{
  "seed_tweet_id": 1008714338574585856,
  "thread_text": "1008714338574585856 [2018-06-18] @literalbanana 💜 1836 🔁 582 💬 49 [(SEED) type=root]\nRefusing to know about things is a valid form of civil disobedience\n↓\n1011986697951690752 [2018-06-27] @literalbanana 💜 358 🔁 43\nIgnorance, like exercise, was not regarded as precious in the past because it was always plentiful.\n↓\n1949509310566003107 [2025-07-27] @literalbanana 💜 19 🔁 3\ninteresting take on the value of ignorance https://t.co/PN8vnIvtXk\n  [Quoting @loquitur_ponte: My view is that the answer to \"why are people often unhappy in modernity\" is actually pretty clear and isn't anything especially ideologically satisfying. It isn't economic precarity, we're very rich. It isn't lack of social community, we actually choose that. It isnt a lack of spirituality or an abundance of plastics or this or that. It's just information abundance.  Imagine the ancestral village. How often do you get new information about the world? What works, what threats there are, what food is abundant, what others think of you... you do get that from time to time, more if you're out ranging for food. And what it all has in common is its all life or death. Starvation is a risk if you mismanage food or predators, injury risks infection and death. The opinion of the humans around you is especially dangerous - who gets fed in lean times? And of course tall poppy syndrome predominates hunter gatherers so if you're too useful you may meet an unfortunate riverbed fall too.   Your mind evolved in an environment where most new information was life and death especially the opinions of others.  You live in an environment where you are constantly awash in new information and the opinions of others.  How would a mind grown in the former respond to the latter? It would be constantly on edge, frantically searching to see the hidden meaning behind every social cue, the threat in every circumstance, the risks to every good thing. There would be so many things to worry about it could never hit them all.  And so it would respond like a mind in the village having an endless web of panics would respond - it would assume on some subconscious level that the environment was dangerous and pull away. Pull away from social situations it cant manage, pull away from resource sources it can't maintain. Retreat, retrench, recoil. Anyone who's ever struggled with anxiety can imagine easily. And indeed what do we see, as technology becomes more prevalent, the information diet gets more constant? More people retreat, retrench, recoil from everything. Even video games obviously fit this - village brain wants to find a different environment that's going better than it thinks yours is. And it gets it. Challenging but bounded, very satisfying to thrive in.  And of course people are different, the rising tide hits different people sooner. The young more not just because they're more digital and less fully formed mentally but because they have less context, less anchored sense of what really matters. But some are more stress tolerant than others, have better ability to identify what matters and phase out other signals than others. But neurotic agreeable people (nervous people who really care about what others think) are in trouble.  And that's it basically. The other stuff is more satisfying and a better story but frankly i think it's just that simple.]\n\n===\n\n1019925117508472837 [2018-07-19] @ultimape 💜 37 🔁 4\nI don't seem to have the GLUT1 deficiency, but I researched all of this too. Wondering why so many degenerative neural disorders manifest with Sweet Tooths is what lead me to https://t.co/DMxZGreo0s andran down this rabbit hole: https://t.co/z4t5YRQpAT https://t.co/DtwvgNvFhy\n  [Quoting Tweet 1019914489834196997 (missing)]\n\n===\n\n1108437788427464704 [2019-03-20] @ultimape 💜 3\n\"women taking commonly used forms of antidepressant drugs may experience delayed lactation after giving birth and may need additional support to achieve their breastfeeding goals.\" Of course it does.https://t.co/pk9wDHUsgX\n↓\n1108438559579619328 [2019-03-20] @ultimape 💜 3\nWhat are you doing there in the pancreas, prolactin? Doing something weird? Helping to regulate insulin? Maybe playing a role in gestational diabetes?https://t.co/hGxBS6cjPQ https://t.co/RfyI7YdaMn\nImages:\n  - [Image #0] The image is a diagram illustrating the secretion of prolactin from the pituitary gland and its various physiological and pathological roles in the body. \n    \n    To reproduce this diagram, start by drawing a horizontal line across the middle of the page, labeling the top section \"Secretion of Prolactin from Pituitary.\" Below this, create five columns, each representing a different function of prolactin: \"1. Lactation and Reproduction,\" \"2. Tumourigenesis,\" \"3. Islet Proliferation,\" \"4. Regulation of Fat Stores,\" and \"5. Immune Responses.\" \n    \n    Each column should include a simple drawing of an organ or cell type (mammary gland, pancreatic beta-cell, adipocytes, and immune cells) with \"PRLR\" above it and \"Autocrine PRL\" below. List the physiological effects of prolactin for each function, followed by a section below the horizontal line detailing potential pathological implications.\n↓\n1108438761736683520 [2019-03-20] @ultimape 💜 2\nwhat\"Prolactin Receptor Gene Polymorphisms Are Associated with Gestational Diabetes\"https://t.co/IiulQ6mFNV\n↓\n1108438873871396865 [2019-03-20] @ultimape 💜 3\n\"Thus burning out the receptors?\" Bingo\n↓\n1108458420041146368 [2019-03-20] @ultimape 💜 2\nI'm... not joking about proxy learning about diabetes thru erections.\"Suppression by Prolactin of the Electrically Induced Erectile Response through its Direct Effect on the Corpus Cavernosum Penis in the Dog\"https://t.co/AvIhruZPLk\"Smooth muscle\"!https://t.co/sFNtD7aQbH\n  [Quoting @ultimape: \"Localization and Function of Cannabinoid Receptors in the Corpus Cavernosum: Basis for Modulation of Nitric Oxide Synthase Nerve Activity\" Whats that?https://t.co/XSQusZBiQd]\n↓\n1108460356802887686 [2019-03-20] @ultimape 💜 2\nSo, my crazy brain, you're telling me that Capsaicin must act similarly to prolactin?What happens if I look that up?\"[Prolactin] sensitizes TRPV1 responses in sensory neurons\"https://t.co/UUTu2UK90ahttps://t.co/b2cvirscxV\n  [Quoting @ultimape: Whelp, Twitter search is failing me once again. I'm still recovering from a head-cold, so I'm frustrated.Note to self: PDE5, 5-Alpha Reductase, Acytlecholine, Parsley, Diabetes, PCOS, Asthma, Smooth Muscle Tissue, Cytochrome/liver genesMuscles, what?https://t.co/W3RrtW2INb]\n↓\n1108462126077788170 [2019-03-20] @ultimape 💜 4\nOk, brain, this says there should be a COMT-&gt;Estrogen-&gt;Prolactin-&gt;TRPV loop somewhere in here? That would explain some gender hormone oddness related to testosterone balance in diabetes/pcos/autism/schizophrenia.Oh, there is? And not many knows about it? https://t.co/T7J649Cp4D https://t.co/DKu3wbwEsQ\nImages:\n  - [Image #0] The image displays a screenshot of a research paper titled \"Prolactin modulates TRPV1 in female rat trigeminal sensory neurons\" with authors A Diogenes, AM Patwardhan, and NA Jeske. The text is transcribed as follows: \n    \n    \"Prolactin modulates TRPV1 in female rat trigeminal sensory neurons\n    A Diogenes, AM Patwardhan, NA Jeske... - Journal of ..., 2006 - Soc Neuroscience\n    Sex dependency in pain perception is well documented and is thought to be attributable to the effect of reproductive hormones on nociceptive processing. In the present study, we evaluated whether estradiol alters gene transcription in the trigeminal ganglia (TG) of ovariectomized rats (OVX). These experiments demonstrated a dramatic (40-fold) upregulation of prolactin (PRL) expression in TG by 17-β-estradiol (E2). PRL expression was restricted to TG neurons and was highly overlapped with transient potential receptor ... \n    99 Cited by 97 Related articles All 12 versions\"\n  - [Image #1] The image is a screenshot of an academic paper discussing the relationship between estrogen, prolactin, and pain sensitivity. The text is a continuation of a research study on the role of estrogen in modulating pain sensitivity, specifically examining the expression of genes in rat female trigeminal sensory neurons regulated by estradiol.\n    \n    The text describes the findings of the study, including the upregulation of the PRL gene in TG neurons of OVX rats treated with estradiol replacement, and the regulation of PRL expression by estradiol. It also mentions that PRL is present in sensory neurons in a releasable pool and that its expression is regulated by estradiol.\n    \n    To reproduce this image, one would need to type out the text as shown, including the highlighted sentence: \"To the best of our knowledge, this is the first report of extrapituitary PRL in peripheral sensory neurons controlled by systemic or local application of estradiol.\" The text is presented in a formal academic font, likely from a scientific journal article.\n↓\n1108465318198943744 [2019-03-20] @ultimape 💜 4\nI think my mom should eat more hot peppers? The question becomes what else unlocks pain reduction associated with TRP channels?https://t.co/1N5OeGNMdF https://t.co/ih11XLwhg7\nImages:\n  - [Image #0] The image shows a text passage discussing mammalian transient receptor potential (TRP) cation channels. The text is transcribed as follows:\n    \n    \"In all, 28 mammalian transient receptor potential (TRP) cation channels have been identified and regrouped into six subfamilies [42]. These include TRPC (\"canonical\"), TRPV (\"vanilloid\"), TRPM (\"melastatin\"), TRPP (\"polycystin\"), TRPML (\"mucolipin\"), and TRPA (\"ankyrin\"). The TRPV subfamily (vanilloid receptors) comprises channels critically involved in nociception and thermo sensing. Moreover, the TRPV 1 receptors have been found in the brain, spinal cord, peripheral neurons, smooth and cardiac muscles, vascular tissues, bronchial muscles, GIT mucosa, and the urinary bladder.\"\n  - [Image #1] The image shows a paragraph of text from a scientific document, specifically the conclusion section. The text is transcribed as follows:\n    \n    \"5. Conclusion\n    \n    From the synopsis above, it is obvious that capsaicin is a peripheral analgesic, which is cell specific. The opening of capsaicin-operated channels is required for efficacy and agonism. Improvement in the therapeutic window is required before the use of an orally active therapeutic drug. However, topical applications of capsaicin have been shown to be effective without side effect [34, 37]. There is also a growing body of evidence for the role of capsaicin in inflammation, coagulation, and gastro-intestinal function.\"\n↓\n1108465763210407936 [2019-03-20] @ultimape 💜 6\nWhy does CBD oil help with pain?https://t.co/9hVM0wtQFC\n↓\n1108466076738899969 [2019-03-20] @ultimape 💜 4\nNote to self: look up CBD oil and other terpenes within that space with an emphasis of effects on diabetes.\n↓\n1109012590288605185 [2019-03-22] @ultimape 💜 3 [(SEED) type=quote_of_root]\n\"I don’t know what those words mean even now. (I know I could look them up and find out what they mean…but now I’m choosing to remain ignorant on principle.)\"https://t.co/iJeBA4O7GNhttps://t.co/e6vDBp4ilq\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1115967103977308161 [2019-04-10] @ultimape 💜 5 🔁 1\nFixing microbiome improved autism symptoms, even 2 years later. Study size of 18, all children, using FMT. They're going to try it in adults next.The question you have to ask: why does one dose not work like under C Diff? I suspect this is metabolic.https://t.co/TnA2rlmjwj https://t.co/CFOb6PIvCf\nImages:\n  - [Image #0] The image shows a text box with a quote from Borody. The text is transcribed as: \"This is a world-first discovery that when we treated the gut bacteria in these children during our clinical trial two years ago to reset their microbiome with FMT, positive results are still continuing to be improving two years from the original treatments. I would call it the highest improvement in a cohort that anyone has achieved for autism symptoms,\" Borody said.\n↓\n1115967478348251138 [2019-04-10] @ultimape 💜 9\nI fixed my autism symptoms by pretending I had metabolic issues associated with diabetes type II, of which gut microbiome was just one aspect. I suspect you can shortcut around the whole needing to eat poop for 3 months straight if you boostrap your metabolism via fast. But N=1.\n↓\n1115967772025065474 [2019-04-10] @ultimape 💜 9\nYou have to ask yourself \"why does keto improve autism symptoms\" and \"why does having a fever improve autism symptoms\", and wonder weirdly a lot about how dog intestines produce mucus the same way as their nose.\n↓\n1115968563339243521 [2019-04-10] @ultimape 💜 4\nThe follow up on that 18 children study, just came out in naturehttps://t.co/ro4T14E9jI\n↓\n1115968779664674821 [2019-04-10] @ultimape 💜 4\nDoes anyone know of any similar studies on long term FMT treatment for schizophrenia or diabetes? Asking for a friend.\n↓\n1115995434823114753 [2019-04-10] @ultimape 💜 4\nWorth noting that the study was an open label exploratory study and so it didn't have controls or a large sample size. It was more an experiment to see if it was worth doing more indepth studies.https://t.co/5HVAdqXLEe\n  [Quoting @ultimape: The follow up on that 18 children study, just came out in naturehttps://t.co/ro4T14E9jI]\n↓\n1115996117639008262 [2019-04-10] @ultimape 💜 5\nSeeing some people point out that there were no controls. of course their weren't.It was a 'pilot study'. https://t.co/GmyxD9BfuB\n↓\n1115996221733310465 [2019-04-10] @ultimape 💜 3\n\"Krajmalnik-Brown and Adams are working now on a larger placebo-controlled trial in adults with ASD to verify their results.\"https://t.co/TnA2rlmjwj\n↓\n1116001095107710977 [2019-04-10] @ultimape 💜 6\nWe don't see \"At the start of the study, 83% of participants were rated as “severe” autism. At the end of the study, only 17% were “severe,” 39% were “mild/moderate” and 44% were below the cutoff for mild ASD.\" with therapy. A nytimes article on this: https://t.co/C7BTCBuoEd https://t.co/TbCrT2o6xz\nImages:\n  - [Image #0] The image displays a text passage, likely from a New York Times article, discussing a study on autism diagnosis and behavioral therapy. The text is presented in black font on a white background, with certain parts highlighted in gray.\n    \n    The text reads: \n    \"In Fein's study, children who lost the diagnosis were twice as likely to have received behavioral therapy as those who remained autistic; they also began therapy at a younger age and received more hours of it each week. But roughly one-quarter of Fein's formerly autistic participants did not get any behavioral therapy, including a boy named\"\n    \n    The passage is cut off at the end, suggesting that it continues elsewhere in the article.\n↓\n1116001824056709120 [2019-04-10] @ultimape 💜 14 🔁 1\n\"a study that tracked 85 children from their autism diagnosis (at age 2) for nearly two decades and found that about 9 percent of them no longer met the criteria for the disorder. \"Vs 45%!!!! in a cohort of 18?LET👏AUTISTIC👏KIDS👏EAT👏SHIT. lol\n\n===\n\n1094416201214656512 [2019-02-10] @eigenrobot 💜 24 🔁 1 [(SEED) type=quote_of_root]\ni bet pretending not to know things is often a good substitute\n\nan upside is you get to hear people go on about [thing] and learn more about who they are\n\nthis is also a downside \n\nalso youre still aware of things in the end: also bad\n\nstill maybe the best infovores can do https://t.co/qa4HsNhwwW\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1094419081308995584 [2019-02-10] @eigenrobot 💜 14\na second upside is that even feigned ignorance is apotropaic\n\ni once was provoked into revealing my power level to some college friends hosting a mighty egregore and it was a terrible mistake\n\ngrey man advocates are on to something\n\n===\n\n1121074497212149760 [2019-04-24] @eigenrobot 💜 48 🔁 11 [(SEED) type=quote_of_root]\nindeed it is the only way anyone has ever been an Activist https://t.co/qa4HsNhwwW\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1125504546254364673 [2019-05-06] @goblinodds 💜 5\nDon't even know how to begin forming opinions about gender. 😭 Peer group pls send help, you guys seem way more nuanced w much weirder opinions than either the mainstream-mainstream or the mainstream-queer community.\n↓\n1125511059727458304 [2019-05-06] @eigenrobot 💜 13\n@cesca_specs why bother having opinion's about it at all?\n↓\n1125511875800600576 [2019-05-06] @eigenrobot 💜 7 [(SEED) type=quote_of_root]\n@cesca_specs (i mean this very seriously and with every fiber of my being. if you can avoid having opinions about a subject where probably most extant opinions are dumb and where having an opinion will make incumbents Angery why not just avoid the minefield)\n\nhttps://t.co/6yX8KNhUzF\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1125512565251907584 [2019-05-06] @goblinodds 💜 1\n@eigenrobot YES x1000 but I'm also trying to figure out something to do with practical considerations of interacting with people more productively. The answer might just be that I'm overthinking and fabricating problems out of nothing, but maybe more knowledge will help me confirm that?\n↓\n1125512944622522369 [2019-05-06] @eigenrobot 💜 2\n@cesca_specs hm!\n\ncan you identify any specific problems with your current operation that general opinions about gender would improve?\n↓\n1125514598772117504 [2019-05-06] @goblinodds 💜 1\n@eigenrobot I'll try to be more aware of this (could just be having an overthinking day) but off the top of my head this basically sums it up:\nhttps://t.co/ezFxnHxewO\n  [Quoting @goblinodds: @palecur --I get a lot of like...women assuming some level of solidarity or similar point of reference? And then another can of worms, men seeming to unintentionally view anything with boobs as a potential mate, which largely isn't an issue but precludes most deep friendships with men.]\n↓\n1125524605324513281 [2019-05-06] @eigenrobot 💜 2\n@cesca_specs initial hunch: these seem like problems with other people that would not be solved by updating your own beliefs :)\n↓\n1125540359390384128 [2019-05-06] @goblinodds 💜 1\n@eigenrobot Quite so! But perhaps there are things I can change about my thinking or appearance to have more efficient interactions.\n\n===\n\n1143296024494186496 [2019-06-24] @ultimape 💜 7 🔁 3\nA system engineered for stealing rival group's children to be adopted by the wealthy, whom feel a sense of status because they are caring for 'unwanted' babies. This idea is literally in the bible:1 Kings 3:25 https://t.co/pgDwwRju95\n  [Quoting Tweet 1143286201580843008 (missing)]\n\n===\n\n1145790715324243971 [2019-07-01] @ultimape \n\"Most people wouldn't keep their pets in the kind of conditions we keep people in\"https://t.co/Sw8QiDJmxGhttps://t.co/w7kY7hJ1AE\n  [Quoting Tweet 1145564375102607361 (missing)]\n↓\n1162983164207411200 [2019-08-18] @ultimape \nI bought 3 floor cleaning robot slaves (on sale).One for my mom.One for me to turn into a wheelchair prototype for when I lose my ability to walk.One to give to my uncle who's taking care of my mom's mom.https://t.co/W5RnP6Llrv\n  [Quoting @ultimape: I want to buy a robot slave to wash my disabled moms floors because she can't find reliable help, partly because no one wants to pay care-givers enough to attract or support them.]\n↓\n1199106636406767621 [2019-11-25] @ultimape \n\"This messenger from Olympus had reminded me that we are all but homunculi at the whims of a capricious algorithmic god.[...] towards olympus, I tweeted.\"https://t.co/r11xrFvnAQ\n↓\n1199115581628256258 [2019-11-26] @ultimape \nWe live in a world where we cut out the genitalia of our beloved pets; creating an environment where farming them to be emotional surrogates is a business in demand.https://t.co/qJORSg6423\n↓\n1199115814361870340 [2019-11-26] @ultimape \nA system that generates monstrous choices. https://t.co/bKPIykMiF4\n↓\n1199116503452454914 [2019-11-26] @ultimape \nWe are collectively poor caretakers.I've never willingly owned a pet.https://t.co/oqSbIAoD1u\n↓\n1199117543572721664 [2019-11-26] @ultimape \nAre they really carpet bombing poison sausages to kill cats in Australia?Is that really a good idea?🤦‍♂️\n↓\n1199121199009353728 [2019-11-26] @ultimape 💜 2\nIt absolutely amazes me that the one of the traits evolution selects for is: \"is this cute enough to be weaponized by the roving bands of murder apes that have spread on the surface of earth?\" https://t.co/uJJmk8gOeK\n  [Quoting @ultimape: But not too cute. They'll eat us. The humans... They'll eat us!https://t.co/g5fn05KBRg]\n↓\n1199122791066456070 [2019-11-26] @ultimape 💜 1\nTheir tops are made out of rubber the bottoms are made out of spring but the most wonderful thing about tiggers is he's the only o..oh God there are so many.Thinking about how we train dogs.https://t.co/SjTYpU7UKu\n↓\n1252828062695079939 [2020-04-22] @ultimape \nI want to see a better future, with less suffering.I am naive.https://t.co/7qKQMsSPZf\n  [Quoting @ultimape: I've been trying to align my own behaviors with climate/collapse by making my goals and desires match up with what I think matters.To keep my head down and keep moving forward.]\n↓\n1252829471373025280 [2020-04-22] @ultimape 💜 1 [(SEED) type=quote_of_root]\nNo. Not Naive.I am willfully ignorant.re:inventing the future.rebuilding the past.https://t.co/SkgJLnQEG5https://t.co/e6vDBoMGWQ https://t.co/Fa99fGc3RW\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\nImages:\n  - [Image #0] The image is a text passage on a black background discussing the fundamental principle of a hacker's approach to understanding complex systems. The text is transcribed as follows:\n    \n    \"In each case, the fundamental principle is that the hacker asks: 'here I have a system W, which pretends to be made out of a few Xs ; however, it is really made out of many Y, which form an entirely different system, Z; I will now proceed to ignore the X and understand how Z works, so I may use the Y to thereby change W however I like'.\n    \n    Abstractions are vital, but abstractions also always leak. ('You're very clever, young man, but it's reductionism all the way down!') This is in some sense the opposite of a mathematician: a mathematician tries to 'see through' a complex system's accidental complexity up to a simpler more-abstract more-true version which can be understood & manipulated—but for the hacker, all complexity is essential, and they are instead trying to unsee the simple abstract system down to the more-complex less-abstract (but also more true) version. (A mathematician might try to transform a program up into successively more abstract representations to eventually show it is trivially correct; a hacker would prefer to compile a program down into its most concrete representation to brute force all execution paths & find an exploit trivially proving it incorrect.) Ordinary users ask only that all their everyday examples of Ys transforms into Z correctly; they forget to ask whether all and only correct examples of Ys transform into correct Zs, and whether only correct Zs can be constructed to become Ys.\"\n↓\n1252830348909539329 [2020-04-22] @ultimape 💜 2\nAngels and Devils all came from the divine creator. I think about this often, but perhaps not framed in biblical terms.https://t.co/yBq7nSCBaC\n  [Quoting @ultimape: Heh, it seems pigs can learn that other pigs know where food is and bully them away from the food. After a while the bullied one starts feinting where the food is as a deception.Amazing.https://t.co/kAj7AoaRbI]\n↓\n1286159420167278597 [2020-07-23] @ultimape 💜 1\n\"what kind of bug are you ape?\"\n↓\n1329555711085465604 [2020-11-19] @ultimape \n\"This is not a love songThis is not a love songI don't sing my mother's tongueNo, this is not a love song\" 🎶https://t.co/DFOC2e6bAYhttps://t.co/TFuTRisOla\n  [Quoting @ultimape: We live in a societywhere \"Americans woke up to find themselves citizens of a failed state. With no national plan—no coherent instructions at all—families, schools, and offices were left to decide on their own whether to shut down and take shelter. \"https://t.co/lrcLPeMJlQ]\n↓\n1372957720740040709 [2021-03-19] @ultimape 💜 1\n\"Trafficking is a cross-cultural phenomenon that affects men and women alike. These people are not victims of culture but are survivors of harrowing circumstances brought on by the larger forces of political economy.\"https://t.co/Doky6Ks6w8https://t.co/UckOr7sA2s\n  [Quoting @ultimape: &gt; implying we stopped farming people like cattlehttps://t.co/CGa0idloGS]\n↓\n1536411040791121927 [2022-06-13] @ultimape 💜 3\nThe bible says we are living in hell. But it is a hell of our own making.https://t.co/9MWB4N9r9j\n  [Quoting @ultimape: \"start following where the stuff comes from and where it goes in your own life, very quickly you begin to understand where the systems of oppression are operating and how you are supporting them by your very existence\" [2013]https://t.co/BxAJ3peSeAhttps://t.co/SXRJx59bUX]\n\n===\n\n1158125321067094017 [2019-08-04] @ultimape 💜 31 🔁 4\nSun gazing is bullshit.*he says to himself while turning on a 10k lux sunlamp to synchronize his microbes to offset the wake time due to circadian rhythm issues associated with non-24*\n\n===\n\n1254998221446881280 [2020-04-28] @ultimape 💜 2\n\"For natural people, the thesis implies that minds can extend beyond the brain to include external cognitive aids, like rolodexes and calculators […] adapts the thesis to corporate law\"The sins of the father, but for AI homunculihttps://t.co/NqQ2bqeqdihttps://t.co/8HYsfrTOiM\n  [Quoting Tweet 1251907555443585030 (missing)]\n↓\n1255000827330248704 [2020-04-28] @ultimape \nall the way up.https://t.co/AsNZSCghbd\n  [Quoting @ultimape: Every time you stop to question overt anthropomorphism the ant, have you ever stopped to think \"maybe we are equally wired to anthropomorphize human systems too much?\"If we are geared to project agency where none exists, surely we must be?https://t.co/dVWmxyR4H4]\n↓\n1257151791038414848 [2020-05-04] @ultimape 💜 3\nLearning wood carving so I can make memes like the cool kids.Thinking about wood carvings as memetic templates &amp; meme reproduction, which themselves can be copied by reverse engineering meme's internal structure.As proxy for meme⇢gene⇢phenotype⇢meme.https://t.co/v81QNlH4Ji\n↓\n1257154677147402240 [2020-05-04] @ultimape 💜 1\nlolhttps://t.co/zu1v09wbLC https://t.co/8yPDNQtuak\n  [Quoting Tweet 1019249300704915456 (missing)]\nImages:\n  - [Image #0] The image shows a screenshot of a tweet. The tweet is from a user named \"follow such a one\" and has a cartoon profile picture of a person with green hair. The text in the image reads:\n    \n    \"Learning wood carving so I can make memes like the cool kids.\n    Thinking about wood carvings as memetic templates & meme reproduction, which themselves can be copied by reverse engineering meme's internal structure.\n    As proxy for meme→gene→phenotype→meme.\n    youtube.com/watch?v=jAhiMC...\"\n    \n    The tweet is liked by one person, indicated by a red heart.\n↓\n1260871240165797888 [2020-05-14] @ultimape \nWiseminds singing the hivesong.https://t.co/yqn7X6y7sb https://t.co/aPIYk2kVsC\n  [Quoting Tweet 1260786905559568386 (missing)]\nImages:\n  - [Image #0] The image shows a close-up of a cluster of bees clinging together, with a person's hand visible in the bottom-left corner. The watermark \"SENDORBEE.COM\" is displayed in the bottom-right corner.\n↓\n1260873235190726656 [2020-05-14] @ultimape 💜 1\nWe were warned. Not all of us listened.\"As the Christmas-y knowledge in the human's brain flashes on a screen before Zim's eyes, he begins to cackle maniacally as he formulates his next, foolproof plan to destroy the humans.\"https://t.co/k5AS6GmmEJhttps://t.co/yQtAOuN0yb\n  [Quoting @ultimape: An angel to watch over you,or demon in disguise?                       🕯              🕯              🕯        🕯                         🕯      🕯        👁️🎅👁️      🕯        🕯                          🕯              🕯              🕯                        🕯]\n↓\n1260873505131937794 [2020-05-14] @ultimape 💜 1 🔁 1\nAll hail the parasite-lord clausehttps://t.co/i66ZTDj3hE\n  [Quoting @ultimape: Santa is \"real\" in a certain sense; Entire civilization collaborate to compute a model of him in their heads, to judge if they are getting coal or not. He regularly reinfects their children to perpetuate itself thru their myths and lore. Watching you.https://t.co/9bKGq2Hwfn https://t.co/W53dX72drl]\n↓\n1266166868588494849 [2020-05-29] @ultimape 💜 4 🔁 1\nWhy, don't you just look like the perfect computational substrate to run this fancy little self-replicating memeplex on. We just gotta disinfect the host a bit and sanitize some of these naughty words.https://t.co/YCQzI2a3L2\n  [Quoting Tweet 1261689627074867208 (missing)]\n↓\n1266169223144972288 [2020-05-29] @ultimape 💜 2\nI've been reviewing the way that some viruses destroy the creation and maintenance of patterns that the immune system creates as part of their infection process. Epistimic immune systems seem to work the same way.https://t.co/Whym8QTuKD\n  [Quoting @ultimape: Tired: Mapping people's brains, seeing why they were so smart. https://t.co/NDeEuRAwLQWired: mapping peoples memes, using insights from epidemiology to study viral ideas. https://t.co/uBriJN8svn]\n↓\n1266170026391932929 [2020-05-29] @ultimape 💜 3\nIt would seem if the collective memescape is rife with viral ideologies roving around and trying to indwell reproductive memeplexes within various hosts.... An effective means of behaviorally inoculating yourself is to lower your Epistemic Motivation.https://t.co/c09QDFywvg\n↓\n1266170952448184327 [2020-05-29] @ultimape 💜 2 [(SEED) type=quote_of_root]\nMy innate curiosity causes me to to act as a carrier of infectious memeplexes. Ideas treat me as a temporary host, waiting to be passed on into someone who has the proper machinery to actually replicate in.This is why I'm learning to cultivate ignorance.https://t.co/e6vDBp4ilq\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1266171440258310156 [2020-05-29] @ultimape 💜 3 🔁 1\nh/t @moonman@shitposter.club https://t.co/uRj6SMePb0\nImages:\n  - [Image #0] The image is a 3-panel comic that depicts a meeting at a conference table. \n    \n    To reproduce this comic, follow these steps:\n    * Draw a three-panel comic with a meeting scene in the top two panels and a character's reaction in the bottom panel. \n    * In the first panel, show a man speaking at a conference table to three other people, with a speech bubble containing the word \"THING\". \n    * In the second panel, depict three people responding with speech bubbles saying \"BAD\", \"GOOD\", and \"TRUTH ABOUT THING\". \n    * The man who spoke in the first panel is on the far left, wearing a blue shirt, and the man on the far right is wearing a blue t-shirt and appears disinterested. \n    * In the third panel, show the man who said \"THING\" having a panic attack in red, then on the phone, with a background of him jumping off a building.\n↓\n1266179063577796608 [2020-05-29] @ultimape 💜 3\nHmmhttps://t.co/WOcmAG4ueE\n  [Quoting Tweet 964248661117906944 (missing)]\n↓\n1273139057145589760 [2020-06-17] @ultimape 💜 2\n\"On a side note, if you have learned to see angels, you will probably run into devils soon enough.\"https://t.co/IZvU9h6JAmhttps://t.co/i66ZTDj3hE\n  [Quoting @ultimape: Santa is \"real\" in a certain sense; Entire civilization collaborate to compute a model of him in their heads, to judge if they are getting coal or not. He regularly reinfects their children to perpetuate itself thru their myths and lore. Watching you.https://t.co/9bKGq2Hwfn https://t.co/W53dX72drl]\n↓\n1273140626872287234 [2020-06-17] @ultimape 💜 1\nhttps://t.co/Pnct3o1Cxr\n  [Quoting @ultimape: Oh no, I've now entered \"I am become god\" phase of my sleep deprived insane ramblings.https://t.co/Nw7taqIPRO]\n↓\n1274162673903718401 [2020-06-20] @ultimape 💜 1\nThis made me giggle.https://t.co/5hyV61d0PJ\n  [Quoting Tweet 1272621640799657984 (missing)]\n↓\n1299861212902109186 [2020-08-30] @ultimape 💜 2\nShot: https://t.co/Wkj1Mvsy7CChaser: https://t.co/3bFYfZJ4UUStomach ache: https://t.co/4lAMrhpRzyDisney ban's junk food ads on TV channels shortly before launching own platform. Partners their brand directly with fizzy sugar water company instead.https://t.co/hVp5TOvgTs\n  [Quoting @ultimape: MOJO, a strong brand (in Australia)... is being bought by coca-cola.https://t.co/e6wbjnN2TT]\n↓\n1299862181790576641 [2020-08-30] @ultimape \nA multimedia company who has long been expanding on digital distribution in gaming content decides they don't want to advertise #wetsugarwithbubbles on TV. Are enough of those ads on YouTube targeting \"gamers\" (aka children) https://t.co/v5iRODKi3Khttps://t.co/dnouhscLSh\n  [Quoting @ultimape: 6 times in past 20 minutes.#puppymonkeybaby have you ever heard of over marketing?Is there such a thing as brand hatred?This is silly.]\n↓\n1337484614676475904 [2020-12-11] @ultimape 💜 1\nI unironically believe this.https://t.co/6d8qzvUD7u\n  [Quoting Tweet 1334558905742061569 (missing)]\n↓\n1337485240571453440 [2020-12-11] @ultimape \nSpreading holiday cheer to everyone I know, so that vvoden doesn't haunt my dreams.https://t.co/ZBoqoSPIez:)\n  [Quoting @ultimape: Holidays are how we contain memeplexes and egregores.VVoden (and his elves) are forced to forever live within the realm of yuletide.Gods of rebirth claim realms of rabbits and eggs.Religions lay claim to the procession of seasons.Sun gods over see all.https://t.co/wA2T0AU9iZ]\n↓\n1337486407015731208 [2020-12-11] @ultimape 💜 1\nConsuming the spirit of Christmas like one swallows an FMT pill in hopes it will impact depression.\"you're more like to die of natural causes from Dec. 25 through New Years Day than any other time of the year.\"https://t.co/4E51r9wUvIvvoden haunts us yet. hunts*\n\n===\n\n1201530976830152705 [2019-12-02] @yashkaf 💜 9 🔁 1\nTotalitarian regimes are one-story states, we live in a two-story state. \n\n\"When people hear one story, they tend to ask: is this true? When they hear two stories, they tend to ask: which one of these is true? Isn’t this a neat trick?\"\n\nhttps://t.co/bOm23o3Y41\n↓\n1201531367470882822 [2019-12-02] @yashkaf 💜 6\nIf one story is \"man-made climate change is a hoax\" people will believe any insane claims about climate change from the other side. If one story is \"all rich men are thieves\" people will support any nonsense economic policies from the other side.\n↓\n1201532320383143938 [2019-12-02] @yashkaf 💜 5 🔁 1\nIs there a catchy name for the political stance of \"90% of what politicians and commentators say is bad and wrong and I refuse to support any of it?\" It's not quite political \"passivism\"; it takes a lot of very active effort not to let the partisan discourse control your mind.\n↓\n1201538057910071299 [2019-12-02] @mechanical_monk \n@yashkaf Also, watch out for the difference between national *policy* (decision-making; \"what should be done?\") and national *politics* (alliances and loyalty-signalling; \"REEEEEEEEE libtard\")\n\nE.g. wrt policy, I'm a consequentialist; wrt politics, I'm not playing\n↓\n1201539013586370560 [2019-12-02] @yashkaf 💜 2 [(SEED) type=quote_of_root]\n@mechanicalmonk1 WRT policy I'm consequentialist but no one cares what I think, and so it's not worth it to participate. WRT politics everyone cares what I think, which is why I must not participate. \n\nhttps://t.co/h0R9jXPkUq\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1201542368228499456 [2019-12-02] @mechanical_monk \n@yashkaf It's not worth it to talk/care about boring implementation details, but it's worth it to take part in nudging the Overton window and normalizing weird (but good) shit. Your opinions ripple through the social fabric\n↓\n1201543180526784514 [2019-12-02] @mechanical_monk \n@yashkaf Also policy is not just law, but social norms too. E.g. making an effort to normalize polyamory is participating in policy decisions. Shaming is a form of governance\n↓\n1201544943669522437 [2019-12-02] @yashkaf 💜 1\n@mechanicalmonk1 I'm usually writing about polyamory etc as a personal life choice, not a policy prescription. Broadly speaking, people do things to get laid (eros) or to get power (thymos); if I touch on policy it's usually in an effort to keep others' thymos out of my eros.\n↓\n1201545662581682183 [2019-12-02] @yashkaf 💜 1\n@mechanicalmonk1 If my friends became poly, bought index funds, stopped believing psych papers, shut up about politics, read the Sequences, did mushrooms, and homeschooled four kids, and if I got zero credit for making any of it happen, I would be absolutely delighted.\n\n===\n\n1213153231171276800 [2020-01-03] @eigenrobot  [(SEED) type=quote_of_root]\nRT @literalbanana: Suddenly becoming the world’s greatest expert to cope with anxiety is also valid https://t.co/lRGgLrGnCP\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1257409854152441856 [2020-05-04] @QiaochuYuan 💜 72 🔁 3\nwhat if i became a dumb bitch 🤔\n↓\n1257534373978468353 [2020-05-05] @eigenrobot 💜 9\n@QiaochuYuan highly recommend\n↓\n1257536496132710400 [2020-05-05] @QiaochuYuan 💜 9 [(SEED) type=quote_of_root]\n@eigenrobot much textural support\n\nhttps://t.co/SeQfy13TWW\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1272033206418550791 [2020-06-14] @eigenrobot 💜 77 🔁 4\nno one has the right to make you care about anything\n\nhth\n↓\n1272033365957341185 [2020-06-14] @eigenrobot 💜 41 [(SEED) type=quote_of_root]\nfurther,,,, https://t.co/qa4HsNhwwW\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1275210623316525062 [2020-06-22] @yashkaf 💜 301 🔁 48 💬 4\nJust came up with a weird theory.\n\nThere are ways of engaging in argument: sincere and truth seeking, bad-faith and power seeking, humorous trolling. I hypothesize that the three have a rock-paper-scissor dynamic.\n↓\n1275211873227587589 [2020-06-22] @yashkaf 💜 89 🔁 4\nIf you argue in good faith, you're predictable to a bad-faith \"politician\". They'll twist your words and hit you with contradictory slogans. The inconsistency of their position is an asset against sincere nerds. This happens everywhere from Twitter to presidential debates.\n↓\n1275212222269136899 [2020-06-22] @yashkaf 💜 69 🔁 4\nA sincere nerd can make a troll look childish and scared to engage. Saying \"here's what I believe, what do you believe?\" is a simple move that trolls don't have a strong response to.\n↓\n1275212860461854720 [2020-06-22] @yashkaf 💜 91 🔁 7 [(SEED) type=quote_of_root]\nTrolls beat politicians, who always take themselves too seriously and are vulnerable to being made fun of. All their attacks slide off a troll and they look ridiculous. For example, the last time someone told me I \"need to educate myself\" I responded with: https://t.co/h0R9jXPkUq\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1275213378760441856 [2020-06-22] @yashkaf 💜 144 🔁 3\nSo if a bunch of bad-faith status grabbers are going to go after a sincere nerd like Scott Alexander I expect all you post-rat anons to troll the shit out of them.\n↓\n1275227397118459904 [2020-06-23] @nosilverv 💜 8 💬 1\n@yashkaf At your service\n\n===\n\n1276712181065822208 [2020-06-27] @Malcolm_Ocean 💜 8 [(SEED) type=quote_of_root]\nMe re 👁️👄👁️\n#JOMO\n\nhttps://t.co/D8goH9CFph\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1279904324102107136 [2020-07-05] @nosilverv 💜 13 🔁 1 [(SEED) type=semantic_search]\nNot intending to save the world is a valid form of civil resistance. https://t.co/nML96WSh16\n  [Quoting Tweet 1279883144636882944 (missing)]\n\n===\n\n1286880671701450752 [2020-07-25] @QiaochuYuan 💜 29\npoll: okay, seriously, what's the deal with the UFO shit\n↓\n1286902076266762240 [2020-07-25] @Malcolm_Ocean 💜 6 [(SEED) type=quote_of_root]\n@QiaochuYuan other\nhttps://t.co/D8goH9CFph\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1305807741370470403 [2020-09-15] @nosilverv 💜 18 🔁 4 [(SEED) type=semantic_search]\nRefusing to enjoy is a valid form of civil resistance. https://t.co/UenhWdbYzS\n  [Quoting Tweet 1303198419083841541 (missing)]\n\n===\n\n1349149358537654274 [2021-01-13] @Malcolm_Ocean 💜 3\nSo uhh\n\nI don't actually know what fleets are\n\nBased on hearing them talked about over the past week, I have the impression they're like a mashup of snapchat and facebook stories... can only send from phone, maybe they have to be video? and you can see who has viewed I guess! https://t.co/HhhtV4BxND\n  [Quoting @visakanv: Interesting thing about fleets is that it basically lets you figure out who’s lurking on your profile but not liking or replying to your tweets]\n↓\n1349149360190210048 [2021-01-13] @Malcolm_Ocean 💜 12 [(SEED) type=quote_of_root]\nmy mood, vaguely, when people started talking about fleets and I don't have the twitter app on my phone\n\nhttps://t.co/D8goH9l40H\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1349251073052086274 [2021-01-13] @visakanv 💜 1\n@Malcolm_Ocean I just repost tweets, and occasionally a cat photo\n\n===\n\n1351583785016549377 [2021-01-19] @nosilverv 💜 7\nFeeling quite a bit of frustration about the EU vaccine debacle. Is there nothing to be done? Can I launch the biggest crowdfunding campaign and jsut get more doses into Portugal? e\n↓\n1351585588516966400 [2021-01-19] @frideswyth 💜 4 [(SEED) type=semantic_search]\n@nosilverv I’m more on the “lockdowns are inhumane” civil disobedience angle\n↓\n1351587927025979402 [2021-01-19] @nosilverv 💜 4\n@ssica3003 effectively solitary confinement without a court intervening anywhere in the process\n↓\n1351588577659019264 [2021-01-19] @frideswyth 💜 3\n@nosilverv Thank God it's not freezing and buying clothes has not just been banned.... wait\n↓\n1351594623056171010 [2021-01-19] @nosilverv 💜 3\n@ssica3003 at least portuguese homes are well equipped for winter with central heating!!\n↓\n1351595596122095617 [2021-01-19] @frideswyth 💜 2\n@nosilverv and hotels!!\n\n===\n\n1434443665724821505 [2021-09-05] @ultimape 💜 13\nCurrent status: calculating how many banana peels it would take to kill a man by hydrogen cyanide alone.https://t.co/iSbXOtTeI6 https://t.co/Sjklj1HxiJ\n  [Quoting Tweet 1434327867937239043 (missing)]\n\n===\n\n1434444557765292041 [2021-09-05] @ultimape \nLooks like you get a 34% yield of peel on a ripe banana.Going by https://t.co/uvtFgDCpWEAt estimates of 1.33mg/g of peel, that means10 killograms of fresh banana would net an expected of 4.575 grams of Hydrogen cyanide, assuming no losses in extraction.\n↓\n1434445656823894016 [2021-09-05] @ultimape \nThe use of hydrogen cyanide in industrial processes is extremely dangerous.Please maintain safety precautions. Do not try this at home. https://t.co/fXz7QjWpaf\n↓\n1434446153588879360 [2021-09-05] @ultimape 💜 1\nConsult your local regulatory agency for safe handling instructions and acquire proper clearances and abide by all local laws.In Vermont, it is considered a weapon of mass destruction, classified as a \"Chemical warfare agent\"https://t.co/YmG6AFUqZe\n↓\n1434446556325875716 [2021-09-05] @ultimape 💜 2\nThis shit is literally bananas.Have you ever considered if you can commit a crime and violate hazard waste management guidelines by simply doing chemistry on bananas?https://t.co/RzIXNBdH1y\n↓\n1434447785408049155 [2021-09-05] @ultimape 💜 1\nOk, so I need a volume to estimate. I'm going to pick a 40ft shipping container https://t.co/1dEMIS4lkX\n↓\n1434448160664035332 [2021-09-05] @ultimape \nDon't know the inner dimensions, but this says\"CBM for 40 feet container : (12000 / 1000) x (2300 / 1000) x (2300 / 1000) = 63.48 cubic meter\"https://t.co/uVpghKFUb1\n↓\n1434450051036852228 [2021-09-05] @ultimape 💜 1\n10 killograms of raw bananas, if perfectly converted, would net about 72.07 mg/m^3, which is a little more than 24% of the amount needed to reach the 300mg/m^3 concentration listed on WHO.\n↓\n1434452587533803522 [2021-09-05] @ultimape 💜 1\nSo assuming I didn't mess up conversions somewhere, we'd need an estimated 41.6 kilograms of banana to kill a man in 10 minutes within a standard 40ft shipping container.That's about 37,000 calories worth, or 92lbs. That's surprisingly few bananas! https://t.co/IBr9z3U0m3 https://t.co/UtvZrSbwiG\nImages:\n  - [Image #0] The image shows a nutrition label for a serving size of 41.6 kg (42 kg) of bananas, with the following information:\n    \n    * Total Calories: 37,024\n    * Fat Calories: 1,149\n    * Total Fat: 137g (211% DV)\n    \t+ Saturated Fat: 47g (233% DV)\n    \t+ Trans Fat: 0g\n    * Cholesterol: 0g (0% DV)\n    * Sodium: 416mg (17% DV)\n    * Total Carbohydrates: 10kg (3,167% DV)\n    \t+ Dietary Fiber: 1kg (4,326% DV)\n    \t+ Sugar: 5kg\n    * Protein: 453g (907% DV)\n    * Vitamins and Minerals:\n    \t+ Vitamin A: 532% DV\n    \t+ Calcium: 208% DV\n    \t+ Vitamin E: 208% DV\n    \t+ Riboflavin: 1,786% DV\n    \t+ Vitamin B6: 7,634% DV\n    \t+ Zinc: 416% DV\n    \t+ Vitamin C: 6,032% DV\n    \t+ Iron: 601% DV\n    \t+ Thiamin: 860% DV\n    \t+ Niacin: 1,383% DV\n    \t+ Folate: 2,080% DV\n    \t+ Magnesium: 2,808% DV\n    \n    The label also notes that the percent daily values are based on a 2,000 calorie diet.\n↓\n1434452833177329664 [2021-09-05] @ultimape 💜 1\nWould you like to see other investigations into peril and intrigue behind the leading illegal fruit? You might enjoy this thread exploring the strange and wonderful world of The Banana Menace:https://t.co/1HtzCSBeIc\n  [Quoting @ultimape: hahahahahahahahahahaha banana addiction]\n↓\n1434453633492475906 [2021-09-05] @ultimape 💜 5\nThis entire thread raises a question in my mind... what would be the deadliest way to use a banana, chemically speaking?Apparently radiation isn't really even a drop the bucket compared to just raw chemical toxicity of cyanide in the peel.https://t.co/gmnMWfQnaP\n  [Quoting Tweet 1167670581367627776 (missing)]\n↓\n1434454630352760834 [2021-09-05] @ultimape 💜 3 [(SEED) type=quote_of_root]\nA wise person once said.\"you can't refuse to learn and retain credibility about anything.\"Am I credible?https://t.co/e6vDBp4ilq\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1434456665336778754 [2021-09-05] @ultimape 💜 1\nNow the next step is to figure out estimated absorption rates in the skin and calculate how many people would be needed to make the space habitable.I'm learning some things I didn't want to know.https://t.co/9da01aA4gR https://t.co/6hBfu4WMQA\nImages:\n  - [Image #0] The image is a screenshot of a text discussing the effects of HCN on cynomolgus monkeys and its implications for humans. The text is transcribed as follows:\n    \n    The AEGL-2 was based on an exposure of cynomolgus monkeys to a concentration of HCN at 60 ppm for 30 min, which resulted in a slight increase in the respiratory minute volume near the end of the exposure and a slight depressive effect on the central nervous system as evidenced by changes in electroencephalograms, also near the end of the exposure; there was no physiological response (Purser 1984). The mechanism of action of HCN is the same for all mammalian species, but the rapidity and intensity of the toxic effect is related to relative respiration rates as well as pharmacokinetic considerations. Based on relative respiration rates, the uptake of HCN by the monkey is more rapid than that of humans. The monkey is an appropriate model for extrapolation to humans because, compared with rodents, the respiratory systems of monkeys and humans are more similar in gross anatomy, the amount and distribution of types of respiratory epithelium, and airflow pattern. Because the monkey is an appropriate model for humans but is potentially more susceptible to the action of cyanide based on relative respiration rates, an interspecies UF of 2 was applied. Humans may differ in their sensitivity to HCN, but no data regarding specific differences among humans were located in the available literature. The detoxifying enzyme rhodanese is present in all individuals, including newborns. Therefore, an intraspecies UF of 3 was applied. The 30-min concentration of 60 ppm from the Purser (1984) study was divided by a combined interspecies and intraspecies UF of 6 and scaled across time for the AEGL-specified exposure periods using the relationship C^2×t=k. The safety of the 30-min and 1-h values of 10 and 7.1 ppm, respectively, is supported by monitoring studies in which chronic exposures to average concentrations of 8 to 10 ppm may have produced primarily reversible central nervous system effects such as headaches in some workers (El Ghawabi et al. 1975).\n↓\n1434456921201942530 [2021-09-05] @ultimape 💜 4\nI'm... going to stop here. I refuse to know more about this space of ideas.\n↓\n1434457547952492549 [2021-09-05] @ultimape 💜 3\nI wanted to know the expected amount of deaths from 92lbs of bananas. But some knowledge isn't worth exploring in public.I'm now sad about thinking about people testing this on animal models and am going to go cry.\n↓\n1434459206854270978 [2021-09-05] @ultimape \nWould you be interested in a philosophical discussion about how seemingly absurd explorations into the messy physics of masturbation can lead to epiphanies in a tangential problem space?https://t.co/1YcsZeF3u0\n↓\n1434459542750994434 [2021-09-05] @ultimape \n🍌👌🔁🤔\n↓\n1434465755853205509 [2021-09-05] @ultimape 💜 1\nUseful application ideas:Air purity in spaceships, bunkers, submarines, HVAC systems.Microbial interactions, Jejunum &amp; Ileum surface area concentrations, effectiveness of lung inhalants for medical purposes.Also just generally having a mental model of safety concerns.\n↓\n1513714943073394691 [2022-04-12] @ultimape \nI decided I'm going to learn about chemotherapy induced baldness by trying to figure out how many banana *peels* it takes to gives someone a similar dose as this radon therapy retreat shown by @tomscott  https://t.co/Zpjiuymw8ihttps://t.co/QyquTyaOvU\n  [Quoting @ultimape: @RickSan48951708 You really have to dig to find the actual instructions and steelman them. \"Viking legend suggests smearing your noggin with a dollop of goose poop.\" https://t.co/fyLp8NA6NA]\n↓\n1513715792466042885 [2022-04-12] @ultimape \nThe most deadly way to kill someone with a banana is by choking.If you are an autistic child with swallowing issues, it doesn't take much of a banana to kill you. FYI.https://t.co/Xvj8sCH0ZM\n  [Quoting Tweet 1167675430775730177 (missing)]\n↓\n1513716963889102850 [2022-04-12] @ultimape 💜 1\nOh neat, I didn't realize that all my knowledge about particulate matter and aerosols also applies to radon safety.https://t.co/sX9uTqRB9ehttps://t.co/bMmSpCdurg https://t.co/y9ANR3hDo9\n  [Quoting @ultimape: To make an accurate ant simulation, I'll need to solve two of the most complex physics problems we have: sand (particulate matter) and water (fluids).Technically, modeling ant communication flow is a form of quantum probability models under lens of information theory. Yay!]\nImages:\n  - [Image #0] The image shows a scientific text discussing radon decay products and their behavior in the air. The text is transcribed as follows:\n    \n    \"After decay in air, the nuclides react in less than one second with trace gases and air vapor, forming clusters of 0.5–5 nm size, also called the \"unattached progeny\", which are positively charged and highly mobile [23,24]. Within 100 s, those clusters may attach to aerosol particles by diffusion, described by gas kinetic laws. The parameter that mostly influences the fraction of attached daughter nuclides is the number of aerosols [25] with the influence of electrostatic forces considered to be negligible [23,26]. The formed particles build the \"attached progeny\" for which diffusion coefficient measurements showed three distinct size ranges. These are called nucleation mode covering sizes from 10–100 nm, accumulation mode with particle sizes ranging from 100–450 nm and the coarse mode for particles larger than 1 μm [1]. The size distribution is strongly influenced by the aerosol mixture in the air. Accordingly, all studies show slightly different results but were consistent in the fact that the highest activity originates from radon decay products bound to aerosols associated with the accumulation mode [1,25,27]. Moreover, measurements showed that over 90% of the activity is associated with the \"attached progeny\" while the \"unattached progeny\" accounts for only 10% [21,23], being, in turn, three to five times more effective in dose commitment due to its smaller size [28].\n    \n    Once built, solid daughter nuclei deposit on surfaces such as walls and furniture by different mechanisms (sedimentation, impaction, interception and diffusion), resulting in a lower activity concentration of the decay products in indoor-air than expected from equilibrium with radon [23,27]. This and other removal processes reduce the concentration of radon decay products, depending on a number of interlinked parameters such as the loss by radioactive decay, ventilation or the aforementioned deposition on room surfaces [29].\"\n↓\n1513717360422752257 [2022-04-12] @ultimape \nI have no idea what I'm doing. But I wanna cure baldness so I gotta learn high-energy particle physics.https://t.co/O1Du2gtLiW\n  [Quoting @ultimape: Tired: tickling the tail of a sleeping dragonWired: tickling the dragon's tailInspired: licking the cloaca of a dinosaurIre'd: realizing a DOI no longer works so I can't confirm a quote by Feynman in contextHired: Fixing wikipedia's entry on demon corehttps://t.co/L6ohE1bFCR]\n\n===\n\n1491941534115106816 [2022-02-11] @eigenrobot 💜 151 🔁 12 [(SEED) type=semantic_search]\ncivil disobedience is a bid for the mandate of heaven\n\n===\n\n1646617889028423681 [2023-04-13] @Ben_Reinhardt 💜 85 🔁 7\nHas anybody tried protesting building regulations by starting to build something almost everybody thinks is good and not stopping until they’re publicly arrested?\n↓\n1646619275174526980 [2023-04-13] @Ben_Reinhardt 💜 32 🔁 2 [(SEED) type=semantic_search]\nCivil disobedience but for infrastructure\n\n===\n\n1695085012335673617 [2023-08-25] @eshear 💜 485 🔁 7 [(SEED) type=semantic_search]\nRefusing to pay attention is a valid form of civil disobedience https://t.co/q1R9BMcCMN\n\n===\n\n1695094836393832739 [2023-08-25] @eshear 💜 21 [(SEED) type=quote_of_semantic_search]\nFeature request tho: image based mutes (mute photos of this person, mute this specific photo and variants of it). The mugshot keeps penetrating my defenses! Cc @soren_iverson if this gives him ideas https://t.co/jHi55gwr8y\n  [Quoting @eshear: Refusing to pay attention is a valid form of civil disobedience https://t.co/q1R9BMcCMN]\n\n===\n\n1736528831119536366 [2023-12-17] @eshear 💜 195 🔁 3 💬 1 [(SEED) type=semantic_search]\nRefusing to understand is a valid form of civil disobedience\n↓\n1736532704538354102 [2023-12-17] @Ken67547214 \n@eshear \"wha? What? I thought this was America!\"\n\n===\n\n1736540935368896783 [2023-12-18] @profoundish 💜 1 [(SEED) type=quote_of_semantic_search]\nWhat counter-comprehension protocols are you running? https://t.co/rkowzekFBI\n  [Quoting @eshear: Refusing to understand is a valid form of civil disobedience]\n\n===\n\n1766135182036218309 [2024-03-08] @eigenrobot 💜 8675 🔁 814 💬 1\nthe general refusal to use the new name for twitter is the greatest act of resistance of the information age\n↓\n1766135856920662191 [2024-03-08] @eigenrobot 💜 713 🔁 12\nno ones making a big fuss of it or anything. but musk aside, only journalists use the new name; and only in their published work\n\neven there it's always \"X (formerly Twitter)\"\n↓\n1766139921839030396 [2024-03-08] @eshear 💜 17 [(SEED) type=semantic_search]\n@eigenrobot An true act of civil disobedience\n\n===\n\n1783308601282433298 [2024-04-25] @C_Harwick 💜 7 [(SEED) type=quote_of_root]\nForwarding this classic to someone who's a little self-conscious about not following the news recently. https://t.co/MagaAYH9QF\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n\n===\n\n1804296426287173874 [2024-06-21] @Malcolm_Ocean 💜 3\nover here being public about not knowing what's going on https://t.co/vSQlf07mNW\n  [Quoting @Malcolm_Ocean: I've barely looked into this situation (which is why I'm not telling anyone to do anything about it) but it seems to me like it has very strong \"you go first\" vibes, with both sides saying \"the other side won't negotiate!\" https://t.co/E4mgvxLUmq]\n↓\n1804296427520299170 [2024-06-21] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\nnormalizing civil disobedience\nhttps://t.co/NlNodKg8qZ\n  [Quoting @literalbanana: Refusing to know about things is a valid form of civil disobedience]\n↓\n1804296428816338976 [2024-06-21] @Malcolm_Ocean 💜 1\nnormalizing normalizing\nhttps://t.co/HojvR2KMhz\n  [Quoting Tweet 1404558294673367040 (missing)]\n↓\n1804777532551806998 [2024-06-23] @Malcolm_Ocean 💜 3\nmore of this vibe:\nhttps://t.co/pm3N0c2zB9\n  [Quoting Tweet 1804168636292018365 (missing)]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand explores strategic ignorance as a form of epistemic self-defense in an information-saturated environment. The boundary object is literalbanana's 2018 tweet framing 'refusing to know' as civil disobedience. The discourse evolves from simple validation (eigenrobot's 'substitute for knowing') through ultimape's deep dive into memetic infection theory (treating curiosity as a vulnerability to viral ideologies), to yashkaf's rock-paper-scissors model of argument styles where trolling beats bad-faith politics. The strand is primarily constructive—building a shared vocabulary for information hygiene—though it includes dialectical moments (e.g., the tension between 'becoming expert to cope with anxiety' vs. 'becoming a dumb bitch'). The community validates selective ignorance as legitimate praxis, not laziness, spanning 7 years with recurring applications to politics, UFOs, Twitter drama, and COVID discourse.",
    "rating": 7,
    "evolution": "high",
    "cohesion": "medium",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1008714338574585856,
        "annotation": "Origin: The founding declaration that ignorance can be an active choice, not a passive state"
      },
      {
        "tweet_id": 1094416201214656512,
        "annotation": "Early refinement: Eigenrobot introduces 'feigned ignorance as apotropaic'—pretending not to know as protective magic"
      },
      {
        "tweet_id": 1109012590288605185,
        "annotation": "Ultimape's application: Choosing ignorance 'on principle' after deep research—willful vs. naive ignorance"
      },
      {
        "tweet_id": 1266170952448184327,
        "annotation": "Theoretical peak: Ultimape frames curiosity as a vulnerability to memetic infection, cultivating ignorance as immune response"
      },
      {
        "tweet_id": 1201539013586370560,
        "annotation": "Yashkaf's political application: Refusing to participate in partisan discourse as consequentialist strategy"
      },
      {
        "tweet_id": 1275212860461854720,
        "annotation": "The rock-paper-scissors model: Trolling beats politicians, nerds beat trolls, politicians beat nerds—ignorance as tactical positioning"
      },
      {
        "tweet_id": 1257536496132710400,
        "annotation": "Qiaochu's 'dumb bitch' turn: Aspirational ignorance as lifestyle, endorsed by eigenrobot"
      },
      {
        "tweet_id": 1272033365957341185,
        "annotation": "Eigenrobot's 2020 synthesis: 'No one has the right to make you care about anything'—peak articulation of the ethic"
      },
      {
        "tweet_id": 1434454630352760834,
        "annotation": "Ultimape's self-aware limit: After calculating lethal banana cyanide doses, choosing to stop—practiced ignorance"
      },
      {
        "tweet_id": 1766139921839030396,
        "annotation": "Eshear recognizes Twitter/X naming resistance as 'true civil disobedience'—the meme's real-world manifestation"
      }
    ]
  }
}