{
  "seed_tweet_id": 1039420186586038273,
  "thread_text": "1020896955856064512 [2018-07-22] @visakanv 💜 294 🔁 31\nNoobs: You made a mistake, haha, gotcha! I win, you lose! Suck it, sucker!\n\nFriends: Was that a mistake? It’s interesting how we both things wrong in distinct ways, that reveal our underlying assumptions and allow us to come to a better understanding of ourselves. I appreciate u\n↓\n1020898951644393473 [2018-07-22] @visakanv 💜 146 🔁 12\nNoobs: wow youre incredibly stupid, ffs, wtf is wrong with you? Astoundingly pathetic. Delete your account\n\nFriends: have u considered X? What are your thoughts on Y? When u say A, do you mean that if B happens, you would do C? Just trying to understand where you’re coming from\n↓\n1020900855204143105 [2018-07-22] @visakanv 💜 124 🔁 8\nNoobs: wow you are so amazingly full of yourself. Who made you an authority on this? What the fuck do you know?\n\nFriends: I love how passionate you are about this! Here’s a related thing I saw once, maybe you’ll find it interesting too? Eager to see where you go with all of this!\n↓\n1020901935556128768 [2018-07-22] @visakanv 💜 159 🔁 13\nNoob-minus: this is the worst thing I have ever read \n\nNoob-plus: this is the best thing I have ever read\n\nFriends: you’re on to something here! I really liked the part where you talked about X, it made me think about Y. I was kinda hoping for more about Z, but that’s just my POV\n↓\n1085388944500498437 [2019-01-16] @visakanv 💜 49 🔁 3\nfriends: I don't quite see it that way / that seems off to me / I have another way of looking at it\n\nnoobs: https://t.co/pavSDlzegn\n  [Quoting @visakanv: there's this very annoying thing that disagreeable people do where they respond to something with \"this is incorrect\" and then elaborate by giving you another statement that does not in any way refute the original statement; ie A and B can both be true https://t.co/EI3zkLWOA4]\n↓\n1085389223635619842 [2019-01-16] @visakanv 💜 60 🔁 3 [(SEED) type=quote_of_root]\nwhy be a noob when you can make friends instead?\n\nhttps://t.co/9Fzs72fAoN\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1085389284960538629 [2019-01-16] @visakanv 💜 25\nhttps://t.co/p0NMY04UYR\n  [Quoting @visakanv: All my best friends have kicked my ass]\n↓\n1085389826331938821 [2019-01-16] @visakanv 💜 34 🔁 3\nwhy be a noob when you can make friends instead? https://t.co/fbW9i8010M\n  [Quoting @visakanv: how to make friends on twitter https://t.co/6XU9C0Cmww]\n\n===\n\n1039420186586038273 [2018-09-11] @visakanv 💜 2349 🔁 475 💬 28 [(SEED) type=root]\nThere is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly\n↓\n1039421328695091200 [2018-09-11] @visakanv 💜 866 🔁 61 💬 11\nEvery “utterance” (status, tweet, whatever) is a bit of an invitation, a bit of a proposal. “Let’s play this game”. When strangers read the proposal accurately, and support the game, a shared understanding develops. You can make friends this way.\n├── 1039423802818551808 [2018-09-11] @visakanv 💜 460 🔁 22 💬 1\n│   Some people deliberately choose to ignore, misread, disregard or denounce other people’s bids. Others are outright clueless and don’t know how to play, and sometimes cluelessness leads to worse bungling than deliberate malice (JJ’s razor) https://t.co/MC09cW3bCM\n│     [Quoting Tweet 739895135870148608 (missing)]\n│   ↓\n│   1039426670053142528 [2018-09-11] @visakanv 💜 484 🔁 34 💬 1\n│   I was a lot more belligerent and disagreeable when I was younger, in part because I simplistically thought playing other people’s games was a sheep-like way to live. Why should I support other people’s dumb games? Why not mock them instead? It’s easy, and intoxicating\n│   ↓\n│   1039427070915297280 [2018-09-11] @visakanv 💜 667 🔁 37 💬 2\n│   I learned that you rarely build anything worthwhile that way. The “best” case scenario: you win over other disagreeable people. A few years of this &amp; it becomes the world you live in – surrounded by other belligerent assholes who don’t know or care how to play nice. A cursed life\n│   ↓\n│   1039427698634895360 [2018-09-11] @visakanv 💜 455 🔁 43\n│   We can’t choose where we are born, or our family, and our initial set of friends is heavily influenced by happenstance. But we can choose who we want to be associated with subsequently. All problems are interpersonal problems, but we kind of get to choose which ones we want\n│   ↓\n│   1039428937229598720 [2018-09-11] @visakanv 💜 637 🔁 56 💬 1\n│   Many different lines of enquiry have led me to this same conviction:\n│   \n│   The best guiding question in life is, “Who do you want to share this life with?”\n│   \n│   *Everything else* can be determined from this question. Your ethics, beliefs, actions, habits...\n│   \n│   https://t.co/BVZYdJ9vyS\n│     [Quoting @visakanv: Circling back: why even bother with the pain of defeat when you can avoid it? You never signed up for life  I think it boils down to the company. Do you want to be around people who are running from the pain, or towards it?  My ethics is derived from my desire for good peers]\n│   ↓\n│   1039497179939856384 [2018-09-11] @visakanv 💜 1115 🔁 128 💬 1\n│   Francis Bacon, Of Discourse\n│   \n│   - don’t be tedious\n│   - let other people talk\n│   - if someone is hogging, cut him off\n│   - ask questions that people can look good answering\n│   - don’t be a poser with smartass questions \n│   - don’t bitch about others\n│   - eloquence is overrated\n│   - It’s Not About You https://t.co/LvHozF4N3Y\n│   ↓\n│   1039499550262681601 [2018-09-11] @visakanv 💜 517 🔁 38\n│   George Washington:\n│   \n│   1. Respect others\n│   13. If your friend has lice, remove it privately\n│   38. When visiting the sick, don’t play physician\n│   41. “Undertake not to teach your equal in the art himself professes”\n│   46. Take all admonition thankfully\n│   49. Use no reproachful language https://t.co/fjUfhcMHqk\n│   ↓\n│   1039504012037382144 [2018-09-11] @visakanv 💜 325 🔁 14\n│   50. ”Be not hasty to believe flying reports to the disparagement of any”\n│   56. Associate with quality people\n│   58. No malice or envy\n│   61. Don’t intimidate the ignorant\n│   62. Don’t ruin the mood; if someone else does, fix it\n│   64. Don’t laugh at others’ misfortune\n│   66. Be courteous\n│   ↓\n│   1039505629742690304 [2018-09-11] @visakanv 💜 245 🔁 11\n│   68. Give not advice without being asked\n│   \n│   70. Reprehend not the imperfection of others\n│   \n│   71. Gaze not on the blemishes of others and ask not how they came\n│   \n│   73. Think before you speak\n│   \n│   74. When another speaks, be attentive and do not interrupt https://t.co/rMTZLaaEWU\n├── 1329064211897610240 [2020-11-18] @blisstweeting 💜 2\n│   @visakanv Taken together, on a time interval long enough, these utterances may comprise a dance, or they may look like a dance but be a mockery of it\n└── 1807848980883333463 [2024-07-01] @workflowsauce \n    @visakanv That’s love right there\n\n===\n\n1056490786680799234 [2018-10-28] @visakanv 💜 4 🔁 2\nIf you reply to someone that something is trash, but you don’t explain it when they ask why, you’re the trash https://t.co/hCLGpl4nFS\n↓\n1056492953344995329 [2018-10-28] @visakanv 💜 10 [(SEED) type=quote_of_root]\nGetting good at replying can dramatically alter your quality of life\n\nIt’s really a digital/text-first way of saying, being courteous can alter your life. “How to win friends and influence people *online*?” Improve your reply game.\n\nhttps://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1056493285869375489 [2018-10-28] @visakanv 💜 9\nOf course first you have to decide what game you’re playing, what you’re optimising for. Optimising for the sweet feeling of insulting something or someone is *so* myopic and unimaginative. I recommend optimising for long term relationships - which means being supportive &amp; kind\n\n===\n\n1073645215397761025 [2018-12-14] @visakanv 💜 63 🔁 1\nI’m always intrigued by the implicit social rules that few talk about but most people understand. eg it can be fun and affirming for women to comment sexy things on each other’s Instagram photos, but it would be mostly tasteless &amp; creepy for a dude to do the same unless he’s gay https://t.co/KNg4YGqVbI\n↓\n1073645688062234624 [2018-12-14] @visakanv 💜 41 🔁 1\nSometimes I hear dudes with poor social skills saying things like “that’s double standards” or “girls are such hypocrites” - which is inaccurate IMO, because the reality behind this phenomenon is quite nuanced. A lot of social relations boil down to power and plausibility\n↓\n1073646782310014977 [2018-12-14] @visakanv 💜 21 🔁 1\nRecently I saw some people asking “how come Beyonce doesn’t get shit for wearing Indian clothes at an Indian wedding”, &amp; it struck me as another version of this cluelessness\n\nSocial relations are complex, nuanced, intersubjective. Consider the unspoken rules around swearing https://t.co/uGPWIEv7Ls\n↓\n1073648169500602369 [2018-12-14] @visakanv 💜 32\nI was watching my nephew [7yo] and niece [5yo] (cousins, not siblings) wrestling around on the carpet, playing and laughing as children do. It’s interesting to realise that there will come a day where it can become kinda inappropriate. So much of human relations are like this https://t.co/oLxdkripc1\n↓\n1073650942333968384 [2018-12-14] @visakanv 💜 39 🔁 1\nI’ve been slow-playing this: I used to be pretty bad at this stuff, and now I’m really good at it. I would say I was probably “bottom 40%” as an ignorant clueless nerd, &amp; probably now top 1% as a high-functioning adult. It’s possibly the single best skill I have, or tied up in it https://t.co/zPrNRfNtRm\n↓\n1073651822932385792 [2018-12-14] @visakanv 💜 73 🔁 5\nBasically, just as you can train your ear as a musician and train your eye as a photographer, you can train your sensitivity to other human beings. (It’s all connected, too, but that’s another story)\n\nThe central insight is probably... “it’s not about you.” https://t.co/QSVUFrL7gI\n↓\n1073653014056001536 [2018-12-14] @visakanv 💜 33 🔁 1\nI think I first opened my eyes to this reality when reading this passage from 48 Laws Of Power. The real message here imo is to be deliberate in putting in effort in modelling other people’s minds, to pay attention to how you are coming across *to them*. https://t.co/D51txAgqav\n  [Quoting @visakanv: @HuanWin reading 48 laws of power at about 20yo was probably my most major 0-to-1 'awakening' moment. \"honesty is a blunt instrument that can bloody more than it cuts\" https://t.co/PPOXzPB2ya]\n↓\n1073653808461303808 [2018-12-14] @visakanv 💜 34\n(Deciding to talk openly about this stuff is a choice that invites potential misunderstanding - it’d be easier to just silently enjoy the fruits of having social skills. But I think it’s worth it if even one other person gets value from it; that’s what I’m optimising for.) https://t.co/SDEIQG9N2I\n↓\n1073654317343637504 [2018-12-14] @visakanv 💜 51 🔁 6\nA misreading of “honesty is a blunt instrument that bloodies more than it cuts” might be “well I guess I’d better be dishonest then.” No!! That misses the point, which is to be sensitive to others. Delivery matters. Context matters. Nuance matters. Be patient &amp; thoughtful &amp; kind https://t.co/IGkT3I6eJm\n↓\n1073655558488518656 [2018-12-14] @visakanv 💜 47\nIf you’re operating in a disreputable marketplace (eg dating), don’t take it personally if people are skeptical of you even though you’re being honest\n\nRemember, again: it’s not about you! It’s the context you are in https://t.co/tAihyWtbMQ\n  [Quoting @visakanv: Circling back:  1. Generally speaking, show, don't tell, because the world is swimming in bullshit and skeptical of unproven/unverifiable statements  2. When you share sincere information that cannot be verified by third parties, don't take it personally when they doubt you]\n↓\n1073659075341107200 [2018-12-14] @visakanv 💜 14 🔁 1 [(SEED) type=quote_of_root]\nOn having good reply game, which will win you friends https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1073660302590238720 [2018-12-14] @visakanv 💜 21 🔁 1\nOn marriage, which definitely requires semi-advanced social skills - or at least, the ability to healthily manage conflict with a person who is going to be the #1 most annoying and frustrating person in your life *even* if they’re your favorite person https://t.co/LtPPFpPYfg\n  [Quoting @visakanv: My wife predicts divorces &amp; failed relationships with stunning accuracy and I have learned a few of her tricks  relationships are fucking hard, and to work they need a sort of functional “economy” (gratitude, laughter, kindness) and waste elimination system (pain, resentment)]\n↓\n1073661442832789504 [2018-12-14] @visakanv 💜 14 🔁 2\nI don’t think we can ever spend too much time and energy learning to be better at relationships, at interfacing with each other (and ourselves!) in nourishing ways. There are some good general principles, but also almost always an exception to every rule https://t.co/2YyyBvQcEc\n  [Quoting @visakanv: \"How do I build more intimate relationships with people\" is a very important question I don't hear many ppl talk abt https://t.co/bBXuCkvvZz]\n\n===\n\n1089577060689797120 [2019-01-27] @visakanv 💜 192 🔁 33\n\"what do you do when you can't compete with people smarter and more ambitious than you?\"\n\nIMO: each time you encounter someone working on X, subtract X from the range of things you’re focusing on. over time you develop a narrower focus, of things that nobody else is focusing on\n↓\n1089578788793442304 [2019-01-27] @visakanv 💜 139 🔁 10\npractice this way of thinking for a while, and encountering someone who's working on X becomes a relief – \"ah, they've got that covered, now I can focus on Y instead\". collaborative model of learning and exploration. the territory is infinite, and we learn from each other\n↓\n1089597694610292736 [2019-01-27] @visakanv 💜 112 🔁 9\nif you get good at this, and keep track of what people are working on, and support them in their pursuits, and introduce them to each other, and generally be a nurturing and wholesome presence...\n\npeople smarter than you become eager to contribute to *you* and *your* work\n↓\n1089599005711986689 [2019-01-27] @visakanv 💜 324 🔁 45\n*cracks knuckles*\n\nschool indoctrinates kids to compete with each other on standardized tests, to see others as competitors rather than potential collaborators. this atomizes people, makes them feel isolated, disconnected, fearful of not measuring up, jealous of others' successes\n↓\n1089600578651471872 [2019-01-27] @visakanv 💜 239 🔁 24\nthe more interesting qn to ask, compared to \"how do you compete with smarter people\", is \"how do you win the love, trust, support &amp; goodwill of smarter people, so that THEY are on YOUR side\"\n\nit's interesting how rarely anybody seems to ask this. i think about this all the time\n↓\n1089601312935694336 [2019-01-27] @visakanv 💜 67 🔁 2 [(SEED) type=quote_of_root]\nmake friends and support them\n\nhttps://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1096868650198298624 [2019-02-16] @visakanv 💜 38 🔁 2\nalso you can be useful to people smarter than you just by taking notes for a long period of time https://t.co/NekIomPb27\n  [Quoting @visakanv: An interesting thing @guanyinmiao pointed out to me recently is that reporters who stick to a beat over time develop a deep understanding of history and context, and so they can pull out all these interesting and insightful bits that even smarter writers will not be able to https://t.co/SAa8LbCpma]\n↓\n1096869250080239616 [2019-02-16] @visakanv 💜 136 🔁 21\nTake notes, make friends https://t.co/BmrkCY15BM\n\n===\n\n1096871327263219713 [2019-02-16] @visakanv 💜 10\nA big part of my twitter style is a variation of “praise publicly, criticise privately” - ie I use quote-tweets to say “yes, this!! and also,”\n\nOver time this introduces kind friendly nerds to other kind friendly nerds and 99% of the time works out great. https://t.co/4PVheTXeRU\n  [Quoting Tweet 1096713374350622720 (missing)]\n↓\n1096871423740600320 [2019-02-16] @visakanv \nEg https://t.co/HMqtkVyzET\n  [Quoting @visakanv: yep. all learning begins with imitation, there are non-obvious things you learn from mimicking \"obvious\" things.  I often get comments like \"oh selling t-shirts with barely-funny slogans is so easy, unimaginative, easy money\" – sure, you try it, lmao https://t.co/0y4Ra2BTU9]\n↓\n1096871699637710851 [2019-02-16] @visakanv \nhttps://t.co/52IcL18KnW\n  [Quoting @visakanv: how amazing does this look?? https://t.co/8uZgsiP80Q]\n↓\n1096871989652860928 [2019-02-16] @visakanv 💜 1\nhttps://t.co/ae42vjlbKU\n  [Quoting @visakanv: yes and, this is also true even at the level of the personal individual  \"By far the most difficult skill for me to learn as CEO was the ability to manage my own psychology.\" – Ben Horowitz]\n↓\n1096872346516746240 [2019-02-16] @visakanv 💜 4 [(SEED) type=quote_of_root]\nAll of this is in service of making friends, creating a nourishing and supportive commons where kind friends can meet other kind friends, and it’s also just intrinsically a wholesome and pleasurable thing to do https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1100490023932051456 [2019-02-26] @visakanv 💜 74 🔁 13\nKnowing how to use tactical agreement + knowing when to STFU easily puts you in the top 1% of conversationalists\n↓\n1100491621840244736 [2019-02-26] @visakanv 💜 21 🔁 4\nIf you look at the state of your correspondence and find it wanting (chronic nitpickers, it you,) you can replace the whole thing with \n\n1. STFU\n2. Agree thoughtfully and supportively when you see an opportunity to agree\n\nand you will immediately find yourself making more friends\n↓\n1100492069330505728 [2019-02-26] @visakanv 💜 15 🔁 3 [(SEED) type=quote_of_root]\nYou can disagree supportively too, though that requires more skill and nuance\n\n“But I don’t want to support people!” - that means you don’t want to make friends. Sounds like a sad and lonely life to me, but fair enough it’s your life\n\nhttps://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1100492784593657856 [2019-02-26] @visakanv 💜 23 🔁 2\n“But the wrong people,,, need to know they are wrong” - do they really? And does telling them they are wrong help them see they are wrong? \n\nI’ve seen people use this logic to enable their bullshit for years without ever stopping to see if it even works (hint: it doesn’t)\n↓\n1100493225947590656 [2019-02-26] @visakanv 💜 14 🔁 1\nIt can *seem* like it works because you receive signals of support from other people who agree with you that the wrong people are wrong, and you *can* make friends this way, sometimes great ones\n\nBut if you’re not careful, you end up surrounded by haters. It only takes a few\n↓\n1100494586609164288 [2019-02-26] @visakanv 💜 9 🔁 1\nI think a sad thing I’ve seen is when people who have been wronged, victimised etc set out to seek justice - which is IMO a good thing!! - but in the process inadvertently end up becoming a proxy for contemptuous haters. It happens. There are abusers just looking for a reason https://t.co/i722EA6NzK\n↓\n1100495902521712640 [2019-02-26] @visakanv 💜 23 🔁 3\nIMO, the best way to help people “see they are wrong” is to ask them questions. The full playbook would take like ~30 tweets minimum so not gonna get into that now,,, \n\nbut anyway, always worth considering &amp; evaluating the outcomes of your correspondence. Does it spark joy? 😂\n↓\n1100497170514362368 [2019-02-26] @visakanv 💜 15 🔁 3\nYou can construct the playbook yourself from 1st principles if you know a few things. People’s conclusions are based on (a) their experience + (b) cherished assumptions, so you’ll rarely persuade them by arguing about conclusions. Ask kindly about a &amp; b https://t.co/llbrYvkfTe\n  [Quoting @visakanv: here's another way of looking at it  if we have a disagreement, we need to identify our respective assumptions, and talk about our respective experiences. if you're not open to doing that then don't waste people's time by disagreeing with them stupidly https://t.co/QctWih0sPd]\n↓\n1100498062378782720 [2019-02-26] @visakanv 💜 16 🔁 1\nA thoughtful disagreement can probably be reduced to “this is where I’m coming from, where are you coming from? Help me understand why I don’t see things the way you see.” Once you see this, witnessing conclusion-level disagreements is dispiriting https://t.co/0QgRDtvdIz\n  [Quoting @visakanv: more simply: a disagreement is interesting if both parties make an effort to show each other what they each see, and to try and see where the other party is coming from. it's uninteresting if one party is just mindlessly going \"boo, no, ew, ick, weak, stupid, bad, fail\"]\n↓\n1100499365561597953 [2019-02-26] @visakanv 💜 15 🔁 1\nAlso!! People generally love to corroborate their experiences (it’s a fantastic thing to do, all good conversations have some of this)\n\nAND, people are often shy/nervous to just blab on about themselves \n\nSO, \n\nasking people kindly about their experiences is INCREDIBLY POWERFUL\n↓\n1100500364086919170 [2019-02-26] @visakanv 💜 40 🔁 2\nWhat have you seen? \nWhat surprised you? \nWhat have you been wrong about?\nWhat do you know now you didn’t before?\nWhat have you struggled with?\nWhat has your relationship with X (food, money, parents, job, dating) been like?\n\nThis puts you in 0.1% and people will *love* you https://t.co/CmH88FeEmt\n↓\n1100502256208744448 [2019-02-26] @visakanv 💜 20\nI used to *suck* at this, but I was earnest and eager to be better. And it’s had the *biggest* impact on my quality of life. People seek me out to talk to me, it’s super nourishing. I’ve learned so much about the world I couldn’t have otherwise, via people https://t.co/8XO9AQCkkc\n  [Quoting @visakanv: Meeting internet friends from around the world is always a huge highlight of my life and fills me with a lot of gratitude. Despite the wanton amounts of rampant fuckery on here, there are good, fun, kind, interesting people worth hanging out with]\n↓\n1100502788633751552 [2019-02-26] @visakanv 💜 8\nBtw I wrote this story a while ago because I wanted to talk about this (getting good at peopling) but didn’t know how to do it 😂 it really resonated with people https://t.co/NThxoRkOXJ\n  [Quoting @visakanv: Story:  You suck at something  It bothers you, so you work hard at it &amp; many years, through lots of pain and failure  You are now good at the thing &amp; it comes easy to you   You look around and you see that most people suck at this  Why don’t they just get good?? Being good rules!]\n\n===\n\n1109569375496007680 [2019-03-23] @visakanv 💜 6\nAmusing to observe how many people in the replies are willfully making an effort to miss the point, and in so doing, confirm the original statement (which is obviously meant to be more of a think-about-it koan than some sort of universal truth) https://t.co/I5bQZK6b5v\n  [Quoting Tweet 1109482934719954947 (missing)]\n↓\n1109569851637424129 [2019-03-23] @visakanv 💜 4 [(SEED) type=quote_of_root]\nImprove your reply-game, improve your life https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1137963842384699393 [2019-06-10] @visakanv 💜 71 🔁 4\nThe big lesson of my social life from being a bungler in my teens to being fairly charming &amp; charismatic in my  late 20s is “it’s less what you say &amp; more how you say it”\n\nPeople who don’t like to accept this will find all sorts of ways to nitpick - and ironically, in so doing...\n↓\n1137965011333070848 [2019-06-10] @visakanv 💜 53 🔁 1 [(SEED) type=quote_of_root]\nWhatever the game you think you’re playing, there’s also simultaneously a meta-game, and in the long run it’s the meta-game that matters. How you fight is more important than the fact that you fought. Fights are near-inevitable, fighting well is not https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1137966378336497664 [2019-06-10] @visakanv 💜 72 🔁 16\nComplaining about freedom of speech in the context of a social conversation is like complaining that your dance partner is restricting your freedom of movement. \n\nBe attentive to your partner and learn to dance, otherwise go somewhere you can dance alone and not bother people\n↓\n1191635484876787717 [2019-11-05] @visakanv 💜 20 🔁 4\n“I want you to know it could be more than this. We could help each other see in the dark. You‘re supposed to be echolocating, but all you are doing is shouting at me.” \n\n(h/t @Tipsycaek) \n\nhttps://t.co/4cu71dPNoP\n\n===\n\n1141043305007894528 [2019-06-18] @visakanv 💜 359 🔁 45 💬 1\nThere’s a recurring moment in multiple conversations I have had with childhood friends (90s kids) that’s quite bleak. They’re 29-30 and realising they’ve been holding on to vague scripts. not done much self-authorship. These are smart people who feel trapped but avoid facing it\n\n===\n\n1141054307887751169 [2019-06-18] @visakanv 💜 11\n11. https://t.co/PjIuLdh19z\n  [Quoting @visakanv: project management is something that *isn't* super intuitive, because it's something that involves things that are bigger than what you might naturally do in a given day. The variance is massive. Some people dick around their whole lives, others build cathedrals and rocket ships]\n↓\n1141054420462886912 [2019-06-18] @visakanv 💜 11\n12. https://t.co/wCjbstIa9z\n  [Quoting @visakanv: People typically have high-res models of their own lives and lower-res models of other people’s. We are all born clueless with incredibly low-res models of the world - then we tweak and upgrade our models. Different people do this to different degrees depending on many variables]\n↓\n1141054844104351745 [2019-06-18] @visakanv 💜 9\n13. https://t.co/2fQqeMkizy\n  [Quoting @visakanv: Visa’s rules for life [draft]  1. recognise when u get ur ass kicked, &amp; accept it with grace  2. if u *have* to kick someone’s ass, be swift, don’t be a dick about it  3. if u can save an innocent ass from being kicked, do so  4. remember, life kicks everybody’s ass in the end https://t.co/Um8cpgnREB]\n↓\n1141055152238972928 [2019-06-18] @visakanv 💜 12\n14. https://t.co/mmKXPJGXhB\n  [Quoting @visakanv: hypothesis: if you do barely anything with your life but take little notes every day, journal, diary, whatever – snapshots of your opinions, impressions, perspectives, predictions – and then you thread these notes over time, say, 10 years...]\n↓\n1141055546528653312 [2019-06-18] @visakanv 💜 11\n15. https://t.co/JvXwaEp34E\n  [Quoting @visakanv: A long term tension in my life: I don't feel qualified to lead, but I don't see anybody really worth following, either. When, where and how did I inherit these annoyingly perfectionist standards and ideals?]\n↓\n1141055748924854272 [2019-06-18] @visakanv 💜 10\n16. https://t.co/HkTbskkGXO\n  [Quoting @visakanv: Alan Watts really changed my life when I was inhibitingly depressed around 2014/2015. Life just seemed so bleak - even with a job I liked and a wife I loved, existence seemed like a jail sentence. Alan helped me see that it was funny, in a hearty and nourishing way https://t.co/QazobK21GF]\n↓\n1141056214534516736 [2019-06-18] @visakanv 💜 9\n17. https://t.co/7Ol5lf51vr\n  [Quoting @visakanv: There are actually some very specific things that I do that reflect my self-as-assemblage, which might seem weird to some people, but I find very therapeutic https://t.co/miJjLVyzJO]\n↓\n1141056554881306625 [2019-06-18] @visakanv 💜 9\n18. empty your cup https://t.co/MweR8JN6WG\n  [Quoting @visakanv: I never really understood the whole “empty your cup” and “unlearn what you have learned” thing until maybe a couple of years ago. Like, intellectually it sorta made sense, but... is it really that big a deal?   It actually is, IMO, and I’m wondering now how I learned to see it]\n↓\n1141056807944613888 [2019-06-18] @visakanv 💜 11 🔁 1\n19. tactical STFU https://t.co/6RypCCzKat\n  [Quoting @visakanv: Knowing how to use tactical agreement + knowing when to STFU easily puts you in the top 1% of conversationalists]\n↓\n1141057077067972608 [2019-06-18] @visakanv 💜 12 🔁 1\n20. ugh fields https://t.co/dkZrgqsv6x\n  [Quoting @visakanv: I think one of the most difficult truths I have to admit to myself is – that despite all my writing and journaling, most of my introspection still mostly circles around my blind spots, which involve deep-rooted fear, anxiety trauma, ugh fields. And I've gotten very good at this]\n↓\n1141067481907228672 [2019-06-18] @visakanv 💜 11 🔁 1 [(SEED) type=quote_of_root]\n21. the art of the reply https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1157363442312863744 [2019-08-02] @visakanv 💜 15\nTrue in my experience https://t.co/qsv5wMtGQS\n↓\n1157364350501310464 [2019-08-02] @visakanv 💜 9 [(SEED) type=quote_of_root]\nIf u are willing but don’t seem to be able: https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1166620515441811461 [2019-08-28] @visakanv 💜 39\nI resist the urge to reply “this is a stupid tweet” roughly 100x a day\n↓\n1166668336517697537 [2019-08-28] @visakanv 💜 5 [(SEED) type=quote_of_root]\nto be constructive about it, https://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1199801131435642880 [2019-11-27] @visakanv 💜 11\nthread expanding the visakanv imaginary AU https://t.co/ZgN1pGL30x\n  [Quoting @visakanv: In my alternate universe, any child that reads books under the desk at school is given a full scholarship to do whatever they want. If they want, they get to skip regular school and hang out in the library with all the other self-directed nerds. Some elder nerds loosely supervise]\n↓\n1199801133453041664 [2019-11-27] @visakanv 💜 13 💬 5\nIn this AU, quote-tweeting bad takes is seen as tacky and cringe. People whisper \"bro, you signal-boosted a bad take\" at each other, and respond with \"o shit, my bad, thanks for looking out\". Friends don't let friends QT bad takes\n\nhttps://t.co/AdCrhCw2CJ\n↓\n1199801894169743361 [2019-11-27] @visakanv 💜 11\nvirginity as a concept does not exist in this imaginary universe \n\nhttps://t.co/XiQR0ht7c1\n  [Quoting @visakanv: petition to replace \"lose your virginity\" with \"make your sexual debut\"]\n↓\n1199802667536531456 [2019-11-27] @visakanv 💜 13 [(SEED) type=quote_of_root]\neverybody in this imaginary universe aspires to be a great conversationalist, and develops great reply game as a result https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1212222026515197953 [2020-01-01] @ultimape 💜 1 [(SEED) type=quote_of_root]\nThreadWeb TL;DR:How to be excellent to each other. https://t.co/woWhZnBYiP\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1213765844045615104 [2020-01-05] @mechanical_monk 💜 40 🔁 2 💬 1\nThere's apparently a module in my brain which thinks that correcting other people's grammatical mistakes will signal that I'm smart and urges me to do it every time. Where would it get this notion? Nobody has ever improved their social standing after being a grammar nazi\n↓\n1214404970948153345 [2020-01-07] @visakanv 💜 5 [(SEED) type=quote_of_root]\n@mechanicalmonk1 here's a module upgrade for ya https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1216273201631617024 [2020-01-12] @visakanv  [(SEED) type=quote_of_root]\nRT @mormo_music: Great advice. I often fail at this. https://t.co/5cYLyl4ldV\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1252069495385911297 [2020-04-20] @visakanv 💜 1164 🔁 142\nOscar Wilde, on bad reply game:\n\n\"A bore is someone who deprives you of solitude without providing you with company.\"\n↓\n1252281490454396936 [2020-04-20] @visakanv 💜 20 [(SEED) type=quote_of_root]\non good reply game: https://t.co/sl601VdAQT https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1273284895876366343 [2020-06-17] @visakanv  [(SEED) type=quote_of_root]\nRT @nbashaw: Twitter should pin this to the top of everyone's timeline for a week https://t.co/ajSNccxnoH\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1279066068858703873 [2020-07-03] @visakanv 💜 67 🔁 3\nI believe that, over the course of a lifetime, good reply game is worth millions of dollars. and I think that undersells it, too, because most of the value is in relationships, which is intangible\n↓\n1279066241324347397 [2020-07-03] @visakanv 💜 28 [(SEED) type=quote_of_root]\ndusting off the classic for newer friends: https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1285729822677831683 [2020-07-22] @visakanv 💜 83 🔁 8\nI was informed that my abrasive eagerness to question and argue with people was being interpreted uncharitably. I realized it was true, and decided to focus on being friendly, kind and accommodating instead https://t.co/yN7Bkx71ZH\n  [Quoting Tweet 1285395036817899520 (missing)]\n↓\n1285730572678189057 [2020-07-22] @visakanv 💜 25 🔁 1\nsame, basically https://t.co/0RtQ38DqQs\n↓\n1285731146475753472 [2020-07-22] @visakanv 💜 7 [(SEED) type=quote_of_root]\nhttps://t.co/sl601UVZZl https://t.co/9Fzs72fAoN\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1302733249869946890 [2020-09-06] @m_ashcroft 💜 5\nHeads up to any of my aspiring reply guys. https://t.co/8XpUE6garM\n  [Quoting @m_ashcroft: @AdmiralOPG @visakanv @donmexlar I strongly dislike broadcast replies.  You know the ones. They're formatted like this.  With a key message here. Except in my replies.  Savvy?]\n↓\n1302733346318028800 [2020-09-06] @m_ashcroft 💜 3 [(SEED) type=quote_of_root]\nPlay this game instead!\n\nhttps://t.co/4PGquT0n9W\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1326660011553124354 [2020-11-11] @natural_hazard 💜 17\na lot of said ambition revolves around social stuff\n\nhaving more amazing friends doing dope stuff\n\none big blocker: I feel like the \"people doing legit stuff\" will only accept me if I can present a clear legible \"mission\"/\"passion project\", and i dont believe in that anymore https://t.co/AozttaTm3k\n  [Quoting @natural_hazard: been dwelling on unrealized ambition  for a long time i've had a sense that i really want to be SUPER INTENSE about *something*, but i haven't believed in anything enough to put that energy into it  what's going on here?]\n↓\n1332702488487555072 [2020-11-28] @visakanv 💜 4 [(SEED) type=quote_of_root]\n@natural_hazard IME people doing legit stuff will also accept you if you're just a generally supportive and useful reply guy https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1332708580299042816 [2020-11-28] @natural_hazard 💜 2\n@visakanv 1) I just realized I've been translating \"IME\" as \"in my épiñion\" 😂\n\n2) yeah. Being on twitter past year has helped me a bit with that. Now I'm thinking about more things to do that would contradict this sense\n↓\n1332708896826224640 [2020-11-28] @visakanv \n@natural_hazard 1) 😂\n\n2) 💪🏾🔥\n↓\n1332709634508025858 [2020-11-28] @m_ashcroft 💜 1\n@visakanv @natural_hazard I always thought \"In My Estimation\" 🤷‍♂️\n↓\n1332709860064907265 [2020-11-28] @visakanv 💜 2\n@m_ashcroft @natural_hazard experience, in my experience\n\n===\n\n1329109217756676097 [2020-11-18] @visakanv 💜 35 🔁 1 💬 1\nI want to try and play a game where I quote one tweet from myself from each year I've been on twitter, to assemble what I think is representative of the bigger long game I've been playing:\n\n===\n\n1329109493028847616 [2020-11-18] @visakanv 💜 10\n2008 https://t.co/9i1g1qLCE2\n  [Quoting @visakanv: just discovered twitter and... doesn't have anybody to follow]\n↓\n1329110118017814528 [2020-11-18] @visakanv 💜 5\n2009 \nhttps://t.co/8t8HXgWUbo\n  [Quoting @visakanv: misses the stage]\n↓\n1329111472631287808 [2020-11-18] @visakanv 💜 6\n2010 https://t.co/Mbpk8Uc00g\n  [Quoting @visakanv: you can be more than you think you can be, and what we can do together is exponentially more than the sum of what we can each do on our own.]\n↓\n1329112043249496064 [2020-11-18] @visakanv 💜 8\n2011 https://t.co/ofuftnwQ7n\n  [Quoting @visakanv: the only way forward for me as I see it is to throw myself into doing what nobody else is doing]\n↓\n1329113380330688513 [2020-11-18] @visakanv 💜 8\n2012 https://t.co/prpcCUUChS\n  [Quoting @visakanv: our education systems train us to be interchangeable, not indispensable]\n↓\n1329117790742007808 [2020-11-18] @visakanv 💜 7\n2013 https://t.co/GMko0KUCWo\n  [Quoting @visakanv: Being alive is such a goddamn miracle, why do we have to spend it obsessed about rituals, social standings, perceived slights?]\n↓\n1329118174499934208 [2020-11-18] @visakanv 💜 6\n2014 https://t.co/EsSTAxKsZF\n  [Quoting @visakanv: Scarcities in the world:   - Stories - Meaning  - Context - Perspective - Empathy - Sincerity - Relationships - Focus - Nuance - Curiosity]\n↓\n1329119620523978752 [2020-11-18] @visakanv 💜 6\n2015 https://t.co/atTCEH7KPR\n  [Quoting @visakanv: The real flying car / hoverboard / jetpack of 2020 will be a tool that helps you navigate information overload, not physical space]\n↓\n1329120364257939456 [2020-11-18] @visakanv 💜 6\n2016 https://t.co/fsmvsXNFqz\n  [Quoting @visakanv: How long have we spent in the past ~5 years in passionate arguments that ultimately amounted to nothing? What could've we done w that time?]\n↓\n1329131389468360704 [2020-11-18] @visakanv 💜 5\n2017 https://t.co/YW4qhrolX3\n  [Quoting @visakanv: I'm going to say something a little odd and self-contradictory, but I want to try saying it.  One of the most powerful insights I've been experimenting with in the past decade is:  When you have an insight, you often shouldn't talk about it – you should often enact it instead.]\n↓\n1329132063488831489 [2020-11-18] @visakanv 💜 4 [(SEED) type=quote_of_root]\n2018 https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1329134317914648576 [2020-11-18] @visakanv 💜 4\n2019 https://t.co/RmlrNR3kim\n  [Quoting @visakanv: guy: how do I make great art   picasso: make 50,000 pieces  guy: ur kidding  picasso: im not]\n↓\n1329134354379862016 [2020-11-18] @visakanv 💜 17\n2020 https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1329140109715750914 [2020-11-18] @visakanv 💜 6\ncouple of tweets came to mind only after I put together the list: https://t.co/BWGaL32elx\n  [Quoting @visakanv: One of my fantasies/goals is to earn the right to have enough quality followers that I can get interesting responses to anything I ask.]\n↓\n1329140375731113984 [2020-11-18] @visakanv 💜 5\nhttps://t.co/zCzHKcQtvi\n  [Quoting @visakanv: In some ways, my life's work is abt assembling a sort of tavern for psychonauts, explorers, wanderers, vagabonds, tinkerers, polymaths]\n↓\n1329141191326142464 [2020-11-18] @visakanv 💜 5\ncontained in this ongoing thread of quoted tweets is a thesis on how to go from being a nobody (I was!) to assembling an incredible international crew that will basically allow you to \"retire\" from the rat race and surf the waves of meaning\n\n https://t.co/hbbXXkBK7p\n  [Quoting @visakanv: My goal in life is to be a word artist-magician. Words are proxies for thoughts, and a master manipulator of words is a skilled navigator in the tumultuous ocean of meaning. Moana, but the ocean is the mind of humanity https://t.co/KY27aZUguA]\n↓\n1329142002177372160 [2020-11-18] @visakanv 💜 3\nhttps://t.co/k1qIZPr4zx\n  [Quoting @visakanv: This was greatly aggravated by me growing up on the Internet, where you have direct access to hundreds of millions of people  If you can persuade a million people to give you a few dollars, you don’t need a job, and you can shitpost all day]\n↓\n1329142482030923777 [2020-11-18] @visakanv 💜 3\nhttps://t.co/d0xpIMujge\n  [Quoting @visakanv: When trying to estimate the value of discerning what you really care about + what you find interesting, in your early 20s, I found myself thinking... if you're moderately privileged (smart, internet, etc), it must surely go to at *least* 7 figures over the course of a lifetime]\n\n===\n\n1343097932426354688 [2020-12-27] @visakanv 💜 83 🔁 3\nthe matrix view of twitter occasionally reveals itself to me. I feel like I have about 80% clarity rn. (I never remember to tweet when I have 90-95% clarity). \n\nI almost wanna say “turn it off, it’s too powerful”- but I look again and I am transfixed. It’s a superhuman system https://t.co/HLLFsYJQgf\n↓\n1343098939654823936 [2020-12-27] @visakanv 💜 37 🔁 1\nI think people get a little too anthropocentric when thinking about things - there are pros and cons to that - but I think if you really want to understand twitter it helps to simultaneously have a model of it where it’s about thoughts, not people. The Selfish Meme\n↓\n1343099574525685762 [2020-12-27] @visakanv 💜 61 🔁 4\none of the core driving forces of twitter is something I’m temp-labelling “the perfect utterance problem”\n\nbasically nobody can make perfect utterances bc of the limits of communication\n\nimperfect utterances chafe and frustrate people and inspire retaliatory utterances\n↓\n1343100717695844355 [2020-12-27] @visakanv 💜 90 🔁 13 💬 1\nit’s really terrifying and beautiful when you connect the dots and see how a string of QTs and replies is a map of people’s dysfunctions and fears. Twitter is a collaborative freeform MMO text-theater that reaches right into people’s guts and the writhing collective unconscious\n↓\n1343102398819012609 [2020-12-27] @visakanv 💜 47 🔁 3\nin this sense twitter is hyper-real, much more so than the casual drudgery of everyday life.\n\nTwitter is War, Twitter is Sport, Twitter is Dance, Twitter is Dream, Twitter is Love, Twitter is Hate.\n\nThe POTUS, the Pope - all have the same 280 characters you do. All can @ all.\n↓\n1343103260727492608 [2020-12-27] @visakanv 💜 50 🔁 3\nwhen I am close to perfect clarity I realize that theory and models are all tracing in the sand, and the only mere thing that matters is to embody love and grace in the deepest and fullest sense I possibly can. It is the only move that truly matters https://t.co/gyol4zzt3h\n  [Quoting Tweet 1343100491065077760 (missing)]\n↓\n1343106085385728001 [2020-12-27] @visakanv 💜 18 [(SEED) type=quote_of_root]\n🧘🏾‍♂️ https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1343107110519808002 [2020-12-27] @visakanv 💜 36 🔁 4\n...what is true is already so... https://t.co/RvuQwSEvn1\n↓\n1343108114812301312 [2020-12-27] @visakanv 💜 26 🔁 1 💬 1\nthe perfect utterance problem is a metaphorical subset of the perfect human problem. no utterance can be perfect as no human is perfect. and yet it is through our imperfections that we arrive at anything worth speaking of. frustration with imperfection is frustration with oneself\n↓\n1343109605610684418 [2020-12-27] @visakanv 💜 49 🔁 6\nmany are wearing themselves to the bone searching for a sign that “it’s okay”, that one can become okay, perhaps by clawing towards perfection one can reach a semblance of okay. the cosmic joke is that it was always okay; it becomes okay by being okay with being not-okay\n↓\n1343110116728442884 [2020-12-27] @visakanv 💜 28 🔁 1\nthe song is never finished, the dance is never done, the eternal play goes on and on, each moment is every moment\n\n===\n\n1343120356685463553 [2020-12-27] @visakanv 💜 29 [(SEED) type=quote_of_root]\nwhen I wrote this 2 years ago I was thinking about something specific, but the more i've cited it in more contexts, the more I've warmed up to the (reductive, yet useful) frame that good reply game is the only thing that matters https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1343120950926053383 [2020-12-27] @visakanv 💜 6\nI have described multiple things as \"the only thing that matters\", but this is not a contradiction, because they are all the same thing\n\nhttps://t.co/GEWDTbReL8\n  [Quoting @visakanv: thinking about how sometimes the only thing that really matters is the right vibe. you can have dark humor that's nourishing and supportive. you can have cheery positivity that's cruel and oppressive. the thing itself is so often secondary to the context, the delivery, the frame]\n↓\n1343121044391915525 [2020-12-27] @visakanv \nhttps://t.co/IdZdZ51IKD\n  [Quoting @visakanv: as an adult I realize that it's not a contest, there is no one right way, and life screws us all one way or another, whether we have a plan or not. so the only thing that actually matters is that we be kind and take care of each other, even if we don't entirely see eye to eye]\n↓\n1343121103577784321 [2020-12-27] @visakanv \nhttps://t.co/Sa8Gx8SFfb\n  [Quoting @visakanv: I’m in that liminal 4am headspace where I wake up between sleeps and the world doesn’t feel real so I’m just gonna come out and say that I think quadranting oneself is stupid and the only thing that matters is building relationships with people who have your back https://t.co/I2mPQ32VkK]\n↓\n1343121196066373633 [2020-12-27] @visakanv 💜 1\nhttps://t.co/OSjIKSAbxp\n  [Quoting @visakanv: @guavault correct. the only thing that matters is that you do the work. you wanna always be asking dumb questions, and be persistent yet flexible about exploring them. that's how you *become* smart. but if you get *attached* to being smart, then you start worrying about looking dumb. bad]\n↓\n1343121246918070275 [2020-12-27] @visakanv 💜 2\nhttps://t.co/4phh1NNsBK\n  [Quoting @visakanv: The phrase “some people are so poor, all they have is money” is so “edgy” but I honestly think it’s true  I was radicalised from a young age, by artists &amp; poets - to sincerely believe that the only thing that matters is the love and loyalty of your crew  https://t.co/CYGhHJDczm https://t.co/kD4a4qGu98]\n↓\n1343121323036299267 [2020-12-27] @visakanv 💜 2\nhttps://t.co/kD4a4qGu98\n  [Quoting @visakanv: The only thing that matters in life https://t.co/RAOlmawyqS]\n↓\n1343121362475339777 [2020-12-27] @visakanv 💜 1\nhttps://t.co/oKn7C21lVv\n  [Quoting @visakanv: but now I realize the only thing that matters is finding True Artists and supporting and challenging them, and the bottleneck there is my own thinking, my own behavior  a summary:   2007: fuck everyone  2013: fuck you guys   2015: fuck Visa   2019: there is no fuck  😂]\n↓\n1343121474211614722 [2020-12-27] @visakanv \nlol this one is specific to fashion but if you squint a little it still works https://t.co/ZH6IzcUXWN\n  [Quoting @visakanv: @nwilliams030 the only thing that matters to me is good aesthetics, costume jewelry can be superior to \"real\" jewelry]\n↓\n1343121554834526208 [2020-12-27] @visakanv \nspecific to email newsletters, but if you squint a little it still works https://t.co/vV49V2kszR\n  [Quoting @visakanv: @fortelabs i don't really care, the only thing that matters is that the email is good (ie doesn't waste my time)]\n↓\n1343121628176125953 [2020-12-27] @visakanv \nhttps://t.co/jlK2RXaOQ5\n  [Quoting @visakanv: @chiara97301070 oh I'm not saying 1% do great things and 99% think they're going to do great things. I'm saying 1% do anything at all, and 99% don't! whether or not you will be great is a distraction, the only thing that matters is doing the work. when in doubt, do the work]\n\n===\n\n1348377978959396864 [2021-01-10] @AskYatharth 💜 65 🔁 8\nPeople feel easy to talk to when they just take your words the way you want them to mean and not anyhow else.\n↓\n1348378891786752003 [2021-01-10] @AskYatharth 💜 24\nCorollary: Take words the way people mean.\n\nWhen someone says, “I think we should X,” when you they have a mistaken model of your mind, and you were already on board X, then just say “ok!” message of doing X received, instead of clarifying blah blah Y I was already on board.a\n↓\n1348378892579397632 [2021-01-10] @AskYatharth 💜 15 🔁 1\nAll they intended or wanted was to make sure you’re on board X, and you are, so great, don’t need to clarify.\n\nThis is one of the rules of a relational space, as I use the term.\n↓\n1348399986694791168 [2021-01-10] @AskYatharth 💜 11\nAnother example. Cropping out the inappropriate joke at the end. https://t.co/aqW9ayclxK\n↓\n1357474565283143683 [2021-02-04] @AskYatharth 💜 31 🔁 1\nIn improv, there’s this idea that partial blocking is still blocking.\n\nIf someone says something, and you try to clarify or but in any way, you are still not receiving the place that it came from.\n\nThey didn’t want you to “but.” They wanted you to get something.\n↓\n1357474566310797315 [2021-02-04] @AskYatharth 💜 34 🔁 3 [(SEED) type=quote_of_root]\nTake that something and then do what you want. Receiving doesn’t mean going along with what they say. But it does mean fully picking up what they put down first.\n\nPssst . . . this is basically what @visakanv does in the replies. https://t.co/O7r3XvmxSY\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1421360357910667267 [2021-07-31] @AskYatharth 💜 14\nPeople themselves might not know what they want.\n\nYour duty is to listen to both what they’re saying, and a bit beyond.\n\nYou’re an active participant in this figuring out what any of us really want or mean or need, yo. https://t.co/Iaya0deMn6\n  [Quoting @AskYatharth: Knowing ourselves is 𝘩𝘢𝘳𝘥, yo.  We have about as much insight into our own heads as other people do into ours.  Together, with our powers combined, yada . . . https://t.co/nKTUmOcLgD https://t.co/wOT547T2Oj]\n\n===\n\n1349727844763459589 [2021-01-14] @m_ashcroft 💜 41 🔁 3 [(SEED) type=quote_of_root]\nThis remains one of the great threads on how to play Twitter well. https://t.co/zL8l0zRuv8\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n├── 1349727902703648773 [2021-01-14] @m_ashcroft 💜 4\n│   nice https://t.co/nFesHg2yfi\n│   ↓\n│   1349728131876155393 [2021-01-14] @m_ashcroft 💜 5\n│   and of course by \"Twitter\" I also mean \"life\"\n└── 1349739565804789762 [2021-01-14] @tnorthcutt 💜 3\n    @m_ashcroft @visakanv Yeah love this. I wonder if there’s also an element of being an OP that makes this easier/work well. Like can you be a “good reply guy” and also a “good replyable guy”\n    ↓\n    1349740138713264128 [2021-01-14] @m_ashcroft 💜 3\n    @tnorthcutt @visakanv I guess it would be an opening that can be interpreted playfully and invites playful responses.\n    \n    Also I guess you can optimise for the kinds of replies you want. Like naval posting will get people replying with similar platitudes maybe.\n    ↓\n    1349745998248120320 [2021-01-14] @tnorthcutt 💜 1\n    @m_ashcroft @visakanv Yeah for sure. Also do you mean navel or Naval? Maybe that sentence works either way 😬\n    ↓\n    1349746171535740929 [2021-01-14] @tnorthcutt 💜 1\n    @m_ashcroft @visakanv Ravikant that is https://t.co/FMdXfWHRa3\n      [Quoting Tweet 1349671297651859456 (missing)]\n    ↓\n    1349747002050039809 [2021-01-14] @m_ashcroft \n    @tnorthcutt @visakanv I meant Naval yes\n    ↓\n    1349747176444817410 [2021-01-14] @tnorthcutt \n    @m_ashcroft @visakanv 👍\n\n===\n\n1360734697710489600 [2021-02-13] @visakanv 💜 88\nI use follower count milestones as reminders to periodically reintroduce myself, particularly to new friends, and also to old ones. just hit 28k, which does feel oddly like a 28th birthday: not particularly significant. but howdy everyone! \n\nask me anything you like\n↓\n1360736760590864386 [2021-02-13] @visakanv 💜 25\nlately I can't stop thinking about how \"spiky\" human progress is. so much happens in such short bursts of time, with such few people. the gupta golden age gave us the number 0. baghdad house of wisdom gave us algebra. can we reverse-engineer these scenes?\n\nhttps://t.co/XmHcSuLN08\n  [Quoting Tweet 1360735885386543105 (missing)]\n↓\n1360737120793464835 [2021-02-13] @visakanv 💜 14\nI kind of optimized my entire life for this\n\nwhen I discovered libraries as a child I knew I wanted to spend my life in them\n\nwhen I discovered the internet afterwards, it was that again but more intense\n\ntwitter is just the current point of focus\n\nhttps://t.co/rtQjjHfa6p\n  [Quoting Tweet 1360736230175105030 (missing)]\n↓\n1360737427539718144 [2021-02-13] @visakanv 💜 14\nwhich is to say, I'm not here as a distraction from anything else – this *is* my life's work\n\nI painstakingly cultivated the audience I needed to support me through this, so now I can make via patrons and selling ebooks and occasionally doing consulting. Twitter helps all of this\n↓\n1360737946916192257 [2021-02-13] @visakanv 💜 13\nI'm 30yo &amp; I spent pretty much my entire 20s living \"ramen-profitable-ish\". wife and I spent like a couple of hundred bucks on our wedding. we never went out much (regretting this now bc pandemic). I don't spend money on anything other than takeout. my life is optimized for this\n↓\n1360738340580904965 [2021-02-13] @visakanv 💜 12 🔁 1\nha, 8 months too late for that, but I suppose never say never\n\ntbh I had most of my existential meltdown at 17, and then the adult salaryman version at 25. getting married young + being saddled with a mortgage probably accelerated that\n https://t.co/1EPsGailOE\n  [Quoting Tweet 1360736409624190976 (missing)]\n↓\n1360738599222665216 [2021-02-13] @visakanv 💜 11\npatreon\nselling ebooks\nii salons\noccasional consulting\n\nI generally keep my expenses as low as I can\n\nhttps://t.co/bTa5gqDGBn\n  [Quoting Tweet 1360737811222196225 (missing)]\n↓\n1360739327748177922 [2021-02-13] @visakanv 💜 10\nah this is a matter of like, knowing what your priorities are\n\nage is also a factor here, I think the older I've gotten, the less comfortable I feel sort of just whiling away mindlessly\n\nI spent many years doing that, feel like I got my fill of it\n\nhttps://t.co/Gg6kz1vlro\n  [Quoting Tweet 1360738025932812292 (missing)]\n↓\n1360739913625337859 [2021-02-13] @visakanv 💜 15\ntwitter does not do a sufficiently good job of helping people build relationships \n\nnavigating one's follower list should be less of a tedious slog\n\nand when you click on someone's profile, you should be able to see who they follow, who's following you\n\nhttps://t.co/Xe2Ne3GLMe\n  [Quoting Tweet 1360739369795997700 (missing)]\n↓\n1360740118298906625 [2021-02-13] @visakanv 💜 17\nbeing a reply guy is great, I consider myself a reply guy. the thing is to get *good* at replies. see thread in next tweet\n\nhttps://t.co/Pd9leFN6ZP\n  [Quoting Tweet 1360739843932831748 (missing)]\n↓\n1360740191955156992 [2021-02-13] @visakanv 💜 8 [(SEED) type=quote_of_root]\n👇🏾 https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1360741279093547009 [2021-02-14] @visakanv 💜 11 🔁 1\nyea the main thing is to have an accessible body of work, and then to find and join existing conversations about that subject matter. you can do this entirely on twitter. clearly articulate what your interests are.\n\nmore: https://t.co/McTp0e7zB9\n\nhttps://t.co/TUxIBCPqgT\n  [Quoting Tweet 1360738212159840258 (missing)]\n↓\n1360742133905285120 [2021-02-14] @visakanv 💜 8\nI don't think it's necessary to use your real name. I have at least one lively alt that nobody here knows about, which is fun. I personally defaulted to realname to begin with from the very start bc that's how I wanted to live my life, but I understand/respect why ppl use alts\n↓\n1360742727382523904 [2021-02-14] @visakanv 💜 9\nlol! uh, classic breakdown of meaning, sense of powerlessness and futility, felt like school was a prison, society is full of lies, bullshit and coercion, am I condemned to live a lie myself, what if I never experience love or kinship, all that fun stuff\n\nhttps://t.co/lRM4gOlUmT\n  [Quoting Tweet 1360741715372617728 (missing)]\n↓\n1360743123891019776 [2021-02-14] @visakanv 💜 8\nhaven't yet seen enough interesting replies from you to recognize you https://t.co/gyogO3cpk1\n  [Quoting Tweet 1360742554749308937 (missing)]\n↓\n1360743404125048838 [2021-02-14] @visakanv 💜 8\n^ this applies to everyone who asks that question, and it's also how I have become friends with people far busier, more important and more famous than me. you just need to be consistently interesting in their replies\n↓\n1360743965792694273 [2021-02-14] @visakanv 💜 7\nhmmm! I think... it's not obvious to people how *deliberate* I am about the path that I am on. There's a lot of stuff that I know about How To Internet Good, but I generally don't wanna be preachy so I don't tweet about it much unless people ask \n https://t.co/ykiWHOrgKJ\n  [Quoting Tweet 1360736196264161283 (missing)]\n↓\n1360745442259075075 [2021-02-14] @visakanv 💜 13\nI like to think of confidence as something that arises naturally from knowing your stuff\n\nyou do the work over and over again until you attain a natural, sleepy ease\n\nrepeatedly seek out what you're most uncertain and unsure about and you articulate that\n\nhttps://t.co/yCPwifKOis\n  [Quoting Tweet 1360743550665678853 (missing)]\n↓\n1360745706894495747 [2021-02-14] @visakanv 💜 17 🔁 1\nfalse confidence is when you pretend that nothing will go wrong\n\nreal confidence is when you have an intimate understanding of all the ways things can go wrong\n↓\n1360747139941294080 [2021-02-14] @visakanv 💜 6\nthere's a singaporean kopi flavored pocky that I quite enjoy\n\nhttps://t.co/CfPAW2bXuJ https://t.co/hApF77Tt6t\n  [Quoting Tweet 1360746771031461888 (missing)]\n↓\n1360754584021467141 [2021-02-14] @visakanv 💜 5\nat first it was like the 200 or so people I knew IRL\n\nthen from then on it was mostly just replying to whatever interesting stuff popped up on my timeline, replying to replies, and so on\n\nthere have been a few phases over the years...\n\nhttps://t.co/EE5Cchlu6a\n  [Quoting Tweet 1360749057652629507 (missing)]\n\n===\n\n1381528973432131584 [2021-04-12] @visakanv  [(SEED) type=quote_of_root]\nRT @ChanaMessinger: @DistractedAnna I've been thinking about linking to this\n\nhttps://t.co/rmDEujGs91\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1382142581786615809 [2021-04-14] @visakanv 💜 32 🔁 1\nduck it I’ll make a list after I shower https://t.co/SZzKwHGTK2\n  [Quoting @visakanv: Probably like 10 of my tweets out of 151,000 are responsible for 60% of the value of the @visakanv account. I can’t actually point you to them with confidence because the truth of it makes me uncomfortable. The truth is always uncomfortable]\n↓\n1382143664491663364 [2021-04-14] @visakanv 💜 4 [(SEED) type=quote_of_root]\n1. https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1382143748692320256 [2021-04-14] @visakanv 💜 3\n2. https://t.co/OSWsjogBqt\n  [Quoting @visakanv: Wife and I were laughing about this last night: the thing nobody quite tells you about marriage is: you’re choosing the person in life who’s going to upset, disappoint annoy and frustrate you more than anybody else]\n↓\n1382144020701335553 [2021-04-14] @visakanv 💜 6\n3. https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1382145605514842116 [2021-04-14] @visakanv 💜 3\n4. \n\nthe “assemble the mindcity” thread within this thread might be a candidate for another top 10 but ima consider both of these to be part of the same thread https://t.co/gCwM7GN3h6\n  [Quoting @visakanv: Interesting conversation with a writer friend earlier about the fragmentation of information. We both agreed that fragmentation isn't actually a bad thing - what's missing &amp; needed is better threading. Twitter threads are a specific instantiation of a solution to bigger problem]\n↓\n1382146071602765824 [2021-04-14] @visakanv 💜 1\n5. https://t.co/pcjkX4zPHS\n  [Quoting @visakanv: hypothesis: if you do barely anything with your life but take little notes every day, journal, diary, whatever – snapshots of your opinions, impressions, perspectives, predictions – and then you thread these notes over time, say, 10 years...]\n↓\n1382146968349073409 [2021-04-14] @visakanv 💜 1\n6. https://t.co/BsuW2Fgi9A\n  [Quoting @visakanv: Stage 1: Do unpaid work for yourself   Stage 2: Use that as leverage to negotiate a position where you get paid to do work for others   Stage 3: Save up enough so you can be free  to do more, higher-quality unpaid work for yourself &lt;--- I am currently here  Stage 4: We’ll see]\n↓\n1382148023149424646 [2021-04-14] @visakanv 💜 2\n7. https://t.co/cFUlpmYZYZ\n  [Quoting @visakanv: Hardcore social game: (even I don’t really do this 100% because I’m lazy)  1. Take the 100 or so people you know, identify the 5-10 people you aren’t talking to who you respect+admire  2. Talk to them, earn *their* respect, then ask for introductions  3. Repeat 2 indefinitely https://t.co/U0vt5MVcRd]\n↓\n1382149208065540096 [2021-04-14] @visakanv 💜 2 🔁 1\n8. https://t.co/Pa8j89OXbl\n  [Quoting @visakanv: I saw someone tweet “I wish smart writing came to me as easily as dumb tweeting” and I am here to share with you my strategy for using the latter to precipitate the former]\n↓\n1382151126041071624 [2021-04-14] @visakanv 💜 2\n9. https://t.co/qaxqQiAnZn\n  [Quoting @visakanv: I’ve talked to hundreds of people about “do 100 thing” - some people get it right away, lots of people warm up to it in time, but most interestingly I’ve started to notice a common feature among those who “don’t get it”, and it is that they have Expectations]\n↓\n1382152017318088706 [2021-04-14] @visakanv 💜 1\n10. https://t.co/ijT9u5iPQr\n  [Quoting @visakanv: There’s a recurring moment in multiple conversations I have had with childhood friends (90s kids) that’s quite bleak. They’re 29-30 and realising they’ve been holding on to vague scripts. not done much self-authorship. These are smart people who feel trapped but avoid facing it]\n↓\n1382152323598716930 [2021-04-14] @visakanv 💜 3\nI’m probably missing a couple here and there but otherwise this is broadly an accurate list of my top 10 best threads in my own assessment\n\n===\n\n1389186670000545807 [2021-05-03] @tasshinfogleman 💜 35 🔁 5\nthis is a @Knipps appreciation thread: sharing what I’ve learned from him about the Art of the Reply. In case you didn’t know, Knipps is the BEST REPLY GUY: \nhttps://t.co/1yd8Tpdegd\n  [Quoting @tasshinfogleman: @Knipps your brand is BEST REPLY GUY]\n↓\n1389186670994640897 [2021-05-03] @tasshinfogleman 💜 15 [(SEED) type=quote_of_root]\n@visakanv talks a lot about the Art of the Reply, e.g. here: https://t.co/TJlOYm7YcC\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1389186672038920194 [2021-05-03] @tasshinfogleman 💜 12\nand here: https://t.co/1AkVlNa1xF\n  [Quoting @visakanv: this has been so effective for me it feels like I'm cheating https://t.co/9ElCmKsf6T]\n↓\n1389186791454949380 [2021-05-03] @tasshinfogleman 💜 16\n... but I felt that it hadn't really clicked for me yet and that I had a lot of room to grow here. i told @Knipps by DM that i would love to learn the art of the reply from him. here’s what I've learned from him so far through our conversations:\n↓\n1389186792595800065 [2021-05-03] @tasshinfogleman 💜 20\nhe shared a little bit about his origin story: \"I grew up around kids much older than i so it made me tough. It was always easy for me to be snarky and mean, I decided to accept the challenge and use it for good because it doesn’t cost anything to encourage folks\"\n↓\n1389187343463198726 [2021-05-03] @tasshinfogleman 💜 18\nif you hang around Knipps for any length of time it's obvious the effort, care, and dedication he's put into becoming an excellent conversationalist. reply game is about being a better friend\n↓\n1389187344293670915 [2021-05-03] @tasshinfogleman 💜 12\nhere are some of the inspirations he shared:Jeff Bezos: \"It’s harder to be kind than clever\"\n↓\n1389187345044361221 [2021-05-03] @tasshinfogleman 💜 10\nhttps://t.co/ba2FvuaoB3\n  [Quoting Tweet 551130145340153856 (missing)]\n↓\n1389187347263201280 [2021-05-03] @tasshinfogleman 💜 27\nthis quote from Tyler Cowen on the Tim Ferriss show (#413, 1:19:22):https://t.co/5oyZum4Stw https://t.co/tiaS7Eyfyr\n↓\n1389187348420829186 [2021-05-03] @tasshinfogleman 💜 12\n(Tyler goes on to explain in that episode that that's why he does his EV grants... the money is symbolic, a way to encourage people and make it real for them that he believes in them)\n↓\n1389187349305860096 [2021-05-03] @tasshinfogleman 💜 12\n\"People share things that make them look 💯\"https://t.co/qUUyJa4K3Q\n  [Quoting Tweet 1387463948312719370 (missing)]\n↓\n1389188149016936452 [2021-05-03] @tasshinfogleman 💜 10\nhere's some of the wisdom he shared with me about excellent reply game:\n\n===\n\n1393121066185285633 [2021-05-14] @blisstweeting 💜 2\nCompiled a brief summary of what @rhymeswithvocal suggested me to read on how to play good reply game and not to be creepy. Here, \"this article\" and \"this thread\" refer respectively to... https://t.co/ozPDSPzO4r\n↓\n1393121068450254852 [2021-05-14] @blisstweeting \n...this article and... https://t.co/0fKSiPAACX\n↓\n1393121070371295232 [2021-05-14] @blisstweeting 💜 1 [(SEED) type=quote_of_root]\n...this thread. https://t.co/yeu9CdW6Yb\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1393144193229406209 [2021-05-14] @blisstweeting 💜 2\nAlso, here's the source tweet for JJ's razor. https://t.co/QLxy2yC2py\n  [Quoting Tweet 739895135870148608 (missing)]\n\n===\n\n1402844134893752320 [2021-06-10] @visakanv  [(SEED) type=quote_of_root]\nRT @sadalsvvd: absolutely essential reading if you consider yourself a \"reply guy\"\nhttps://t.co/gOlMBuktGo\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1402874736460316672 [2021-06-10] @goblinodds 💜 102\nhmm i'm wary of high-status new people entering my social circles-- some vestigial sense that i'm only tolerated bc i fill a niche and can be replaced at any time\n\nrude, brain\n↓\n1402875027196833796 [2021-06-10] @nobu_hibiki 💜 9\n@goblinodds :(\n\ni understand the feeling :(\n↓\n1402875447122169859 [2021-06-10] @goblinodds 💜 8\n@nobu_hibiki good to notice it, at least--i'm sure it's outlived its usefulness for you too!\n↓\n1402876468657487874 [2021-06-10] @nobu_hibiki 💜 9\n@goblinodds these days its less someone entering my circle and more me entering one, a part of me still thinking that the only reason im there is because a niche that can easily be replaced with other people\n↓\n1402876964273225729 [2021-06-10] @visakanv 💜 14\n@nobu_hibiki @goblinodds how I think abt this:\n\ngroups have their own logic almost independent of individuals\n\nwe can never earn the true loyalty of a group (obvious if you substitute in corporations)\n\nbut we can earn the loyalty of individuals\n\nevery group is \"merely\" an opportunity to love individuals\n↓\n1402877257765441536 [2021-06-10] @visakanv 💜 13\n@nobu_hibiki @goblinodds work eg: you can earn the personal loyalty of individual colleagues even if the team/company/etc thinks of you as expendable, this outlasts any group dynamic, even years after the company goes under or w/e\n↓\n1402877655733522438 [2021-06-10] @goblinodds 💜 9\n@visakanv @nobu_hibiki yep yep this makes sense!!\n\ni think the prospect is still scary bc i have a lot of stress around keeping up with individuals, groups are the thing i've always wanted\n↓\n1402878136044331011 [2021-06-10] @visakanv 💜 11\n@goblinodds @nobu_hibiki there are \"solutions\" for groups too but it's more complex bc it depends on your individual personality &amp; dynamic and idk how deep you wanna get into it\n\nthe short riff is \"you belong in any group you add value to\", but you wanna be careful to do this in a way that's true to you\n↓\n1402878883901280257 [2021-06-10] @visakanv 💜 5 🔁 1 [(SEED) type=quote_of_root]\n@goblinodds @nobu_hibiki this applies for groups too – every group has some implicit proposal. (there may be an explicit one too.) \"people like us gather here to do things like this\". once you read the implicit proposal correctly and add to it, you basically belong in the group\n\nhttps://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1441674463074947072 [2021-09-25] @visakanv 💜 23 🔁 1\nbtw this is true inside one's own mind and body too, and that's where it's most consequential https://t.co/y948jIu94p\n  [Quoting @visakanv: people really just say shit at other people without taking the time to process what the other person is trying to say, without trying to find common ground, points of agreement  and then these same people often wonder why the world seems like such a hostile and unfriendly place]\n↓\n1441674671519244291 [2021-09-25] @visakanv 💜 13\nthe binary dichotomy between \"agreeable\" and \"disagreeable\" is so simplistic, boring, ineffective https://t.co/mw8rx4GUjq\n  [Quoting @visakanv: being EITHER agreeable OR disagreeable limits your development, limits what you can learn, what you can know, what you can do  all the magic happens in the yin/yang collision of the two. productive, prolific, honest disagreements conducted fairly and sustainably…ish https://t.co/Bym36sOY0O]\n↓\n1441681893225758727 [2021-09-25] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\n@visakanv https://t.co/V5fzSqEk6L\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1461509207593680900 [2021-11-19] @Malcolm_Ocean 💜 2\nyeah these spaces are hugely underrated\neven informally\n\n…let people hear experts jam! https://t.co/Tg1xc8iUjz\n  [Quoting Tweet 1461437773651525632 (missing)]\n↓\n1461509209111949318 [2021-11-19] @Malcolm_Ocean 💜 5\nat a lunch table at a CFAR reunion, honing in with @slatestarcodex on implications of PCT &amp; got interrupted by staff worried about people feeling excluded 😒\n\nthen convo fell apart, turned meh\n\n(not to say we're PCT experts, but we were *relative* experts, having read the books)\n↓\n1461509210605174790 [2021-11-19] @Malcolm_Ocean 💜 3\n@Meaningness's \"Upgrade your cargo cult for the win\" is very relevant here.\n\nPeople learn by watching &amp; doing, and by participating situatedly: apprenticeship.\n\nhttps://t.co/viwFkUMmAc\n↓\n1461509212433883138 [2021-11-19] @Malcolm_Ocean 💜 2\nWe're gonna see a lot more ability to do this in cultures shifting out of spiral-dynamics-green 🟢 into spiral-dynamics-yellow 🟡\n\n...where\n • equal dignity &amp; welcomeness\n&amp;\n • equal expertise &amp; attention\naren't even remotely confusable for each other.\n\n(+ expertise contextual)\n↓\n1461509214136782849 [2021-11-19] @Malcolm_Ocean 💜 2\nHere's @ricvolpe speaking to appetite to hang out and watch me do what I do and take notes:\n\n(I'm not an expert relative to him in all dimensions, but I am on some.)\nhttps://t.co/G6lVx7dxUr\n  [Quoting Tweet 1461068076380827652 (missing)]\n↓\n1461509215852249089 [2021-11-19] @Malcolm_Ocean 💜 6 [(SEED) type=quote_of_root]\nThis is, btw, part of what's cool re Twitter—anyone can talk to anyone (all are welcome) but also, if you chime in with something useless on a given topic, you can be ignored easier than in person.\n\nhttps://t.co/V5fzSqEk6L\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1461509217441906689 [2021-11-19] @Malcolm_Ocean 💜 3\nThis doesn't even require being an expert or having any particular status—you just need to be able to ask good questions, or otherwise help draw out people's thinking.\n\nhttps://t.co/lYFjEKcpwO\n  [Quoting @Malcolm_Ocean: @replyallguy @gptbrooke do you feel drawn towards uplevelling your reply game?  conversation, *especially* on twitter, isn't per se about \"who\" people want to talk to, but what sorts of conversations they want to have, and whether you know how to read &amp; create invitations https://t.co/UihHX6SSQy]\n\n===\n\n1467090668874964992 [2021-12-04] @visakanv 💜 138 🔁 5 💬 2\nslowly increasing the # of tweets I have literally hotkeyed https://t.co/l9T9Hu2Q5O\n↓\n1467091226662821888 [2021-12-04] @visakanv 💜 8\nvvfaqs https://t.co/9oY3HEZbhG\n  [Quoting @visakanv: Questions I Keep Getting About My Threads, The Thread https://t.co/R35zlQme2Q]\n↓\n1467091249706373123 [2021-12-04] @visakanv 💜 13\nvvmemex https://t.co/wxOAVmtvgG\n  [Quoting @visakanv: latest version  some people have asked for a PDF (idk why, but ok) you can have that one here: https://t.co/SY3Oi82hF5 https://t.co/fKBnf7btzs]\n↓\n1467091292203061252 [2021-12-04] @visakanv 💜 12\ncardsright https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1467091320816619523 [2021-12-04] @visakanv 💜 18\nayylmao https://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1467091496981598209 [2021-12-04] @visakanv 💜 8\ntxtrpg https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1467092358940348417 [2021-12-04] @visakanv 💜 10\nwifemanaged https://t.co/GlLF8aRusy\n  [Quoting @visakanv: me: I love you  wife: how much  me: why this obsession with quantification   wife: what gets measured gets managed]\n↓\n1467092944049954816 [2021-12-04] @visakanv 💜 8\nmvpmodel https://t.co/PGGQhIksya\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1467093228818034689 [2021-12-04] @visakanv 💜 10\nkneelbeforezod https://t.co/ZQ7JbXSJVD\n  [Quoting @visakanv: https://t.co/EzaHMVnlUT]\n↓\n1467093758621609993 [2021-12-04] @visakanv 💜 4\nfriendsbook https://t.co/EEnPgdIJLB\n  [Quoting @visakanv: This is a huge part of the premise of my book... man I could probably write my book entirely out of my friends’ tweets https://t.co/7oIPeY7tVL]\n↓\n1467094065199992832 [2021-12-04] @visakanv 💜 3 [(SEED) type=quote_of_root]\ngoodreplygame https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1467094271492644864 [2021-12-04] @visakanv 💜 6\nsurvivorbias https://t.co/tnB88b86kC\n  [Quoting @visakanv: the big lesson of survivor bias is that you should optimize for being a survivor]\n↓\n1467094883483541507 [2021-12-04] @visakanv 💜 8\nfocusmoreof https://t.co/tFaWtEZM1p\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n├── 1467095246471196674 [2021-12-04] @visakanv 💜 8\n│   uxdegraded https://t.co/r7X1AFoy6F\n│     [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n│   ↓\n│   1467095369074962434 [2021-12-04] @visakanv 💜 8\n│   shittychoices https://t.co/LqS4F1JWlb\n│     [Quoting @visakanv: @MsHortonTweets people don't wanna make better choices, they wanna make shitty choices and then complain about the shitty outcomes]\n│   ↓\n│   1467095610218082304 [2021-12-04] @visakanv 💜 4\n│   fidgetyboi https://t.co/hX0Jcpet5m\n│     [Quoting @visakanv: are you also a fidgety boi? you may be interested in my draft notes for Constructive ADHD:  https://t.co/e0Q0Z661CJ]\n│   ↓\n│   1467096593597808641 [2021-12-04] @visakanv 💜 6\n│   lowresmodels https://t.co/19zdOv4ZUs\n│     [Quoting @visakanv: People typically have high-res models of their own lives and lower-res models of other people’s. We are all born clueless with incredibly low-res models of the world - then we tweak and upgrade our models. Different people do this to different degrees depending on many variables]\n│   ↓\n│   1468308980325752834 [2021-12-07] @visakanv 💜 3\n│   plansdisregard\n│   \n│   https://t.co/svGsmVhzzq\n│     [Quoting @visakanv: @michaelcurzi Plans are worthless, planning is priceless. Spend a day making elaborate plans and then disregard them completely to make whatever you think is most compelling. Repeat monthly or quarterly]\n│   ↓\n│   1468309377547333633 [2021-12-07] @visakanv 💜 1\n│   storysuck https://t.co/3lLFJWHeom\n│     [Quoting @visakanv: Story:  You suck at something  It bothers you, so you work hard at it &amp; many years, through lots of pain and failure  You are now good at the thing &amp; it comes easy to you   You look around and you see that most people suck at this  Why don’t they just get good?? Being good rules!]\n│   ↓\n│   1468309475916279808 [2021-12-07] @visakanv 💜 3\n│   weirdohuh https://t.co/PEQnmKDv1b\n│     [Quoting @visakanv: so you're a weirdo, huh https://t.co/XExDMfrydc]\n│   ↓\n│   1468528071330304002 [2021-12-08] @visakanv 💜 9\n│   20. wordartist https://t.co/hbbXXkBK7p\n│     [Quoting @visakanv: My goal in life is to be a word artist-magician. Words are proxies for thoughts, and a master manipulator of words is a skilled navigator in the tumultuous ocean of meaning. Moana, but the ocean is the mind of humanity https://t.co/KY27aZUguA]\n└── 1467096181889142784 [2021-12-04] @sharanvkaur 💜 15\n    @visakanv have u tried ‘shipbook’|———————————————||    INTROSPECT out next week!     ||———————————————|\n    ↓\n    1467097050827595780 [2021-12-04] @visakanv 💜 9\n    @sharanvkaur wifeass https://t.co/GLE0e3mwLM\n      [Quoting @visakanv: no hater or critic has ever kicked my ass harder than my wife does while she quietly giggles to herself https://t.co/osNmv8VPg4]\n\n===\n\n1475548462930284545 [2021-12-27] @QiaochuYuan 💜 90 🔁 2\nsome anons / lurkers with almost no tweets and almost no followers send me really heartfelt and well-articulated DMs, y’all can write like that a little more publicly too! hang out in the replies of your favorite followers! twitter gives you what you give it https://t.co/62WU40eWi1\n  [Quoting Tweet 1475420360921149440 (missing)]\n↓\n1475549264608563204 [2021-12-27] @QiaochuYuan 💜 11\n*favorite follows gdi\n↓\n1475554864516136963 [2021-12-27] @QiaochuYuan 💜 34 🔁 1\ni have an old one-tweet guide to twitter which i still like but i am tempted to condense the “pith instructions” even more. here’s what you do to have a good time on twitter, in five words:\n\n🔸tell the truth\n🔸have fun https://t.co/rWQdmjvD8o\n  [Quoting @QiaochuYuan: tiny twitter strategy guide  🔸follow ppl whose tweets u want inside u 🔸custom search engine for own tweets + fav others 🔸screenshot highlights from links (cmd-shift-4 on mac) 🔸thread threads 🔸humor (memes, shitposts) 🔸vulnerability 🔸improv, not debate 🔸goddamnit, be kind]\n↓\n1475556196006318082 [2021-12-27] @QiaochuYuan 💜 3 [(SEED) type=quote_of_root]\ni would also be remiss if i did not link to @visakanv’s reply game stuff https://t.co/O001oLNc1V\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1481147261325574145 [2022-01-12] @visakanv 💜 20\nha this is a great way to get a feel for the OODA loop concept (assuming you’re already partially familiar) https://t.co/b6ZMybbQAp\n  [Quoting Tweet 1246210117378293762 (missing)]\n↓\n1481148970223411200 [2022-01-12] @visakanv 💜 10\npart of why i have the audience I do (without external boost) is that my tweets/writing get inside the OODA loop of any discourse I participate in. \n\nIe, my riffs and taking points are the covid of my community, lol. I’ll get to everyone eventually\n↓\n1481149112485806081 [2022-01-12] @visakanv 💜 15\nwell I’m like a good guy covid, or try to be. Imagine a virus that goes around making everyone feel healthier\n↓\n1481149323350265859 [2022-01-12] @visakanv 💜 7 [(SEED) type=quote_of_root]\ngood reply game is intrinsically boydian https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1502384590635167744 [2022-03-11] @visakanv 💜 4\ncivilization as personal OODA disruptor https://t.co/8B6J2y8pms\n  [Quoting @visakanv: @nvpkp and dig a little deeper, often it’s the voices of caregivers/parents, family, peers, community, society, culture interrupting us. in a way you could even argue that almost all of human civilization is designed to interrupt the OODA loop of us fulfilling our own deepest desires]\n↓\n1502385527999262720 [2022-03-11] @visakanv 💜 8\nquietly revolutionary to just have your own OODA loop going on https://t.co/TqC2sSCrbM\n  [Quoting Tweet 1502374177549991938 (missing)]\n\n===\n\n1508969106736828418 [2022-03-30] @nosilverv 💜 105 🔁 14 💬 1\nWatching Murder Mystery and it hit me like a ton of bricks: I've been perpetually confused about interactions, they're not about exchanging information, they're about creating a scene. Everything is improv theatre, Keith Johnstone's Impro is not about improv, it's about life. https://t.co/bZ65a3exZe\n↓\n1508969109937082386 [2022-03-30] @nosilverv 💜 48 💬 1\nEvery interaction, every move, it's all a bid, it's all a suggestion, it's all a proposal: \"Shall we dance this way?\". Trying to make it about information is a type error, it doesn't parse, it reads as a counter-proposal, as a lack of an ability to yes-and.\n↓\n1508969112013258756 [2022-03-30] @nosilverv 💜 27 🔁 1 [(SEED) type=quote_of_root]\nVisa talks about this here and I realise now I was an idiot for - like thinking Impro was about theatre - thinking this was about Twitter: this is about life.\n\nhttps://t.co/BxxsMaop0R\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1508969113984634880 [2022-03-30] @nosilverv 💜 22\nNow, for the pedants in you - and gosh I know you're there - yes, it sorta *is* about exchanging information, or rather, meta-information, information about the kind of person you are, that you can cooperate, that you can co-create scenes, what type of life-drama you're in, ...\n↓\n1508969115859529730 [2022-03-30] @nosilverv 💜 31\nBut, again, I really wanna drive this home - *every utterance* is an invitation, a proposal, a 'shall we play this game?' and that's how to best interpret it. It's an invitation to cooperate in a game. Players who know how to play end up playing fun games. Maybe you've seen it.\n↓\n1508969117566517250 [2022-03-30] @nosilverv 💜 20\nI saw it once with @TylerAlterman: within a few minutes of meeting someone he was playing - literally playing - some physical game with them, not many words were exchanged but so much info is. They both had the skill so they could communicate *at that level*.\n↓\n1508969121312030723 [2022-03-30] @nosilverv 💜 18\nIt also makes sense of PUA literature. PUA literature is just a really overwrought explanation of this point: people want to play games. Here are some games you can play. They even give you \"routines\"! (Explicitly explained games!) https://t.co/zmexabwqWJ\n↓\n1508969123690258434 [2022-03-30] @nosilverv 💜 16\nNow you, a successful PUA, are going back trough your whole life history, reinterpreting everything, realising that 'night-time' or 'clubs' or 'bars' arent a special magical moment - although ofc they are - but that that type of interaction is just what people want *all the time*\n↓\n1508969125737078787 [2022-03-30] @nosilverv 💜 16\nThe reason interaction was flowing there is because you took nothing too seriously, it wasn't about the object-level information, it was about the game (get it?) being played by you two, or three, or four. The game being co-created. The social interaction being co-created.\n↓\n1508969127402217478 [2022-03-30] @nosilverv 💜 15 🔁 1\nP̶l̶a̶y̶e̶r̶ ̶o̶f̶ ̶G̶a̶m̶e̶s̶\n\nCo-creator of Games\n↓\n1508969129012772864 [2022-03-30] @nosilverv 💜 9\nSocial Games\n↓\n1508969130598223873 [2022-03-30] @nosilverv 💜 12\nGames people play\n↓\n1508969132213121029 [2022-03-30] @nosilverv 💜 22 🔁 1\nG̶i̶r̶l̶s̶ ̶j̶u̶s̶t̶ ̶w̶a̶n̶n̶a̶ ̶h̶a̶v̶e̶ ̶f̶u̶n̶\n\nPeople just wanna play games\n\n===\n\n1521381979857453056 [2022-05-03] @visakanv 💜 211 🔁 13\nthis is true for everything for most people, I believe. I grew up non-musical, “tone deaf”, couldn’t clap in time, and now I can sing in harmony. people who start doing yoga etc say things like “I’m conscious of my pelvis now”. we underestimate what we are capable of https://t.co/hT2m9WnA3i\n  [Quoting Tweet 1521235091145379840 (missing)]\n↓\n1521383526108598279 [2022-05-03] @visakanv 💜 56 🔁 6\nwhat a lot of people really need is a supportive learning environment. (School is largely not a supportive learning environment) https://t.co/034lp8Skq0\n  [Quoting @visakanv: I watched this video over a decade ago and still think about it all the time: Bobby McFerrin teaches the audience to be his backing track and performs a song with them in real time https://t.co/vWjO0Dm5nQ]\n↓\n1521384005924388865 [2022-05-03] @visakanv 💜 42\nsome parts of twitter are supportive learning environments, some parts of twitter are the opposite\n↓\n1521384470980423680 [2022-05-03] @visakanv 💜 20\nyou can make your inner world a supportive learning environment: @introspectvv\n↓\n1521384975781666816 [2022-05-03] @visakanv 💜 19 🔁 1 [(SEED) type=quote_of_root]\ngood reply game creates a supportive learning environment between peers https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1528410609112346624 [2022-05-22] @visakanv 💜 179 🔁 5 💬 1\nthought i'd make a visakanv bingo card \n\nanything missing? https://t.co/R3QoRlmcuu\n↓\n1540603482918776833 [2022-06-25] @visakanv 💜 10\nthought I'd just link the relevant threads too\n\na1. dominos meme https://t.co/QCM7vr3rzW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1540603525235113985 [2022-06-25] @visakanv 💜 5 [(SEED) type=quote_of_root]\na2. good reply game https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1540603670982983680 [2022-06-25] @visakanv \na3. embrace mistakes https://t.co/wMMDvyxD2G\n  [Quoting @visakanv: Reminder to tomorrow-Visa to make a thread about how this video changed my life (approach to mistakes and failure, and the expectations and feelings around them) https://t.co/yHoNg9I3K2]\n↓\n1540603755733078016 [2022-06-25] @visakanv 💜 1\na4. 👑 https://t.co/O4NFz9C9Ff\n  [Quoting @visakanv: Everyday is a new opportunity to assign value to things, to decide what is important, what is beautiful, what is good, what is deserving. In this regard you are truly the Monarch of your life, first of your name, bla bla https://t.co/YGXHATd5Ke]\n↓\n1540606630924288000 [2022-06-25] @visakanv 💜 1\na5. https://t.co/kMKjTDCZC6\n  [Quoting @visakanv: ASK QUESTIONS  thread of threads with examples of questions, asking good questions, notes on curiosity and so on]\n↓\n1540606688772132864 [2022-06-25] @visakanv 💜 1\nb1. well-prepared https://t.co/tvh6a0ZjHN\n  [Quoting @visakanv: people are really not used to dealing with someone who's well-prepared]\n↓\n1540607002107596800 [2022-06-25] @visakanv 💜 6\nb2. https://t.co/i5cjayL5L9\n  [Quoting @visakanv: periodic reminder to do whatever makes your heart sing https://t.co/HCbYbJLVu4]\n↓\n1540607074081865730 [2022-06-25] @visakanv 💜 3\nb3. https://t.co/tFaWtEIIZp\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1540607864792055813 [2022-06-25] @visakanv 💜 5\nb4. do 100 thing https://t.co/RmlrNRltwu\n  [Quoting @visakanv: guy: how do I make great art   picasso: make 50,000 pieces  guy: ur kidding  picasso: im not]\n↓\n1540608053774790656 [2022-06-25] @visakanv 💜 2\nb5. talk to your friends https://t.co/t7UQYzzEvE\n  [Quoting @visakanv: here's a really simple and powerful thing that few people do  1. make a list of all the times you've had a conversation with someone that left you feeling energized, excited, empowered, encouraged  2. be deliberate about talking to those people again  that's it]\n↓\n1540608116316078080 [2022-06-25] @visakanv 💜 2\nc1. https://t.co/tnB88aR3iC\n  [Quoting @visakanv: the big lesson of survivor bias is that you should optimize for being a survivor]\n↓\n1540608551206686720 [2022-06-25] @visakanv 💜 4\nc2. baby steps https://t.co/FR3Gj9cHP0\n  [Quoting @visakanv: I thought I understood baby steps but even I continue to underestimate them  It’s worth doing even 1 single pushup and celebrate that]\n\n===\n\n1536780318350667776 [2022-06-14] @visakanv 💜 29 🔁 1\nlet it be known that the guy who constantly prattles and preaches about good reply game, at the very least, continues to do good replies 😅🤓🙏🏾 https://t.co/gBtnogsgQq\n  [Quoting Tweet 1536773353377243136 (missing)]\n↓\n1536782175718494208 [2022-06-14] @visakanv 💜 9 [(SEED) type=quote_of_root]\nit works, it's learnable, i taught myself how to do it, it's a source of a lot of what is good about my life, i should really write it into a more readable essay... but here's the OG thread in the meantime https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n├── 1536782685322227713 [2022-06-14] @visakanv 💜 12 🔁 1\n│   though if you wanna get technical about it, getting to \"most useful reply\" takes not just good reply game (friendship skill tree) but also good intel (nerd skill tree) and I will talk more about both in FAN v1.1 https://t.co/NFXPFAjCnr\n│     [Quoting @visakanv: tbc https://t.co/I6hClKBh9T]\n│   ↓\n│   1536783327461769217 [2022-06-14] @visakanv 💜 20\n│   ... i should totally write up literal skill trees, gosh that sounds so fun\n└── 1536783464820768776 [2022-06-14] @__drewface 💜 1\n    @visakanv I'm trying to write short, punchy culturally legible equivalents of \"good reply game\" and other FAN-y ideas into punk songs right now\n    \n    The punk energy is like \"what the fuck are we even doing? We're focusing on the wrong things, obviously. Everyone knows this doesn't feel right\"\n    ├── 1536783572526579712 [2022-06-14] @visakanv 💜 1\n    │   @__drewface hell yea ❤️💪🏾🔥\n    │   ↓\n    │   1536783637840285696 [2022-06-14] @visakanv 💜 1\n    │   @__drewface why \"trying\"? what's the struggle\n    │   ↓\n    │   1536784730519117825 [2022-06-14] @__drewface 💜 2\n    │   @visakanv putting the idea that we should treat each other better into punky terms is caught between feeling hoke-y and campy (the rock) and feeling nihilistic and critical (hard place)\n    │   \n    │   \"trying\" to strike the balance so it feels hopeful and real and transgressive. Need many reps.\n    │   ↓\n    │   1536785693808402432 [2022-06-14] @visakanv 💜 2\n    │   @__drewface mmmm yea i feel you\n    │   \n    │   i guess the thing about making hope anthems that don't feel fluffy is to write the pain into it\n    └── 1536783881080344581 [2022-06-14] @__drewface 💜 1\n        @visakanv If u have fav phrasings that you think are most legible/needed to a more general audience, would love your thoughts\n        ↓\n        1536784249088782336 [2022-06-14] @visakanv 💜 1\n        @__drewface 🤔  \"cruelty leaks\" i think is totally a punk song waiting to happen\n        \n        https://t.co/UVFZq0dHgq\n          [Quoting @visakanv: 58. Cruelty leaks.   When you mock and insult others- even if they seem to deserve it- you become, to yourself, a person who mocks and insults others.   This happens a lot with smart people who shame others for “being dumb”. They then live in chronic fear of being dumb themselves]\n        ↓\n        1536784870583721986 [2022-06-14] @__drewface 💜 1\n        @visakanv Yes this is exactly the sort of thing I mean. Love it, will write this in\n\n===\n\n1548644046700101632 [2022-07-17] @visakanv 💜 125 🔁 3\nthis didn’t quite occur to me but I think it’s true: good reply game, by its very scarcity, elevates the status of the recipient\n↓\n1548645064779304960 [2022-07-17] @visakanv 💜 25 🔁 1 [(SEED) type=quote_of_root]\n(context for newer friends:) https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1550891550657622017 [2022-07-23] @visakanv 💜 23\nok i'm going out to buy some late nite mcdonalds, ask me anon questions https://t.co/PFw3EUwhwq\n↓\n1550892853294821381 [2022-07-23] @visakanv 💜 17\nI don’t like framing things as regrets - also what I’m doing, I’ve always done, lol. But to meet the spirit of the question — I would like to have been more aggressive about meeting new people, and about travelling, and generally just doing more chaotic and random things https://t.co/77SgcSHNvH\n↓\n1550894175205281792 [2022-07-23] @visakanv 💜 15 [(SEED) type=quote_of_root]\nI reply to a lot of tweets! maybe try writing better tweets idk lol https://t.co/9Fzs72xbgl https://t.co/ozPesVVcAq\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1550894479900434432 [2022-07-23] @visakanv 💜 20\nthis is not a practice life\n\nthis is it https://t.co/0Wg25I0xCE\n↓\n1550894750844088321 [2022-07-23] @visakanv 💜 7\nused to be filet o fish, still a classic. these days I tend to default to double cheeseburgers. nuggs too always good https://t.co/wkX2AusHMY\n↓\n1550894994403123200 [2022-07-23] @visakanv 💜 5\n👇🏾  https://t.co/1UuBVGbUxW https://t.co/Mty9SpL0Ok\n  [Quoting @visakanv: Scarcities in the world:   - Stories - Meaning  - Context - Perspective - Empathy - Sincerity - Relationships - Focus - Nuance - Curiosity]\n↓\n1550895904844001280 [2022-07-23] @visakanv 💜 11\nprobably The User Illusion by Tor Norretranders. Or maybe Lives of a Cell by Lewis Thomas. Or Keay Davidson’s biography of Carl Sagan https://t.co/eXZ8GWxvsV\n↓\n1550896138051391488 [2022-07-23] @visakanv 💜 14 🔁 1\nthat I’m not a good enough husband and won’t be a good enough dad https://t.co/DZwKkZYk4H\n↓\n1550896507900940289 [2022-07-23] @visakanv 💜 100 🔁 14 💬 1\nBitch I was born here, it’s my home, I’m fucking staying lmao. Why should I be the one to leave? https://t.co/CmHHSDMmut\n↓\n1550896751413891072 [2022-07-23] @visakanv 💜 17\nmost important thing is that you can communicate healthily and navigate conflict/disagreement together, everything else is downstream of that https://t.co/dCihlnmX1a\n↓\n1550897366995070976 [2022-07-23] @visakanv 💜 4\nOooh fun Q. They’re both intertwined, I think of FAN as outward directed (but not entirely) and Introspect as inward directed (but not entirely) and together they got this sorta yin-yang thing going on. I’m looking forward to updating FAN v1.1 which will make this clearer https://t.co/lRgVYMXnMl\n↓\n1550897850233413632 [2022-07-23] @visakanv 💜 6\nhonestly too many to list. If I’m following someone it typically means I think they’ve got big potential. But how these things play out can be unpredictable in the short term. Look for people who are producing public-facing output https://t.co/JiLlbS8AET\n↓\n1550898242996473857 [2022-07-23] @visakanv 💜 8\n👇🏾 https://t.co/svGsmVhzzq https://t.co/D9vRlObVSX\n  [Quoting @visakanv: @michaelcurzi Plans are worthless, planning is priceless. Spend a day making elaborate plans and then disregard them completely to make whatever you think is most compelling. Repeat monthly or quarterly]\n\n===\n\n1552024372684242944 [2022-07-26] @grin_io 💜 11\nmy wife's thinking of joining twitter and im collecting the best intro material on how to make friends online and get the most out of this place. please halp!\n\nshow me your fav \"aha\" tweets/threads/links that changed the way you play the game\n↓\n1552024687458254862 [2022-07-26] @grin_io \nstart here. no twitter knowledge required\n\nhttps://t.co/iCQeuFtAzY\n↓\n1552024751174025218 [2022-07-26] @grin_io 💜 1\nhttps://t.co/j1BmjcN2Wg\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1552024819117555712 [2022-07-26] @grin_io 💜 1 [(SEED) type=quote_of_root]\nhttps://t.co/CMdXLDq8Si\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1552025321125416966 [2022-07-26] @grin_io 💜 8 🔁 1\nfair warning: there's gonna be a lot of visa in this thread\n\npersonally i if i could keep just one tweet in mind at all times, it would be this one\n\nhttps://t.co/Sh81zEp7vW\n  [Quoting @visakanv: if you’re spending lots of time on social media, you’re either   1. building nourishing relationships with people who care about you 2. grifting off of suckers 3. a sucker  very sad to see suckers being swept up by grifters *at the expense of their relationships* https://t.co/OpvQDarFCR]\n↓\n1552026014364188672 [2022-07-26] @grin_io 💜 4\nmany have walked this exciting path\n\nhttps://t.co/ffyODnMt2I\n  [Quoting Tweet 1475531864337096711 (missing)]\n↓\n1552030202284449795 [2022-07-26] @grin_io 💜 1\nmaking friends online is easier than IRL because you can google them\n\nhttps://t.co/tKzNO6ffs0\n  [Quoting @visakanv: thinking about what stood out in this conversation – the idea that it's easier to make friends with strangers online than with strangers on the street, bc you can see a person's body of work – their tweets, their website, etc – and infer a lot about them https://t.co/RwyauA2vmI]\n\n===\n\n1578768148429688832 [2022-10-08] @forthrighter 💜 7 [(SEED) type=quote_of_root]\nNotes on \"support by disagreeing well\" and what it might mean to disagree well, as a branch off of this tweet https://t.co/6IsRxFJtUi\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1578768491527942150 [2022-10-08] @forthrighter 💜 3\n\"Stay within OP's frame (or extend it)\". If the claim is coffee is best morning drink, disagree about morning drinks; do not switch frames and talk about after-dinner drinks (coffee is bad bc caffeine)\n↓\n1578768949235265544 [2022-10-08] @forthrighter 💜 3\nthe frame that OP offers is the \"playground\" so to speak.  If each utterance is an invitation to play, you need to play *here* not on some other playground of your invention. That's the frame/supporting OP.\n↓\n1578769212880797696 [2022-10-08] @forthrighter 💜 3\n\"It's not gladiatorial combat\".  If it's ever about the person then you're probably not supporting OP.  If it looks like there will be a winner or a loser it's probably not supportive.\n\nThe play is about the ideas.  Not only is it not about the gladiators...there are none!\n↓\n1578769456221650945 [2022-10-08] @forthrighter 💜 2\n\"To support by disagreeing well\" might be something like working together to chip more truth, about the topic at hand, out of the block/frame offered by OP\"\n\nBecause that's what they were trying to do with the thread to begin with!\n↓\n1578769723265011712 [2022-10-08] @forthrighter 💜 2\nSo someone came to twitter and posted some long thread about topic XYZ. They might not be claiming to have the answer, they might just be \"thinking it through out loud\". \n\nSome approximation of they're seeking truth and you can support by disagreeing\n\nhttps://t.co/RTAnf7k9k2\n  [Quoting @forthrighter: @moothought @_StevenFan well there's knowing and then there's \"knowing\" (that's a long topic itself).   Frequently, people don't write what they know. They write so they can discover what they think and that's OK too.  I find it comes in styles though according to the different sides of the brain]\n↓\n1578770429183131648 [2022-10-08] @forthrighter 💜 3\nperhaps disagreeing isn't the point, it's just a side-consequence. What I mean is, look at the utterance, try to elucidate some tiny bit of truth for yourself (within that frame). Then share it; if you do that, it may come out as a disagreement with OP but supportive\n↓\n1578771374377562113 [2022-10-08] @forthrighter 💜 4\n\"But what if I fundamentally disagree with the frame?\"\n\n🤔\n\nHere, I think if you have a tight relationship with OP you can challenge it. If you don't you gotta hard ask yourself why you want to engage in the first place. Ego check, why does this thread get you so hard https://t.co/yOwDCLm9Il\n↓\n1578771798492999680 [2022-10-08] @forthrighter 💜 3\nA derived principle might be the more challenging the feedback you want to give someone, the tighter you need to be with them before you even try\n\nThis is roughly, \"Having standing in the relationship to make a point\"\n\nyou manifestly don't get to say anything to anyone\n↓\n1578772446710157313 [2022-10-08] @forthrighter 💜 4\nthis extends to things like sarcasm &amp; mock insults; works better (and can even be really funny) with tight friends.  Blows up in your face real quick when dealing with people with whom you don't have relationship standing\n↓\n1578773945880395777 [2022-10-08] @forthrighter 💜 2\nI would be honored if someone told me I got this thread wrong, and tried to elucidate any extra shreds of what it means to disagree skillfully because I'd like to get better at it\n\n===\n\n1585214577427775491 [2022-10-26] @visakanv 💜 16 🔁 1\n🥰🙏🏾 https://t.co/3NiluLvTPu\n  [Quoting Tweet 1585213428049641472 (missing)]\n↓\n1585214604803571713 [2022-10-26] @visakanv 💜 9 [(SEED) type=quote_of_root]\nhttps://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1586727885573787649 [2022-10-30] @visakanv 💜 179 🔁 6\ngood reply game as a Halloween costume https://t.co/KDMfRlo3Ev\n  [Quoting Tweet 1586094421577113600 (missing)]\n↓\n1586728208275234819 [2022-10-30] @visakanv 💜 63 🔁 1 [(SEED) type=quote_of_root]\nthey worried less about how they looked and focused on how they could create a better experience for other people. they supported the proposal\n\nhttps://t.co/9Fzs72fAoN\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1586729403219775490 [2022-10-30] @visakanv 💜 23\nrelated: thread of deadpool cosplayers https://t.co/9UNn7wXo43\n  [Quoting @visakanv: Deadpool cosplayers are the best https://t.co/dMCpZ458YD]\n\n===\n\n1592427847163187200 [2022-11-15] @visakanv  [(SEED) type=quote_of_root]\nRT @emmagine79: @victorfatanmi basically, having good reply game! https://t.co/RN6km7RJMc\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1602787427760111616 [2022-12-13] @visakanv 💜 246 🔁 14\nhow about this for my maybe spicy-ish late night take\n\nto be successful as a bad mf feral free agent you need to be able to hold about 4-7 things in your mind simultaneously\n\nand if you can't do that then you either need to expand capacity or probably be a follower of some sort\n↓\n1602787900797911040 [2022-12-13] @visakanv 💜 88 🔁 1\ni dont usually like pointing directly at this but i get annoyed/frustrated sometimes when I talk about one of the variables and people are like \"but what about the other variables\" and I'm like yea bro you need all 7 variables at the same time\n↓\n1602788203689574400 [2022-12-13] @visakanv 💜 63\nfirst of all you need to understand the nature of dynamism\n https://t.co/cLpQFc4h1N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1602788298791219200 [2022-12-13] @visakanv 💜 47\nyou need to understand constraints https://t.co/N44oPPHK5V\n  [Quoting @visakanv: One of the biggest tells that someone doesn’t know what they’re talking about: glossing over addressing resource constraints, or saying things that imply infinite resources. Effectively everything is resource-constrained, &amp; seasoned practitioners are especially sensitive to this https://t.co/DZi8XbYQqx]\n↓\n1602788337513025537 [2022-12-13] @visakanv 💜 42\nyou need to optimize for survival https://t.co/tnB88aR3iC\n  [Quoting @visakanv: the big lesson of survivor bias is that you should optimize for being a survivor]\n↓\n1602788378004852736 [2022-12-13] @visakanv 💜 41\nyou need to be well-prepared https://t.co/tvh6a0ZjHN\n  [Quoting @visakanv: people are really not used to dealing with someone who's well-prepared]\n↓\n1602788438893371397 [2022-12-13] @visakanv 💜 53\nyou need to know how to allocate your limited resources in a way that gets you to win\n\nhttps://t.co/PGGQhI2RGC\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1602788986065661952 [2022-12-13] @visakanv 💜 35 💬 1 [(SEED) type=quote_of_root]\nyou need to practice good reply game https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1602789200038092800 [2022-12-13] @visakanv 💜 38 🔁 2\nthere's lots and lots of things you gotta do in concert in a dynamic way and you have to be able to fail gracefully and adapt and iterate and survive\n\nhttps://t.co/wxOAVmcseG\n  [Quoting @visakanv: latest version  some people have asked for a PDF (idk why, but ok) you can have that one here: https://t.co/SY3Oi82hF5 https://t.co/fKBnf7btzs]\n\n===\n\n1605469746882678784 [2022-12-21] @christineist 💜 32 🔁 1\nPattern language friends—  what are the patterns that show up here/in this part of twitter that make the space feel alive, and which make the space feel dead? \n\ncomment ideas on top level tweet and I will attach them along with my own brainstorm in the thread\n↓\n1605470316536352769 [2022-12-21] @christineist 💜 7\nWe have memes. Memes are effectively packaging and \"naming\" patterns in a way that is easily shareable \n\nhttps://t.co/jigZMcFG7b\n  [Quoting @gnostrils: all right, i guess it's time for me to share my list of ingroup memes that i've been collecting all year  tell me which ones i'm missing and i'll add them to this list  in no particular order... 🧵]\n↓\n1605471251274747904 [2022-12-21] @christineist 💜 8 [(SEED) type=quote_of_root]\nI would argue that \"good reply game\" is a pattern. It has elements (accounts, tweets), relationships (mutuals, replies), space (twitter), repeated events (replies), etc\n\nhttps://t.co/KLlRlYREx1\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1605471492354953217 [2022-12-21] @christineist 💜 8\nthere is some sense of \"norms\" that also serve as \"shared language\" or \"common patterns\"\n\nhttps://t.co/psaPLwb6Ry\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1605472267298754560 [2022-12-21] @christineist 💜 6\nHighest level pattern: People come to twitter to tweet and reply to each other's tweets\n\nWithin twitterspace: Ability to thread, Ability to branch off any particular node, Temporality of feed &amp; profile posts\n\nWithin twitterevents: tweeting, making threads, replies...\n↓\n1605472845747740673 [2022-12-21] @christineist 💜 6\nmore twitter-space-events: repeated online and IRL events. Picnics, vibecamp, bigger parties, get togethers, discord servers, book clubs, birthday parties, group chats, twitterspaces, interintellect salons\n↓\n1605473360153939970 [2022-12-21] @christineist 💜 6\nEase of entry and access. Anyone can reply to anyones tweets (given they are public). You can say anything (mostly lol). \n\nThere is no dislike button, so the worst that can happen is you get ignored. I want to say that the lack of dislike actually does a lot of heavy lifting.\n↓\n1605473907418353664 [2022-12-21] @christineist 💜 6\nThings that make this space feel alive: \nWhen you get your first mutual interaction. when someone compliments you on your tweet. a voice responds from the void, and it is friendly. Close quarters with brilliant / genius minds.\n↓\n1605474260297740288 [2022-12-21] @christineist 💜 8\nThings that make things feel dead: \nboring content, bad engagement, non-thoughtful replies, lack of people creating or thinking on their own, judgment, shaming, acrimonious/combative discussion, riffing that goes too far\n↓\n1605475713460473857 [2022-12-21] @christineist 💜 7\nOh, one of my favorite patterns in this space is people who build in public, make things, share progress, and show it to friends. There is the music channel, the occasional \"look I made this\" photo, tweeting of how things are going, Make 100 Things\n↓\n1605475848210894855 [2022-12-21] @christineist 💜 6\nAnother pattern— lots of programmers. Lots of male programmers.\n↓\n1605476343994388481 [2022-12-21] @christineist 💜 5\nGoing into communities as patterns... rationalist, post rationalist, EA, IFS, meditation/spirituality, Qualia research institute, VC and startup area, therapy and life coaching, Interintellect, the stoa, Open AI, Blogs with community followings (ribbonfarm, astral codex ten, etc)\n↓\n1605476611721084929 [2022-12-21] @christineist 💜 4\nIf we were to follow the prescribed way and pick out the nearest larger patterns that this part of twitter falls under, and pick out the major patterns underneath this space, what would those be?\n\n===\n\n1625445127643865090 [2023-02-14] @visakanv 💜 214 🔁 4\nover the next ~20 years i'm going to reach about 10,000,000 people with the idea of good reply game, loosely-informally 'recruit' the top 1,000 of them, then in the 30 years after that the top 12 or so will reshape/improve discourse on a global scale\n↓\n1625455118077263874 [2023-02-14] @inkolore_ 💜 5\n@visakanv How did you come up with the idea of \"reply game\" ? I can now see super clearly how my own is super poor because usually I add very little to the conversation or sometimes contribute to killing it, but I don't think I would have consciously noticed if not for you.\n↓\n1625457705971494912 [2023-02-14] @visakanv 💜 5 🔁 1 [(SEED) type=quote_of_root]\n@inkolore_ it just sorta came together organically while thinking and writing a lot about how people respond to each other. the main thread i tend to point to is here, and it doesn't actually contain the phrase in the start https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1626846162937606144 [2023-02-18] @visakanv 💜 128 🔁 10\nI used to put a lot of effort trying to change the minds of people who disagreed with me. I'd say I'm pretty good at it; I had to do it to survive early on. But along the way I came to see that it's much easier for me to achieve my goals by seeking out people who agree with me\n↓\n1626846463195226113 [2023-02-18] @visakanv 💜 30\nthis thought sets itself up for immediate blowback in the simplistic form of \"oh you just want an echo chamber, huh? you just want to be free from criticism?\" no, I don't, which is a big part of why I am so public-facing on all fronts and I read n internalize all criticisms. but\n↓\n1626846771656941568 [2023-02-18] @visakanv 💜 22\nif you play it out a few thousand times (and I have!), you come to see there are patterns. you can map out disagreements. there's a gd chance I already have a tweet or thread considering any particular perspective that's relevant to my domains of interest, including opposing ones\n↓\n1626847032676855808 [2023-02-18] @visakanv 💜 21\nI believe very much in the spirit of the notion of, \"you should understand your opponents' perspectives, backgrounds, histories, etc better than they understand their own, and be able to LARP as one of them so well that you can become a leader in their community\"\n↓\n1626847492016078850 [2023-02-18] @visakanv 💜 37 🔁 2\nand then you come around to noticing that most persuasion with most people has little to do with arguments anyway and most people are persuaded by charm, aesthetics and social proof. and then by simple persistence over time + achieving results, vs arguing in the moment\n↓\n1626848022784274433 [2023-02-18] @visakanv 💜 13\nthere's a subset of people who are turned off by anybody even MENTIONING these variables, like it's sinful to even point out that people are people. and I used to kinda desperately want this group of ppl's approval, when I was a lowly forum rat nobody knew or cared about\n↓\n1626848514939686913 [2023-02-18] @visakanv 💜 24\nbefore I met people who were smart AND kind, I thought I had to choose between people who were smart (and scathing) OR people who were kind (and foolish/naive), and I mostly chose the former. I was so desperate for intimacy i tolerated the most odious behavior bc it was \"real\"\n↓\n1626848957459763201 [2023-02-18] @visakanv 💜 19\nI would think things like, kindly weaklings are just putting on this smarmy fake bullshit show of niceness because they can't afford not to. when my asshole friends treat me like shit at least they're not bullshitting me, they're telling me how they really feel\n\nnot wrong but ugh\n↓\n1626849446922432512 [2023-02-18] @visakanv 💜 34 🔁 1\ntook me a few more years to really appreciate in a full-stack way what I did feel in my heart, which is that smart+kind people do exist – people who are strong and don't *need* to be nice to anyone, and yet *choose* to be tender anyway. we can choose both strength n sensitivity\n↓\n1626849860543733760 [2023-02-18] @visakanv 💜 16 [(SEED) type=quote_of_root]\ncircling back to agree/disagree – the missing nuance maybe is that I'm not interested in fanboys, stans, yesmen. there's something disrespectful about *mindless* agreement. and any sufficiently thoughtful disagreement implies a 'deeper' agreement IMO https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1626850401311154176 [2023-02-18] @visakanv 💜 19 🔁 1\nthere is a depth of disagreement you can only reach when you have substantial shared understanding. this rhymes with how nobody can hurt you more than your loved ones. your parents knows how to push your buttons best since they sewed them on.\n↓\n1626850675769606144 [2023-02-18] @visakanv 💜 10 🔁 2\nit also rhymes with how, if you seek haters, you don't need to be disagreeable or perform any stunts. you simply need to do what you love with all your heart, boldly, confidently, proactively, earnestly, sincerely. this inspires haters more than petty superficial squabbling\n↓\n1626852093062684672 [2023-02-18] @visakanv 💜 17 🔁 1 💬 1\nsetting aside legit criticism:\n\nthe haters that hate your bad takes are recreational haters, casuals\n\nthe serious haters that *really* get mad, are not mad at what you say\n\nthey're mad that you have the guts, the self-respect, the audacity to live your life like it matters\n↓\n1626852539395358721 [2023-02-18] @visakanv 💜 9\nof course there's almost always at least ~some~ legit criticism in anything, which complicates everything, but that's also what keeps things interesting. if you're too sure of yourself then things get boring too\n↓\n1626853231191273472 [2023-02-18] @visakanv 💜 5\nhonestly I've disagreed with myself harder than anybody else has ever disagreed with me\n\nI've had more *interesting* disagreements with friends, peers, etc who bring different POVs to the table, which has been more useful than hard or intense disagreement https://t.co/8tyiOxcw0Y\n  [Quoting @visakanv: 8. it’s very cute when internet antagonists think they can hurt my feelings. you trying to go up against [checks notes] me?? you’ll fuck me up?? Bitch, *I’ll* fuck me up]\n↓\n1626853938740989952 [2023-02-18] @visakanv 💜 21 🔁 2\ncircling back to the start idk if I even like the idea of \"change people's minds\" as a frame. it's a fairly static or binary model of minds. minds are much more dynamic than that. I'm always looking for people who deeply understand this. people who r beyond agreement/disagreement\n↓\n1626854138779947009 [2023-02-18] @visakanv 💜 1\n-fin https://t.co/x7oH4zPI1X\n\n===\n\n1640433974907371521 [2023-03-27] @visakanv 💜 188 🔁 6 💬 1\ni have at this point corresponded with ~100,000+ people and the # of interesting conversations i've had that began with someone saying \"i disagree\" is a rounding error. less than a dozen, it feels like. i want to say 0 but i'm maybe forgetting 1 or 2\n↓\n1640434350281072640 [2023-03-27] @visakanv 💜 42\nmost of the time it looks like this https://t.co/ZuvXfuNo9f\n  [Quoting @visakanv: a frustrating thing about trying to think out loud on the internet is a lot of people will blindly agree or disagree without actually saying anything about what they think https://t.co/dcvsrSN1eu]\n↓\n1640434794084569088 [2023-03-27] @visakanv 💜 45 🔁 1\nsometimes it gets weirder, like this \nhttps://t.co/IqMPr4m6Ap\n  [Quoting @visakanv: imagine if someone said “I’m hungry” and someone else said “I disagree, I literally just ate”. That’s obviously absurd  but somehow some wires seem to get crossed when the statement becomes slightly more complex. “I’m hungry for a better class of movie criticism” “I disagree”]\n↓\n1640435679136981007 [2023-03-27] @visakanv 💜 48 🔁 4 [(SEED) type=quote_of_root]\nthe issue isn't *that* there's a disagreement – if the person actually cares to navigate that disagreement, and have the skill to manage it, they would take pains to establish a connection with the person they're disagreeing with\nhttps://t.co/9Fzs72fAoN\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n├── 1640436276078735361 [2023-03-27] @visakanv 💜 25\n│   that's how you get your disagreement *across*, such that it is actually considered\n│   \n│   but typically these people aren't interested in having a conversation, or they're unable to because of a skill issue\n│   ↓\n│   1640438074751741952 [2023-03-27] @visakanv 💜 22\n│   honestly i'm actually sort of surprised. if you had asked me to guess, before interacting with 100k people, how often \"i disagree...\" as an opening salvo would lead anywhere interesting or productive, I would guess \"maybe a few hundred times?\" but it's close to 0\n│   ↓\n│   1640438322362482688 [2023-03-27] @visakanv 💜 35 🔁 1\n│   again to be clear i'm not saying disagreement is uninteresting\n│   \n│   i have had lots of interesting disagreements with people\n│   \n│   i'm saying that interesting disagreements happen in contexts where people demonstrate a willingness + ability to model one another, and prioritize this\n│   ↓\n│   1640440142199656450 [2023-03-27] @visakanv 💜 18\n│   there are some contexts where the setup invites disagreement, eg \"would you agree that...\" and if someone says \"i disagree...\" there, I probably don't even notice that bc it fits the format, it goes with the dance\n│   \n│   it's the jarring outta-nowhere \"I disagree\" that's a sour note\n│   ↓\n│   1640441862652567578 [2023-03-27] @visakanv 💜 32\n│   to be clear i'm not interested in having ppl expressing agreement, i'm interested in the *specifics* of their thinking. once you've gone through a few 1000 cycles of this it's hard to shake the sense that ppl often use agree/disagree *in lieu* of thinking https://t.co/Q0gECmra6e\n│     [Quoting @visakanv: \"hard agree\" this isn't actually helpful either]\n│   ├── 1640444535363739655 [2023-03-27] @forthrighter 💜 1\n│   │   @visakanv is this phrase (\"I disagree\") unique in its accuracy as a selector?  Flip it on its head, is there a phrase or opening salvo that disproportionately makes for interesting conversations? \n│   │   \n│   │   I'm thinking abt smth like that's interesting because...or other \"yes/and\" signifiers maybe?\n│   │   ↓\n│   │   1640445753825828875 [2023-03-27] @forthrighter 💜 2\n│   │   @visakanv some conversational physics I've noticed:\n│   │   \n│   │   - yes/and: extending &amp; riffing, same premise\n│   │   - no/but: disagreeing\n│   │   - whatabout: (last tweet was one of these)\n│   │   - maybe/why: noncommittal probe Q to elicit nuance\n│   │   \n│   │   any _could_ be good or make for interesting convo if done skillfully\n│   │   ↓\n│   │   1640446113604837376 [2023-03-27] @forthrighter 💜 2\n│   │   @visakanv - yes/and unskillfully: obsequiousness. \"You're so right\"\n│   │   - no/but badly: (root topic of this thread)\n│   │   - whatabout badly: whataboutism\n│   │   - maybe/why badly: topic switch, irrelevant Q\n│   └── 1640450441845547016 [2023-03-27] @visakanv 💜 16\n│       anyway i wrote all of this off-the-cuff, if i were to write an essay abt it i'd probably lead with the bit about how there are some frames/contexts which invite disagreement (classroom type setting, debate, etc) and some where it's a sour/off note, and im talkin abt latter. k thx\n│       ↓\n│       1640465084186079239 [2023-03-27] @monistowl 💜 1\n│       @visakanv This is precisely the line of thought which led me to abandon forms of social media that cannot simply be turned off when not in use.\n│       ↓\n│       1640472416957734915 [2023-03-27] @monistowl 💜 2\n│       @visakanv If I turn my light off when I go to sleep, why wouldn't I turn off my connexion to the Internet\n│       ↓\n│       1640472863131009024 [2023-03-27] @monistowl \n│       @visakanv simply unplug router\n│       ↓\n│       1640472947897901057 [2023-03-27] @monistowl \n│       @visakanv simply walk without phone\n└── 1640517545164967936 [2023-03-28] @JimmyRis \n    @visakanv This is such a thing, talking about this constantly with people\n    \n    My goto example “it’s cold in here” “No, it’s not” 😂 \n    \n    an opinion or personal reality being presented and/or interpreted as an assertion about objective reality, and disagreed with\n    ↓\n    1640517651075321857 [2023-03-28] @JimmyRis \n    @visakanv Guarantees that distance and is such a nonstarter\n\n===\n\n1645021161741484033 [2023-04-09] @visakanv 💜 254 🔁 16\ni've written a bunch of stuff about my idea about 'project management' here and there, long-stewing on an essay about it, so once again i'ma try and blurt it out in a thread\n\nfor starters, I define a project as... https://t.co/PVXJkysrD2\n  [Quoting @Malcolm_Ocean: \"A project is anything that requires collaboration, even if it's \"only\" between you-today and you-tomorrow.\"  — @visakanv (in Introspect)]\n↓\n1645021590000926721 [2023-04-09] @visakanv 💜 48 🔁 1\ni love this definition so much bc it makes so many things simpler &amp; clearer. when you get good at doing projects, you get good at collaborating. and collaboration is a useful skill in any direction. it's humanizing if we can do it, dehumanizing if we cant  https://t.co/nDbVmrX8Kw\n  [Quoting @visakanv: can we collaborate? can we labor together? or can we not? this might be the most fundamental question for human beings https://t.co/z9ZZwKG55P]\n↓\n1645022131477164032 [2023-04-09] @visakanv 💜 29\nok so lets say you're sold, projects are about collaboration, it's worth learning how to collaborate better. where do you start? buncha different possible answers to this question. you could start small. or you could start compelling. this itself can be a micro-project...\n↓\n1645022393428234244 [2023-04-09] @visakanv 💜 23\nyou could list out a bunch of things that you're interested in doing, or feel compelled or obligated to do. i recommend doing this in writing, whether in a notes app or on paper, so that you can look at it, and pay attention to how you feel about it\n↓\n1645022763718156288 [2023-04-09] @visakanv 💜 27\nif you don't have a lot of experience getting things done, there's a chance your list will include vague things like \"learn guitar\", or \"get fit\". these are good starts, but they are poorly defined projects. how do you define success? how do you determine progress? vague = no-go\n↓\n1645023321501863937 [2023-04-09] @visakanv 💜 49 🔁 1\nthis is where we get to \"do 100 things\". it's one of the simplest templates you can pick up re: projects. do 100 pushups, however long it takes, across however many sets over however many days. keep track of it (write it down), and see how it feels https://t.co/HH3J9LKQt8\n↓\n1645023767155056643 [2023-04-09] @visakanv 💜 26\nyou might try starting a do100thing project here and there and find that you ran out of interest, motivation, energy, etc maybe 7 or 15 things in. this is absolutely fine and normal. if it were easy to do100things you'd already have done it. embrace your failure and investigate\n↓\n1645024429137858560 [2023-04-09] @visakanv 💜 26\nwhy did you stop? did you lose interest? in which case, cool! strike that project off from your list. \n\ndo you wanna do something else? cool! do that instead, you can always pick this project up again next time if you like. \n\nbut what if it's neither? cool, a more complex puzzle!\n↓\n1645024804880388096 [2023-04-09] @visakanv 💜 68 🔁 5\nin my experience with my own projects, talking with a couple of hundred people about theirs, my investigation and reading, my broad sense is that usually people drop off a thing because they weren't in the flow zone. they either pushed themselves too hard too fast, or not enough https://t.co/RFFSbhUzzg\n↓\n1645025177607237633 [2023-04-09] @visakanv 💜 61 🔁 3\nso the critical thing about keeping a project running turns out to be managing your own psychology! you wanna be having fun, you wanna be feeling like you're learning and growing, becoming more dynamic, more powerful, expanding your range of expression https://t.co/PGGQhI3pwa\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1645041843288289282 [2023-04-09] @visakanv 💜 25 [(SEED) type=quote_of_root]\nlet's start over from a different angle. one of my fav ways of thinking abt collaboration is as a \"conversation\". a back and forth, one bit of \"speech\" after another. here's a thread about Good Reply Game, re: being a desirable conversation partner: https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1645042945815621632 [2023-04-09] @visakanv 💜 24\nnow see this gif again, and see it as a physical manifestation of good reply game. observe how each person has to be attentive, and reposition themselves slightly to receive the pass well, &amp; be attentive to the next person who is receiving *their* pass\n\nhttps://t.co/nDbVmrX8Kw\n  [Quoting @visakanv: can we collaborate? can we labor together? or can we not? this might be the most fundamental question for human beings https://t.co/z9ZZwKG55P]\n↓\n1645043568904650752 [2023-04-09] @visakanv 💜 42 🔁 2 💬 1\nnow think of all of these guys as temporally different versions of yourself. 2pm you, 3pm you, 4pm you. or january you, february you, maruary you. or 2020 you, 2021 you, 2022 you. how well are you passing \"the ball\", whatever that means, from one self to the next? https://t.co/RMejXUGU8A\n↓\n1645044154953785349 [2023-04-09] @visakanv 💜 43\nif you aren't good at this stuff yet, you're going to drop the ball a bunch. that's ok! the thing is to see that ball-passing is a skill, it's learnable, you can get better at it. you can modify your environment. you can ask for help. you can do smaller passes. use 'better balls' https://t.co/5QLDYukjA3\n\n===\n\n1648982169900183554 [2023-04-20] @visakanv 💜 183 🔁 4\nlet's address this. I've spent my whole life trying to find out what exactly makes people positive deviant outliers. I don't have the answers. If I did, I'd be a literal trillionaire. this is like asking \"I wish visa knew how to identify steve jobs\". buddy, I wish I did too https://t.co/NQ2nzADd5v\n  [Quoting Tweet 1648856884772839425 (missing)]\n↓\n1648982409038417922 [2023-04-20] @visakanv 💜 64 [(SEED) type=quote_of_root]\nbut saying \"most of visa's stuff = sucks to be you\" is such a hilariously bad interpretation of my stuff. sir, do you even know how to read? because I have written hundreds of thousands of words trying to help people be more effective. \n\n1. \nhttps://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1648982843094364160 [2023-04-20] @visakanv 💜 35\n2. do you want me to list out all the threads that I've written over 10+ years to help people? because I can do that https://t.co/PGGQhI3pwa\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1648983127149395975 [2023-04-20] @visakanv 💜 24\n3. https://t.co/N44oPPHK5V\n  [Quoting @visakanv: One of the biggest tells that someone doesn’t know what they’re talking about: glossing over addressing resource constraints, or saying things that imply infinite resources. Effectively everything is resource-constrained, &amp; seasoned practitioners are especially sensitive to this https://t.co/DZi8XbYQqx]\n↓\n1648983377603858438 [2023-04-20] @visakanv 💜 24\n4. c'mon man https://t.co/DmDADVhOEj\n  [Quoting @visakanv: Step 1 is you do an inventory. List out everything about your life. What are your possessions, relationships, behavior patterns, what is everything of consequence that comes to mind? What do you love? What do you hate? What torments you? List it all out. In writing. Look it over https://t.co/uYBZL8r5G8]\n↓\n1648983984179933184 [2023-04-20] @visakanv 💜 19\n5. \n\nhttps://t.co/46SsYNa25J\n  [Quoting @visakanv: I think a thing that I internalized early on, which made a big difference to every part of my life, that I’d like to teach other people if it helps (which it should), is an awareness of something like “expanded complex problem space” (ew, lol)]\n↓\n1648985222820798466 [2023-04-20] @visakanv 💜 18 🔁 1\n6. if my attitude were \"sucks to be you\", why would I spend so much time and effort trying to teach people what I know? https://t.co/DhULqXJ99m\n  [Quoting @visakanv: lets say I want to learn about swords and become a Sword Guy. well, okay. who are the Sword people? what are the Sword communities? this is actually a funnily difficult example but it probably means I got the wrong word. but hey, there are a couple of sword shops in my city https://t.co/ca2RnedTJ2]\n↓\n1648986007004667906 [2023-04-20] @visakanv 💜 22\n7. if my attitude were \"sucks to be you\", why would I try to teach people to ask for help? https://t.co/yfaq3T9irI\n  [Quoting @visakanv: a quick sketch of a blogpost: how to ask for help   https://t.co/ERYRjedrsV https://t.co/Au6UEOjWdc]\n↓\n1648986511176773633 [2023-04-20] @visakanv 💜 26\n8. if my attitude were \"sucks to be you\", why would I spend so much time making so many videos for no reward, talking about how to do things?  \n\nhttps://t.co/nkqvMLkH6F https://t.co/HPI3rmSvqn\n↓\n1648987082940116993 [2023-04-20] @visakanv 💜 26\n9. These are not rhetorical questions. I'm serious. Think about it. Why am I doing this? https://t.co/9CdF3SZH5h\n↓\n1649016155535982593 [2023-04-20] @michelleakin 💜 2\n@visakanv I could hear your pffffft of indignation when I read OP’s tweet\n\n===\n\n1669529498633797632 [2023-06-16] @visakanv 💜 126 🔁 9\na lot of the fun of twitter is about recognizing the constraints that we're operating in and doing what makes sense in this medium. anything we say in 280 characters is likely to be naive and simplistic. that is part of the nature of the medium and we can have fun with that\n↓\n1669529915761524738 [2023-06-16] @visakanv 💜 43\na lot of the tedious boorish nitpickers comes along and points out edge-cases. \"oh yeah, what about like, when a health authority posts misinformation?\" i am not talking about health authorities here, c'mon, learn to infer some context and intent, and quit being an annoying shit\n↓\n1669530178979254272 [2023-06-16] @visakanv 💜 40\ndid i make a grammar mistake the prev tweet? yea! who gives a fuck?? if i wanted to write a well-researched, carefully cited, carefully edited essay, I would have done that instead. some of yall do the equivalent of going to a beach and complaining that its sandy and wet\n↓\n1669531618871222272 [2023-06-16] @visakanv 💜 71 🔁 7\nall utterances are imperfect, all communication is lossy, all understanding is adjacent to misunderstanding. you can either recognize this and make a good-faith effort to collaborate, and become someone who is appreciated, or you can be a nuisance whose *absence* is appreciated\n↓\n1669533409918742529 [2023-06-16] @visakanv 💜 11 [(SEED) type=quote_of_root]\nhttps://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1676106269294481409 [2023-07-04] @visakanv 💜 422 🔁 16\nI don't wna dox my own alts but lemme share some knawledge, take it or leave it. over the years i've spun up maybe half a dozen accounts in different niches, platforms, etc, and it's fairly trivial to anonymously get to 2,000+ followers. \"oversaturated\" is a sign of opportunity https://t.co/5UZIM01QkZ\n↓\n1676106707947360258 [2023-07-04] @visakanv 💜 121 🔁 2\nthe common failure mode is that people start too generic, too broad. \"anon's tech review channel\", \"anon's gaming page\". of course yeah you're not going to get any followers that way. you have to find a very specific angle that a very small niche of people would be into\n↓\n1676108440400441344 [2023-07-04] @visakanv 💜 129 🔁 2 💬 1\nanother way of framing it, which is the same thing actually, is to solve for, \"what will someone tell someone else about my channel/account/page?\" \n\nand I mean answer that v specifically, very deliberately. why should someone follow you?  \"because i am a good boy\" is not enough\n↓\n1676108949152747525 [2023-07-04] @visakanv 💜 137 🔁 4 💬 2\n\"anon's mindful meditation blog\" = impossible, you're competing against the titans in the field\n\n\"mindful meditation for nihilistic software engineers\"  = you'll pick up interest at the crossroads even if you're not a very good meditator or a very good engineer\n↓\n1676109875896786944 [2023-07-04] @visakanv 💜 123 🔁 1\nactually I bet I could spin up a 2,000 follower \"bad motherfucker affirmations for recovering good boys\" twitter alt within a couple of months if I was intense about it, lol\n\nfirst you do about ~100 tweets that's a body of work. 20% can be quotes. 40% can be like, 2 book reviews\n↓\n1676110960157933568 [2023-07-04] @visakanv 💜 78 🔁 1 [(SEED) type=quote_of_root]\nthen after that it's about practicing good reply game in the mentions of larger accounts, news sites, etc. people like your replies, some % clickthru to your account, see that they like the content, follow  https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1676112593977745420 [2023-07-04] @visakanv 💜 54\ntext-based content marketing is my primary skillset but some fundamental things generalize\n\non youtube i've grown to almost 5k subs with a frame of \"secular sermons for FANs\"\n\nv few of my twitter followers follow me over to youtube, I think &lt;500. text-ppl tend to dislike video\n↓\n1676113615353675776 [2023-07-04] @visakanv 💜 52\ni haven't gotten around to being deliberate about growth on youtube, but the low-hanging-fruit wins are pretty clear – cultivate a point of view, and then make stuff that overlaps with stuff people are already into. eg if you're a musician, do covers of video game soundtracks etc\n├── 1676114772830597121 [2023-07-04] @visakanv 💜 72\n│   i could go on for hours and this thread is me avoiding the essay i'm working on in another tab lol so ima stop here  \n│   \n│   tldr: \"put yourself in the shoes of the consumer/audience etc and ask what you would like to see/watch/hear\". be rigorous n a lil unforgiving about this\n│   ↓\n│   1676114854049087488 [2023-07-04] @visakanv 💜 39 🔁 1\n│   related: https://t.co/oAiKv1QlPn\n│     [Quoting @visakanv: I feel like “put yourself in the shoes of the people who have the ability to give you what you want, then work give them what they want” is still a dramatically underutilized frame for getting what you want. It applies to everything from dating to jobs. Foundational peopling 101]\n└── 1676244573738205184 [2023-07-04] @__drewface 💜 5\n    @visakanv i like that example a lot, i want moreee\n    \n    what's one equivalent of \"if you're a musician, do covers of video game soundtracks\", but for each of:\n    - politics\n    - film-making\n    - therapy / coaching\n    - entrepreneurship\n    - software\n    ↓\n    1676245939500249089 [2023-07-04] @visakanv 💜 6\n    @__drewface in all cases it’s just about picking topics/subjects that existing adjacent people already have an interest in\n    \n    this is a professional skillset for me so I don’t like to give half-baked egs\n    \n    therapist eg might be to make short vids about /r/relationships drama\n\n===\n\n1701404018466230656 [2023-09-12] @visakanv 💜 120\nFriendly Ambitious Nerd is really 3 proto-books in one and it’s increasingly clear to me that the “Friendly” part wants to be a standalone book about Reply Game\n↓\n1701404966789980482 [2023-09-12] @visakanv 💜 15 🔁 2 [(SEED) type=quote_of_root]\nthe “central” or “origin” thread for that would be: https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1701405616030556472 [2023-09-12] @visakanv 💜 34 🔁 1\nhad a braingasm here where I realized good notetaking is about having your notes practice good reply game with each other. \n\nso in a sense even being a nerd is about being a good friend in the realm of ideas https://t.co/o9Vbu6cSxs\n  [Quoting @visakanv: startling how something like a 1% improvement at the tiniest level of a system can percolate through an entire system. eg, 1% better reply game can make an entire community feel livelier, warmer, more welcoming. same for 1% better threadin- holy SHITFUCK]\n↓\n1701408128909406349 [2023-09-12] @visakanv 💜 30 🔁 3\n“my job is not just to play with him, my job is to make him sound better…”\n\n“you’re hired.”\n\n“-that’s what ends up happening!”\n\n^ this is the essence of the whole thing \n\nhttps://t.co/Mtufs999Ic\n\n===\n\n1701405084599599274 [2023-09-12] @DanielleFong  [(SEED) type=quote_of_root]\nRT @visakanv: the “central” or “origin” thread for that would be: https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1730771708364358014 [2023-12-02] @voooooogel 💜 30 🔁 1\none thing i've been slowly realizing over the last 3 months (because i have to slowly realize everything related to social dynamics for some reason) is that signalling competence on ai twitter is really important\n↓\n1730771710251872748 [2023-12-02] @voooooogel 💜 12\nthere's a lot of people on here who talk really confidently but have no idea wtf they're actually talking about and if you want to talk to people who *do* know what they're talking about you sort of have to prove you're not one of those people\n↓\n1730771711988252751 [2023-12-02] @voooooogel 💜 9\nlike for example, on the tipping thread i just posted, i got a lot of comments along the lines of \"well duh, it's just a next token predictor, the internet is full of tipping\" to which i ask: does your theory predict this response? the internet is full of vacations! https://t.co/RzFAz80xln\n↓\n1730771713955393888 [2023-12-02] @voooooogel 💜 11\nbut once i know someone knows like, wtf pretraining vs instruction tuning vs RLHF is, i can have an actual discussion with them about why this surprised me despite it being in the pretraining dataset. e.g. @lumpenspace made some rly good points here\n\nhttps://t.co/pX6KeDv7ig\n  [Quoting Tweet 1730744015727800680 (missing)]\n↓\n1730771715956080738 [2023-12-02] @voooooogel 💜 15\nthat's part of why i pin my blog posts now, so people see i actually write interesting things about LLMs and am not just an uninformed rando. but it kinda sucks because it makes it harder to break in to the discussion as a new account\n↓\n1730771717772181962 [2023-12-02] @voooooogel 💜 10 [(SEED) type=quote_of_root]\nofc, another way to signal that you're knowledgeable, even while disagreeing, is to have good reply game :-) core twitter skill fr\n \nhttps://t.co/k1c6fiQLVX\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1741995226380578963 [2024-01-02] @nosilverv 💜 46 🔁 4 [(SEED) type=quote_of_root]\nVisa really out here teaching people online how to respond to bids\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1741995549220651064 [2024-01-02] @visakanv 💜 9\n@nosilverv cultivating a crew thats skilled at this is a source of tremendous power! takes a while to pay off but 🔥\n↓\n1742133854708588771 [2024-01-02] @nosilverv 💜 3\n@visakanv Yea - once I grokked the concept I saw bid attempts and failure/success everywhere… like opened up a new dimension people could be skillfull or unskillful in. Realized both memes below are about failed bids… https://t.co/AQ9uce9Und\n\n===\n\n1807677698875314255 [2024-07-01] @visakanv 💜 18\nincredible testimonial, I love to hear it!! ❤️‍🔥 https://t.co/x8jajf84oB\n  [Quoting Tweet 1807677529584779531 (missing)]\n↓\n1807679266257342590 [2024-07-01] @visakanv 💜 6 [(SEED) type=quote_of_root]\nit could maybe happen for you too: https://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n\n===\n\n1819445816337326151 [2024-08-02] @visakanv 💜 277 🔁 9\ndebating internally whether to discuss someone's earnestly cringe response to a friend's tweet... i'll paraphrase it: ~\"you dont know me but we are uniquely suited for each other and we should get to know one another, pls DM me\"\n\n(i dont share this to dunk but to help)\n↓\n1819446233725128990 [2024-08-02] @visakanv 💜 80\ni've sorta been on both sides of this, i vaguely recall maybe having sent some earnest emails and/or DMs when i was a kid that were sort of in this spirit, though I think even then I was at least careful to do what I think is the most important part: offer supporting evidence\n↓\n1819446606070255766 [2024-08-02] @visakanv 💜 110 🔁 3\nbasically, if you have a special connection with someone– and you might! I have had this with people I had never met or spoken with before! – the way to connect is not to say \"i believe we have a special connection\", but to *demonstrate* that special connection. \n\nhow?\n↓\n1819446864577720520 [2024-08-02] @visakanv 💜 114 🔁 1\nwell, you have to put yourself in the other person's shoes and ask what they're looking for, what they're interested in, what would make their day. if your connection is as real as you think it is, you should already know the answers to this\n↓\n1819447265163112638 [2024-08-02] @visakanv 💜 121 🔁 2\nat this point you may have to come to the sobering realization that you don't actually have a connection, you're possibly just projecting that you might have one because you'd *like* to have one, because you find them so admirable/clever/skilled/beautiful/desirable etc\n↓\n1819447730877673714 [2024-08-02] @visakanv 💜 90 🔁 2\nwhen I look back on the people i've developed special connections with, when we had magic right away from the first interaction– and sometimes this me being the reply guy, sometimes i'm the recipient– a recurring thing that stands out is a searingly sharp read of deeper intent\n↓\n1819448258760188401 [2024-08-02] @visakanv 💜 65\nand you don't have to speak with fake certainty, bluster, bravado here like \"I know EXACTLY what you need\". you can if it's true, (and you also can if it's untrue, lol, but that wont go well),\n\na gentle offering that's well-put together beats all the other mid responses\n↓\n1819449880311746872 [2024-08-02] @visakanv 💜 74 🔁 2\nand here's the thing: even if it's true that you actually do somehow know exactly what the person needs, saying \"we have a special connection, I know exactly what you need\" can make you seem like you don't, via unfortunate pattern-matching. that's the lemon market problem for ya https://t.co/LtkDTqHXTg\n↓\n1819450661836382395 [2024-08-02] @visakanv 💜 99 🔁 3 💬 2 [(SEED) type=quote_of_root]\nso what do you do? some moves that generally work are\n\n- offer precise, specific compliments about their choices/actions\n- offer interesting supporting material that's relevant to their interests\n- build on their bit, practice good reply game\n\nhttps://t.co/9Fzs72g8el\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1819451331301855611 [2024-08-02] @visakanv 💜 47\ni do wanna offer some general reassurance that's like... i dont think anybody is born knowing this stuff. if you're lucky you might've been socialized well from a young age by skilled parents/peers etc. even then maybe-probably for some people it clicks easier than others\n↓\n1819451781568778562 [2024-08-02] @visakanv 💜 51 🔁 1\ni wasn't a natural at this, which is why i talk about it. i learned it the hard way after people cringed at me. at the time it was mortifying, but looking back, that's life, isn't it? and there's a circular aspect to it too where once you get good, you get your own simps lol\n↓\n1819452183177564407 [2024-08-02] @visakanv 💜 54 🔁 2\ni hope this has had a good-natured spirit, i was once a simp too, i still have a simp's heart tbh tho maybe some will now say that's stolen valor. it feels honest to me tho, like in a kind of strange-loop way https://t.co/gtKRnrqkeG\n  [Quoting @visakanv: the first step to cease being an unintegrated wannabe is to accept that you are one, and will always be one. and to see the beauty, humor, joy and humility in that]\n\n===\n\n1837668336853045699 [2024-09-22] @RhysLindmark 💜 28 🔁 2 [(SEED) type=quote_of_root]\nWhen trying to pill people into Twitter, it's hard to find someone better to model off of and learn from than @visakanv.\n\nLots of evergreen content:\n- How past heroes were all friendly ambitious nerds https://t.co/oOsx0KRh0U\n- Good reply game https://t.co/0fFjWDEECc\n- Make friends online: https://t.co/cP6xoRsqoO\n- Iteratively move through a social graph by vibing with top 10 existing friends, expanding that to 100 new ones, then repeating: https://t.co/wtKOt2f3hs\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n├── 1837752088836665658 [2024-09-22] @visakanv 💜 2\n│   @RhysLindmark 🥰🙏🏾\n└── 1863747114083422515 [2024-12-03] @RhysLindmark 💜 3\n    cc @DefenderOfBasic \n    \n    Here are the tweets your semantic search gave for the prompt \"Visa talking about how to be a reply guy and friendly ambitious nerd\"\n    \n    vs. What I wanted/expected was the tweets above. (Not necessarily bad!)\n    \n    - https://t.co/JEEGrHd6BG \n    - https://t.co/20rkG0aEjh\n    - https://t.co/icEOHlngph\n      [Quoting @visakanv: this has been so effective for me it feels like I'm cheating https://t.co/9ElCmKsf6T]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand represents a multi-year evolution of the 'Good Reply Game' concept—a practical social technology for online discourse. Anchored by Visa's 2018 thread distinguishing 'noob' vs 'friend' communication patterns, it evolved from personal observation into a teachable framework adopted across communities. The discourse is constructive rather than dialectical: participants build on the core insight ('support the OP, disagree well') by applying it to contexts like improv theater, bid theory, Twitter growth strategy, and even internal note-taking. The boundary object is the original thread itself, which gets repeatedly cited as people recognize reply game as a learnable skill with compounding returns. High utility for community builders, content creators, and anyone seeking to improve online relationships.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1039420186586038273,
        "annotation": "Origin: The foundational thread defining good vs bad reply patterns, establishing 'support the OP' as core principle"
      },
      {
        "tweet_id": 1039428937229598720,
        "annotation": "Key insight: 'Who do you want to share this life with?' frames reply game as relationship-building, not debate"
      },
      {
        "tweet_id": 1085389826331938821,
        "annotation": "Early synthesis: Linking reply game to friendship-making, establishing it as a deliberate practice"
      },
      {
        "tweet_id": 1100490023932051456,
        "annotation": "Tactical refinement: Introducing STFU + tactical agreement as top 1% conversationalist moves"
      },
      {
        "tweet_id": 1343120356685463553,
        "annotation": "Philosophical deepening: Recognizing reply game as 'the only thing that matters'—a meta-skill"
      },
      {
        "tweet_id": 1357474566310797315,
        "annotation": "Cross-pollination: Yatharth connects reply game to improv's 'yes-and' principle, expanding theoretical foundation"
      },
      {
        "tweet_id": 1508969112013258756,
        "annotation": "Breakthrough application: Nosilverv realizes 'everything is improv theater'—reply game as life skill, not just Twitter"
      },
      {
        "tweet_id": 1578768148429688832,
        "annotation": "Operationalization: Forthrighter creates detailed guide on 'disagreeing well,' making the skill more teachable"
      },
      {
        "tweet_id": 1625445127643865090,
        "annotation": "Vision statement: Visa's 20-year plan to reach 10M people, showing intentional community-building strategy"
      },
      {
        "tweet_id": 1819450661836382395,
        "annotation": "Recent synthesis: Reply game as solution to 'earnestly cringe' outreach, demonstrating mature practical application"
      }
    ]
  }
}