{
  "seed_tweet_id": 1094684057173016581,
  "thread_text": "1094684057173016581 [2019-02-10] @visakanv 💜 1424 🔁 414 💬 74 [(SEED) type=root]\ntwitter_rpg_strategy_guide.txt\n├── 1094686272155602944 [2019-02-10] @visakanv 💜 425 🔁 96 💬 5\n│   Twitter is a multiplayer real-time virtual world, primarily text-based with limited multimedia support. It combines elements of role-playing games, hack and slash, player versus player, interactive fiction, and online chat.\n│   ↓\n│   1094687116796125186 [2019-02-10] @visakanv 💜 193 🔁 10 💬 1\n│   Players can read, view and contribute descriptions of objects, other players, non-player characters, and actions performed in the virtual world, as well as the “real” world. Players typically interact with each other by utilizing strings that resemble a natural language.\n│   ↓\n│   1094688015199350785 [2019-02-10] @visakanv 💜 192 🔁 20\n│   While traditional MUDs typically implement RPGs set in distinct fantasy worlds populated by fictional races and monsters, with players choosing classes in order to gain specific skills or powers, Twitter allows every player to project their own fantasy and define their own game.\n│   ↓\n│   1094689527615021056 [2019-02-10] @visakanv 💜 276 🔁 29\n│   The flexible nature of Twitter makes it difficult for any singular definition of “the game” to become canonical. Conflict between players with different interpretations of Twitter is a key feature of Twitter itself. Indeed, one of the most popular games is “hey, fuck that guy”.\n│   ↓\n│   1094691177289281536 [2019-02-10] @visakanv 💜 216 🔁 9 💬 1\n│   Unsurprisingly, few players put much thought into precisely defining the game that they are playing. Most players “pick it up” organically as they go along, inheriting the unwritten rules and norms of their peers via imitation and (limited) experimentation.\n│   ├── 1094694093509128192 [2019-02-10] @visakanv 💜 203 🔁 13 💬 1\n│   │   The key feature of (public) Twitter is that any player can interact with any other player. Any player can reply to any other player’s tweets, or retweet it, or quote-tweet it. This bypasses traditional limitations of both “real life” as well as older web mediums like “blogs”.\n│   │   ↓\n│   │   1094697463301079041 [2019-02-10] @visakanv 💜 195 🔁 12\n│   │   Twitter is also searchable, and allows tweets to be “threaded” in chains. \n│   │   \n│   │   This allows skilled players to build incredibly complex tapestries of hypertext, consisting of thousands of tweets.\n│   │   ↓\n│   │   1094698711618269184 [2019-02-10] @visakanv 💜 210 🔁 13\n│   │   Why would such prolific players choose Twitter as a medium, rather than “websites” or “books”, which appear to be better suited to large volumes of content?\n│   │   \n│   │   Because Twitter allows any player to interact with any other player’s tweets.\n│   │   ↓\n│   │   1094699709027905545 [2019-02-10] @visakanv 💜 398 🔁 38 💬 4\n│   │   Most casual players do not appear to have caught on to the true potential utility of Twitter, or perhaps they are indifferent to it. \n│   │   \n│   │   A web of tweets is a living entity that allows players to meet, interact and engage with 1000s of others *at the level of individual thoughts*.\n│   │   ↓\n│   │   1094701060462075904 [2019-02-10] @visakanv 💜 206 🔁 13\n│   │   Properly constructed, a web of tweets allows you to:\n│   │   \n│   │   - witness how other players discover your tweets, via their patterns of Likes, RTs, QTs\n│   │   \n│   │   - connect each fragmented thought and experience into a part of a greater whole\n│   │   \n│   │   - recognise and embellish patterns in your own play\n│   └── 1865972747404267803 [2024-12-09] @ultimape 💜 5\n│       @visakanv Trying to go viral is an emergent twitter puzzle game that manny people don't realize they are playing.https://t.co/7Jk8LR11EQ\n│         [Quoting Tweet 1865795808811172190 (missing)]\n├── 1094701265068740609 [2019-02-10] @nabeelqu 💜 2\n│   @visakanv I love this\n├── 1094765023489069058 [2019-02-11] @smart_intellecc 💜 9\n│   @visakanv @sonyaellenmann Are there any good Twitter speed runs?\n│   ↓\n│   1094847667903971329 [2019-02-11] @visakanv 💜 9\n│   @smart_intellecc @sonyaellenmann https://t.co/ppfLJlp0lT\n├── 1115209716484005889 [2019-04-08] @mwiik 💜 2\n│   @visakanv Interesting stuff. I would think  with hundreds of millions users that there's more than a handful doing a deep look at what's possible w/twitter, but nooooo...\n├── 1231579211443294215 [2020-02-23] @DNADecay 💜 5 🔁 1 💬 1\n│   @visakanv What are “mutuals”?\n│   \n│   Seriously - I see the term all the time and I have no idea what it means. \n│   \n│   Wrong answers only.\n├── 1262802698019106816 [2020-05-19] @OperationMoksha 💜 2\n│   @visakanv God bless this thread\n├── 1588803131118612483 [2022-11-05] @myddelton 💜 3\n│   @visakanv this is a great rabbit hole. hadn't thought of twitter in quite these ways before even though lots feels recognisable as soon as you say it out loud...and the shitposting / sermonposting / nerdposting model you drew is a memorable model! thanks 🙏🏻\n│   ↓\n│   1588803321519017984 [2022-11-05] @visakanv 💜 1\n│   @myddelton 🥰🙏🏾\n├── 1588854832190087174 [2022-11-05] @juliangough 💜 1\n│   @visakanv Ah, hadn't seen this before. Excellent guide. Thanks for re-surfacing it.\n└── 1835830213055299861 [2024-09-16] @christineist 💜 10\n    @visakanv this definitely needs to be preserved as an essay/document somewhere\n\n===\n\n1105728602027352064 [2019-03-13] @visakanv  [(SEED) type=quote_of_root]\nRT @nthd3gr33: @chimten Wanna jump in the deep end?\n\nhttps://t.co/Lm1UHdUEt7\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1106501163141066752 [2019-03-15] @visakanv 💜 37 🔁 1\nA thread by @pmarca made me start doing threads \n\nA “how to find your own tweets” reply by @ryandawidjan levelled them up\n\nA @sehurlburt tweet about asking for things inspired me to start a Patreon which has given me hundreds of dollars\n\nA @vgr curiosity led to /r/obscurePDFs\n↓\n1106502478583885824 [2019-03-15] @visakanv 💜 7\nWriting blogposts got me discovered by @dineshraju who hired me and mentored me for 5+ years\n\nI quoted @davelocity in a blogpost; he reached out and we ended up working together too\n\n @qamuri found me in a FB musician’s group I created and we’ve sold thousands of tshirts together\n↓\n1106503482750558210 [2019-03-15] @visakanv 💜 11 🔁 1\nA blogpost by @lara_hogan about celebrating milestones with donuts inspired me to do this thread to keep track of meetups with twitter friends\n\nThrough this I have met busy people like @devonzuegel and @patio11 and @jamesclear for coffee\n\n https://t.co/8XO9AQTVbK\n  [Quoting @visakanv: Meeting internet friends from around the world is always a huge highlight of my life and fills me with a lot of gratitude. Despite the wanton amounts of rampant fuckery on here, there are good, fun, kind, interesting people worth hanging out with]\n↓\n1106504365471227906 [2019-03-15] @visakanv 💜 24 🔁 1\nNever underestimate the power of being a kind friendly nerd on the Internet. It literally transformed my life, pays all my bills, helped me address my childhood issues, introduced me to 100s of amazing people, taught me music &amp; cooking, had me invited to meet my Prime Minister...\n↓\n1106505431961104384 [2019-03-15] @visakanv 💜 6\nI’m sure I’m forgetting dozens of other things, and there are dozens of opportunities still just lying in waiting. I’m just some guy tapping on a phone in Singapore and I have friends from all over the world who have offered to buy me dinner if I visit. Anybody can do this IMO https://t.co/1yIoGwJqad\n↓\n1106506117276798978 [2019-03-15] @visakanv 💜 80 🔁 11\nBasically I think lots of people treat Twitter like Call of Duty while I treat it like SimCity. Why spend time fighting with assholes when you can build nourishing relationships with friends? Assholes won’t buy you a beer and show you around their city https://t.co/bKAgQWQIUw\n  [Quoting @visakanv: you don't actually have to be swept up in outrage cycles  you can actually choose to not give in to that  which isn't to say you have to ignore it – you can use it as motivation to make something better  it's not perfect but I highly recommend it   https://t.co/JxeKGEyeEM]\n↓\n1106506545645273089 [2019-03-15] @visakanv 💜 3 [(SEED) type=quote_of_root]\n🤓 https://t.co/O7GtzLBaom\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1113213694320828417 [2019-04-02] @Malcolm_Ocean 💜 30 🔁 2\nI'm introducing @QiaochuYuan to twitter, and I'm like \"find some meta-rationality people to follow in the list of who @utotranslucence is following\", &amp; also follow @visakanv &amp; @GRITCULT to learn threading. \"Seriously, this is important for understanding the power of the medium.\"\n↓\n1113213695117623296 [2019-04-02] @Malcolm_Ocean 💜 5 [(SEED) type=quote_of_root]\nThen read this lovely doc:\n\nhttps://t.co/h6i6KFP2BZ\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1113213695914663937 [2019-04-02] @Malcolm_Ocean 💜 4\nAnd make sure to actually see the meta-threada at the bottom:\n\nhttps://t.co/zHl8iCrBrx\n  [Quoting @visakanv: Interesting conversation with a writer friend earlier about the fragmentation of information. We both agreed that fragmentation isn't actually a bad thing - what's missing &amp; needed is better threading. Twitter threads are a specific instantiation of a solution to bigger problem]\n↓\n1113213696782884864 [2019-04-02] @Malcolm_Ocean 💜 6\nAnd this thread of mine is probably overkill for your current level of understanding, but it kind of explains when you might want to quote-tweet versus retweet-&amp;-reply\n\nhttps://t.co/zhvhYI1LiY\n  [Quoting @Malcolm_Ocean: As I continue musing on how I'd design a #TwitterReplacement, I noticed that something really messy happened with a thread of mine from a month ago.  It started with this reply to @cosimia_ https://t.co/1ymCCuhjFw]\n↓\n1113213697818755072 [2019-04-02] @Malcolm_Ocean 💜 8\nAnd then—don't worry about it too much and just play with it:\n\nhttps://t.co/LdPFuTAgip\n  [Quoting @visakanv: This is actually a FANTASTIC description of a VERY natural human behavior – \"fiddle with it and see what happens\". Programmers do this. Musicians do this. All of our tools should be optimized to allow us to do this better, because it's the most natural way to make sense of things https://t.co/046fNtbxhl]\n↓\n1132412554767151104 [2019-05-25] @Malcolm_Ocean 💜 8\nWas sharing this intro thread with @Timer_22 today and found myself noting some subtle changes even just in the 7.5 weeks since I tweeted it.\n\nThe first is that it's not just @visakanv &amp; @GRITCULT that I'm seeing doing dense inter-linking now. Myself, @QiaochuYuan, @Conaw...\n↓\n1132412555589226497 [2019-05-25] @Malcolm_Ocean 💜 6\nAnd not just a few individuals, but a sense that a growing number of people are creating a more generative culture on twitter than has been seen here before. Curiosity, discussion, play!\n\nThreads on this:\n\nhttps://t.co/3xhCdLWIfF\n  [Quoting @Malcolm_Ocean: 1/ I'm reflecting on this tweetstorm I wrote a couple days ago and noticing that while I still stand by the content that's in there (and many people resonate with it) it was incomplete:  It gave only one sentence to why I'm excited about the thing! https://t.co/j8GVnBUGaU]\n↓\n1148008149426872320 [2019-07-07] @Malcolm_Ocean 💜 5\nAlso, @KevinSimler describes a general form of the thing I did here for Qiaochu\n\n&gt; Grassroots \"getting started\" programs for new Twitter users\n\nover here:\n\nhttps://t.co/hIeWwtKgvZ\n  [Quoting Tweet 1147576714282852353 (missing)]\n↓\n1148827969663598592 [2019-07-10] @Malcolm_Ocean 💜 6\nWelp, haven't even read it yet but I'm sure this thread needs a link to @visakanv's new thread about the types of threads he makes:\nhttps://t.co/lEVtg4Fcpm\n  [Quoting @visakanv: the surge of emotional energy from a venkat compliment is giving me the Useless Fellow Power I need to attempt make a thread about the different kinds of threads I make. 106am, let's do this https://t.co/Cs6XVzZoIj]\n\n===\n\n1141098573469143040 [2019-06-18] @QiaochuYuan 💜 7\nthinking about periodically creating alts in order to speedrun twitter\n↓\n1141121321092308992 [2019-06-18] @QiaochuYuan 💜 1 [(SEED) type=quote_of_root]\nhttps://t.co/G8OlueVhG2\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1162187064579805185 [2019-08-16] @visakanv  [(SEED) type=quote_of_root]\nRT @NelsonMRosario: No surprise, but @visakanv has already explored the absolute wonder that is Twitter https://t.co/IGNxXEbMIB\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1173945471267561472 [2019-09-17] @visakanv  [(SEED) type=quote_of_root]\nRT @lehoczkyescobar: @jonnym1ller this might be up your alley https://t.co/1oluPfBq4h\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1188313351475957761 [2019-10-27] @visakanv  [(SEED) type=quote_of_root]\nRT @LaFille_Etrange: A fun re-interpretation of the platform https://t.co/oAmzV1O2br\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1192905560837877760 [2019-11-08] @QiaochuYuan 💜 352 🔁 48 💬 5\ntiny twitter strategy guide\n\n🔸follow ppl whose tweets u want inside u\n🔸custom search engine for own tweets + fav others\n🔸screenshot highlights from links (cmd-shift-4 on mac)\n🔸thread threads\n🔸humor (memes, shitposts)\n🔸vulnerability\n🔸improv, not debate\n🔸goddamnit, be kind\n↓\n1192905562066866176 [2019-11-08] @QiaochuYuan 💜 36 [(SEED) type=quote_of_root]\ninspired by the king @visakanv, whose guide (which @Malcolm_Ocean showed me to intro me to twitter) i found using custom search engine \"tvv\" that searches \"from:visakanv\"; you'll be amazed at how much easier it becomes to RT tweets into a convo\n\nhttps://t.co/G8OlueVhG2\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n├── 1192905563056656384 [2019-11-08] @QiaochuYuan 💜 48 🔁 1\n│   see also @literalbanana's extremely important contribution to the twitter strategy guide literature, which i found using custom search engine \"tw\" that just searches twitter, then adding \"from:literalbanana\"\n│   \n│   https://t.co/iaZTDUop8u\n│     [Quoting Tweet 1192166853080039424 (missing)]\n│   ↓\n│   1475555456365961217 [2021-12-27] @QiaochuYuan 💜 13\n│   v2.0 https://t.co/9NQCnAXeyU\n│     [Quoting @QiaochuYuan: i have an old one-tweet guide to twitter which i still like but i am tempted to condense the “pith instructions” even more. here’s what you do to have a good time on twitter, in five words:  🔸tell the truth 🔸have fun https://t.co/rWQdmjvD8o]\n│   ↓\n│   1475969494610681856 [2021-12-28] @QiaochuYuan 💜 31 🔁 1\n│   🔸lowercase\n│   \n│   https://t.co/6r8Wjntum8\n│     [Quoting Tweet 1475962866192687108 (missing)]\n└── 1248372753444421632 [2020-04-09] @dbabbitt 💜 2\n    @QiaochuYuan @visakanv @Malcolm_Ocean How does one create a custom search engine? I swear I need one of you kids to sit me down and explain this stuff to me because I don't have the social finesse to figure it out on the fly.\n    ↓\n    1248373655123312640 [2020-04-09] @QiaochuYuan 💜 2\n    @dbabbitt @visakanv @Malcolm_Ocean in chrome it's settings -&gt; manage search engines -&gt; add and then i'll just do the visa one as an example:\n    \n    search engine: twitter visakanv\n    keyword: tvv\n    URL with %s in place of query: https://t.co/JClbFDBorA https://t.co/eDmq63ayB5\n    ├── 1248374056971198464 [2020-04-09] @QiaochuYuan 💜 1\n    │   @dbabbitt @visakanv @Malcolm_Ocean i also have a search engine with keyword tw that just searches twitter\n    │   \n    │   and one with keyword tq that searches my tweets; these two are the ones i use the most often https://t.co/LdFnPV9vdM\n    └── 1249244874387439618 [2020-04-12] @dbabbitt 💜 1\n        @QiaochuYuan @visakanv @Malcolm_Ocean Thanks! I remember (and apparently have completely forgotten about) I used to use this when it first came out.\n\n===\n\n1197813543480856576 [2019-11-22] @visakanv  [(SEED) type=quote_of_root]\nRT @LapsusLima: Excellent addition on #MetaTwitter https://t.co/nsmoVuJdxG\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1201882532469465091 [2019-12-03] @tasshinfogleman 💜 26 🔁 2\nbrag to me about a great strategic decision you made this year. i’m all ears!\n↓\n1201884537061400576 [2019-12-03] @visakanv 💜 10 [(SEED) type=semantic_search]\n@tasshinfogleman My whole twitter game\n↓\n1202010948611059712 [2019-12-03] @tasshinfogleman 💜 3\n@visakanv what specifically changed? the biggest thing i'm aware of is your in-person trip/meetups\n↓\n1202012422426357760 [2019-12-03] @visakanv 💜 3\n@tasshinfogleman - more deliberate about who I'm reaching out to\n\n- making bolder moves knowing they'll be misunderstood or misinterpreted\n\n- thinking longer-term\n\n===\n\n1249801475682787333 [2020-04-13] @QiaochuYuan 💜 49 🔁 3\nthis is a good example of the thing @visakanv talks about where people complain about the bad thing instead of doing the good thing (i forget how he said it)\n\nyou can still do the good thing, actually! nobody's stopping you! you can be the friendly internet you want to see https://t.co/yb4mQTZfot\n↓\n1249801476777492480 [2020-04-13] @QiaochuYuan 💜 21 🔁 1 💬 1\nwelcome to twitter, i'll be your guide, part 1:\n\nhttps://t.co/stTWA0dTXx\n  [Quoting @QiaochuYuan: tiny twitter strategy guide  🔸follow ppl whose tweets u want inside u 🔸custom search engine for own tweets + fav others 🔸screenshot highlights from links (cmd-shift-4 on mac) 🔸thread threads 🔸humor (memes, shitposts) 🔸vulnerability 🔸improv, not debate 🔸goddamnit, be kind]\n↓\n1249801477750534145 [2020-04-13] @QiaochuYuan 💜 11 [(SEED) type=quote_of_root]\npart 2:\n\nhttps://t.co/BILtP6Dqz9\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1260207365963407361 [2020-05-12] @visakanv  [(SEED) type=quote_of_root]\nRT @Mellow_Mizz: I predict this guide to Twitter will be forever useful https://t.co/9NwZQsZfEm\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1262137998042259457 [2020-05-17] @visakanv  [(SEED) type=quote_of_root]\nRT @visakanv: @forgingtowards @Myosynthesis 😎 https://t.co/O7GtzLBaom\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1280674871857405952 [2020-07-08] @visakanv 💜 38\n😎 I’d do it all over again, and more intensely https://t.co/zxJQxS9vE6\n  [Quoting Tweet 1280613039054614528 (missing)]\n↓\n1280675154813575168 [2020-07-08] @visakanv 💜 10 [(SEED) type=quote_of_root]\n⚡️ https://t.co/O7GtzLBaom https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1283506942036471808 [2020-07-15] @QiaochuYuan 💜 45 🔁 3\nhooooooly crap https://t.co/Ue7gya8BSj\n  [Quoting Tweet 1283499294541131776 (missing)]\n↓\n1283507885184450561 [2020-07-15] @QiaochuYuan 💜 35 💬 1 [(SEED) type=semantic_search]\nthis is the new munchkin game: what would you do if you had access to any twitter account you wanted\n\nhttps://t.co/KrbRxBsDKm\n  [Quoting Tweet 1283501429559353347 (missing)]\n├── 1283508127879458817 [2020-07-15] @QiaochuYuan 💜 17\n│   this is pretty good\n│   \n│   https://t.co/SMWpYOhURk\n│     [Quoting Tweet 1283503080978489344 (missing)]\n│   ↓\n│   1283511988035833856 [2020-07-15] @QiaochuYuan 💜 13\n│   stock market manipulation seems a lot more profitable than this BTC stuff so far\n│   \n│   https://t.co/BsefPcky7R\n│     [Quoting Tweet 1283506918963777537 (missing)]\n│   ↓\n│   1283514238548361216 [2020-07-15] @QiaochuYuan 💜 10\n│   nuts i was gonna do a twitter search to see how many accounts were posting the scam tweet but elon's at least is deleted now\n│   ↓\n│   1283516787682766848 [2020-07-15] @QiaochuYuan 💜 8\n│   word\n│   \n│   https://t.co/4MxbnRNijY\n│     [Quoting Tweet 1283508170640351232 (missing)]\n│   ├── 1283519649284370432 [2020-07-15] @QiaochuYuan 💜 7\n│   │   query for tracking\n│   │   \n│   │   it's getting flooded with people posting the address for other reasons but just saw xxxtentacion on there, wild shit\n│   │   \n│   │   https://t.co/tHDjPhKiAC\n│   │     [Quoting Tweet 1283513087564316673 (missing)]\n│   │   ↓\n│   │   1283527321077444608 [2020-07-15] @QiaochuYuan 💜 43 🔁 7\n│   │   headcanon accepted https://t.co/2wV22fsujl\n│   │   ↓\n│   │   1283528304260075520 [2020-07-15] @QiaochuYuan 💜 17\n│   │   holy crap the bluecheck query shows no bluecheck posting the address for the last 24 minutes\n│   │   \n│   │   https://t.co/2RzYgOPLua\n│   │     [Quoting Tweet 1283525543980228608 (missing)]\n│   │   ↓\n│   │   1283530804006490117 [2020-07-15] @QiaochuYuan 💜 37 🔁 5\n│   │   this is too good oh my god\n│   │   \n│   │   https://t.co/rAvgrGlGX1\n│   │     [Quoting Tweet 1283529019250499584 (missing)]\n│   │   ↓\n│   │   1283531690942423040 [2020-07-15] @QiaochuYuan 💜 17 🔁 1\n│   │   maybe i'll start collecting these https://t.co/GXD7kWPFSY\n│   │   ↓\n│   │   1283531933788430337 [2020-07-15] @QiaochuYuan 💜 12\n│   │   https://t.co/LszXepLf7i\n│   │     [Quoting Tweet 1283531012903972870 (missing)]\n│   └── 1283519886942105600 [2020-07-15] @QiaochuYuan 💜 2\n│       https://t.co/SNWU1DeGPN\n│         [Quoting Tweet 1283504158054797315 (missing)]\n├── 1283510803212058624 [2020-07-15] @QiaochuYuan 💜 10\n│   cannot believe anyone on the planet could have access to everyone's twitter account and not try to punk tr*mp in some way\n└── 1283527715795206150 [2020-07-15] @euxenus \n    @QiaochuYuan https://t.co/ki5AyD0wmN\n      [Quoting @euxenus: Imagine if the hacker just posted tweets soliciting donations for GiveWell  That's what I call Effective Altruism]\n\n===\n\n1283718372308381696 [2020-07-16] @easoncxz \nThis is how I hear about news events on Twitter: first via memes and shitposts, and only later do I figure out what is going on.\n\n\"Why can't verified accounts speak?\" https://t.co/FwD7N40idK\n  [Quoting Tweet 1283529761176850432 (missing)]\n↓\n1283718374376103936 [2020-07-16] @easoncxz \n\"What happened to the blue ticks?\" https://t.co/dOtOYQ97PF\n  [Quoting Tweet 1283546430402068482 (missing)]\n↓\n1283718376368422912 [2020-07-16] @easoncxz \n\"Apparently something about Bitcoin scamming…\" https://t.co/zsI7k7e6QD\n  [Quoting Tweet 1283522973010235392 (missing)]\n↓\n1283718378490748928 [2020-07-16] @easoncxz \nOk finally a news-article-like post: https://t.co/7MnwG0weCV\n  [Quoting Tweet 1283540820402925568 (missing)]\n↓\n1283718380176830464 [2020-07-16] @easoncxz \nAnd more shitposting about blue-checks being only able to RT but not tweet: https://t.co/GJJMtyINWy\n  [Quoting Tweet 1283528365173948416 (missing)]\n↓\n1283718382479527936 [2020-07-16] @easoncxz \nMoar shitposting https://t.co/oEH36lWjgF\n  [Quoting Tweet 1283542008817160192 (missing)]\n↓\n1283718385004503040 [2020-07-16] @easoncxz \nAnd some satire about people falling for a simple scam https://t.co/yZhrzWChol\n  [Quoting Tweet 1283514869904478211 (missing)]\n↓\n1283718389488185346 [2020-07-16] @easoncxz  [(SEED) type=quote_of_semantic_search]\nWhat would you do if you controlled lots of famous Twitter accounts? https://t.co/JG2GBXcvxa\n  [Quoting @QiaochuYuan: this is the new munchkin game: what would you do if you had access to any twitter account you wanted  https://t.co/KrbRxBsDKm]\n↓\n1283718392541843456 [2020-07-16] @easoncxz \nA list of some of the hacked blue-checks: https://t.co/LWIBwWUIT1\n  [Quoting Tweet 1283516942440001536 (missing)]\n↓\n1283718396018692096 [2020-07-16] @easoncxz \nAnd the obligatory sarcasm towards the capitalist class: https://t.co/ysDoNg34MJ\n  [Quoting Tweet 1283510105170948096 (missing)]\n↓\n1283718401022558209 [2020-07-16] @easoncxz \nOfficial Twitter address: https://t.co/ItqHYIv3Cs\n  [Quoting Tweet 1283518038445223936 (missing)]\n↓\n1283718403765616646 [2020-07-16] @easoncxz \nRumours about it being based on stealing email verification codes from the password-reset flow: https://t.co/Auppgj9aMe\n  [Quoting Tweet 1283514329187250177 (missing)]\n\n===\n\n1285728896877551618 [2020-07-22] @eigenrobot 💜 115 🔁 6\ntwitter is the worlds greatest mmo\n↓\n1285855566707875840 [2020-07-22] @visakanv 💜 11 [(SEED) type=quote_of_root]\n@eigenrobot obligatory https://t.co/O7GtzLBaom https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1289610661362728961 [2020-08-01] @visakanv  [(SEED) type=quote_of_root]\nRT @impactology: A class on appreciation of ui affordances using Twitter as an example by @visakanv \n\nhttps://t.co/qJvCLuwSN5\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1304650299714363392 [2020-09-12] @eigenrobot 💜 169 🔁 11\nif someone is trying to pick a fight with you an easy flex is complimenting them\n\na genuine compliment will simply confuse them, a fulsome-but-plausibly-deniable compliment will mog them but may make them really angry\n↓\n1304650638354046976 [2020-09-12] @eigenrobot 💜 51 🔁 1\npeople trying to pick fights with you are trying really hard to be disagreeable and when you deny them that by being gracious they instantly lose, but Good\n↓\n1304650739168419840 [2020-09-12] @eigenrobot 💜 37 🔁 2\nplus you might make a friend\n↓\n1304651917977477120 [2020-09-12] @eigenrobot 💜 37\nthe real beauty of it is not just meeting disagreeableness with affability\n\nits further that you've made something Nice, about Them, the battlefield\n\nthey COULD disagree with you (their tactical inclination) but if they do they're suddenly arguing . . . against themselves!!\n↓\n1304652966259900416 [2020-09-12] @eigenrobot 💜 66 🔁 2\nPowerful case study\n\nht @visakanv \n\nhttps://t.co/gGxl1zm1Oe\n  [Quoting Tweet 1075088494048014337 (missing)]\n↓\n1304654437026164737 [2020-09-12] @visakanv 💜 27 🔁 1\n@eigenrobot the interesting thing about this to me – is how it demonstrates that you can choose to *completely* ignore a person's statement. on the surface of it, this can seem rude, even narcissistic, &amp;it's easy to imagine how it might be bungled, but wielded artfully it's a real power move\n↓\n1304655340340826115 [2020-09-12] @visakanv 💜 24 🔁 1\n@eigenrobot I think one of my implicit assumptions as a baby conversationalist slash internet argumentarian was \"I have to address everything you put on the table\" – which is great in some contexts but it's also a \"press this to hijack my time and attention\" button\n↓\n1323730371389906945 [2020-11-03] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\n@visakanv @eigenrobot ^ yo visa I would love to have a version of your rpg strategy guide but like, one level of abstraction down, that includes stuff like this learning\n\nhttps://t.co/h6i6KFP2BZ\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1341279857150369793 [2020-12-22] @visakanv 💜 18 🔁 1 [(SEED) type=quote_of_root]\nthe funny thing about this thread is it was initially just meant to be the first tweet, as a standalone joke. then I thought I would expand the joke by remixing the wikipedia page for MUDs. then I got earnest about it, and now people are still sharing it today https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1357767665503199233 [2021-02-05] @visakanv 💜 9 [(SEED) type=quote_of_root]\namazing @strategy_rpg \n\nhttps://t.co/Zn2QbrVItr https://t.co/rn9SeZQYWa\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1408049124344168454 [2021-06-24] @visakanv  [(SEED) type=quote_of_root]\nRT @deepfates: this is still the best way to get into twitter https://t.co/d7b988t8m9\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1408447539460952074 [2021-06-25] @blisstweeting 💜 3 [(SEED) type=quote_of_root]\nI'm finally reading this and I'm not disappointed. For me, Twitter is a magic mirror — malleable and requiring great mastery. What is it for you? https://t.co/tUg049FxoO\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1408499239534145538 [2021-06-25] @exgenesis 💜 23\ncan I buy ingroup bonds?\n↓\n1408795567271022600 [2021-06-26] @visakanv 💜 9\n@ExGenesis just help people become successful and they’ll help you back\n↓\n1408796032851316736 [2021-06-26] @visakanv 💜 4\n@ExGenesis https://t.co/lft6fYHDMf\n  [Quoting @visakanv: And you can’t tax friendship https://t.co/Lv5U5ApkCQ]\n↓\n1408808828083257347 [2021-06-26] @exgenesis 💜 2 [(SEED) type=quote_of_root]\n@visakanv btw I'm sure you get this all the time but I appreciate all the workhttps://t.co/L4SBOzLTvR\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1408851736920354819 [2021-06-26] @visakanv 💜 2\n@ExGenesis 🥰🙏🏾\n\n===\n\n1440782829181280257 [2021-09-22] @Malcolm_Ocean 💜 10\nThis is a great yes/and-ing thread.\n\nIf you're thinking about playing the infinite game here on this global mindcity, you wanna check this out: https://t.co/41pxVPDPju\n  [Quoting Tweet 1438549325878112262 (missing)]\n↓\n1440782830720540674 [2021-09-22] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\nhey @visakanv we now have some provisional levels for \n\nhttps://t.co/h6i6KFxrdp\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1444169730554621963 [2021-10-02] @visakanv 💜 41\ndo you have a favorite visakanv thread? self-indulgent of me to ask, I know, but it'll help me weave together a master doc for easy reference\n├── 1444171300218441735 [2021-10-02] @QiaochuYuan 💜 8 [(SEED) type=quote_of_root]\n│   @visakanv this is the first thing that came to mind, if i had more time to search my memories i might say something else but this is pretty up there as far as impact on my life https://t.co/G8OlueVhG2\n│     [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n└── 1444171395664056321 [2021-10-02] @blisstweeting 💜 2 [(SEED) type=quote_of_root]\n    @visakanv this one jumps to mind https://t.co/tUg049FxoO\n      [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1463883262158331914 [2021-11-25] @m_ashcroft 💜 32 🔁 2 [(SEED) type=quote_of_root]\nJust recommended Visa's Twitter strategy guide to another friend so why not signal boost it again https://t.co/bv8gZPBemG\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1467090668874964992 [2021-12-04] @visakanv 💜 138 🔁 5 💬 2\nslowly increasing the # of tweets I have literally hotkeyed https://t.co/l9T9Hu2Q5O\n↓\n1467091226662821888 [2021-12-04] @visakanv 💜 8\nvvfaqs https://t.co/9oY3HEZbhG\n  [Quoting @visakanv: Questions I Keep Getting About My Threads, The Thread https://t.co/R35zlQme2Q]\n↓\n1467091249706373123 [2021-12-04] @visakanv 💜 13\nvvmemex https://t.co/wxOAVmtvgG\n  [Quoting @visakanv: latest version  some people have asked for a PDF (idk why, but ok) you can have that one here: https://t.co/SY3Oi82hF5 https://t.co/fKBnf7btzs]\n↓\n1467091292203061252 [2021-12-04] @visakanv 💜 12\ncardsright https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1467091320816619523 [2021-12-04] @visakanv 💜 18\nayylmao https://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1467091496981598209 [2021-12-04] @visakanv 💜 8 [(SEED) type=quote_of_root]\ntxtrpg https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n├── 1467092358940348417 [2021-12-04] @visakanv 💜 10\n│   wifemanaged https://t.co/GlLF8aRusy\n│     [Quoting @visakanv: me: I love you  wife: how much  me: why this obsession with quantification   wife: what gets measured gets managed]\n│   ↓\n│   1467092944049954816 [2021-12-04] @visakanv 💜 8\n│   mvpmodel https://t.co/PGGQhIksya\n│     [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n│   ↓\n│   1467093228818034689 [2021-12-04] @visakanv 💜 10\n│   kneelbeforezod https://t.co/ZQ7JbXSJVD\n│     [Quoting @visakanv: https://t.co/EzaHMVnlUT]\n│   ├── 1467093758621609993 [2021-12-04] @visakanv 💜 4\n│   │   friendsbook https://t.co/EEnPgdIJLB\n│   │     [Quoting @visakanv: This is a huge part of the premise of my book... man I could probably write my book entirely out of my friends’ tweets https://t.co/7oIPeY7tVL]\n│   │   ↓\n│   │   1467094065199992832 [2021-12-04] @visakanv 💜 3\n│   │   goodreplygame https://t.co/9Fzs72xbgl\n│   │     [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n│   │   ↓\n│   │   1467094271492644864 [2021-12-04] @visakanv 💜 6\n│   │   survivorbias https://t.co/tnB88b86kC\n│   │     [Quoting @visakanv: the big lesson of survivor bias is that you should optimize for being a survivor]\n│   │   ↓\n│   │   1467094883483541507 [2021-12-04] @visakanv 💜 8\n│   │   focusmoreof https://t.co/tFaWtEZM1p\n│   │     [Quoting @visakanv: focus your time and energy on what you want to see more of]\n│   │   ├── 1467095246471196674 [2021-12-04] @visakanv 💜 8\n│   │   │   uxdegraded https://t.co/r7X1AFoy6F\n│   │   │     [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n│   │   │   ↓\n│   │   │   1467095369074962434 [2021-12-04] @visakanv 💜 8\n│   │   │   shittychoices https://t.co/LqS4F1JWlb\n│   │   │     [Quoting @visakanv: @MsHortonTweets people don't wanna make better choices, they wanna make shitty choices and then complain about the shitty outcomes]\n│   │   │   ↓\n│   │   │   1467095610218082304 [2021-12-04] @visakanv 💜 4\n│   │   │   fidgetyboi https://t.co/hX0Jcpet5m\n│   │   │     [Quoting @visakanv: are you also a fidgety boi? you may be interested in my draft notes for Constructive ADHD:  https://t.co/e0Q0Z661CJ]\n│   │   └── 1467096181889142784 [2021-12-04] @sharanvkaur 💜 15\n│   │       @visakanv have u tried ‘shipbook’|———————————————||    INTROSPECT out next week!     ||———————————————|\n│   │       ↓\n│   │       1467097050827595780 [2021-12-04] @visakanv 💜 9\n│   │       @sharanvkaur wifeass https://t.co/GLE0e3mwLM\n│   │         [Quoting @visakanv: no hater or critic has ever kicked my ass harder than my wife does while she quietly giggles to herself https://t.co/osNmv8VPg4]\n│   └── 1468333320228454400 [2021-12-07] @strangestloop 💜 1\n│       @visakanv excellent\n└── 1468094767749754881 [2021-12-07] @Malcolm_Ocean 💜 2\n    @visakanv just queried for this tweet using `twv txtrpg`\n    ↓\n    1468095785564844032 [2021-12-07] @strangestloop \n    @Malcolm_Ocean @visakanv just queried for this tweet using `twmal twv txtrpg`\n\n===\n\n1477880846300418053 [2022-01-03] @cxgonzalez 💜 2 [(SEED) type=quote_of_root]\nreread this thread but think metaverse the whole time https://t.co/JTzVO3nRbC\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1484418475237928961 [2022-01-21] @Malcolm_Ocean 💜 4 [(SEED) type=semantic_search]\n@hasgotmoves also check out this guide to twitter:\n\nhttps://t.co/UbSaQcVfjp\n├── 1484420302796775426 [2022-01-21] @Malcolm_Ocean 💜 1\n│   @hasgotmoves In particular also I think this thread would be a good place to start on a couple levels of abstraction. Will help you understand threading and will be of interest!\n│   \n│   https://t.co/HUMOKJuqtq\n│     [Quoting @m_ashcroft: 1/ This is a thread on things I've written about Alexander Technique. I will expand it as I write more things.  https://t.co/hq7gk6EBmB]\n│   ↓\n│   1484447574253715456 [2022-01-21] @Malcolm_Ocean 💜 2\n│   @hasgotmoves - also a thread talking really big picture about crypto\n│   \n│   https://t.co/hnfZl8rIvp\n│     [Quoting Tweet 1483124807054938112 (missing)]\n└── 1484453234517422082 [2022-01-21] @strangestloop 💜 2\n    @Malcolm_Ocean @hasgotmoves good to see people Just Having Fun too\n    https://t.co/dCTHW6uq1f\n      [Quoting Tweet 1383165650110136322 (missing)]\n\n===\n\n1510679270506770432 [2022-04-03] @visakanv  [(SEED) type=quote_of_root]\nRT @prerationalist: @OneEyedAlpaca @SeanMombo have u seen the strategy guide yet?\n\nhttps://t.co/8Ln1gEHtoN\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1534168492865425408 [2022-06-07] @RichDecibels 💜 489 🔁 66 💬 3\nTwitter Is A Dating App For Making Friends\n\nhere's some ideas about how to have fun on twitter dot com\n\n(this is the thread I will send to people on their first day here)\n↓\n1534168494509522944 [2022-06-07] @RichDecibels 💜 133 💬 1\nfirst: tweet a lot\n\nthere are no bad tweets. you are a hose, so gush!\n\nlet yourself flow &amp; the algorithm will be your editor (posts that your followers find interesting are automatically promoted &amp; the rest are demoted)\n↓\n1534168496292220928 [2022-06-07] @RichDecibels 💜 158 🔁 3\nreply a lot\n\nconsider yourself invited into every conversation. if you want to make friends you have to visit other people's parties \n\nlarge account = dinner party host\nsmol account = be the kind of guest that gets invited back\n↓\n1534168497898528770 [2022-06-07] @RichDecibels 💜 85 🔁 1\nfollow a lot of people\n\nat first, follow anyone that seems vaguely interesting. later on, prune out the ones that don't spark joy\n\nyou can start with this list of people I find fun &amp; friendly:\n\nhttps://t.co/KnCCyK3oKI\n\ndon't follow celebs/brands bc they are not seeking friends\n↓\n1534168729604571137 [2022-06-07] @RichDecibels 💜 73 🔁 3 [(SEED) type=quote_of_root]\nread Visa's twitter strategy guide to learn what other games you can play here\n\nhttps://t.co/vU2pKBV4S4\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1534169039613878273 [2022-06-07] @RichDecibels 💜 146 🔁 6 💬 1\nTWITTER IS A DATING APP FOR MAKING FRIENDS\n\nthe usual flow looks like this:\n\n1. reply to each other a bunch\n2. follow each other (\"mutuals\")\n3. private messages (DM = direct message or gc = group chat)\n4. video call\n5. local meetup\n6. make babies/start a cult\n├── 1534169557690159105 [2022-06-07] @RichDecibels 💜 98 🔁 6\n│   mute or block unfriendly people\n│   \n│   mute = you won't see them anymore\n│   block = they won't see you either\n│   \n│   don't hesitate to use these great features! a tiny fraction of twitter users are mean. with one click you can be rid of them forever. don't think twice, just do it\n│   ↓\n│   1534170070859014144 [2022-06-07] @RichDecibels 💜 115 🔁 4\n│   opt out of the culture war\n│   \n│   polarised political arguments is twitters most popular and least fun game. don't play!\n│   \n│   mute words that you don't want to see (eg I mute words like \"gun control\" \"biden\" \"cops\")\n│   ↓\n│   1534170190770061312 [2022-06-07] @RichDecibels 💜 84 🔁 2\n│   you can make money on twitter without being annoying:\n│   \n│   1. have a buy now button 1 click away (link in yr bio or pinned tweet)\n│   2. collect email addresses so you can take your audience with you one day (eg substack)\n│   3. occasionally talk about the thing you sell when it is relevant\n│   ↓\n│   1636257945297068041 [2023-03-16] @RichDecibels 💜 9\n│   here's an excellent conversation about how you can use twitter to make friends, build a business, and follow your spiritual path all at the same time\n│   \n│   https://t.co/1woFO4x2t9\n│     [Quoting Tweet 1636069500427567105 (missing)]\n└── 1534566375204835330 [2022-06-08] @camino_delsol_ 💜 1\n    @RichDecibels 6. 🫣🤣🤣🤣🤣\n\n===\n\n1543284713271730176 [2022-07-02] @visakanv 💜 52\nindulge me? 🤓🙏🏾 which of my tweets/threads do you have saved, reference, etc? i'm making yet another list\n↓\n1543287507021959168 [2022-07-02] @IgorBrigadir 💜 1 [(SEED) type=quote_of_root]\n@visakanv #1 i link other people to is definitely https://t.co/ku8KAUXikr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1552024372684242944 [2022-07-26] @grin_io 💜 11\nmy wife's thinking of joining twitter and im collecting the best intro material on how to make friends online and get the most out of this place. please halp!\n\nshow me your fav \"aha\" tweets/threads/links that changed the way you play the game\n↓\n1552024687458254862 [2022-07-26] @grin_io \nstart here. no twitter knowledge required\n\nhttps://t.co/iCQeuFtAzY\n↓\n1552024751174025218 [2022-07-26] @grin_io 💜 1 [(SEED) type=quote_of_root]\nhttps://t.co/j1BmjcN2Wg\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1552024819117555712 [2022-07-26] @grin_io 💜 1\nhttps://t.co/CMdXLDq8Si\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1552025321125416966 [2022-07-26] @grin_io 💜 8 🔁 1\nfair warning: there's gonna be a lot of visa in this thread\n\npersonally i if i could keep just one tweet in mind at all times, it would be this one\n\nhttps://t.co/Sh81zEp7vW\n  [Quoting @visakanv: if you’re spending lots of time on social media, you’re either   1. building nourishing relationships with people who care about you 2. grifting off of suckers 3. a sucker  very sad to see suckers being swept up by grifters *at the expense of their relationships* https://t.co/OpvQDarFCR]\n↓\n1552026014364188672 [2022-07-26] @grin_io 💜 4\nmany have walked this exciting path\n\nhttps://t.co/ffyODnMt2I\n  [Quoting Tweet 1475531864337096711 (missing)]\n↓\n1552030202284449795 [2022-07-26] @grin_io 💜 1\nmaking friends online is easier than IRL because you can google them\n\nhttps://t.co/tKzNO6ffs0\n  [Quoting @visakanv: thinking about what stood out in this conversation – the idea that it's easier to make friends with strangers online than with strangers on the street, bc you can see a person's body of work – their tweets, their website, etc – and infer a lot about them https://t.co/RwyauA2vmI]\n\n===\n\n1566765773292552193 [2022-09-05] @the_wilderless 💜 12 🔁 2\nI know I’ve seen some decent Twitter Etiquette guides around here from a couple of you, anyone care to link? https://t.co/U050m8K6Y8\n  [Quoting Tweet 1566764817548967936 (missing)]\n↓\n1566766048535126017 [2022-09-05] @m_ashcroft 💜 6\n@the_wilderless https://t.co/frdcBiRO8E\n  [Quoting @QiaochuYuan: welcome to twitter, i'll be your guide, part 1:  https://t.co/stTWA0dTXx]\n↓\n1566766175995867136 [2022-09-05] @m_ashcroft 💜 6 [(SEED) type=quote_of_root]\n@the_wilderless https://t.co/hrQ7IXeEIK\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1578612445077155842 [2022-10-08] @the_wilderless 💜 32 🔁 2\nGooooood morning, new followers\n\nTo save everyone some time—if you haven’t been around my corner of Twitter before, I wanna share some gestures toward our etiquette around these here parts\n↓\n1578612539658625024 [2022-10-08] @the_wilderless 💜 4\nThere’s some great stuff in the replies down here, https://t.co/MdZNSSLMlu\n  [Quoting @the_wilderless: I know I’ve seen some decent Twitter Etiquette guides around here from a couple of you, anyone care to link? https://t.co/U050m8K6Y8]\n↓\n1578612657779007490 [2022-10-08] @the_wilderless 💜 5 [(SEED) type=quote_of_root]\nA classic of the genre https://t.co/BFwEjeSJOt\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1578612979351683073 [2022-10-08] @the_wilderless 💜 6\n“Goddamnit be kind” https://t.co/iGYLCJVoSM\n  [Quoting @QiaochuYuan: tiny twitter strategy guide  🔸follow ppl whose tweets u want inside u 🔸custom search engine for own tweets + fav others 🔸screenshot highlights from links (cmd-shift-4 on mac) 🔸thread threads 🔸humor (memes, shitposts) 🔸vulnerability 🔸improv, not debate 🔸goddamnit, be kind]\n↓\n1578613204120268800 [2022-10-08] @the_wilderless 💜 6 🔁 1\nmaking friends and having fun, https://t.co/gCZsc97TMW\n  [Quoting @RichDecibels: Twitter Is A Dating App For Making Friends  here's some ideas about how to have fun on twitter dot com  (this is the thread I will send to people on their first day here)]\n↓\n1578613360450449408 [2022-10-08] @the_wilderless 💜 10\nAnd my own contribution https://t.co/hOXiViFPfD\n  [Quoting @the_wilderless: When replying, assume OP isn’t an idiot and has a steelman version of the idea in their head, even if the tweet doesn’t fully express it  Either respond to that steelman, or help to express it  Don’t just reply to a dumb version of the idea as if that’s what they’re saying]\n\n===\n\n1582240166382473216 [2022-10-18] @christineist 💜 22 🔁 2\nwhat is your favorite thread EVER from these parts (collecting for a project)\n↓\n1582240984473051137 [2022-10-18] @zencephalon 💜 8 [(SEED) type=quote_of_root]\n@christineist The one that started it all for me here: https://t.co/j8Gg4h9dzT\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1582301711082799106 [2022-10-18] @IgorBrigadir 💜 2\n@zencephalon @christineist Yep, was gonna post that one too.\n\n===\n\n1583978643529035776 [2022-10-23] @TylerAlterman 💜 13\nMy friend @lizasimonova is learning how to Twitter what do you teach her?\n↓\n1583994150977839105 [2022-10-23] @lukeallenmiller 💜 4 [(SEED) type=quote_of_root]\n@TylerAlterman @lizasimonova I would share this with her: https://t.co/6X36RcNHPp\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1584099804438999040 [2022-10-23] @TylerAlterman 💜 2\n@lukeallenmiller @lizasimonova I would study this game as well as Streetfighter to figure out what the boys like\n\n===\n\n1588790053316481025 [2022-11-05] @visakanv 💜 118 🔁 4\nprobably true for the majority of people but fwiw mine has been getting better each year https://t.co/m810Rd5yCo\n  [Quoting Tweet 1588651799569129472 (missing)]\n↓\n1588790822652514304 [2022-11-05] @visakanv 💜 35 [(SEED) type=quote_of_root]\nif you're smart and you look at your own tweets and you think about the implications and second-order effects you should be able to figure out why your experience has been getting worse\n\nif you need some hints:\n\nhttps://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1588792730733654017 [2022-11-05] @visakanv 💜 45 🔁 2\nunfortunately most people would prefer to keep posting things that make things worse for them, than investigate their own behavior and make changes in alignment with what they want\n\nfortunately no individual needs to associate with Most People https://t.co/LqS4F225zj\n  [Quoting @visakanv: @MsHortonTweets people don't wanna make better choices, they wanna make shitty choices and then complain about the shitty outcomes]\n↓\n1588792990226874369 [2022-11-05] @visakanv 💜 30 🔁 3\nmost people, when given a magic mirror, will use it to harm themselves\n\n===\n\n1598395388230217729 [2022-12-01] @IaimforGOAT \nI'll write this thread to try to show people that they probably should spend some/more time on twitter.\n\n===\n\n1598395400854962177 [2022-12-01] @IaimforGOAT \n(This culture shock is usually seen in the \"verified vs non-verified\" and the \"face pfp vs anon pfp\" clusters)\n↓\n1598395403258327040 [2022-12-01] @IaimforGOAT \nDue to the low friction in breaking the walls of the cluster of groups, twitter is considered the digital town square. I don't know any other social networks that does it as well.\n↓\n1598395405753950208 [2022-12-01] @IaimforGOAT \nThis allows you to dip in several micro cultures / clusters of people, sometimes these are named but most of the times they aren't.\n↓\n1598395408195067904 [2022-12-01] @IaimforGOAT \nYou are free to enter any micro culture, all you need to do is follow some of the people in that cluster and figure out how they work, their values, their lingo, their lore, etc. Some don't even need all this and are very open to get to know who you are!\n↓\n1598395410766188544 [2022-12-01] @IaimforGOAT \nSometimes you find people that are already very close to you in all those dimensions but you haven't cross paths yet. On Twitter the algorithm helps you out finding each other.\n↓\n1598395413333102593 [2022-12-01] @IaimforGOAT \nWhen many people start getting into those clusters, some name starts to emerge to refer to it. There's CT Twitter (crypto twitter) FinTech Twitter (self-explanatory), TPOT(it's... complicated, more often than not they are cool &amp; friendly people tho), and hundreds/thousands more\n↓\n1598395415912595456 [2022-12-01] @IaimforGOAT \nExploring these clusters ─ both in breadth and in depth ─ is part of the fun of Twitter.\n↓\n1598395418374643718 [2022-12-01] @IaimforGOAT \nYou can move in and out of these clusters, how YOU use twitter is the unique way of interacting! Twitting is an act of self-expression.\n\nIf you are consistent and give it time, you'll attract more of what you are putting out there so https://t.co/yX11dPHLHC\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1598395421138685952 [2022-12-01] @IaimforGOAT \nTwitter is a big part of the Global Social Computer in the Cloud https://t.co/8pkd80lnE0\n  [Quoting Tweet 1125122401086214144 (missing)]\n↓\n1598395423902687232 [2022-12-01] @IaimforGOAT 💜 2 🔁 1\nTwitter is the best open world MMORPG of all time. https://t.co/qlJuHMZfsI\n  [Quoting Tweet 1584956611361091584 (missing)]\n↓\n1598395426498965504 [2022-12-01] @IaimforGOAT  [(SEED) type=quote_of_root]\nSo if you are starting, grab a guide and start exploring! :)\n\nPick some roles, explore them, prune the ones that don't work, have fun, repeat! https://t.co/wMlIjMzj3b\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1598395429414207508 [2022-12-01] @IaimforGOAT \nSo, this might've not convinced you yet, right? Who the hell is this guy anyway?! He is just some random anon ( 😏 )\n\nAnd yeah, you are right! There's a skill which is to identify if a random anon can provide value or not, you'll develop it if you decide to play this game!\n↓\n1598395432131969025 [2022-12-01] @IaimforGOAT \nMeanwhile, let me try to loan some tweets to convince you of Twitter value.\n↓\n1598395434568802305 [2022-12-01] @IaimforGOAT \nYou see, twitter has a search function which is not that good but works most of the time... So, if you follow cool people you can search what they have said before using this feature in the text 'filter:follows' and adding some text to it like 'twitter is the best'\n↓\n1598395437483847680 [2022-12-01] @IaimforGOAT \nhttps://t.co/wlywoSW8DX\n  [Quoting @nosilverv: Twitter is the best networking website in the world. If you are what you claim to be then your tweets will function as proof-of-work making the right people follow you opening up a direct channel to them via DMs.]\n↓\n1598395441049206800 [2022-12-01] @IaimforGOAT \nhttps://t.co/oqAOtE4qoy\n  [Quoting @visakanv: like, i honestly think twitter is close to the best use of my time, which is why I'm here so much. I enjoy it. if I felt twitter is bad for you, I wouldn't be on twitter advocating that we should get off twitter, I would simply not be on twitter]\n↓\n1598395444022767616 [2022-12-01] @IaimforGOAT \nhttps://t.co/E5xNINnIPB\n  [Quoting @nosilverv: The best in real time public thinking on the internet is being done on twitter by people with anime avatars and i couldn't be happier lol]\n↓\n1598395446845587456 [2022-12-01] @IaimforGOAT \nhttps://t.co/dYIT8kQEO1\n  [Quoting @visakanv: twitter has both the best and worst content in the world  like imagine you’re walking along a fair, and at one booth is the actual goddess Athena, and at the next booth is some crusty pervert covered in dried cum and Cheeto dust, replying to e-girls  and both have 220 followers]\n↓\n1598395449680896001 [2022-12-01] @IaimforGOAT \nhttps://t.co/N0L80NToNo\n  [Quoting Tweet 1495207409173864456 (missing)]\n↓\n1598395452356890625 [2022-12-01] @IaimforGOAT \nhttps://t.co/nXialKSRjR\n  [Quoting Tweet 1495207701760069638 (missing)]\n↓\n1598395455108304899 [2022-12-01] @IaimforGOAT \nhttps://t.co/ywbVmz2EmM\n  [Quoting @visakanv: twitter is one of the best places to \"have\" a scene, but all of us who are already here tend to underestimate how confusing it is to people who maybe signed up a decade ago and mostly think of it as a sort of text content stream to follow celebrities on]\n\n===\n\n1598476722315603968 [2022-12-02] @visakanv 💜 41 🔁 2\nhonestly you can already see this on twitter over the past 10 years so that will probably accelerate more/faster https://t.co/nXFOEBQAxj\n  [Quoting Tweet 1598452269254692885 (missing)]\n↓\n1598477687643066368 [2022-12-02] @visakanv 💜 2 [(SEED) type=quote_of_root]\nhttps://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1604548151486156806 [2022-12-18] @ultimape 💜 21 🔁 2\nI will be deleting my account here soon because of this policy. This is ridiculous. https://t.co/C0pnCq8t5Z\n  [Quoting Tweet 1604531272226832387 (missing)]\n\n===\n\n1801442759162703982 [2024-06-14] @ultimape 💜 2\nHiding likes is hiding reputation and damaging the signaling goods that we use to communicate our attention with.https://t.co/lwaNZXAvaL\n  [Quoting Tweet 1692431667548528661 (missing)]\n↓\n1801443387028979868 [2024-06-14] @ultimape 💜 1\nDestroying humanity's collective consciousness from being able to see what other's think? Great idea Elon. /shttps://t.co/9gHLkYKz2X\n  [Quoting @ultimape: @parafactual A different frame: thinking about lack of negative signaling (used by ant and bee colonies as part of their voting mechanisms). Twitter becomes arbiter over speech by inherent manipulation of feeds in an adversarial relationship w/ user's attention.https://t.co/JebB4199s1]\n↓\n1801443501365764107 [2024-06-14] @ultimape \nIdiot.https://t.co/OPxpPnoDJr\n  [Quoting @ultimape: @parafactual Negative signaling behavior AFAICT is how swarms self-police against virulent memes. This isn't really facilitated well on twitter. And the incentives are for more engagement to get advertisers (forced viral for $$$), so why would they?]\n↓\n1801443754097705176 [2024-06-14] @ultimape \nFool.https://t.co/hCt647KTX2\n  [Quoting @ultimape: @BonbonFork @Plinz @sonyasupposedly Policing behavior ('negative signaling') seems to be normal among complex societies, tho it shows up among ants more often.https://t.co/aAkHddZORnBut we found it in bees as wellhttps://t.co/6GLu6BgHaJI suspect more common than recognized.]\n↓\n1801443982221730198 [2024-06-14] @ultimape \nDimwit.https://t.co/zRW7usOBLU\n  [Quoting @ultimape: \"some scientists now think our brains might actually work in the same way\"https://t.co/m8zQNeVoqN]\n↓\n1801448948604793176 [2024-06-14] @ultimape 💜 1\nI still remember when likes were favorites. they were ⭐️s not hearts.https://t.co/DgjmsBVcT3\n  [Quoting Tweet 1601389152917782529 (missing)]\n↓\n1801448976337571972 [2024-06-14] @ultimape 💜 1\nMad.https://t.co/82ihQB2MmU\n  [Quoting @ultimape: Remember when twitter chose to change⭐️(favorite) into ❤️(like) and regular users were saying that this change is going to cause confusion in the userbase?Then started showing 'likes' in feed to boost engagement. And now everyone is mad?Me neither.https://t.co/wPZElzayuM]\n↓\n1801449171183907256 [2024-06-14] @ultimape \nAngry.https://t.co/jXOoENFOnD\n  [Quoting @ultimape: Everybody I've introduced to twitter thinks it's trash and stopped coming.So I am acting as vector of insight porn for newbs in hopes that they'll follow people like @visakanv or @desantis &amp; bootstrap a network of people using twitter as external brain. https://t.co/pEmup2hfol]\n↓\n1801450117972570525 [2024-06-14] @ultimape \nGet ratioed.https://t.co/K0tNeXCjSC\n  [Quoting @ultimape: I've been gaming the \"likes are stochastic retweets\" for a while now.Your friends of friends are getting fed my ideas just by you following me. I am parasiting off of ranking &amp; engagement systems built to make brand managers feel like they matter.https://t.co/exteoBwP3t]\n↓\n1802846034772754518 [2024-06-17] @ultimape 💜 1\nCant search my account anymore. Free speech platform my ass.https://t.co/VXK5EBTvp3 https://t.co/2VYqEHUpy7\n  [Quoting @ultimape: We're all going to fucking diehttps://t.co/AYAM0n8xxn]\n↓\n1809986326865051854 [2024-07-07] @ultimape  [(SEED) type=quote_of_root]\ns/twitter/bluesky/https://t.co/e0rdmOo3br\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1828540662754705645 [2024-08-27] @ultimape 💜 1\nLooks like I can't make posts anymore. Going back to bluesky. Fuck you X.https://t.co/HCXh8Spt6x\n  [Quoting @ultimape: My account is not automated FFS. I haven't used any automated tools to manage my twitter presence since I stopped using buffer years ago.]\n↓\n1828543537752809904 [2024-08-27] @ultimape \nI am not automated. https://t.co/xHDYRsotxM\n↓\n1828785763074634155 [2024-08-28] @ultimape \nCan't use search now. So frustrating.\n↓\n1828786957776027893 [2024-08-28] @ultimape \nBlocking isn't real and can't hurt you. https://t.co/CRoULInbNn\n↓\n1828787119923605625 [2024-08-28] @ultimape 💜 1\nWhy is twitter so broken? I don't even have to do anything and I find bugs.\n↓\n1833221349185360258 [2024-09-09] @ultimape \nLMAO. I literally can't post links off site anymore.I have my phone in there and have had it in there for years now. What the fucking. https://t.co/9ifFEl1Dxw\n↓\n1833221376368378221 [2024-09-09] @ultimape \nhttps://t.co/1aRlOb1Hwj\n  [Quoting @ultimape: haha. Ok... what?Twitter has my phone number!https://t.co/VZGh84L1l3 https://t.co/7HacobWDOF]\n↓\n1833222350906789978 [2024-09-09] @ultimape \nfuck you very much https://t.co/KWvm9eretT\n↓\n1833223241491472737 [2024-09-09] @ultimape \nYour shit ass platform just sent me a text to my fucking phone to give me the verification code to backup my account.\n↓\n1840175931609981384 [2024-09-28] @ultimape 💜 1\nCan't see my replies on other people's comments now. Good.I didn't want to read the entire thing I wrote about placebo anyway.\n\n===\n\n1609991013099241472 [2023-01-02] @visakanv 💜 96 🔁 9 💬 1\nyou can scroll past a thing and not talk about it https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1609996338414112768 [2023-01-02] @visakanv 💜 42 🔁 1 [(SEED) type=quote_of_root]\nit's worth doing an inventory of all of your utterances and asking yourself how they are serving you, what outcomes they are leading to, and whether those are outcomes you like\n\nit's worth being deliberate about this because it can reshape your reality\n\nhttps://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1609996690844700673 [2023-01-02] @visakanv 💜 41 🔁 5\nyour attention is currency. what are you choosing to spend it on? why? what are you sharing with your peers? why? how do you see it playing out over the next year, 5 years, 10 years? what sort of life do you want for yourself?\n\n===\n\n1647516371138519041 [2023-04-16] @visakanv 💜 169 🔁 12\nthere's more to this than i thought when i first wrote it.  it applies not just to an individual trying to get some work done, but to the work itself, too https://t.co/5ujbUyyqR0\n  [Quoting @visakanv: sometimes people think their bottleneck is time but it’s actually the absence of a supportive context]\n↓\n1647517072149344258 [2023-04-16] @visakanv 💜 31\nthere are ways in which i want to help people, but I don't want to proclaim from my own soapbox \"i want to help people!\" – there's something awkward and overexposed about that. it turns out that one of the best ways to make progress on this is to tell friends to send ppl my way\n↓\n1647517286037860354 [2023-04-16] @visakanv 💜 18\nit allows me to keep the ratios right https://t.co/hcUXl1PJAU\n  [Quoting @visakanv: after a talk I gave at @Prigoose’s last Sunday dinner, someone came up to me and improved my own understanding of my ideas in this space – it hadn’t quite occurred to me to talk about the *ratios* of people. If you maintain the right ratio, you can grow better than if you don’t…]\n↓\n1647517839681818626 [2023-04-16] @visakanv 💜 38 🔁 2\none of the best things about a scene of twitter friends is that people can use each other's tweets as setups. we might write threads in replies to each other, or use someone's tweet as a jumping off point. all of this helps make our writing people-shaped https://t.co/xYia1MZiWe\n  [Quoting @visakanv: whenever I try to put together some kind of “master resource” it almost always ends up being overwrought and tedious  when I write something like a personal recommendation doc for a friend, it almost always ends up being useful for other people and way easier to share too]\n↓\n1647518032577847300 [2023-04-16] @visakanv 💜 29\nyou can do this on your own, and/or with strangers, I used to, but it's a very weird thing to do. it gets way easier when you have the supportive context of even a couple other people who get what you're doing\n↓\n1647518469523636224 [2023-04-16] @visakanv 💜 32 🔁 1\ni've been helping dozens of people with their creative process over the past year, and if I had to summarize all of it into a single sentence, it's something like \"you and your work are not correctly positioned to receive the support it needs to flourish, lets fix that\"\n↓\n1647519654536183809 [2023-04-16] @visakanv 💜 32 🔁 1\noh hmmm a bunch of the status that i have is actually me being rewarded by people for attempting the weird thing and sticking with it. as mark manson elegantly put it, you have to be contrarian, right, and follow through https://t.co/DK2WC8qqjz\n↓\n1647520435494617089 [2023-04-16] @visakanv 💜 29 [(SEED) type=quote_of_root]\nmy 1-2-3 here is that I believe twitter is a land of great opportunity, and that if you sidestep all of the tedious day-to-day nonsense, focus on what you want to see more of, practice good reply game, build elaborate webs of 100,000+ tweets, you win\n\nhttps://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1647521106625191937 [2023-04-16] @visakanv 💜 24 🔁 2\nif this place burns down, we'll have to start over, which will be annoying, but not unsurvivable. we already have the most valuable thing, more valuable than any tool or platform or app: each other\n↓\n1647521418140356608 [2023-04-16] @visakanv 💜 29 🔁 1\nsome of the fair-weather audience might disappear but we were never doing any of this for them. my collaborators will find me, and if we have to start over we will do it with feverish passion that will draw even more people to us wherever we do it\n↓\n1647521614727385088 [2023-04-16] @visakanv 💜 34 🔁 3 💬 1\nas long as i'm alive i cannot lose https://t.co/qN3PiWJu3X\n\n===\n\n1649096424645349379 [2023-04-20] @QiaochuYuan 💜 100 🔁 8\ni am still very interested in this question of why some of my amazing friends with valuable things to say instantly thrive on twitter while for others every tweet is a struggle. after seeing a few more cases there seem to be more potential blocks in play than i'd thought https://t.co/AIiDVDkMC3\n  [Quoting @QiaochuYuan: there's a sort of unusual skill that i think you maybe need to really thrive on twitter which is something like the ability to both send and receive detailed vibes through text. probably developed by chatting online a lot as a kid? (for me it was MSN messenger + forums)]\n\n===\n\n1649096427149336577 [2023-04-20] @QiaochuYuan 💜 25\nit's hard to cultivate this sense until you've interacted with accounts you like enough. and also some people seem to have a hard time with this diffuse sense of audience and really seem to need to know *exactly* who they're writing to in order to write\n↓\n1649096428168564738 [2023-04-20] @QiaochuYuan 💜 19\nfor such people a suggestion might be to try writing tweets addressed to specific people (who may not necessarily need to be named in the tweet)\n\nhttps://t.co/rrR6TA0bzT\n  [Quoting @visakanv: this is part of how scenes work. a group of friends each lists out all (or even some) of the ideas they have, and then ask/challenge each other to write them, for each other. writing for a specific someone is always easier (and juicier!) than writing for a vague everyone]\n↓\n1649096429808549889 [2023-04-20] @QiaochuYuan 💜 19\none thing you need to pick up on about how twitter specifically works is that tweets, by virtue of RTs, QTs, and likes, *create their own audience*. you have a lot of control over who sees a tweet based on how you pitch it\n\nhttps://t.co/QGV0VDK8bo\n  [Quoting @QiaochuYuan: this sparked a useful thought for me about twitter:   in normal conversation utterances happen in a fixed context, namely the conversation, with its fixed (in that moment) collection of participants, etc.   on twitter tweets *create their own context* by being liked, RT'd, QT'd https://t.co/GU81NnL4C1]\n↓\n1649096431612100608 [2023-04-20] @QiaochuYuan 💜 18\nthere's also a specific way you need to learn how to pitch tweets so that they get RTs and QTs at all to reach a wider audience. you don't need to get growth hacky about it, it's more like there's a specific flavor to the currents of twitter and you have to learn how to surf them\n↓\n1649096432736141314 [2023-04-20] @QiaochuYuan 💜 17 🔁 1\na two-pronged recommendation:\n\n * tweet a bunch of different stuff in a bunch of different voices and styles (including replies) until you start getting RTs and QTs at all\n\n * pay attention to your favorite accounts and which tweets of theirs get RTs and QTs, and why\n↓\n1649096433893777408 [2023-04-20] @QiaochuYuan 💜 27 🔁 2\none of the magical things you learn from writing on twitter is that you can write stuff that is just you talking to yourself out loud and it can be surprisingly relevant to *other people*. your tweets inevitably have a specific energy and draw other people with that energy\n↓\n1649096434912997376 [2023-04-20] @QiaochuYuan 💜 17\na lot of what keeps me going with twitter is having received variations of the following feedback repeatedly over the years: \"dude i have felt this thing for years but never have i seen anyone put it into words until you did, thank you\"\n↓\n1649096436636872709 [2023-04-20] @QiaochuYuan 💜 30\ni believe most people (almost all?) live much richer lives and have much richer interiorities than they ever get to express publicly. writers, artists, musicians, and others who are unusually good at public expression have a gift they can offer to such people, to be their voice\n↓\n1649096437924511745 [2023-04-20] @QiaochuYuan 💜 14\ni guess one way to say it is that when i tweet the audience i implicitly have in mind is something like everybody who's ever interacted with me on twitter, as a symbol of everybody who might vibe with my twitter energy\n\nhttps://t.co/HvCr6Nvmdb\n  [Quoting @QiaochuYuan: \"A human mind, a train of thinking in a particular body, is constituted by one’s personal history in a chain of social encounters. For intellectuals, these are special kinds of social chains, and therefore special kinds of minds.\" https://t.co/zvZSWk3lwz]\n↓\n1649096439732252674 [2023-04-20] @QiaochuYuan 💜 14\nthis sort of thing needs to be able to *start* somewhere though so you might ask who the audience i had in mind was at the very beginning. the answer is that i was trying to find the others on here because @Malcolm_Ocean told me they'd be here. and they were 🙏\n↓\n1649120021724164096 [2023-04-20] @QiaochuYuan 💜 22 🔁 2 [(SEED) type=quote_of_root]\nit's important context here that one of the first things i ever read about how to use twitter, before writing a single tweet, was twitter_rpg_strategy_guide.txt which is still one of the GOATs and heavily informed my initial approach\n\nhttps://t.co/BILtP6mnx9\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1649266140412248065 [2023-04-21] @Malcolm_Ocean 💜 3\n@QiaochuYuan I unironically think twitter or bsky should just show a guide like that to every user who signs on\n\n===\n\n1651076803501625344 [2023-04-26] @eshear 💜 20\nTwitter is the Calvinball of MMORPGs\n↓\n1651208909288513537 [2023-04-26] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@eshear damn u just summarized all of this guide in one tweet https://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1659681041240686592 [2023-05-19] @visakanv 💜 177 🔁 3\nvaguely kinda wishing i had someone to really discuss deep twitter game with the way some people discuss chess\n↓\n1659687799472418816 [2023-05-19] @QiaochuYuan 💜 21\n@visakanv sup whatcha wanna talk about\n↓\n1659688878108987394 [2023-05-19] @visakanv 💜 23\n@QiaochuYuan i guess the iffy thing is i dont even have the right parameters yet, since i haven't had the occasion to come up with them. a phrase that jumps to mind is \"intermediate players\", so maybe i'll work out from the middle. https://t.co/wpyeaZzzXm\n  [Quoting @visakanv: intermediate players quit because they accumulate all of this complicated, conflicting advice about what they should or should not do, should or should not care about, how they should position themselves, brand themselves, etc  and all of that obscured their love of the game]\n↓\n1659689207202447362 [2023-05-19] @visakanv 💜 20 💬 1\n@QiaochuYuan it makes me sad how some of the best voices/players i've known over the years have left the game. oftentimes its the right move for them personally and i respect that, and also i want to better understand the web of things influencing everything around it...\n↓\n1659689806182625281 [2023-05-19] @visakanv 💜 24\n@QiaochuYuan saying-the-obvious: because the better we understand the precise conditions and mechanics of what makes sustainable/healthy/good twitter game, the better we'll be able to support long game players, the better shot we'll have at knocking over larger dominos\n↓\n1659690512226603008 [2023-05-19] @visakanv 💜 14\n@QiaochuYuan so. loosely there are a couple of big important parts. one big part is managing one's psychology, that's what i wrote @Introspectvv to help people with. if someone is unwell/maladjusted etc off-site, it's generally bad news for them on-site (unless they're VERY skilled. &amp;still)\n↓\n1659690889340686337 [2023-05-19] @visakanv 💜 16\n@QiaochuYuan the other big important thing is plaintext/hypertext literacy, which u know is a thing i've been collecting notes on for a long time, trying to write an essay abt. its just as annoyingly difficult as writing introspect in that it's self-referential nature invites scrutiny lolsob\n↓\n1659693477968637952 [2023-05-19] @visakanv 💜 31 🔁 1 💬 1\n@QiaochuYuan another big thing is not getting sucked into audience capture and *mindlessly* solving for volume of reach. audience members are not equal. i've seen otherwise very smart people completely fuck this up \n https://t.co/UTbmjGunlW\n  [Quoting @visakanv: the flattening of attention metrics is something that seems to trip up even the most thoughtful of people  1 follow or view from the right person is worth 10,000 casual randos, maybe 100k. this is hardly ever reflected anywhere  in practice it’s a kind of sliding scale but still]\n↓\n1659697999461875712 [2023-05-19] @visakanv 💜 13\n@QiaochuYuan ok back to top-level: practice good reply game. manage yr psychology. be plain/hypertext literate. beware audience capture.  what else? i have some stray notes about (1) culture-savvy, (2) word magic... these bits feel undercooked but it's what i really want to get into\n↓\n1659698279242952705 [2023-05-19] @visakanv 💜 17 🔁 1\n@QiaochuYuan all the preceding stuff is like hygiene principles, \"how to not get pwned\", but once we're past that, or maybe in parallel, the real good shit is \"how do you create culture/meaning and provide nourishment for yourself and others via text\". we know its possible!!\n↓\n1659701364119994370 [2023-05-19] @QiaochuYuan  [(SEED) type=quote_of_root]\n@visakanv so much is just about seeing it's possible at all i think. this gets at your stuff about people being bottlenecked by lack of imagination. twitter_rpg_strategy_guide.txt was a big leg up for me getting started as i've mentioned\n\nhttps://t.co/BILtP6mnx9\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1659701568722325506 [2023-05-19] @QiaochuYuan 💜 4\n@visakanv there's another interesting thing that seems to stop people (maybe women more than men?) that seems to have something to do with \"not having a clear sense of audience,\" i don't have a super clear sense of this yet\n\nhttps://t.co/aY2K7gcfiZ\n  [Quoting @QiaochuYuan: there is something very key about \"having a sense of who you're writing to.\" when i tweet i have sort of a diffuse sense of writing for somewhere between \"my friends / colleagues\" and \"my friends / colleagues + our lurkers\" and that informs my choice of what to say and how]\n\n===\n\n1692395211924668692 [2023-08-18] @Malcolm_Ocean 💜 11 [(SEED) type=semantic_search]\nrandom twitter game you can play right now:\n\n❝ quote one of someone's tweets as a reply to another ❞\n\none place to start is to look at a recent tweet by the person\nthen search\n from:username keyword\n\nto find something that might be relevant!\n\n===\n\n1697311359963377778 [2023-08-31] @visakanv  [(SEED) type=quote_of_root]\nRT @AbstractRevery: if you need some help to define your own character, you can read the official guide: https://t.co/T0LJIm5FmO\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1726842226163286452 [2023-11-21] @univrsw3th4rt 💜 86 🔁 5\n&gt; turns out you can keep someone stuck having a problem forever by denying them permission to have it🥵 https://t.co/4vDsL9jY7f\n  [Quoting @QiaochuYuan: turns out you can keep someone stuck having a problem forever by denying them permission to have it  and conversely, you can help someone get unstuck by giving them permission to have the problems they in fact have]\n↓\n1726908327253414307 [2023-11-21] @QiaochuYuan 💜 14 💬 1\n@univrsw3th4rt remember when i used to write good tweets 🥲\n↓\n1726912657335488910 [2023-11-21] @visakanv 💜 11\n@QiaochuYuan @univrsw3th4rt your latest thread might be your best work yet\n↓\n1726922342818095223 [2023-11-21] @QiaochuYuan 💜 6 [(SEED) type=quote_of_root]\n@visakanv @univrsw3th4rt that means a lot coming from you very very very specifically since it was @Malcolm_Ocean sending me your threads that taught me how to tweet (telling this story for the young'uns who don't know)\n\nhttps://t.co/0fFpE2XKRL\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n├── 1726922571004956882 [2023-11-21] @QiaochuYuan 💜 2\n│   @visakanv @univrsw3th4rt @Malcolm_Ocean the way in which you've been able to write about the kinds of pain and suffering i was desperately trying to understand but with a lightness and playfulness i hadn't known it was possible to hold it with has done a lot for me quietly and slowly over the last 4 years\n│   ↓\n│   1726922953030558184 [2023-11-21] @QiaochuYuan 💜 2\n│   @visakanv @univrsw3th4rt @Malcolm_Ocean i'm more grateful to you than i can express. it's really too bad you're already married because if you were getting married and invited me to your wedding i'd have absolutely kicked ass at giving you a speech\n│   ↓\n│   1726923366618235110 [2023-11-21] @QiaochuYuan 💜 3\n│   @visakanv @univrsw3th4rt @Malcolm_Ocean you were, among many other things, maybe the first person i'd seen write anything publicly about grappling with the power and responsibility of being charismatic. i won't be able to find the specific tweets but that was deeply significant to me. hadn't ever seen that before\n│   ↓\n│   1726926201556804059 [2023-11-21] @visakanv 💜 3\n│   @QiaochuYuan @univrsw3th4rt @Malcolm_Ocean in many ways this is all i ever wanted to do with my writing/time/life so thank you for really reading and listening 🥲❤️\n│   ↓\n│   1726926676611997860 [2023-11-21] @QiaochuYuan 💜 3\n│   @visakanv @univrsw3th4rt @Malcolm_Ocean 🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡🫡\n│   ↓\n│   1729059971994980656 [2023-11-27] @Malcolm_Ocean 💜 1\n│   @QiaochuYuan @visakanv @univrsw3th4rt https://t.co/0F3XyikIoY\n│     [Quoting @visakanv: 🔥 this is how we win 🔥 https://t.co/h1Ip49Kd2P]\n├── 1726922860487410118 [2023-11-21] @visakanv 💜 4\n│   @QiaochuYuan @univrsw3th4rt @Malcolm_Ocean ❤️‍🔥🙏🏾 and we are still early\n│   ↓\n│   1726923137932267846 [2023-11-21] @QiaochuYuan 💜 4\n│   @visakanv @univrsw3th4rt @Malcolm_Ocean 🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏🙏\n└── 1729060457988952231 [2023-11-27] @Malcolm_Ocean 💜 2\n    @QiaochuYuan @visakanv @univrsw3th4rt here's my \"welcome to twitter QC\" thread\n    \n    (also for the young'uns)\n    https://t.co/1j2LqAoDZs\n      [Quoting @Malcolm_Ocean: I'm introducing @QiaochuYuan to twitter, and I'm like \"find some meta-rationality people to follow in the list of who @utotranslucence is following\", &amp; also follow @visakanv &amp; @GRITCULT to learn threading. \"Seriously, this is important for understanding the power of the medium.\"]\n    ↓\n    1729060887636717992 [2023-11-27] @Malcolm_Ocean 💜 1\n    @QiaochuYuan @visakanv @univrsw3th4rt and also, incidentally, just yesterday I was thinking of your first thread\n    \n    (although the thought I had was more like \"what are words for? are they good? should we, perhaps, stop using them?)\n    https://t.co/bgW8jmkI40\n      [Quoting @QiaochuYuan: @Malcolm_Ocean persuaded me to try playing around with Twitter, so: hello. Here is a question I have, crudely put, tongue moderately in cheek: is writing bad? Should we, perhaps, stop doing it?]\n    ↓\n    1729061052565045685 [2023-11-27] @QiaochuYuan \n    @Malcolm_Ocean @visakanv @univrsw3th4rt 💪\n\n===\n\n1733957039226048573 [2023-12-10] @visakanv 💜 108\ni got some time to kill, AMA (ask me anything)\n↓\n1733959431568654487 [2023-12-10] @Tymtweet 💜 2\n@visakanv Advice on both providing and extracting value on twitter?\n↓\n1733961230489108951 [2023-12-10] @visakanv 💜 3 [(SEED) type=quote_of_root]\n@Tymtweet https://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1755071375377875436 [2024-02-07] @QiaochuYuan 💜 49 🔁 1\nthinking about the long tweet meta. first, it’s a waste to write a tweet that’s only *slightly* long. people have to click an extra time to read the rest of a long tweet past the first 280 chars. so the game is to invite people to make the click\n\nso the first 280 chars should be a good advertisement for the rest of the long tweet; it should promise the reader that something interesting is waiting, and then the rest of the long tweet should deliver on that promise. so no 300 character tweets unless somehow the last 20 characters are an amazing punchline; that’s not worth the extra click to your readers\n\nsecond, a question any long tweet has to answer is: why isn’t this a thread? i personally have really enjoyed learning how to write threads well, it’s a distinct form of writing with its own distinct advantages. the key fact about threads, which i was introduced to by @visakanv’s twitter_rpg_strategy_guide.txt, is that any individual tweet in a thread can be RT’d or QT’d, by anyone, including yourself. (also that any individual tweet can itself be a QT!) \n\nwhat this means is that it’s worth learning how to write threads in such a way that every individual tweet stands somewhat on its own, and makes sense and says something comprehensible even when RT’d / QT’d outside the context of the rest of the thread. ideally (imo) each tweet in a thread should make exactly one point or introduce exactly one new idea - they get very cluttered if you try to say too much at once. the thread as a whole serves as a journey through the individual ideas or points in each tweet, and can also offer detours via QTs to other threads. one of the cool things learning how to thread like this does is that you can be surprised by which tweets in a thread resonate with other people - maybe you had a grand conclusion but it’s a throwaway tweet in the middle that people actually RT and QT and reply to. this is a level of granularity of feedback on your writing and ideas that longform doesn’t support by default (although google doc comments can be even more granular, eg) and i’ve learned a lot from it\n\nfrom this perspective long tweets offer a return back to longform, but somewhat more casual longform than eg a ‘stack post. sometimes you wanna describe an idea that takes longer than 280 chars to meaningfully express. sometimes you wanna ramble and think out loud in a less structured way than a thread (this is what i’m doing rn). threads also have the disadvantage that if you do too good a job making the individual tweets stand alone then when they get RT’d and QT’d they may not even look like part of a thread, so people may not even click through to the rest of it. long tweets have the advantage (and disadvantage) that the whole thing is RT’d or QT’d at once, meaning it’s harder to single out individual bits but the whole package gets transported around twitter together, and unlike an external link it’s all still happening on twitter. typically when i write long threads the first tweet gets RT’d and QT’d the most and all the numbers drop off from there. so i’m interested in the ability of long tweets to preserve what might otherwise be a chopped-up thread as more of an organic whole. anyway that’s what i’ve got so far, time to get some food now. thanks for reading\n↓\n1755072676811685951 [2024-02-07] @QiaochuYuan 💜 16 [(SEED) type=quote_of_root]\nkinda wish this was a thread, the stuff in the middle about threading would be worth having in its own separate tweets so i could QT it later, and also it would've been nice to be able to QT the strategy guide\n\nhttps://t.co/0fFpE2XKRL\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1798422482845901020 [2024-06-05] @VividVoid_ 💜 312 🔁 2\nWhat are the great load-bearing TPOT posts? Like the early ideas that defined the scene and its norms?\n↓\n1798422858387071112 [2024-06-05] @imhinesmi 💜 17 [(SEED) type=quote_of_root]\n@VividVoid_ https://t.co/2m3pHnQRYZ\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1798422955921428890 [2024-06-05] @imhinesmi 💜 3\n@VividVoid_ https://t.co/NtrrD4lr75\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1798622866961027536 [2024-06-06] @visakanv 💜 1112 🔁 14\nIt’s my 34th birthday!! 🥳 \n\nif any of my writing or videos etc has ever helped you with anything, I would love love love to hear about it!! 🤓🙏🏾\n↓\n1798683511949328698 [2024-06-06] @forthrighter 💜 3\n@visakanv it was this particular tweet which really grabbed me, but had to re-read it about 20 times before it sunk in why it grabbed me, it was the reframing. Prior: tpot and a number of other interactions made no sense to me. Afterwards, click, level up\n\nhttps://t.co/3ZjCR6F8WH\n  [Quoting @visakanv: Every “utterance” (status, tweet, whatever) is a bit of an invitation, a bit of a proposal. “Let’s play this game”. When strangers read the proposal accurately, and support the game, a shared understanding develops. You can make friends this way.]\n↓\n1798684169075413096 [2024-06-06] @forthrighter  [(SEED) type=quote_of_root]\n@visakanv with that reframing, the rpg strategy guide (and many other things you've written) flow smoothly, naturally and help a lot once the \"click\" of \"why is this framing useful/important\" fell into place\n\nhttps://t.co/gtSpBw2pQe\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1830777393264632285 [2024-09-03] @bashu_thanks 💜 22\nohh. Twitter is an MMORPG! but you don't immediately become undateable by playing it\n↓\n1830781571722305865 [2024-09-03] @strangestloop 💜 1 [(SEED) type=quote_of_root]\n@bashu_thanks https://t.co/axegEz71QT\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1853175200994758731 [2024-11-03] @danallison 💜 7\nSocial media can have a powerful positive effect when used well. https://t.co/kYeSJdwkiN\n  [Quoting Tweet 1853063331042689382 (missing)]\n↓\n1853175202697621808 [2024-11-03] @danallison 💜 2\nGood heuristics https://t.co/13XTzwt3nz\n  [Quoting Tweet 1853132244518338852 (missing)]\n↓\n1853175204241080528 [2024-11-03] @danallison 💜 4 🔁 1\nSerendipity is a useful lens https://t.co/81ViyEb4QN\n  [Quoting Tweet 1748703572920070166 (missing)]\n↓\n1853200195716341940 [2024-11-03] @danallison 💜 3 [(SEED) type=quote_of_root]\nClassic https://t.co/ysG5EHNtRO\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1929692872699208123 [2025-06-03] @AbstractFairy 💜 2 [(SEED) type=semantic_search]\nthe twitter game:\n\n===\n\n1955256986376827170 [2025-08-12] @Malcolm_Ocean 💜 15\nif I ran twitter, you'd be able to set up yourdomain.tweet, and then you'd be able to QT your favorite tweets WAY easier, like [[page refs]] instead of ((2f47h92834f)) block refs.\n↓\n1955256987895120350 [2025-08-12] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\nso eg @visakanv could have txtrpg.tweet point here:\nhttps://t.co/wG8uRcxxvk\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n\n===\n\n1959731074583658510 [2025-08-24] @norvid_studies  [(SEED) type=semantic_search]\ntwitter character sheet\n\n===\n\n1960914754316460038 [2025-08-28] @Malcolm_Ocean 💜 12 [(SEED) type=quote_of_root]\nevery few months, I look for a tweet to point people at when I want to tell them how to learn \"good reply game\" \n\nand every time I search from:@visakanv good reply game\n\nbut I don't feel like I have a go-to / canon piece. maybe this classic?\nhttps://t.co/wG8uRcy5kS\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1960920590883393707 [2025-08-28] @tasshinfogleman 💜 3\n@Malcolm_Ocean @visakanv https://t.co/eAR0WUVscq\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand represents a **Meta-Narrative about Platform Literacy** anchored by Visakanv's 2019 'twitter_rpg_strategy_guide.txt'—a boundary object that reframes Twitter as a multiplayer game with learnable mechanics. The arc evolves from a playful remix of MUD documentation into a canonical onboarding resource cited across 6+ years (2019-2025). The discourse is **constructive** rather than dialectical: participants (Malcolm_Ocean, QiaochuYuan, RichDecibels) build on the original framework by adding tactical guides (custom search engines, threading principles, reply etiquette). The strand demonstrates high **knowledge production**—creating shared vocabulary ('reply game,' 'threading,' 'audience capture') and social technology (hotkeys for tweets, custom search shortcuts). It shows **temporal depth** with recurring citations during platform crises (2020 hack, 2022 Musk acquisition) and serves as **infrastructure** for scene-building (TPOT onboarding). However, it lacks a clear **outcome artifact** beyond the original guide itself—no physical institution or widely adopted external framework emerged. The utility is primarily **internal** (scene cohesion) rather than **external** (broader adoption).",
    "rating": 7,
    "evolution": "high",
    "cohesion": "high",
    "utility": "medium",
    "essential_tweets": [
      {
        "tweet_id": 1094684057173016581,
        "annotation": "The Origin: Initial joke tweet that becomes the canonical 'twitter_rpg_strategy_guide.txt' referenced for 6+ years"
      },
      {
        "tweet_id": 1094689527615021056,
        "annotation": "Core Insight: 'Conflict between players with different interpretations of Twitter is a key feature of Twitter itself'—establishes meta-game awareness"
      },
      {
        "tweet_id": 1094699709027905545,
        "annotation": "The Utility Thesis: 'A web of tweets is a living entity that allows players to meet at the level of individual thoughts'—articulates the boundary object's purpose"
      },
      {
        "tweet_id": 1113213694320828417,
        "annotation": "First Transmission: Malcolm_Ocean uses the guide to onboard QiaochuYuan, demonstrating its role as social infrastructure"
      },
      {
        "tweet_id": 1192905562066866176,
        "annotation": "Expansion Pack: QiaochuYuan's 'tiny twitter strategy guide' builds on Visa's work, adding tactical elements (custom search engines, vulnerability)"
      },
      {
        "tweet_id": 1534168729604571137,
        "annotation": "Synthesis: RichDecibels' 'Twitter Is A Dating App For Making Friends' thread integrates the guide into a broader onboarding framework"
      },
      {
        "tweet_id": 1647520435494617089,
        "annotation": "Longevity Signal: Visa reaffirms the guide's thesis 4 years later during reflection on 'supportive context' for creative work"
      },
      {
        "tweet_id": 1649120021724164096,
        "annotation": "Canonical Status: QiaochuYuan credits the guide as foundational to his approach, calling it 'one of the GOATs'"
      },
      {
        "tweet_id": 1659701364119994370,
        "annotation": "Meta-Reflection: QiaochuYuan notes the guide's role in 'seeing it's possible at all'—addressing the imagination bottleneck"
      },
      {
        "tweet_id": 1726922342818095223,
        "annotation": "Full-Circle Validation: 5 years later, QiaochuYuan thanks Visa for teaching him 'how to tweet,' closing the loop on knowledge transmission"
      }
    ]
  }
}