{
  "seed_tweet_id": 1097772276022370304,
  "thread_text": "1088077027532365824 [2019-01-23] @visakanv 💜 64 🔁 4\nIMO often what makes a disagreement interesting is whether or not the other person has a sense of vision\n\na lot of twitter idiots (from every subculture, tribe, ingroup) have no vision, which makes the disagreements hideously boring unless you're choosing to entertain yourself\n↓\n1088077903575711744 [2019-01-23] @visakanv 💜 46 🔁 4\nall communication is lossy and involves trade-offs\n\na good faith discussion and/or disagreement is sensitive to the fact that the other person has made those trade-offs\n\n\"ha, your communication is lossy!\" is so uninspiring. it's the inverse of inspiring; it's dispiriting\n↓\n1088078961395953668 [2019-01-23] @visakanv 💜 15\na sort of specific lens to make sense of this is to think in terms of makers and critics. you shouldn't have to be a maker to be a critic, but if you're going to be a critic, you ought to be a constructive one. \"vision\" here is a sense of possibility\n\nhttps://t.co/ZzgwDPdVqN\n  [Quoting @visakanv: 12. Some nitpicking is useful, but a lot of it is trash. As a general rule I am distrustful of anybody who nitpicks others liberally without having a body of work that others might nitpick in turn. An order of magnitude more so if anonymous]\n↓\n1088079452813197312 [2019-01-23] @visakanv 💜 32 🔁 4\nmore simply: a disagreement is interesting if both parties make an effort to show each other what they each see, and to try and see where the other party is coming from. it's uninteresting if one party is just mindlessly going \"boo, no, ew, ick, weak, stupid, bad, fail\"\n↓\n1088079902136397825 [2019-01-23] @visakanv 💜 44 🔁 3 [(SEED) type=semantic_search]\nhere's another way of looking at it\n\nif we have a disagreement, we need to identify our respective assumptions, and talk about our respective experiences. if you're not open to doing that then don't waste people's time by disagreeing with them stupidly https://t.co/QctWih0sPd\n↓\n1088080204294107136 [2019-01-23] @visakanv 💜 39 🔁 2\n\"this is twitter lol, who spends that much time and effort\"\n\nI do! my friends do, too! that's how you *make friends*. that's how you *build relationships*. that's how you *expand your mind*. you learn nothing from stupid disagreements. IMO you're wasting your time *otherwise*\n↓\n1088383271598051333 [2019-01-24] @visakanv 💜 7\nthreadblogged https://t.co/NK4OFBBQx3\n\n===\n\n1097772276022370304 [2019-02-19] @visakanv 💜 486 🔁 106 💬 19 [(SEED) type=root]\nwhenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB\n├── 1097772623478513664 [2019-02-19] @visakanv 💜 121 🔁 20\n│   I have had extremely heated disagreements lead into nourishing friendships once we get around to appreciating each other's backstories and contexts\n│   \n│   and I have had relatively mild-seeming disagreements ruin relationships because someone simply refused to discuss their experiences\n│   ↓\n│   1097823942847287296 [2019-02-19] @visakanv 💜 38 🔁 1\n│   Disagreements can be good https://t.co/svyh1FWVQv\n│     [Quoting @visakanv: IMO often what makes a disagreement interesting is whether or not the other person has a sense of vision  a lot of twitter idiots (from every subculture, tribe, ingroup) have no vision, which makes the disagreements hideously boring unless you're choosing to entertain yourself]\n│   ↓\n│   1552003255030272000 [2022-07-26] @visakanv 💜 15 🔁 1\n│   https://t.co/07Kn4i18Gr\n│     [Quoting @MJPiercello: @ilex_ulmus @Malcolm_Ocean @visakanv I think so, yes.  Do we disagree? NO    YES  If YES, is that a problem? NO    YES  If YES, can we solve it together? NO    YES  [loop]  Can we solve it? LoRC says YES, &amp;here's how/why Should we? Ethics says YES Must we? exponential tech says YES  pic from: https://t.co/9tMifJShH0 https://t.co/13CafGWoR4]\n│   ↓\n│   1552003579912720384 [2022-07-26] @visakanv 💜 37 🔁 2\n│   https://t.co/EaxGYSSoCS\n│     [Quoting @buster: Here's the cheat sheet for the 4 conundrums of the universe that our brains attempt to solve with what we call biases: https://t.co/cMwHJhElVL]\n│   ↓\n│   1613016559072710657 [2023-01-11] @visakanv 💜 31 🔁 3\n│   (h/t @vidhster)\n│   \n│   https://t.co/pRKzTg7E3M https://t.co/gWzgNWGk7g\n├── 1097778185473789952 [2019-02-19] @HiredThought 💜 10 🔁 1\n│   @visakanv This reminds me of evaporating cloud diagrams. Have you ever played with them? https://t.co/phpFW5AatS\n│   ├── 1097778387592966147 [2019-02-19] @visakanv 💜 4\n│   │   @BenMosior ooh, this is cool\n│   └── 1163526080843649025 [2019-08-19] @tasshinfogleman 💜 5\n│       @HiredThought @visakanv came here to say this. wrote about them recently for Praxis: https://t.co/e5yKbwtTXW\n├── 1097945675868839937 [2019-02-19] @GRITCULT 💜 2 🔁 1\n│   @visakanv I name definitions and how you get those definitions an important part in argument games. \n│   \n│   https://t.co/7gdO6a21Hd\n│     [Quoting @Orthogonal_MO: Just published GRITCULT.’s Law. by @GRITCULT   A comment on the ontology of internet erisology.  https://t.co/cRwp27yvML]\n├── 1132889416291086336 [2019-05-27] @davecraige 💜 9\n│   @visakanv Related powerful quote:\n│   \n│   \"People are locked in their experiences\"\n├── 1163526402349633537 [2019-08-19] @amelapay 💜 7 🔁 1\n│   @visakanv Read this sometime when you're bored! https://t.co/laPwJAnuCl\n├── 1485817881786925056 [2022-01-25] @RomeoStevens76 💜 58 🔁 7\n│   @visakanv Philosophers would benefit from better understanding of how tacit linked premises often have emotional contents. Therapists would benefit from better understanding how tacit linked premises often have philosophical content.\n├── 1486746050631192583 [2022-01-27] @tasshinfogleman 💜 3\n│   @visakanv i think a really important part of life experiences (and therefore assumptions) is one's past or present social context or social reality\n└── 1788194986736951679 [2024-05-08] @rikardhjort 💜 1\n    @visakanv i read the chart before the tweet and assumed this was internal to one person.\n\n===\n\n1100490023932051456 [2019-02-26] @visakanv 💜 74 🔁 13\nKnowing how to use tactical agreement + knowing when to STFU easily puts you in the top 1% of conversationalists\n↓\n1100491621840244736 [2019-02-26] @visakanv 💜 21 🔁 4\nIf you look at the state of your correspondence and find it wanting (chronic nitpickers, it you,) you can replace the whole thing with \n\n1. STFU\n2. Agree thoughtfully and supportively when you see an opportunity to agree\n\nand you will immediately find yourself making more friends\n↓\n1100492069330505728 [2019-02-26] @visakanv 💜 15 🔁 3\nYou can disagree supportively too, though that requires more skill and nuance\n\n“But I don’t want to support people!” - that means you don’t want to make friends. Sounds like a sad and lonely life to me, but fair enough it’s your life\n\nhttps://t.co/sl601VdAQT\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1100492784593657856 [2019-02-26] @visakanv 💜 23 🔁 2\n“But the wrong people,,, need to know they are wrong” - do they really? And does telling them they are wrong help them see they are wrong? \n\nI’ve seen people use this logic to enable their bullshit for years without ever stopping to see if it even works (hint: it doesn’t)\n↓\n1100493225947590656 [2019-02-26] @visakanv 💜 14 🔁 1\nIt can *seem* like it works because you receive signals of support from other people who agree with you that the wrong people are wrong, and you *can* make friends this way, sometimes great ones\n\nBut if you’re not careful, you end up surrounded by haters. It only takes a few\n↓\n1100494586609164288 [2019-02-26] @visakanv 💜 9 🔁 1\nI think a sad thing I’ve seen is when people who have been wronged, victimised etc set out to seek justice - which is IMO a good thing!! - but in the process inadvertently end up becoming a proxy for contemptuous haters. It happens. There are abusers just looking for a reason https://t.co/i722EA6NzK\n↓\n1100495902521712640 [2019-02-26] @visakanv 💜 23 🔁 3\nIMO, the best way to help people “see they are wrong” is to ask them questions. The full playbook would take like ~30 tweets minimum so not gonna get into that now,,, \n\nbut anyway, always worth considering &amp; evaluating the outcomes of your correspondence. Does it spark joy? 😂\n↓\n1100497170514362368 [2019-02-26] @visakanv 💜 15 🔁 3 [(SEED) type=quote_of_semantic_search]\nYou can construct the playbook yourself from 1st principles if you know a few things. People’s conclusions are based on (a) their experience + (b) cherished assumptions, so you’ll rarely persuade them by arguing about conclusions. Ask kindly about a &amp; b https://t.co/llbrYvkfTe\n  [Quoting @visakanv: here's another way of looking at it  if we have a disagreement, we need to identify our respective assumptions, and talk about our respective experiences. if you're not open to doing that then don't waste people's time by disagreeing with them stupidly https://t.co/QctWih0sPd]\n↓\n1100498062378782720 [2019-02-26] @visakanv 💜 16 🔁 1\nA thoughtful disagreement can probably be reduced to “this is where I’m coming from, where are you coming from? Help me understand why I don’t see things the way you see.” Once you see this, witnessing conclusion-level disagreements is dispiriting https://t.co/0QgRDtvdIz\n  [Quoting @visakanv: more simply: a disagreement is interesting if both parties make an effort to show each other what they each see, and to try and see where the other party is coming from. it's uninteresting if one party is just mindlessly going \"boo, no, ew, ick, weak, stupid, bad, fail\"]\n↓\n1100499365561597953 [2019-02-26] @visakanv 💜 15 🔁 1\nAlso!! People generally love to corroborate their experiences (it’s a fantastic thing to do, all good conversations have some of this)\n\nAND, people are often shy/nervous to just blab on about themselves \n\nSO, \n\nasking people kindly about their experiences is INCREDIBLY POWERFUL\n↓\n1100500364086919170 [2019-02-26] @visakanv 💜 40 🔁 2\nWhat have you seen? \nWhat surprised you? \nWhat have you been wrong about?\nWhat do you know now you didn’t before?\nWhat have you struggled with?\nWhat has your relationship with X (food, money, parents, job, dating) been like?\n\nThis puts you in 0.1% and people will *love* you https://t.co/CmH88FeEmt\n↓\n1100502256208744448 [2019-02-26] @visakanv 💜 20\nI used to *suck* at this, but I was earnest and eager to be better. And it’s had the *biggest* impact on my quality of life. People seek me out to talk to me, it’s super nourishing. I’ve learned so much about the world I couldn’t have otherwise, via people https://t.co/8XO9AQCkkc\n  [Quoting @visakanv: Meeting internet friends from around the world is always a huge highlight of my life and fills me with a lot of gratitude. Despite the wanton amounts of rampant fuckery on here, there are good, fun, kind, interesting people worth hanging out with]\n↓\n1100502788633751552 [2019-02-26] @visakanv 💜 8\nBtw I wrote this story a while ago because I wanted to talk about this (getting good at peopling) but didn’t know how to do it 😂 it really resonated with people https://t.co/NThxoRkOXJ\n  [Quoting @visakanv: Story:  You suck at something  It bothers you, so you work hard at it &amp; many years, through lots of pain and failure  You are now good at the thing &amp; it comes easy to you   You look around and you see that most people suck at this  Why don’t they just get good?? Being good rules!]\n\n===\n\n1132755633726459909 [2019-05-26] @ultimape 💜 6\nCommodity fetishism in action. https://t.co/Ofptq81ib6\n  [Quoting Tweet 1132428951492603904 (missing)]\n↓\n1132756686119276544 [2019-05-26] @ultimape 💜 1\nWhen people talk about \"capitalism\" causing problems in the world, what they're really talking about is a very complex construct centered around marxist thinking on opressive systems stemming from market forces interacting with government collusion.https://t.co/Z0fTGrz8Wn\n  [Quoting @ultimape: The desire to mass produce such addicting products run deep in our modern industrial world. The human need for bananas, driven by advertising campaigns and industrial mono-crops, means they too will soon be replaced.https://t.co/8ve5og6Emz]\n↓\n1132757261523259392 [2019-05-26] @ultimape \nThere are a number of mental frameworks centered around \"capitalism\", each flavor referencing it's own construct of what that means. Get two people in the room who decry capitalism or meme about post-capitalism and you're not likely to get the same answers. It's multifaceted.\n↓\n1132758088442961926 [2019-05-26] @ultimape \nFor some, \"capitalism\" represents Jeffersonian whiteness - often representing a disgust with how colonialism and male driven systems of rule leaked over from Europe as people reconstituted British law here in the states. It takes the same connotation as \"white man's burden\".\n↓\n1132758607865556992 [2019-05-26] @ultimape \nBut for others it is more about racial boundary - with skin colour being a defining factor. The conflict arises when one group's language is referring to cultural moors and systems of rule, and another group is thinking about racial purity. There are groups viewing both as true.\n↓\n1132759467035156480 [2019-05-26] @ultimape \nThere is also hints of 'power' - how one group rules another with social forces (stuff like creeping gentrification, culture destroying social policing etc) end up swaying the way groups make meaning. Terms like 'violence' and 'oppression' are often framed under this ontology.\n↓\n1132760356303048704 [2019-05-26] @ultimape \nLike most conflicts among human groups, linguistic divide here seems to put a dampener on how things communicated. And there are also those who are smart enough to see this problem and intentionally muck with it via meta trolling. Most are simply blind to the schism in language.\n↓\n1132760947586674688 [2019-05-26] @ultimape \nQuite often I see people arguing at this language barrier. one person talking about racial stuff they likely learned in school, and another person arguing from the power / oppression framing. Like water and oil, they inevitably disagree and can't find common ground.\n↓\n1132761369525329920 [2019-05-26] @ultimape \nWhen people talk about echo chambers, this language barrier issue is often hinted at but not fully spelled out. It's the same concept of the \"shibboleth\", but more fundamental. It's not just words differing, but entire mental constructed founded on divergences in life experience.\n↓\n1132761882845229058 [2019-05-26] @ultimape \nOften even if two people or groups manage to hash out their differences in perspective on the issue (and find a common goal they both agree is worth persuing) we still see conflict. Each group's sense of risk varies, so choice of approach biases toward what they see as problems.\n↓\n1132762729746292737 [2019-05-26] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@ultimape https://t.co/LaNuypqoQy\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1132765568208130054 [2019-05-26] @ultimape \nI can 'think about' stuff like native american Spirit Animals in terms of hauntu, or see how Tsukumogami lore from Shinto influenced Walt Disney's Fantasia (but distorted thru the lens of western's view of magic)\n↓\n1132766610333294597 [2019-05-26] @ultimape \nI have a framework I can hang these ideas on that others haven't spent time to develop. And it lets me model 'other' ways of thinking in familiar patterns. Effectively, I can translate a culture's lore (at least those that fit my internalized views) between ontological domains.\n↓\n1132767578395467776 [2019-05-26] @ultimape 💜 2\nI see myths as foundations for concepts, similar to how language processing develops (or more specifically how what you 'hear' in a language is biased as a child develops). If mental framework isn't able to process other models for thinking, they might as well be speaking cat.\n↓\n1132767981728149509 [2019-05-26] @ultimape \nIt's like how I can't roll r's when trying Spanish &amp; I'll never be able to 'hear' languages that rely on inflection/intonation. If I was raised that way, I might have been able to. But it would take a lot of effort to put myself into the beginners mind to do that effectively.\n↓\n1132768803803344898 [2019-05-26] @ultimape \nI use this meta-model of understanding social constructs to great effect. Part of why I have all those weird poetry threads on here: trying to adapt my autistic brain to learn stuff like idioms and 'donkey anaphora'. Digesting metaphor from my own culture: https://t.co/qdbGAcD4ea\n↓\n1132776279827255296 [2019-05-26] @ultimape \nI see this strange conflict in views/ideologies everywhere now. I spend a lot of time searching out writings that attempt to bridge these gaps, while actively shunning stuff that seems to be driving further wedges between groups.\n↓\n1132776917114007552 [2019-05-26] @ultimape 🔁 1\nA recent one I read was from @enkiv2 where they attempt to explain and dissolve the boundary around the disjoint sense of 'violence' that seems to cause conflicts between libertarian thought and 'social justice' types. https://t.co/CMdKDbcuYv\n↓\n1132777514722635781 [2019-05-26] @ultimape \nSome of the best kinds of this writing is a sort of piecemeal decomposition of a memetic construct - trying to see the shape of an egregore and elucidate (illuminate?) places where they are more similar than we thought. A sort of interpersonal peace accord ~finding common ground.\n↓\n1132778907818762241 [2019-05-26] @ultimape 💜 2\nI also think a lot about this particular piece on how the kinds of people we end up interacting with in a group are often the loudest. And how that noise biases our perceptions thru majority illusions.https://t.co/hEk6s5q5Jw\n  [Quoting @ultimape: 1/6 Consider this analogy of communication, the majority illusion, &amp; it's effects on the narrative of the outgroup.https://t.co/WMBRTkZM2e https://t.co/0gwkZPMmnQ]\n↓\n1132780269356896258 [2019-05-26] @ultimape 💜 1\nI added \"Stories masked in a cocoon of insight porn and body horror.\" to my bio here a while back b/c fundamentally I see what I am doing is finding + inventing alternative narratives on how we view the world. An attempt model as many minds as possible. https://t.co/3Lo0tAPEX8\n  [Quoting @ultimape: “Integratively complex thinkers are better able to reach mutually advantageous solutions in mixed-motive games” https://t.co/HQBucDxTYU]\n↓\n1132780829061591040 [2019-05-26] @ultimape 💜 2 [(SEED) type=quote_of_root]\nGoing with the rest of this thread, I think the first step in understanding someone else's experiences is in undoing our preconceived notions and opening ourselves up to the possibility of alternative models of reality. Turning this into a game of sorts: https://t.co/UD7lc9FElq\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1133365754974355456 [2019-05-28] @ultimape 💜 1\nMemetic theory of mind.https://t.co/rVWHrRSp6j\n  [Quoting Tweet 1004861314135674881 (missing)]\n↓\n1137796954677751808 [2019-06-09] @ultimape \nMemetic theory of mind.https://t.co/okNxT6Mnoe\n  [Quoting @ultimape: Informational Cybernetics. Communication is sharing our maps.https://t.co/GTpF8Es1Dz https://t.co/RPcladg9XE]\n↓\n1265825264187170822 [2020-05-28] @ultimape 💜 2\nMemetic theory of mind.https://t.co/a2J9weh8RI\n  [Quoting @ultimape: I like how this meme is diverging into plebian and high-brow variations, but at the same time it is also acting as a vehicle for identity signaling among ingroups.wow! https://t.co/xj4oYqLMij]\n↓\n1267939188390985728 [2020-06-02] @ultimape 💜 5\nMemetic theory of the bicameral-mind.https://t.co/hzeDZW3q6R\n  [Quoting @ultimape: Did a @literalbanana write this? https://t.co/Djyua4uXDf]\n↓\n1268728351746859008 [2020-06-05] @ultimape \nMimetic theory of mind.https://t.co/NAgkBICGg5\n  [Quoting @ultimape: Amazing what you can learn about someone by consuming a fictionalized philosophical work, drilling down into the memes that would have been influencing themselves at the time of their ideas developing, and building up alternate realities.https://t.co/3rS4y9oayU]\n↓\n1268767548646055936 [2020-06-05] @ultimape \nHow to mine the map of the memetic mind map.https://t.co/wfOS1zFBZF\n  [Quoting @ultimape: Reposts: how hiveminds synchronizes meaning making machinery.Like clockwork machine,memes drip into our stream:Raw materials for the swarm to mime.Meaning crystallizes differently, echos of time.Recapitulating Sybils Swarmhttps://t.co/qWjXs19Ymkhttps://t.co/PzhWUD9DJ7]\n↓\n1268767750920572932 [2020-06-05] @ultimape \nMetaphysical Mentalism.https://t.co/TksgGBw1Uz\n  [Quoting @ultimape: It's a trick. A statistical trick. Superforcasting is just math &amp; perception.\"Usually I just do a Google search\"https://t.co/AJnYrpuKnS]\n↓\n1268767841299431427 [2020-06-05] @ultimape \nEchoshttps://t.co/HJjCuPtQIe\n  [Quoting @ultimape: Metaphysical Mentalism.https://t.co/btySm4VoHG]\n↓\n1268768150058930176 [2020-06-05] @ultimape 💜 1\nDo, or do not. There is no wondering.Act as if.\"I wonder if the urge to synchronize other people's opinions with yours is the same that lets dominant thoughts in your own mind subdue and harmonize your other thoughts.\"https://t.co/Nyf8ONuNpV\n  [Quoting Tweet 1268611780877533184 (missing)]\n↓\n1593688494907576324 [2022-11-18] @ultimape \nOne culture bending another to it's will thru systematic subjugation. https://t.co/hvvZbnVVSu\n  [Quoting @ultimape: \"The Day of the Dead used to be held in the middle of the Aztec year, but once the Spanish arrived, it was moved to occur on All Saints’ Day, merging some ancient Aztec beliefs with a dose of Catholicism.\" https://t.co/VN8gxlKlEj]\n\n===\n\n1141235027394494464 [2019-06-19] @visakanv 💜 22 🔁 2\nA lot of the Internet is populated by the second tweet without the first tweet. We need a lot more of the first tweet in order to have proper conversations about where we’re coming from. This whole planet needs therapy https://t.co/tJgCRJGf0A\n  [Quoting Tweet 1141093028553285632 (missing)]\n↓\n1141237089083617280 [2019-06-19] @visakanv 💜 7 [(SEED) type=quote_of_root]\nhttps://t.co/LaNuypqoQy\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1162193452362166273 [2019-08-16] @visakanv 💜 34\nthere’s something funny-strange about how most people deal with moral ambiguity - and I think the finite/infinite lens is the closest thing I can use to explain it. So much discussion about good and bad, right and wrong etc is framed in a sort of classroom/courtroom context\n↓\n1162204186269777929 [2019-08-16] @visakanv 💜 27 🔁 4\nOne of the many symptoms of this is a simplistic yet fervent prostration before the law, as if laws are magical rules of the universe rather than stuff a bunch of people made up\n↓\n1162218260021989379 [2019-08-16] @visakanv 💜 8 [(SEED) type=quote_of_root]\nmore generally, I think this is often a problem of mismatched frames. All reasoning happens within some frame or set of frames, but people seldom acknowledge this. We each tend to be attached to our own frame and few have much practice switching frames https://t.co/LaNuypqoQy\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1166548379616169984 [2019-08-28] @easoncxz 💜 11 🔁 3\n我意识到，或许很多令理性者感到很烦、很没有作用、很没意义的争执之中，其实有一种现象，就是：对方根本没有理会你的立场具体是什么，而是固执、粗暴、不自知地把你视作了其所反对的一切的代言人、支持者。\n↓\n1166549151959543808 [2019-08-28] @easoncxz 💜 7 🔁 2\n我喷你的时候，我根本不管你到底认为什么；只要你在这某个问题上不是「我方」立场而是「对方」立场，那我所反对的所有东西都可以对着你喷。你说你其实也反对我所反对的一些东西？我管你妈个屄啊！照样喷你！\n\n就是这么一种非友即敌，毫无细节的互相攻击。这是想理性讨论的人的灾难。\n↓\n1166866807535177728 [2019-08-29] @visakanv 💜 1 [(SEED) type=quote_of_semantic_search]\n@easoncxz https://t.co/llbrYvkfTe\n  [Quoting @visakanv: here's another way of looking at it  if we have a disagreement, we need to identify our respective assumptions, and talk about our respective experiences. if you're not open to doing that then don't waste people's time by disagreeing with them stupidly https://t.co/QctWih0sPd]\n↓\n1172461367112024064 [2019-09-13] @easoncxz \n@visakanv I've still been thinking about this. It seems pretty difficult, to achieve such civility when caught in the middle of politics between two large crowds of angry people (including myself). It's hard to conjure up good faith when there isn't apparently any from the other side.\n↓\n1172468424275976192 [2019-09-13] @visakanv \n@easoncxz It’s worth doing because even if only 1 in 100 people appreciate it, those people end up becoming your friends, and over time you build a really great group of friends\n↓\n1172469554531860481 [2019-09-13] @easoncxz \n@visakanv Usually that is the case, but I don't know whether it's me being too stubborn/close-minded, or if it's you not understanding the context. My original tweets are about Chinese authoritarian rule, so I do feel a \"Jews can't be friends with Nazis\" sentiment.\n↓\n1172477615338221568 [2019-09-13] @visakanv \n@easoncxz fair enough\n\n===\n\n1277600019676364803 [2020-06-29] @natural_hazard 💜 14 🔁 1 [(SEED) type=quote_of_root]\nfound it! https://t.co/t55naZYdtL\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n├── 1277609699379159044 [2020-06-29] @bierlingm 💜 3\n│   @natural_hazard @visakanv Boy do I have a coupla’ slides (and presentation) for you https://t.co/jJYOPa3nzt\n│   ↓\n│   1277616272637902849 [2020-06-29] @bierlingm \n│   @natural_hazard @visakanv https://t.co/tGH9IhpYuU\n│   ↓\n│   1277616431014838272 [2020-06-29] @bierlingm 💜 1\n│   @natural_hazard @visakanv https://t.co/crJaDItgmZ\n└── 1277610043857342466 [2020-06-29] @natural_hazard 💜 3\n    My head cannon example: two people arguing over if third party has bad intent / is dangerous\n    \n    one person grew up in a hella dangerous environment, other grew up in safe nurturing one. Both project the past on this third party\n    ↓\n    1277610597589409793 [2020-06-29] @natural_hazard 💜 3\n    This relates HEAVILY with \"to resolve conflict, you must get stronger\"\n    \n    After the differing backgrounds are sussed out, what I want to see happen is both parties realize they get better at understanding people, and not coast on past fueled assumptions\n    ↓\n    1277611048413982720 [2020-06-29] @natural_hazard 💜 1\n    in a sense it's \"reasonable\" for both to continue thinking third party is good/bad cuz that's their priors, but in order to move forward they both need to look more at what is. Redirect attention to gathering more info.\n    ↓\n    1277611730978451458 [2020-06-29] @natural_hazard 💜 1\n    This is a thing in the back of my head all the time: \n    \n    Notice when information is cheap and you can go out and find more. Making a final decision based of just the evidence you have now is only necessary in one-shot HIGH risk scenarios. Most of your life probs isn't that\n\n===\n\n1277604689404551169 [2020-06-29] @visakanv  [(SEED) type=quote_of_root]\nRT @natural_hazard: found it! https://t.co/t55naZYdtL\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1320913656620539904 [2020-10-27] @visakanv 💜 63 🔁 2\na bunch of the disagreements on here have the vibe of far-sighted people arguing with short-sighted people about what the world looks like\n↓\n1320914000780038144 [2020-10-27] @visakanv 💜 7\n. https://t.co/4NLtpbL7RP\n  [Quoting @visakanv: saw the following exchange on the TL  A: law of attraction works  B: sorry, survivorship bias, dangerous ideology  me: I don't see any disagreement here 😂]\n↓\n1320914248646574080 [2020-10-27] @visakanv 💜 14 [(SEED) type=quote_of_root]\n.. https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1345826901751783424 [2021-01-03] @visakanv 💜 97 🔁 3\ncan opener dad story is such a classic SSC Sort By Controversial scissor\n↓\n1345827283316002816 [2021-01-03] @visakanv 💜 63\nthe frustratingly boring thing about it is that there’s just not quite enough information to have any certainty, but it’s practically designed to get people fighting\n\n“not enough info” is itself an assessment that can be fought about\n↓\n1345827748539817985 [2021-01-03] @visakanv 💜 35 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1345828825796526081 [2021-01-03] @visakanv 💜 37\nthe thing to be wary about are people who are way too certain that they know the truth of the matter based on a bit of text \n\nbut even saying this can come across as dismissive or aloof/insensitive. It *is* an emotionally charged thing for people, based on their exp/knowledge\n↓\n1345829594297823233 [2021-01-03] @visakanv 💜 27\nI guess I don’t care abt some random dad but I do care about my friends so I get sucked in and now everyone is embroiled in disagreements which is, ahhh, not very pleasant \n\nand to think social media is incentivized to just keep throwing more Scissors our way 😅\n↓\n1345830282432135168 [2021-01-03] @visakanv 💜 24 🔁 1\nI think it’s helpful to try and remember that disagreement in text is devoid of tone and body language and so it’s easy to presume people are coming off much more strongly than they would face to face\n↓\n1345831772777377793 [2021-01-03] @visakanv 💜 30\nI’m kinda oversensitive to this sorta thing but like- I’ve seen forums, chatgroups, etc fall apart bc of the exhaustion caused by repeated disagreements like this (without a corresponding, uh, aftercare)\n\nnot to be alarmist or anything, just\n\nreminder to self to care for friends\n↓\n1345832562598371328 [2021-01-03] @visakanv 💜 25\n(I’m really always the guy trying to calm ppl down in any fight bc I keep seeing over and over again how miserable ppl are after they do some dramatic “Well Fuck You And Fuck Your Horse” gesture, and then end up lonely and isolated. Yea fights healthy but also I’m paranoid 😅😩)\n├── 1345832882888065024 [2021-01-03] @visakanv 💜 19\n│   I also ramble a lot when I’m nervous. Not a very high status thing to do or admit but. Yknow. If you keep rambling you can delay a blowout and maybe hot tempers will cool while you’re distracting them?\n└── 1345901295551406080 [2021-01-04] @sharanvkaur 💜 3\n    @visakanv you should know that i am never miserable after my “Well Fuck You And Fuck Your Horse” gestures. pls update✌️🏼\n    ↓\n    1345903261304307713 [2021-01-04] @visakanv \n    @sharanvkaur https://t.co/PS031qwtFW\n    ↓\n    1345903739257769987 [2021-01-04] @sharanvkaur 💜 1\n    @visakanv Well Fuck You And Fuck Your Horse\n    ↓\n    1345903893473988609 [2021-01-04] @visakanv 💜 1\n    @sharanvkaur https://t.co/9vxwTvQeJR\n\n===\n\n1366682989325742081 [2021-03-02] @visakanv 💜 22 🔁 2\na recurring source of bitter conflict seems to be that some people casually use phrases (eg \"you owe it to X to...\") without any particular meaning attached (disputable), whereas for other people such phrases are a red flag – used by abusers to coerce and control\n↓\n1366683371267493889 [2021-03-02] @visakanv 💜 10 🔁 2\nof course when abusers use such language they will never say \"haha you caught me, oops\". they will accuse you of being crazy and imagining something that's not there. hence the dispute. you can't really know from the utterance alone\n↓\n1366683623483609095 [2021-03-02] @visakanv 💜 9 🔁 2\nand/but also sometimes people just use words without realizing/knowing that what's a casual thing to them is something troubling and traumatic to others, and it's quite common for them to get quite defensive if you yell at them about it because wtf why are you yelling at me??\n↓\n1366683734620078083 [2021-03-02] @visakanv 💜 9\nyou see the problem then, because the innocent bungler and the sinister sociopath look exactly the same\n↓\n1366684252239134730 [2021-03-02] @visakanv 💜 10\nan extreme response here is \"there are no innocent bunglers\" – I understand the thinking that goes into this, like. innocent bunglers end up providing cover for abusive sociopaths, as \"useful idiots\". but the distinction is an important one imo\n↓\n1366684670931296258 [2021-03-02] @visakanv 💜 9\npeople who are deeply immersed in the worst of things *are* likelier to be quick to assume that the slightest glimpse of red flag is a sign of trouble. this is completely understandable as a self-protection mechanism. but i don't think we can run The Public Commons this way\n↓\n1366684878037688322 [2021-03-02] @visakanv 💜 8\nwell – The Public Commons is not one single monolithic thing, but rather an assemblage of many commons, and some commons are more trusting and open than others, some are more skeptical and security-minded, and we each have to find spaces that are right for us\n↓\n1366685291646357507 [2021-03-02] @visakanv 💜 9 🔁 1\nthe challenge as I see it: there are people who are hurting and want to transmute that hurt to make the world a better place, but often their impulse tends to be overly prescriptive, overly broad, and overly damning. it's not very effective (IMO) at achieving the desired result\n↓\n1366685881969467392 [2021-03-02] @visakanv 💜 7 🔁 1\nbut we can't yell at people to get them to stop yelling at people, do you see the humor and irony in this? https://t.co/ZPmtOLI6R2\n  [Quoting @visakanv: @RonenV \"stop screaming into the void\", scream the people into the void]\n↓\n1366686661115932677 [2021-03-02] @visakanv 💜 5\noh yeah. sometimes one person's poison is another person's antidote. sometimes some guy's life is pathetic shit until he discovers Hustle And Grind, and it literally transforms his life into something wonderful... so surely he should Share The Good News? https://t.co/aahSuENt7b\n  [Quoting Tweet 1366686058734383105 (missing)]\n↓\n1366687233722355714 [2021-03-02] @visakanv 💜 10 🔁 1 [(SEED) type=quote_of_root]\nso... having been through 100s of such conflicts and witnessing a lot of pain/anger/grief etc, the only thing I think I can be sure about is that it's precious and important that we have spaces where people can try to see where each other is coming from https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1366687862574313472 [2021-03-02] @visakanv 💜 5\nsuch spaces should exist, but we cannot force, coerce, bully people into participating in such spaces. a lot of people struggle with this, and a common phrase I've heard is \"I wish someone had set me straight\". It's VERY TRICKY BUSINESS, I would be *extremely* cautious abt this\n↓\n1366688546258477056 [2021-03-02] @visakanv 💜 6\nit should be opt-in. we must respect people's autonomy. personally i volunteer to devote my life to making my comments sections – twitter, yt, my ii salons, almost everything I do– spaces where people can learn about each other's experiences &amp; backgrounds\n\nhttps://t.co/g2bJ4cUUcO\n  [Quoting @visakanv: Incredibly thoughtful high-effort comment from an Indonesian on this video. I dream of a world where the global commons comment section is like this. Let’s make it happen 🌏❤️ https://t.co/C4M6oeIKBc https://t.co/151sIkLA8f]\n\n===\n\n1408363298353860618 [2021-06-25] @visakanv 💜 107 🔁 10\na story is supposed to take the audience on a journey from A to B\n\nif the journey is good, people will largely forgive bumps along the way\n\nif the journey is uninteresting, then even slight bumps become annoying\n\ncreators often misread criticism of bumps to mean \"reduce bumps\"\n↓\n1408363614939934721 [2021-06-25] @visakanv 💜 37 🔁 1\nbut no amount of bump reduction can save a fundamentally uninteresting story\n↓\n1408365320000008198 [2021-06-25] @visakanv 💜 28\nand yet like 80-90% of analysis, criticism, etc tends to fixate on bumps\n\nbecause that's what's most visible\n\nthe problem is almost always upstream tho\n↓\n1408365836981575685 [2021-06-25] @visakanv 💜 13\nIME the best and most useful criticism tends to come in the form of, \"I think what you were going for here is A, and I think component B falls short of achieving A because of C. Maybe D would've worked better?\"\n↓\n1408366144063295491 [2021-06-25] @visakanv 💜 16\nyou see how, if it turns out the critic was wrong about A, then even if they were correct about B, it would not be helpful to the creator\n\ntho the creator has to ask himself, how come the critic thought I was trying to do A? how did I fail to convey what I was really going for?\n↓\n1408366966927020034 [2021-06-25] @visakanv 💜 20 [(SEED) type=quote_of_root]\nyou see how telling stories and receiving feedback becomes a way to get insight into the assumptions other people have. and if you have thoughtful conversations with them about it, you can learn about their experiences\n\nhttps://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1408367508994752514 [2021-06-25] @visakanv 💜 12\nand the assumptions you yourself have! I think in the early days of storytelling, or blogging or whatever – making public utterances – it's common to experience a baptism of fire where you learn how many of the things you take for granted turn out to be unique to your experience\n↓\n1408368292889169924 [2021-06-25] @visakanv 💜 12 🔁 1\nsome would say this is growing up, or becoming more worldly, or becoming less clueless – learning to understand that different people have different experiences, different models of reality, attach different meanings to words, labels, symbols\n  https://t.co/19zdOv4ZUs\n  [Quoting @visakanv: People typically have high-res models of their own lives and lower-res models of other people’s. We are all born clueless with incredibly low-res models of the world - then we tweak and upgrade our models. Different people do this to different degrees depending on many variables]\n↓\n1408369962335432709 [2021-06-25] @visakanv 💜 35 🔁 4\nbeen thinking lately that both dunning-kruger (thinking you're more competent than you are) and imposter syndrome (thinking you're less competent than you are) are forms of solipsism, addressed by having conversations with other people to get a sense of where *they're* at\n↓\n1408371807963336707 [2021-06-25] @visakanv 💜 25\ninteresting, kinda wild corollary: it may not be possible to perceive oneself accurately in isolation. in a certain sense, we can only know who/what we are in relation to others.\n\nthe self might not exist in isolation. like, very literally! \n https://t.co/ulimxXKiMv\n  [Quoting @visakanv: Christopher Knight similarly-ish described how, in his 27-year hermit solitude, \"I lost my identity. There was no audience, no one to perform for. There was no need to define myself. I became irrelevant.\"  https://t.co/Px7dJadeUD https://t.co/W9Jm0MYWLH]\n↓\n1408372565085605893 [2021-06-25] @visakanv 💜 22 🔁 2\nthe coherent self is a construct for interfacing with other people (inter-face!)\n\nthe self being a construct, an authored fiction, does not mean that it is \"fake\" or \"not real\". it's a role we play, one we can play very seriously, earnestly, passionately, sincerely, virtuously\n↓\n1408372827057582081 [2021-06-25] @visakanv 💜 14\nanyway, in conclusion I think Mass Effect: Andromeda could have been a much better game story-wise https://t.co/n4pg7CMLQK\n\n===\n\n1414509059558952962 [2021-07-12] @visakanv 💜 63 🔁 3\nI’ve been obsessed about space and human progress since I was a child\n\nthe thing to understand here is that the thing that people are upset about is not the thing that we care about\n\nthis is an echo of so much misunderstanding in the world: people talking past each other https://t.co/zQHwDwPBiF\n  [Quoting Tweet 1414343963708821505 (missing)]\n↓\n1414509418914271232 [2021-07-12] @visakanv 💜 18 🔁 1 [(SEED) type=quote_of_root]\nimagine having different interpretations than someone because of a different set of assumptions and experiences https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1414509984587534336 [2021-07-12] @visakanv 💜 33 🔁 3\nus getting better at understanding each other and communicating with each other would be a more impressive development in human progress than space travel\n\ncool thing is, while not all of us can contribute to space missions, all of us can contribute to the project of human comms\n↓\n1414510597975154696 [2021-07-12] @visakanv 💜 6 🔁 1\nand I say this as someone who clung to the promise of space to keep me afloat psychologically in the depths of my darkest despair! I still think space exploration is a tremendously valuable thing to do. Neil said it better than I can: https://t.co/Ai1shropqc\n  [Quoting @visakanv: I want to do a thread of video snippets that have moved me deeply over the years  This bit from Neil Tyson was at the heart of my motivation to stay alive ~2013 – the idea of expanding human consciousness via space travel https://t.co/B5cc3GWp1M]\n\n===\n\n1423908343857303556 [2021-08-07] @visakanv 💜 26 🔁 4\nSaw a comment quoted in a news article where a person sees a minority speaking about racism as “wanting to stir and cause more hatred and conflict”\n\nI understand where they’re coming from. As they point out- all parties involved have apologised! Why can’t you just forgive? https://t.co/7WfcatIQd4\n↓\n1423909330949054464 [2021-08-07] @visakanv 💜 17 🔁 1\nthe core of the conflict is this, in my view: targets of racist acts - or shall we call them “culturally insensitive and stupid mistakes” know that these are not one-off incidents. \n\nIt’ll happen again. And again. And again. https://t.co/pKCMoGFxnk\n  [Quoting @visakanv: In 1992, a Member of Parliament said Little India was pitch dark because there were too many Indians. He apologised. We forgave him.  In 2016, a Member of Parliament called Indians “walking time-bombs.” She apologised. We forgave her.  How many more times will we have to forgive? https://t.co/ABu0JxhMr6]\n↓\n1423909946979086340 [2021-08-07] @visakanv 💜 15 🔁 1\nif you see events as isolated incidents, then the target’s reaction seems overblown. And then it’s natural for us to start looking for an explanation. Oh, she likes the attention. Oh, she wants drama. Oh, she wants to stir hatred and discord. She’s a malevolent trickster spirit\n↓\n1423910511649771521 [2021-08-07] @visakanv 💜 34 🔁 2 [(SEED) type=quote_of_root]\nthe reality of it seems to actually be quite a bit simpler than that: one person sees events as isolated incidents, while another sees them as part of a wider pattern https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1423913351311097860 [2021-08-07] @visakanv 💜 8\nhere’s a thread about a dear old friend of mine who had a breakthrough in realising that women’s experiences of sexism are not isolated incidents https://t.co/em9idZH4X6\n  [Quoting @visakanv: Woke up to some interesting messages in a group chat with my wife &amp; one of our closest friends we’ve known for ~15 years. Let’s call him C. C is a really sweet, kind, helpful guy, who had a minor revelation last night that he’s still reeling from. (Mine happened a few years ago)]\n↓\n1423914104733929478 [2021-08-07] @visakanv 💜 5\nanother thread about patterns and perception https://t.co/jQhPwz1Nl6\n  [Quoting @visakanv: but even if you have a ~thousand~ data points about racism or sexism or some other form of bigotry, it will *feel* very different to people \"inside\" vs \"outside\" – and I think that's a function of how many of your OWN experiences are data points in that pattern]\n↓\n1423915249413984256 [2021-08-07] @visakanv 💜 12\nnotice that I have threads about this going back several years\n\nI expect to continue talking about this for the rest of my life, and manage my time &amp; energy accordingly \n\nyou have to have a strategy if you want to be sustainable &amp; not burn out\n\nsome people take 10 years to see it\n↓\n1423923155836366848 [2021-08-07] @goblinodds 💜 5\n@visakanv damn, good threads\n\ni think this all gets complicated by the fact that emotionally charged topics are ripe for grifting, so grifters gravitate to them and it's hard to tell the difference from sound bytes, and when grifters get outed that's its own news story\n↓\n1423923319154241538 [2021-08-07] @goblinodds 💜 4\n@visakanv i have no idea what would make this less of a problem\n↓\n1423924265770909700 [2021-08-07] @visakanv 💜 5\n@goblinodds my instinct is we need more good actors with sound credentials who are respected/supported by their communities\n\n===\n\n1429316509176786948 [2021-08-22] @goblinodds 💜 37\nok when people talk about solving interpersonal \"communication\" problems i didnt realize they meant this--\n\n1/\n↓\n1429316509969436682 [2021-08-22] @goblinodds 💜 29\nmy bf and i get into pretty frustrating debates(?) occasionally, where i get frustrated because he wont pause to clarify a step in his logic, and he gets frustrated because i won't let him finish a sentence\n\n2/\n↓\n1429316510917357569 [2021-08-22] @goblinodds 💜 41\nturns out when making a multi-step argument, i do most of my thinking before i speak, and i assume everyone else does this, BUT THEY DON'T.\n\n3/\n↓\n1429316512003751938 [2021-08-22] @goblinodds 💜 34\nso i was upset that my bf wouldn't pause to explain step A and my bf was upset because *by explaining step A* he was processing his thoughts and i was effectively interrupting his train of thought!\n\n4/\n↓\n1429316513542991877 [2021-08-22] @goblinodds 💜 41\nand that's how i learned \"you're interrupting my train of thought\" can be literal (rather than\"you're interrupting my train of speech\") even if the speaker looks like they're confident\n\n5/\n↓\n1429316514524528641 [2021-08-22] @goblinodds 💜 37\ncaveat: i was stoned upon having this realization and i'm stoned now, so i'm not sure any part of this is accurate\n↓\n1429316977881849860 [2021-08-22] @goblinodds 💜 27\nit's wholly possible that if i'd been sober for this interaction, i'd've registered it as \"oh he's bullshitting, not describing his previously-thought-out argument\" and i've just had to recreate it mentally from scratch bc i'm stoned, but here we are\n↓\n1429341596017778690 [2021-08-22] @visakanv 💜 8\n@goblinodds this is why we all need whiteboards to map out our arguments https://t.co/1lomXZCpix\n  [Quoting @visakanv: @empathy2000 @nickcammarata @sonyasupposedly @diviacaroline nerd: let’s hit “inspect element” on this conversation to figure out wtf just happened  most people: don’t change the subject  people here: [crowds around with notebooks] hmm interesting we should map out the whole conversation tree and investigate the external causal factors]\n↓\n1429344895613816833 [2021-08-22] @goblinodds 💜 3\n@visakanv YES\n↓\n1429345213848252416 [2021-08-22] @visakanv 💜 6 🔁 1 [(SEED) type=quote_of_root]\n@goblinodds people: visa how are you and your wife so in sync and get along so well\n\nme: diagrams\n\npeople: hahaha he’s joking about being a nerd\n\nme: https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1429344627656589312 [2021-08-22] @visakanv 💜 15 🔁 1\nI do a version of this with social graphs, mostly subconsciously https://t.co/Gtv6J1TETK\n  [Quoting Tweet 1428592627541155845 (missing)]\n↓\n1429345408933789697 [2021-08-22] @visakanv 💜 8 [(SEED) type=quote_of_root]\nand also disagreements https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1439950786545393664 [2021-09-20] @visakanv 💜 122 🔁 10\nI wonder what % of people who dislike small talk maybe don't quite know how to enjoy it. it's less about the content and more about the exchange. it's like passing a ball back and forth. the fun is in the flow, the attention, the feedback, the dynamic https://t.co/ki0vqPMhBP https://t.co/ClCcvXDuVn\n  [Quoting Tweet 1439726101937463296 (missing)]\n↓\n1439951625766903809 [2021-09-20] @visakanv 💜 53 🔁 1\n^ why are these men wasting their energy on such a vapid game of hitting a ball? because it's not the ball they care about. it's each other. it's about being a part of something bigger than themselves.\n\nthe trick to enjoying small talk is to pay just a little bit more attention\n↓\n1439952377675583494 [2021-09-20] @visakanv 💜 36\nyou can be doing small talk with someone, even a stranger, and if you ask the right question in the right way at the right moment, you can turn a \"pedestrian moment\" into something precious, valuable, even profound https://t.co/63Kjs2kQAz\n  [Quoting @visakanv: of course you have to hear it in context – with the relief and the disbelief and all https://t.co/BhyuB7W07h]\n↓\n1439953683765022721 [2021-09-20] @visakanv 💜 28 🔁 1\nonce you've experienced this, everyday life becomes charged with tremendous potential &amp; meaning. a random chat with a stranger could lead to the opportunity of a lifetime, if you have the right energy. you can treat every conversation as a dance https://t.co/cyeRfFQh8u\n  [Quoting @visakanv: I love seeing shie boon’s instagram vids, he’s like a poet who uses his body in physical space https://t.co/lNAWOI5N6t https://t.co/gPpYwixfJC]\n↓\n1439954297240784904 [2021-09-20] @visakanv 💜 21 🔁 1\nbut even that's not quite the right frame... because you shouldn't go into conversations as an opportunist. people can tell. the point is to enjoy the act itself. small talk is verbal dancing, you can learn to enjoy it for its own sake https://t.co/kDbbawJY44\n  [Quoting @visakanv: I think a lot about how Feynman got his Nobel Prize from “piddling around with wobbly plates”. I’m always looking for wobbly plates to piddle with.   And of course the point isn’t to get the Prize, but to enjoy the piddling https://t.co/FQNTZdChsN]\n↓\n1439956085868167169 [2021-09-20] @visakanv 💜 21 🔁 1\nbtw, I think the binary dichotomy of \"you are either talking about feelings or you are communicating ideas\" is *extremely* misled\n\nI have spent more time studying the communication of ideas than probably 99% of people my age\n\nwanna guess how idea-comms typically breaks down? https://t.co/I3raVIxP96\n↓\n1439956571497193478 [2021-09-20] @visakanv 💜 16 🔁 1\nI have seen this happen literally THOUSANDS of times – people who think they're \"communicating ideas\" witness the whole thing crash and burn because they didn't take the trouble to get aligned with each other\n\nhttps://t.co/qb4rNw84Ps\n  [Quoting @visakanv: I still remember when an interesting thread about finance on HN a few years ago got derailed because two people started attacking each other personally  Personal attacks are juicy but they follow the same boring cycles every time, nobody learns https://t.co/cw3Uc67oKC]\n↓\n1439957330066432005 [2021-09-20] @visakanv 💜 21 [(SEED) type=quote_of_root]\nyou cannot separate ideas from people, because different people have different interpretations of the \"same\" idea. what do you mean by democracy? what do I mean by democracy? we mean different things because of our respective experiences https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1442250739313623044 [2021-09-26] @visakanv 💜 91 🔁 11 💬 1\nactually thinking on it more I am probably weirdly/unusually well-adapted to “how do you broadcast a lot of your inner self online without getting pwned” and there’s probably stuff I take for granted as obvious that would be very useful for some people to hear\n  [Quoting Tweet 1442228481710952450 (missing)]\n\n===\n\n1442258905149571077 [2021-09-26] @visakanv 💜 21\n(once you demonstrate that you’re someone who is respectful of other people’s boundaries, and that you will honor their secrets and their stories, people start opening up to you about all sorts of wild, crazy shit. This is a life-changing before/after transition. Different world)\n↓\n1442259454884401153 [2021-09-26] @visakanv 💜 25\nit’s probably not too bad an oversimplification to say that if you make a conscientious effort to always be thoughtful, sensitive and kind, then you’ll basically be fine. The challenge is to be humane while people try to goad you into drama. Extreme sport https://t.co/8qCNhLmbQ1\n↓\n1442260275449647110 [2021-09-26] @visakanv 💜 20 🔁 1\nalso sometimes there’s just no avoiding that you will get your ass kicked for making mistakes and the challenge is to accept it as graciously as you can\n\ncool thing is, while it’s painful as heck, good people recognize when you’re being gracious and will value you more for it https://t.co/Djg6VIND1W\n  [Quoting @visakanv: Visa’s rules for life [draft]  1. recognise when u get ur ass kicked, &amp; accept it with grace  2. if u *have* to kick someone’s ass, be swift, don’t be a dick about it  3. if u can save an innocent ass from being kicked, do so  4. remember, life kicks everybody’s ass in the end https://t.co/Um8cpgnREB]\n↓\n1442260614710059014 [2021-09-26] @visakanv 💜 22\nalso yeah: disregard the follower count as a measure of self-worth or meaning or anything like that. instead focus your time and attention on the people you respect and admire. there are like a dozen people here whose opinions I’d trust/value over 30,000 other people\n↓\n1442260822168768518 [2021-09-26] @visakanv 💜 12\npast like 20k followers, or once it starts to annoy you, turn off all the notifications\n↓\n1442261248318447621 [2021-09-26] @visakanv 💜 26 🔁 1\ntry to periodically switch up your posting style so you don’t get pigeonholed into playing a tediously predictable role for a tediously predictable “target audience”\n\ntry to surprise and entertain yourself and seek genuine novelty https://t.co/YsF6RSbOCA\n  [Quoting @visakanv: Sermonposting without shitposting gets you pedestalized, which is dehumanizing   Shitpost too much and nobody takes you seriously, which is also kind of dehumanizing  You can nerdpost forever quite happily, but it can be a lonely and frustrating experience  The flow is the point https://t.co/HYsXv2Bhpc]\n↓\n1442261904315977729 [2021-09-26] @visakanv 💜 30\nhave some stuff going on in your life that you care about that has nothing to do with Internet points. play the guitar, learn to cook. It’s nice to have at least one thing that’s just for you that you refuse to turn into content\n↓\n1442262156779528196 [2021-09-26] @visakanv 💜 27 🔁 1\nmeditate on death and the impermanence of all things \n\nI’m serious lol\n↓\n1442262882431819776 [2021-09-26] @visakanv 💜 22\nencourage and celebrate the replies that you like. generally best to disregard/ignore the ones that you don’t \n\n(at this stage sometimes I don’t notice some replies, it’s not personal!)\n↓\n1442263333042733060 [2021-09-26] @visakanv 💜 24 🔁 1\nif you use quote tweets primarily to celebrate and uplift people you like, this leads to a positive spiral of good things happening https://t.co/tFaWtEZM1p\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1442264116983320577 [2021-09-26] @visakanv 💜 17 🔁 2 [(SEED) type=quote_of_root]\nif you’re drawn into a disagreement, generally the smart thing to do is to try and ask genuine questions. sometimes people warm up and you can even become friends. if they’re hostile about it you can graciously just stop replying and move on https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1442264556135280641 [2021-09-26] @visakanv 💜 19 🔁 1\nif people are being dickish or abusive to other people in your mentions, block them. Think of it as asking them to leave your house. It’s worth it to create a warm and pleasant environment for everyone else who knows how to play nice\n↓\n1442266400924450825 [2021-09-26] @visakanv 💜 25 🔁 2\nI guess I’ll close with: try to be an account you respect. If you respect yourself, everything else tends to fall into place. If you don’t respect yourself things can get very ugly bc your internal conflicts will play out viciously with other people\n\n(this isn’t just abt twitter) https://t.co/R7hqDvWkTL\n  [Quoting @visakanv: If I may, I would say that in my experience, “happiness” is a function of   - earning your own self-respect - living in accordance with your values - building relationships with people you respect  - doing work you enjoy and believe in - bring playful and curious and kind]\n↓\n1442266784686501893 [2021-09-26] @visakanv 💜 17\nanyway I am just some guy who tweets a lot, if you found this stuff helpful, cool! If not, o well, it wasn’t for you I guess. It’s not a big deal\n↓\n1505986699297386497 [2022-03-21] @visakanv 💜 7\nredteaming https://t.co/wJLh91fTw6\n  [Quoting @visakanv: there's a kind of literacy that doesn't get talked about much, and it's something like running a \"how will this be misinterpreted negatively\" filter over your writing while you do it. has to be a more succinct way of putting this. antagonist literacy? defensive literacy? 🤔]\n\n===\n\n1478590492988227584 [2022-01-05] @visakanv 💜 240 🔁 20 💬 1\nTyrants especially hate artists, comedians and journalists. \n\nTo dismantle your inner tyrant, you will need to first break your artist, comedian and journalist out of prison\n\nand then do a heist, to steal the jewel of life from the tyrant’s palace\n↓\n1478595282174550016 [2022-01-05] @visakanv 💜 34 🔁 4 [(SEED) type=quote_of_root]\nAt 31 it’s now obvious to me that almost all of my conflicts with my friends when we were teenagers came from the different models – values, beliefs, principles, assumptions – that we each inherited from our families, and never thought to question at the time https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1486114071065677826 [2022-01-25] @jd_pressman 💜 13 [(SEED) type=quote_of_root]\nMaybe the real magic of drugs like MDMA is it gets people out of their usual shell enough to just blurt out what they're actually, *actually* thinking during these discussions. \n\n\"Trying to be too rigorous cost me opportunities.\"\n\"I was in a cult and logic saved me.\" https://t.co/5Po0FceKFh\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1486114073204776963 [2022-01-25] @jd_pressman 💜 9\nWhy are all these people overawed about 'embodiment'? Are they in pain all the time? Is compulsory schooling teaching them their body isn't theirs? Is it actually just a cover for giving themselves permission to be a sexual reproductive being? No clue tbh\n\nhttps://t.co/RtPS6mQCUE\n  [Quoting @nosilverv: Trauma comes from being unable to move and thus not being able to process the emotional events. Embodiment fixes this by causing movement. Sobbing is a form of movement.]\n├── 1486114075436150792 [2022-01-25] @jd_pressman 💜 7\n│   Wanting to be a 'happiness billionaire' is just ??? to me. I remember reading things like https://t.co/Oree8PHr0B and realizing that I don't care if becoming a Buddhist monk will make me happy. I want what I want not what will make me feel good.\n│   https://t.co/j62aNW7gAW\n│     [Quoting Tweet 1362265963438235648 (missing)]\n│   ↓\n│   1486114077638201344 [2022-01-25] @jd_pressman 💜 5\n│   I know in principle that abuse is widespread and modernity is invasively controlling, but it doesn't feel real. I suspect my hedonic baseline is higher than usual. If it was lower maybe I'd be desperate for anything that promised to make me feel good.\n│   ↓\n│   1486114079399809028 [2022-01-25] @jd_pressman 💜 4\n│   Something feels arrogant-disgusting to me about saying it, but I suspect I'm 1/1000 in my natural resistance to trauma. I'll often share memories about things like being left to bleed in a locked room at school to shocked onlookers. They're hurt by memories I think of as normal.\n│   ↓\n│   1486114081245261826 [2022-01-25] @jd_pressman 💜 4\n│   I'm not alone, one of the things I found so shocking reading about the life of Anne Sullivan is how horrible the things that happened to her were. Just startlingly, relentlessly awful, and yet she seems to have stayed entirely functional through all of it.\n│   https://t.co/cLPo6zscOR\n│     [Quoting @jd_pressman: As always I recommend reading the life of Anne Sullivan Macy, who barely got into a school for the blindness she contracted as a child living with her abusive family that died of tuberculosis leaving her in the poor house.  https://t.co/TMwyhZfIu7  She taught Helen Keller to read]\n│   ↓\n│   1486114083287932928 [2022-01-25] @jd_pressman 💜 6\n│   If this was just a case of \"people have different problems\" I'd shrug and let it be. But when it results in people coping by loudly denouncing the things I love as bad and the problems I care about as non-problems I'm forced into conflict with them.\n│   \n│   https://t.co/Zr5z3X9Ylm\n│     [Quoting @visakanv: for today's meditation i am accepting that many people want to be wrong and enjoy being wrong and it might be selfish of me to try and take that away from them]\n│   ↓\n│   1486114088073584647 [2022-01-25] @jd_pressman 💜 4\n│   It's possible to force people to update by sharing an insight that makes the environment resist their malignant strategy more, but the underlying motivations haven't changed. Forcing unaligned agents away from bad behavior is a slow and tedious way to capture stones. https://t.co/3SHhCN0yWk\n│   ↓\n│   1486114090036596736 [2022-01-25] @jd_pressman 💜 8 🔁 1\n│   People harp about how systems are bad because they're intrinsically flawed when it seems to me like most of the problem is systems plagiarizing insights they couldn't have come up with themselves in the course of advertising their aesthetics.\n│   \n│   https://t.co/Ub7Y4ZmERT\n│     [Quoting Tweet 1482817033406345216 (missing)]\n│   ↓\n│   1486114091848503298 [2022-01-25] @jd_pressman 💜 9\n│   Ideology is a lemon market. Rampant plagiarism means that without careful research it's hard to tell what to invest in to get what results. Laundering personal experience into 'objective' arguments lures in poor fit people who are then treated as bycatch.\n│   \n│   https://t.co/pcgoztCkHd\n│     [Quoting @nosilverv: @jd_pressman Yep, I speak to my former self/those like me, think i've said this a few times]\n│   ├── 1486114093685608448 [2022-01-25] @jd_pressman 💜 7\n│   │   It's not that objectivity doesn't exist, it just isn't the central feature or battleground for most of what's going on with a lot of 'objective' arguments. This can be endlessly frustrating if you actually care about the things people appropriate for LARP\n│   │   \n│   │   https://t.co/yDqBoBrfBy\n│   │     [Quoting @nosilverv: This article sounds like a meme but its def. been the case that as I've grown to need society less for protection I've become more and more at ease with 'woo' whereas before it was anathema   https://t.co/9f0Zmu0VPu]\n│   └── 1486285409801887751 [2022-01-26] @nosilverv 💜 1\n│       @jd_pressman Many offers! Many options! Choose what works! Discard what doesn't! Boldly stating a premise is a great way to figure out how you're wrong, especially on the internet!\n└── 1486285094683914241 [2022-01-26] @nosilverv 💜 2\n    @jd_pressman Probably because they correctly ascertain that they're disembodied!\n    ↓\n    1486285670129627147 [2022-01-26] @jd_pressman 💜 2\n    @nosilverv Could you speak more to the internal experience/phenomenology of that? If someone reading this thread is curious whether they're disembodied or not, how would they figure it out?\n    ↓\n    1486286971207045120 [2022-01-26] @nosilverv 💜 2\n    @jd_pressman Sure!\n    ↓\n    1486287019731042306 [2022-01-26] @nosilverv 💜 9\n    @jd_pressman Once I was having a physical education class and we were supposed to notice various parts of our body, starting from the feet, the lower legs, going up. I remember when it got to my head me being genuinely viscerally and utterly shocked that my head was part of my body\n    ↓\n    1486287145413361674 [2022-01-26] @nosilverv 💜 3\n    @jd_pressman Like genuinely in shock lol. Like up to that moment it... it's not like I was attending to the separation but it was just a given that body was one thing, head another and body MOST DEFINITELY did not include the head\n    ↓\n    1486287288095199232 [2022-01-26] @nosilverv 💜 5\n    @jd_pressman The locus of my existence seemed to be 'above the neck' or 'before the eyes' or 'inside the head'. Now the locus of my existence is co-existent with the *full* extension of my body\n    ↓\n    1486287477006643203 [2022-01-26] @nosilverv 💜 3\n    @jd_pressman It was very easy, trivial even, maybe the default state, for me to not be aware of my body. I'd be hyper-focused in whatever i was seeing and completely lose track of myself as a physical being with physical extension. Now I'm aware of my body *all the time*.\n    ├── 1486289187661774849 [2022-01-26] @jd_pressman 💜 2\n    │   @nosilverv Asking this in total seriousness: Did you ever do things like turn your head or roll your head around on its neck swivel? Neck is of course the connection between head and the rest of the body, so it seems like there would be weird impacts on use of it in this state.\n    │   ├── 1486290716183580672 [2022-01-26] @jd_pressman 💜 2\n    │   │   @nosilverv One question I've been asked before is \"how many points of contact on your body are you ambiently aware of while sitting in a chair, if you just close your eyes and count them\" and I confusedly reply \"all of them? &lt;long list&gt;\" This is apparently not universal?\n    │   └── 1486292714341773313 [2022-01-26] @nosilverv 💜 2\n    │       @jd_pressman I remember i did a movement class once and dropped my head with such violence on the floor the teacher let out a little shriek lol. Total disconnection\n    └── 1486292504483872768 [2022-01-26] @nosilverv 💜 3\n        @jd_pressman Like, before, if I were typing i'd basically only see the screen (collapsed awareness?) now i see the screen in the context of all else which INCLUDES my body: both what i see of it (hands, arms) and\n        ├── 1486292526680223749 [2022-01-26] @nosilverv 💜 4\n        │   @jd_pressman what i feel (forearms pressing against the table, shoulders heavy, back against chair, ass against chair, feet on ground\n        └── 1486295762094858241 [2022-01-26] @jd_pressman 💜 1\n            @nosilverv Does this imply you wouldn't touch your face or rest your head on your hand, or other actions which make the connection between the head and the rest of your body obvious? Like you're just rigidly sitting there controlling a head and a body?\n\n===\n\n1506172280258260997 [2022-03-22] @visakanv 💜 52 🔁 4\nI’ve witnessed something like 4 different good-faith conflict confusion-arguments in the past few days, each about entirely different things, and they ALL seem to have the same pattern where two people have different models, reduce the same complex reality down to diff maps\n↓\n1506172945651023873 [2022-03-22] @visakanv 💜 27 🔁 1\nIn every single case I found myself saying “it’s obvious to me that all of you are correct lol” and with more probing and investigation it turns out that people typically are differently sensitive to different failure modes, which they might not be comfortable leading with,\n↓\n1506173889541378052 [2022-03-22] @visakanv 💜 30 🔁 1\nand which cannot be condensed into simple utterances. to make something compelling requires an act of faith in the compression (and audience).\n\nalmost all communication involves compression, plaintext tweets compress harder than almost anything else, conflict happens in the gaps\n↓\n1506174572579618816 [2022-03-22] @visakanv 💜 25\npeople very attached to their maps, for important emotional reasons. They’re often literally maps of pain, heartbreak, grief, disappointment. “This is where dad beat me” “this is where gf broke up with me” “this is where I got fired” – and someone else’s map leaves these out??\n↓\n1506175336072896514 [2022-03-22] @visakanv 💜 17 [(SEED) type=quote_of_root]\nI mean that more figuratively than literally – “if this happens then that might happen”, precautions, scar tissue \n\nThis old frame does still apply, although rereading it I find “assumption” doesn’t quite hit by itself. Maybe I’d also add “reasoning” https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1506177869675839496 [2022-03-22] @visakanv 💜 18\nanother interesting pattern is that, usually at least one person in the conflict has an overly binary “well it’s either black or white” frame. If it’s just one person, then it can be solved with patient Q&amp;A. But if it’s both people simultaneously, it can be much more challenging\n\n===\n\n1508693443752517634 [2022-03-29] @visakanv 💜 69 🔁 1 [(SEED) type=quote_of_root]\nThe Slap is one of the greatest examples I've ever seen to demonstrate the phenomenon of disagreement,  we get to see different people truly experiencing different realities in real time. It's like The Dress (black/blue vs white/gold). Might do a whole essay about this https://t.co/p3FcArCgRF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1508693964295049221 [2022-03-29] @visakanv 💜 17 🔁 2\nhttps://t.co/1yljFJttlD\n  [Quoting @SteveStuWill: \"Perceptual illusions show us in a clear and unambiguous way that we don’t directly perceive the world around us. Perceptual experience is a simulation—a mental model—that doesn’t always correspond to the reality it aims to depict.\" https://t.co/4E8xM6JFdR https://t.co/lNGGWwb3JA]\n\n===\n\n1573486199330717696 [2022-09-24] @Malcolm_Ocean 💜 7\nI've been thinking that we could probably use bespoke offramps for cults, but it seemed obvious to me that they'd need to be written by people who'd left those exact cults, articulating new views that actually transcend &amp; include the old views, not just pay lip service https://t.co/hoDaDqR4Xf\n  [Quoting Tweet 1573302851908308997 (missing)]\n↓\n1573486201742434315 [2022-09-24] @Malcolm_Ocean 💜 1\nthese are obviously going to be a lot less opinionated towards a lateral viewpoint than the permission structure versions\n\neg for vax might say something more honest like \"yeah, there are risks. I eventually decided it was worth it, but it's a tough call\"\nhttps://t.co/VhioU5axbq\n  [Quoting Tweet 1573228608784834561 (missing)]\n↓\n1573486204040912910 [2022-09-24] @Malcolm_Ocean 💜 1\nif you actually understand someone's actual experience &amp; values, you can actually engage with them and help them figure out what's actually good for them, which is a very different kind of move\n↓\n1573486206163230735 [2022-09-24] @Malcolm_Ocean 💜 1\nit could be that some of the people someone might be trying to influence don't actually have a deep take on the situation, they just have a bit of rhetoric that resonates with some aspect of their experience, and are thus easily given a new one\n\nbut\nhttps://t.co/7qCchofxGR\n  [Quoting @eigenrobot: \"permission structuring\"   my fundamental objection to this is that it is not how one speaks to free men and equals]\n↓\n1573486208428244992 [2022-09-24] @Malcolm_Ocean 💜 3\noverall this offramps thing seems like it could comprise a whole sub-department of the Memetic Mediation Division of the Metamodern Post-propaganda Project\n↓\n1573486210323980293 [2022-09-24] @Malcolm_Ocean 💜 1\na link to some of my earlier speculation on this topic, though I don't go into much depth there:\n\nhttps://t.co/Fc6l0s76xE\n  [Quoting @Malcolm_Ocean: @stephlepp Ooooh, this is very cool. Dovetails with something I'd been thinking about which is how to create an offramp or series of offramps for different extreme viewpoints. Your thread here seems like a starting point for a manual on how to do that. https://t.co/xrDGMXUtSa]\n↓\n1573730298273361920 [2022-09-24] @Malcolm_Ocean 💜 2 💬 1 [(SEED) type=quote_of_root]\nusefully working with disagreements requires understanding that different people have different context and that this necessarily informs how they see things\n\nyour view is as obviously wrong to them as theirs is to you\nhttps://t.co/dRgb18LzsB\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1573496282089504768 [2022-09-24] @Malcolm_Ocean 💜 3\n@visakanv where's your tweet with the image of how different background experiences yield different conclusions?\n↓\n1573513884987625472 [2022-09-24] @lukeallenmiller 💜 3 [(SEED) type=quote_of_root]\n@Malcolm_Ocean @visakanv I had this bookmarked. Is this it? https://t.co/b7yG81lZwp\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1573729453590867968 [2022-09-24] @Malcolm_Ocean 💜 1\n@lukeallenmiller @visakanv yup, nice, thanks!\n\n===\n\n1574106362719735810 [2022-09-25] @RichDecibels 💜 152 🔁 10 [(SEED) type=semantic_search]\nif I could broadcast one insight en masse, its the conviction that the people who disagree with me are not wrong, inferior, bad or stupid, they simply have different experiences &amp; values generating a different perspective to mine\n↓\n1574106824705560581 [2022-09-25] @RichDecibels 💜 67 🔁 1\nwhen you grasp this, every issue becomes more slippery: it erodes nearly everything you held certain. but it's not the end of meaning or truth or goodness, and it is in fact the way out of polarisation &amp; stuckness, and its the most fun &amp; interesting &amp; connected way to live\n\n===\n\n1574245008466710528 [2022-09-26] @Malcolm_Ocean 💜 19 💬 4\nYou know that thing where neither person can hear the other because they both feel so unheard?\n\nI call this \"knot-listening\"\n\n3 step solution:\n 1: hear *yourself* thoroughly\n 2: hear the other person thoroughly (by their standard!)\n 3: get them to hear you\nhttps://t.co/cihQJXHFvi\n↓\n1574245009968308225 [2022-09-26] @Malcolm_Ocean 💜 3\nIf 2 isn't working, return to 1.\n\nhttps://t.co/Zmw3iTTKNk\n  [Quoting @Malcolm_Ocean: The more you trust yourself to hold onto your own viewpoint no matter what, the more able you'll be to also take in someone else's.]\n↓\n1574245011750789120 [2022-09-26] @Malcolm_Ocean 💜 4\nI sometimes call this \"self-validation\". It's basically coherence empathy for yourself: really honoring that your own viewpoint makes whatever sense it makes.\n\nhttps://t.co/2woaQfaT5a\n↓\n1574245013390823424 [2022-09-26] @Malcolm_Ocean 💜 5 [(SEED) type=quote_of_root]\nHearing yourself thoroughly enough to hear someone else with different deep assumptions may require self-validating your own experience all the way back to some life experience from years ago!\n\nhttps://t.co/dRgb18L1D3\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1574245015664181248 [2022-09-26] @Malcolm_Ocean 💜 2\nThen when listening, keep this in mind:\n\nJust because someone else's assumption/generalization contradicts yours, doesn't negate the reality of whatever happened that gave each of you those learnings!\nhttps://t.co/4QuBX6V1Kf\n  [Quoting @Malcolm_Ocean: every experience you've ever had was real  but almost none of them imply what you think they imply  nor do they imply what other people claimed they imply]\n\n===\n\n1596882760815476736 [2022-11-27] @tasshinfogleman 💜 16\n“I think you and I had very different childhoods”\n↓\n1596884653960736773 [2022-11-27] @tasshinfogleman 💜 6 🔁 1 [(SEED) type=quote_of_root]\nAmos just straight up intuiting the Diagramhttps://t.co/je1mhTPLWP\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1671901300148310017 [2023-06-22] @visakanv 💜 287 🔁 18 💬 2\nthe amount of self-coercive language i'm seeing amongst my friends/peers has been on the uptick lately\n\nyou don't need to be bullied into doing what you think is right for you\n\nyou don't need to \"be ruthless\" in eliminating bad things like, focus on what you actually want\n↓\n1671903162704314368 [2023-06-22] @cocadonv 💜 1\n@visakanv I don't see the difference https://t.co/sg1r6ff1JU\n↓\n1671903340626685952 [2023-06-22] @cocadonv 💜 2\n@visakanv If you're ready to hear \"stop procrastinating\" from yourself or anyone else itll sound like a relief not bullying\n↓\n1671903752377483264 [2023-06-22] @visakanv 💜 2\n@nebulousverde I am writing this for a very specific set of people that I know pretty well, who already tell themselves \"stop procrastinating\" every day, and aren't experiencing relief as a consequence\n↓\n1671905483270111232 [2023-06-22] @cocadonv 💜 1\n@visakanv Sounds like they're either not ready to hear it or they haven't said it enough times\n↓\n1671906468948512768 [2023-06-22] @visakanv 💜 2\n@nebulousverde it's closer to this \nhttps://t.co/Z8aWjYlTqn\n  [Quoting @visakanv: I get young people in my DMs all the time  a common thing I notice about their despair is that they do a lot of generalizing (\"I can't seem to study for this test\" -&gt; \"I can't do anything\"). Lots of catastrophic thinking, things get very grandiose  I remember this feeling too]\n↓\n1671907409462194178 [2023-06-22] @cocadonv 💜 1\n@visakanv Ah yes I'm familiar with that, but i find it quite orthogonal. If anything it's worth even more bullying\nHim: \"I can't study\"\nMe: \"yea you're right fix that\"\nHim: \"i can't do anything\"\nMe: \"lmao you narcissistic piece of shit. How dare you\"\n↓\n1671908095390523392 [2023-06-22] @visakanv 💜 1\n@nebulousverde we're in agreement about the narcissism problem  https://t.co/ZQ7JbYaT9L\n  [Quoting @visakanv: https://t.co/EzaHMVnlUT]\n↓\n1671910408012038144 [2023-06-22] @cocadonv  [(SEED) type=semantic_search]\n@visakanv What do we disagree on?\n\n===\n\n1690872802440519681 [2023-08-13] @tasshinfogleman 💜 30 🔁 1 [(SEED) type=quote_of_root]\nvisa_disagreement_diagram.jpg https://t.co/je1mhTPe7h\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1713487125629607981 [2023-10-15] @tasshinfogleman 💜 37 🔁 7 [(SEED) type=quote_of_root]\nthis diagram's spread is on the critical path to world peace https://t.co/EY4iwBjxNg\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1713487309180703047 [2023-10-15] @visakanv  [(SEED) type=quote_of_root]\nRT @tasshinfogleman: this diagram's spread is on the critical path to world peace https://t.co/EY4iwBjxNg\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1737538039260356989 [2023-12-20] @tasshinfogleman 💜 68 🔁 3\nfor @threadapalooza 2023 i am going to riff on my friends and internet neighbors' recurring ideas and talking pointsi thought it'd be fun to reflect on what's impacted me and try saying the same ideas in new and different ways\n\n===\n\n1737539627215384678 [2023-12-20] @tasshinfogleman 💜 4\n25. as babies are gestated in wombs, so too everything that lives and thrives and flourishes grows within something else—notice what you're growing, and what it's growing inside of https://t.co/KvElehgmCv\n  [Quoting @RichDecibels: EVERYTHING THAT LIVES GROWS INSIDE SOMETHING ELSE  so if you want to change yourself, change whet you're inside of]\n↓\n1737539764188844081 [2023-12-20] @tasshinfogleman 💜 7\n26. you can ask people about their secrets https://t.co/HLt88k6uig\n  [Quoting Tweet 1671598439870652427 (missing)]\n↓\n1737539804458275154 [2023-12-20] @tasshinfogleman 💜 7\n27. haters are mentors too https://t.co/fjcNqRZR1Q\n  [Quoting @RomeoStevens76: Your haters are sharing hypotheses about where you still have work to do. Really useful free labor.]\n↓\n1737539909479534781 [2023-12-20] @tasshinfogleman 💜 6\n28. tell your life story so far and you will meet yourself again as a new character in a new story, the hero of a whole new world https://t.co/ULb5rDl6Av\n  [Quoting Tweet 1414525598765039616 (missing)]\n↓\n1737539955625246748 [2023-12-20] @tasshinfogleman 💜 7\n29. eat your vegetables. eat twice as many vegetables. eat ten times as many vegetables. be a 100x vegetable eater https://t.co/SQR6VoRCtD\n  [Quoting Tweet 1486311683500949506 (missing)]\n↓\n1737540012713836627 [2023-12-20] @tasshinfogleman 💜 7\n30. if you absolutely need to force yourself to do something, stop once you've started https://t.co/Uut5vZCahu\n  [Quoting @uberstuber: self-coercion is like the pullcord on a lawnmower, you're supposed to stop pulling on it once you get going]\n↓\n1737540044494098770 [2023-12-20] @tasshinfogleman 💜 6\n31. put good theory into practice https://t.co/sHwEdz7fof\n  [Quoting @reasonisfun: I hardly ever draw.  I can happily read art tutorial books all day. And then read the crit forums to see the kind of misconceptions budding artists have.  If I then drew at the end of such a day, I would just be better.  It’s not magic, it’s just what learning stuff does.]\n↓\n1737540079420084600 [2023-12-20] @tasshinfogleman 💜 14 🔁 1\n32. if you don't enjoy it, change it until you do https://t.co/9P90ZFGh2m\n  [Quoting @RomeoStevens76: If you don't enjoy your meditation practice, change it until you do.]\n↓\n1737540117391184257 [2023-12-20] @tasshinfogleman 💜 8\n33. introduce your friends to each other and we'll all be better friends together https://t.co/CE2xaxUBv6\n  [Quoting @christineist: On keeping in touch with friends— Similar to setting up a self-reinforcing life, I think it's really nice to introduce your friends to each other so that each friend individually stays in touch with each other, therefore strengthening the overall network and lessening the burden]\n↓\n1737540235200733247 [2023-12-20] @tasshinfogleman 💜 7\n34. you can care about a lot of people, situation, issues, but your time, energy, resources, and skills are limited—decide carefully what you want to do with them https://t.co/ERCUzqqi9Y\n  [Quoting Tweet 1614714272998895616 (missing)]\n↓\n1737540274216153183 [2023-12-20] @tasshinfogleman 💜 7 [(SEED) type=quote_of_root]\n35. disagreements stem from seemingly incompatible conclusions drawn from wildly different life experiences https://t.co/Yo5O7S09jd\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1737540320458404117 [2023-12-20] @tasshinfogleman 💜 5\n36. widespread loneliness is symptomatic of systemic change and degradation https://t.co/0zcsseduGf\n  [Quoting @RichDecibels: maybe you're lonely because you're fundamentally broken or maybe it's because we spent the last 70 years dismantling social structures that took centuries to develop and we haven't replaced them with anything yet]\n↓\n1737540396777947325 [2023-12-20] @tasshinfogleman 💜 5\n37. cultivate loving friendships—let them lead you towards (romantic) love https://t.co/cVmcwacDHx\n  [Quoting Tweet 1653770395810689024 (missing)]\n↓\n1737540438427353167 [2023-12-20] @tasshinfogleman 💜 5\n38. persistent problems are unconscious solutions to other hidden, forbidden problems you don't even want to acknowledge https://t.co/CAYfasYeFw\n  [Quoting @DRMacIver: A lot of visible problems that you can't seem to solve are secretly solutions you don't want to admit to adopting to problems you don't want to admit to having.]\n↓\n1737540644761927970 [2023-12-20] @tasshinfogleman 💜 9\n39. if you can expand what you can notice, you expand what you can do https://t.co/O0YrXP1Fxq\n  [Quoting @m_ashcroft: I have a talking point that I want to bang on about more in different ways  that is \"you can only respond to what you notice\"  not being able to notice something (if it lies outside your awareness) renders you choiceless  expanding your capacity to notice things gives you agency]\n↓\n1737540727322665309 [2023-12-20] @tasshinfogleman 💜 6\n40. you treat yourself the way you treat others—treat others with love, kindness, and respect and you will automatically give yourself that same care, toohttps://t.co/f4gs01xWZw\n  [Quoting Tweet 1520128095885352960 (missing)]\n↓\n1737540785333997699 [2023-12-20] @tasshinfogleman 💜 4\n41. join multiple cults in parallel to find the best wisdom in each while inoculating yourself against the damage any one can do you https://t.co/VET7RBIlSo\n  [Quoting Tweet 905918301699801088 (missing)]\n↓\n1737540828023730523 [2023-12-20] @tasshinfogleman 💜 4\n42. you can learn to laugh deeper, harder, more frequently, and enjoy it more, too https://t.co/R0LSOGjJ7l\n  [Quoting Tweet 1400876034199674884 (missing)]\n↓\n1737540871837392932 [2023-12-20] @tasshinfogleman 💜 6 🔁 1\n43. you are excellent to the degree to which you can do cool badass wholesome shit, you are wise and loving in proportion to the rate at which you complete fun service projects https://t.co/7jW8mrmhiQ\n  [Quoting @exgenesis: What if the extent to which you can do cool wholesome shit in real world is the extent of your spiritual development]\n↓\n1737540919413367212 [2023-12-20] @tasshinfogleman 💜 6 🔁 1\n44. feel your feet, feel the ground, then come back to sensei https://t.co/ecagfJfkEA\n  [Quoting Tweet 1693098110178746368 (missing)]\n↓\n1737540956860129706 [2023-12-20] @tasshinfogleman 💜 6\n45. the best feeling in the world is writing out your thoughts precisely, completely—totally articulating your thoughts to yourself, deeply understanding and validating your own perspective https://t.co/pdzf1LxrBU\n  [Quoting @ElodesNL: @BecomingCritter Writing out your thoughts in a way that truly captures them -- comprehensively, coherently, concisely, and beautifully so. The feeling of having said everything you needed to say on a given topic, as well as possible.]\n\n===\n\n1759593432832446514 [2024-02-19] @tasshinfogleman 💜 96 🔁 2\nprojection seems like a basic fact of psychology but i still don't understand how it works, why it happens\n↓\n1759593472519262285 [2024-02-19] @tasshinfogleman 💜 9\ni asked once here and this didn’t clear it up https://t.co/L7cuV1gRuh\n  [Quoting @tasshinfogleman: why is projection a thing?]\n↓\n1759602687426150887 [2024-02-19] @visakanv 💜 7\n@tasshinfogleman lemme try again more comprehensively\n\nwe all live in stories\n\nfor a lot of people, these stories are largely inherited, imposed, ie not self-authored, not questioned or examined much\n↓\n1759602749073965163 [2024-02-19] @visakanv 💜 5\n@tasshinfogleman at infancy, there is no need to distinguish between “my personal interpretation of reality (story)” and “how the world works”\n\nthis typically continues up until the point where one’s story bumps up against a hard reality, at which point some people may question their projections\n↓\n1759603230865347043 [2024-02-19] @visakanv 💜 5 🔁 1 [(SEED) type=quote_of_root]\n@tasshinfogleman but that’s uncomfortable, tedious, psychologically/emotionally costly. it’s easier to simply insist on your story. that’s roughly what projection is. how dare your conclusion not conform to my assumptions, my interpretation based on my experience? https://t.co/p3FcArldPF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1759603546985762900 [2024-02-19] @visakanv 💜 7\n@tasshinfogleman https://t.co/IwkUCnq5Dg\n  [Quoting @visakanv: super in love with @morganhousel's description of this phenomena https://t.co/PTZb3aKIHq https://t.co/2fqqHCUMfd]\n\n===\n\n1766749606694777040 [2024-03-10] @JustAnkurBagchi 💜 31 🔁 1 [(SEED) type=semantic_search]\nWhen someone says a thing, it helps to think “what kind of experience led to this thing being said?”\n\nDo this enough and you’ll have very few disagreements with people.\n\n===\n\n1775509095388258805 [2024-04-03] @nosilverv 💜 66 💬 1\nThere's a skill of detriggering interlocutors in a charged topic so that they may learn from one another and you may learn from both. \n\nI need to learn this skill.\n↓\n1775527203704606826 [2024-04-03] @visakanv 💜 9 [(SEED) type=quote_of_root]\n@nosilverv i'd say i'm pretty good at this\n\none general approach is to ask people about the background/context/history that informed their position, typically while offering a piece of one's own experience/background\n\nhttps://t.co/p3FcArldPF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n├── 1775527504004145361 [2024-04-03] @visakanv 💜 4\n│   @nosilverv lots of variations on this, i've had surprising, remarkable results from asking people things like \"what do you think the other person's objective is\", \"what do you think they're really trying to say here,\" etc. this can sometimes help get behind the tedious mess of language\n│   ↓\n│   1775532837241807280 [2024-04-03] @nosilverv 💜 3\n│   Oh, yes, I've had a lot of success, personally, in trying to first articulate someone's position to themselves in terms they'd agree is a fair re-articulation before sharing my view\n│   ↓\n│   1775532927306084714 [2024-04-03] @nosilverv 💜 4\n│   @visakanv Also separating emotional tone and conversation: like you can say 'No' in such a sweet tone people LOVE to receive it lol\n│   ↓\n│   1775533191153021263 [2024-04-03] @nosilverv 💜 2\n│   @visakanv Like, see this, how JOYOUS would most people be to receive such a \"no\"?? \n│   \n│   https://t.co/Q40NWUKAPN\n└── 1775562034098098592 [2024-04-03] @Tangrenin 💜 1\n    @visakanv @nosilverv Yes!Also reminds me of Defender's thoughts on thisNot exactly on the detriggering part, but on making claims on a charged topic without (re)triggering I liked:&gt;Find insightful examples of *their* map not matching the territory that *they* knowhttps://t.co/QAGGD6Paoi\n      [Quoting @DefenderOfBasic: How to change anybody's mind about anything:  - Understand the territory  - Understand their map - <make it emotionally safe for them to change their mind> - Find insightful examples of their map not matching the territory that they know]\n    ↓\n    1775562457559204109 [2024-04-03] @DefenderOfBasic 💜 1\n    @Tangrenin @visakanv @nosilverv yeah I've been practicing this a lot and I think the real key is you can't start by telling them anything. You have to start by asking questions (you need to know where they are at before you can get anywhere) https://t.co/1UI2wmlzPD\n      [Quoting @DefenderOfBasic: I've decided to change the way I give advice, and teach. I can't teach anything until I first ask a lot of questions. I need to know what is happening in the other person's mind.   (otherwise the attempt to change their mind sometimes works, sometimes fails, &amp; it's unclear why) https://t.co/ahGJF0cbjC]\n    ↓\n    1775562701613232284 [2024-04-03] @DefenderOfBasic 💜 1\n    @Tangrenin @visakanv @nosilverv Always assume they are a good, reasonable person. The only question is: why would a good reasonable person say what this is person is saying\n    \n    This is the puzzle you must crack. Agitating them/dismissing them makes it harder to solve the puzzle.\n\n===\n\n1802082809408061486 [2024-06-15] @inkolore_ 💜 3 [(SEED) type=semantic_search]\nReminder for my future self: if someone disagrees with you, it's pretty much guaranteed that either:\n1) They disagree on fundamental levels - base assumptions, experiences in life, etc.\n2) They *want* to disagree with you and will keep looking for evidence to do so\n↓\n1802082811588784559 [2024-06-15] @inkolore_ \nIn both of these cases, nothing can be done about it, better move on and find other people to riff with, or do other things\n↓\n1802083107480519017 [2024-06-15] @inkolore_ 💜 1\nI guess there's a 3rd type of disagreement where you disagree on small details but overall agree on main premises, but I would consider that more as low resolution agreement rather than disagreement per se.\n\n===\n\n1813051558994825349 [2024-07-16] @visakanv 💜 268 🔁 8\nthis is a nice example of a phrase that, if internalized, might really help some people, and maybe make some people worse. it depends on what their starting conditions are, what their assumptions are, what each thing mean to them https://t.co/Drckeyrj3u\n  [Quoting Tweet 1812890563060138032 (missing)]\n↓\n1813052356852130004 [2024-07-16] @visakanv 💜 39\nI would say what’s being conflated here is self-respect and the obsessive control of one’s image. the thing is, to a person who’s sufficiently down bad, simply taking yourself and your needs seriously, advocating for yourself, etc can *seem* like narcissism https://t.co/DzQZOMwOX4\n  [Quoting Tweet 1539085376320684032 (missing)]\n↓\n1813053469361860802 [2024-07-16] @visakanv 💜 20\npeople who’ve been victimized by seriously abusive, coercive narcissists likely would balk from the whole phrase. and there are some people who think depression is just being kinda sad and narcissism is just buying yourself a nice coffee and it totally works in that case. Lol\n↓\n1813054206972207591 [2024-07-16] @visakanv 💜 22 🔁 1\nI’m not particularly advocating for one point of view over the other, my thing is I try to help more people see that other people interpret the same words very differently. comms is so lossy, we’re rarely ever even talking about the same thing\n↓\n1813054669763358890 [2024-07-16] @visakanv 💜 15 🔁 1\ncool thing to observe as a language nerd is how what starts out as maybe useful terminology eventually gets overused in too many contexts such that it eventually becomes meaningless. this happened to the word “neurotic” in the past and it’ll happen to all our current words too\n↓\n1813055254772261210 [2024-07-16] @visakanv 💜 28 [(SEED) type=quote_of_root]\nsad thing to observe as a person is people getting into twisted vicious conflicts with one another without ever clarifying their terms, to figure out whether they’re even actually talking about the same thing https://t.co/p3FcArldPF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n↓\n1813055673753837604 [2024-07-16] @visakanv 💜 28 🔁 1\nyup; once you really appreciate the context-specificity of basically everything, you can learn to not take things so personally, have a bit more flexibility in interpretation, be slower to assume things, and as a result start to be helped more and harmed less! https://t.co/ysYfbvDcsV\n  [Quoting Tweet 1813054738927091994 (missing)]\n\n===\n\n1894400712731189441 [2025-02-25] @imitationlearn 💜 2 [(SEED) type=quote_of_root]\nGILVV! (gosh i love visa veer!) https://t.co/KYzJHNxcau\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1897453910996169061 [2025-03-06] @VividVoid_ 💜 364 🔁 5\nLiterally every day I go back and forth on whether to start a podcast where I pick one person from TPOT, find something we disagree about, and fight it out. \nNo windbag, hours-long conversations. Nasty, brutish and short. Don't care if I win or lose. I just want to throw down.\n↓\n1897456915682066655 [2025-03-06] @KThorssen 💜 2 [(SEED) type=semantic_search]\n@VividVoid_ I wonder what we would disagree about most\n\n===\n\n1920176297990631546 [2025-05-07] @breathe_and_ski 💜 9\n- if you find yourself triggered, show yourself some curiosity first, then apply some to the one who triggered you\n↓\n1920184351456956465 [2025-05-07] @tasshinfogleman 💜 3 [(SEED) type=quote_of_root]\n@breathe_and_ski heck yeah! i've gotten a lot of mileage out of this onehttps://t.co/32pD7FWJKF\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n\n1924485859220259287 [2025-05-19] @tasshinfogleman 💜 19 [(SEED) type=semantic_search]\ni believe this crazy thing that when we have a disagreement it's worth being kind to each other while we listen and understand each other's perspectives\n\n===\n\n1935345474015293723 [2025-06-18] @tasshinfogleman 💜 112 🔁 15\nreal friendships can handle differences of perspective and opinion with grace and verve\n↓\n1935346351081980149 [2025-06-18] @tasshinfogleman 💜 8 🔁 1 [(SEED) type=quote_of_root]\nbtw if U don't have grace and verve yet U can just memorize and internalize this diagram https://t.co/EY4iwBiZXI\n  [Quoting @visakanv: whenever we have a disagreement, the first thing I want to understand is: how have your experiences have been different from mine? https://t.co/gNCFnhzCZB]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand represents a multi-year intellectual project centered on Visa's 2019 'disagreement diagram' as a boundary object for understanding how different life experiences produce different conclusions. The arc moves from Visa's initial articulation of 'vision-based disagreement' through practical conversational techniques (tactical agreement, asking questions), to broader applications in conflict resolution, storytelling, and community building. The discourse is primarily constructive rather than dialectical—people building on and applying the core insight rather than challenging it. The diagram itself becomes a memetic artifact that gets quoted/shared across years (2019-2025), with participants like Malcolm Ocean, Tasshin, Rich Decibels, and others extending it into domains like cult offramps, embodiment debates, and interpersonal mediation. The strand shows high cohesion (recurring cast returning to the same framework) and medium-high utility (practical conversational tools), but evolution is somewhat limited—the core insight remains static while applications multiply.",
    "rating": 6,
    "evolution": "medium",
    "cohesion": "high",
    "utility": "medium",
    "essential_tweets": [
      {
        "tweet_id": 1088079902136397825,
        "annotation": "The Origin: Visa's first articulation of the core principle—disagreements require identifying assumptions and discussing experiences"
      },
      {
        "tweet_id": 1097772276022370304,
        "annotation": "The Viral Moment: The diagram tweet that becomes the recurring boundary object, asking 'how have your experiences been different?'"
      },
      {
        "tweet_id": 1100497170514362368,
        "annotation": "The Playbook: Visa explicitly constructs the conversational technique—ask about experiences and assumptions, not conclusions"
      },
      {
        "tweet_id": 1132780829061591040,
        "annotation": "Ultimape's Extension: Applying the framework to memetic theory and 'alternative models of reality' as a game"
      },
      {
        "tweet_id": 1366687233722355714,
        "annotation": "Conflict Resolution Application: Visa uses the framework to address trauma/abuse language barriers in public discourse"
      },
      {
        "tweet_id": 1429345213848252416,
        "annotation": "Domestic Application: Visa reveals using diagrams/maps with his wife for relationship alignment, making the abstract concrete"
      },
      {
        "tweet_id": 1486114071065677826,
        "annotation": "The MDMA Hypothesis: JD Pressman suggests drugs help people 'blurt out what they're actually thinking'—a chemical shortcut to the diagram"
      },
      {
        "tweet_id": 1573730298273361920,
        "annotation": "Malcolm Ocean's Synthesis: Connecting the framework to 'offramps for cults' and memetic mediation projects"
      },
      {
        "tweet_id": 1574106362719735810,
        "annotation": "Rich Decibels' Restatement: 'People who disagree aren't wrong—they have different experiences and values' (152 likes, independent validation)"
      },
      {
        "tweet_id": 1813055254772261210,
        "annotation": "2024 Reaffirmation: Visa returns to the diagram 5 years later, noting people fight 'without ever clarifying their terms'—the problem persists"
      }
    ]
  }
}