{
  "seed_tweet_id": 1209195568146325504,
  "thread_text": "1209050005085945858 [2019-12-23] @visakanv 💜 302 🔁 17\nI post about stuff I like more than about stuff I don't like.\n\nThis leads me to other people who talk about stuff they like.\n\nThis leads to friends, which is wealth and meaning.\n\nIt's all so simple in my head.\n\nWhat am I missing re: why it's not so simple to others?\n↓\n1209055302055645185 [2019-12-23] @QiaochuYuan 💜 176 🔁 4 💬 1\n@visakanv as usual i’ll chip in with: trauma has a lot to do with it. simple ex. is people who got bullied for being honest about what they liked growing up and now feel unsafe talking about it\n\ntrauma means people living in different worlds, made of the worst parts of their childhoods\n↓\n1209195568146325504 [2019-12-23] @Malcolm_Ocean 💜 369 🔁 50 💬 23 [(SEED) type=root]\n@QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.\n\n&amp; as in dreams, somehow the weirdness of this mashup goes unnoticed\n├── 1209195928906694656 [2019-12-23] @visakanv 💜 28\n│   @Malcolm_Ocean @QiaochuYuan that's a very rich and evocative picture, nice\n│   ↓\n│   1376982745956589570 [2021-03-30] @visakanv 💜 11 🔁 1 💬 1\n│   @Malcolm_Ocean mad a vid about this tweet https://t.co/j6iPKR888A\n├── 1212490526974513156 [2020-01-01] @Malcolm_Ocean 💜 96 🔁 5\n│   @QiaochuYuan @visakanv Pete Walker has a great article about this phenomenon:\n│   \n│   &gt; Because most emotional flashbacks do not have a visual or memory component to them, the triggered individual rarely realizes that she is re-experiencing a traumatic time from childhood.\n│   \n│   https://t.co/5GCWlsD2tc\n│   ↓\n│   1212491626846793728 [2020-01-01] @Malcolm_Ocean 💜 56 🔁 5\n│   @QiaochuYuan @visakanv Note that while he's talking about Complex PTSD, schools are prisons so basically everybody is actually traumatized quite a lot.\n│   \n│   In some dimensions this has gotten better; in others, worse:\n│   https://t.co/P6wmjrko5D\n│     [Quoting Tweet 1196825154313236482 (missing)]\n│   ↓\n│   1212491869390815232 [2020-01-01] @Malcolm_Ocean 💜 70 🔁 13\n│   @QiaochuYuan @visakanv We recognize a certain baseline level of trauma as being the norm, and fail to realize that there could be a completely different way of humaning that doesn't involve everyone constantly rehashing these old nightmares at each other.\n│   \n│   https://t.co/3n12TKc0Ht\n│     [Quoting @Malcolm_Ocean: @QiaochuYuan @a_witch_in_time Yeah, I generally phrase this as \"because the DSM measures deviation from norm, it is structurally incapable of recognizing a dysfunctional condition that everyone has.\"  I tried to say this to a group of ppl at YC120 and one of them literally said \"but then it would be normal!\" https://t.co/AlKssHT58M]\n│   ↓\n│   1218047670138417157 [2020-01-17] @Malcolm_Ocean 💜 19\n│   @QiaochuYuan @visakanv Mmm just found this old tweet and it's also very relevant to the whole school thing.\n│   \n│   Most schools (and much of parenting) is based on a lot of authority-imposed reward &amp; punishment, rather than exploring &amp; learning via trying things &amp; seeing what happens.\n│   https://t.co/Iv2e4hC9cd\n│     [Quoting @Malcolm_Ocean: @cosimia_ @Conaw \"reward is just the temporary relief of punishment\" might surprise; it connects with my remark at the top that most humans are in chronic fear. Reward represents temporary relief of that fear: don't worry, you're okay, you did the right thing—this time. Implicit threat.]\n├── 1224801023648202754 [2020-02-04] @Malcolm_Ocean 💜 7\n│   @QiaochuYuan @visakanv https://t.co/D2wCPzs4Ja\n│     [Quoting @Malcolm_Ocean: @s_r_constantin Veterans know, consciously, they're not still on the battlefield, but it doesn't take much to create an emotional flashback.  This 1min video is very illustrative and not likely to be disturbing to most people (sound on) https://t.co/xtRDUJ9mBz]\n└── 1410158782382960643 [2021-06-30] @Malcolm_Ocean 💜 21 🔁 1\n    @QiaochuYuan @visakanv this tweet now has a whole blog post on the model, what it implies, and how I approach working with this phenomenon!\n    https://t.co/8qP6ApK4pJ\n    ↓\n    1410159759940931584 [2021-06-30] @visakanv 💜 9\n    @Malcolm_Ocean @QiaochuYuan hell yea https://t.co/3KCGsDP1Tb https://t.co/z7ah1f7xDh\n    Images:\n      - [Image #0] The image is a screenshot of a Reddit post and its comments. The post is from the \"INGROUPTWITTER\" community, and the title is a tweet from @Malcolm_Ocean that reads: \"everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow. & as in dreams, somehow the weirdness of this mashup goes unnoticed.\" The tweet is accompanied by an image of a purple-toned person in a contemplative pose.\n        \n        The post has 3 comments, which are displayed below the original tweet. The first comment is from @NO_LAH_WHERE_GOT, who says \"Now expanded into blogpost: https://malcolmocean.com/2021/06/dream-mashups/\". The second comment is from PeterW_, who quotes Carl Jung: \"Until you make the unconscious conscious, it will direct your life and you will call it fate.\" - Carl Jung https://m.youtube.com/watch?v=YweEH74TJW0.\n        \n        To reproduce this image, one would need to create a screenshot of a Reddit post with the same title, image, and comments. The Reddit post should be from the \"INGROUPTWITTER\" community and have the same text and image as the original tweet. The comments should be displayed below the post, with the same usernames, text, and links as the original comments.\n\n===\n\n1211924655226769408 [2019-12-31] @visakanv 💜 50 🔁 2\nit takes people a very long time to experiment with newly-possible behavior patterns. we are almost always living in the past. the future is not only unevenly distributed, it’s under-distributed https://t.co/jjfJmYjcIC\n  [Quoting Tweet 1148498249583489025 (missing)]\n↓\n1211925194412965888 [2019-12-31] @visakanv 💜 11 🔁 2 [(SEED) type=quote_of_root]\nthe past looms so heavily on the present that barely anybody notices what is presently possible https://t.co/59HuOC7EyH https://t.co/KL01SsyLpY\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1211925639156002816 [2019-12-31] @visakanv 💜 22 🔁 2\nweirdos are extremely valuable because their irreverence can surprise you into questioning assumptions that you didn’t realize that you had, and never thought to consider https://t.co/jiwFw4VRCw https://t.co/92Bc4MbTkL\n  [Quoting @visakanv: The imagination deficit is the most staggering thing in the human realm - but few people know it... because most people lack imagination!!! https://t.co/z4vSYHY2I9]\n\n===\n\n1212783246255091714 [2020-01-02] @relic_radiation 💜 2 [(SEED) type=quote_of_root]\nOo I’d been using something similar! Life / the-present-moment as “emotional collage.” https://t.co/JO7uIg6UXF\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1214266910298099712 [2020-01-06] @QiaochuYuan 💜 61 🔁 3 💬 2\nfeels like i'm close to finding the simplest and most impactful slogan or phrase for talking about emotional projections / emotional flashbacks / being blinded by ghosts from the past / @Malcolm_Ocean's nightmare mashups; aaalmost but not quite there yet (1/n)\n↓\n1214309471565955072 [2020-01-06] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\n@QiaochuYuan For linky reference re nightmare mashups:\nhttps://t.co/CzEXNYtJlf\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1227596232677351424 [2020-02-12] @yashkaf 💜 80 🔁 2\nA breathwork guide was telling me about \"reliving my birth trauma\" and I realized why this shit bothers me: it's a New Age spin on Calvinist Original Sin doctrine, aka the dumbest part of ✝️.  We're all born traumatized, doomed to eternal but incomplete \"healing\".\nCC @Aella_Girl\n↓\n1227765738963918848 [2020-02-13] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\n@yashkaf @Aella_Girl One stance I like: you don't *have* to heal anything from the past—just live your life and work with whatever shows up, some of which will be stale past stuff.\n\nThough it is key to learn to differentiate this stuff from present stuff!\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1233113679048138753 [2020-02-27] @nosilverv 💜 138 🔁 4\ni think i just raelised that in response to feeling shitty you can, instead of processing your emotions until they're ok, change the situation until it doens't anymore make you feel shitty and that that's probably what feelign shitty is *for*, lol\n↓\n1233114647244374016 [2020-02-27] @QiaochuYuan 💜 19\n@nosilverv ime the processing is for resolving feelings about the past that you're flashing back to; those situations can't be changed\n↓\n1233119471784677376 [2020-02-27] @Malcolm_Ocean 💜 10 [(SEED) type=quote_of_root]\n@QiaochuYuan @nosilverv Yeah, both skills are vital. If you only have one you'll either:\n- depress yourself trying to accept situations that suck\n- frustrate yourself &amp; your loved ones by trying to fix a current situation that would be fine if you weren't projecting onto it\n\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1233119834474532864 [2020-02-27] @Malcolm_Ocean 💜 4\n@QiaochuYuan @nosilverv the other challenges are, of course \"knowing the difference\" and \"dealing with things that are a bit of both\"\n\n(&amp; most things are a bit of both)\n\nhttps://t.co/rZULskv1j1\n  [Quoting @Malcolm_Ocean: Something granted me the serenity to accept the things I cannot change, and the courage to change the things I can.  Nobody told me what to do about the things that are a bit of both.  New blog post on this                  👇 https://t.co/WENLbx2lFi]\n\n===\n\n1249162766079995905 [2020-04-12] @Malcolm_Ocean 💜 22 🔁 4\nIn the tweet below they're talking about people being uncharitable, but I think this is actually what's happening by default when anyone's reading anything.\n\nIt's just that if you're in resonance with the person, then you'll fill in the gaps in a way that's fairly workable. https://t.co/2QF0SvKfiy\n  [Quoting Tweet 1247615402651213825 (missing)]\n↓\n1249162767191412738 [2020-04-12] @Malcolm_Ocean 💜 4\nI've recently read some chat messages out loud to my friends, and more than half the time, when I do, I realize there's layers of meaning I completely missed (or inverted) when I skimmed it silently.\n\nHighly recommend trying this with a message you read &amp; replied to earlier today\n↓\n1249162768651083778 [2020-04-12] @Malcolm_Ocean 💜 5\nAnd my clearest memory of this happening was in a situation where I deeply admire &amp; respect the person and have more shared context with them than either of us have with more than a few dozen other people.\n\nYet still I wasn't really taking in what he was saying!\n↓\n1249162769498288129 [2020-04-12] @Malcolm_Ocean 💜 5\nLack of conversational resonance can happen in multiple ways:\n- difference in word meanings\n- difference in unstated assumptions\n  (including re purpose of the conversation)\n- difference in emotional state\n\n(ordered, I guess, by \"increasingly harder to reconcile\")\n↓\n1249162770391740417 [2020-04-12] @Malcolm_Ocean 💜 5 [(SEED) type=quote_of_root]\nThe emotional state one is underappreciated.\n\nTwo people in an argument are typically basically in two completely different scenes mentally, from some other moment in their life.\n\nhttps://t.co/CzEXNYLkJP https://t.co/tKWEm7LPiw\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\nImages:\n  - [Image #0] The image is a comic strip that depicts a humorous take on a hypothetical sports system. The comic strip is divided into two sections: the top section shows a series of stick figures playing a game, and the bottom section provides a caption explaining the context of the game.\n    \n    **Top Section:**\n    \n    * The top section features six stick figures, each representing a player in a game.\n    * The players are shown in various poses, with speech bubbles containing their instructions to each other.\n    * The instructions are contradictory, with some players yelling \"NO!\", \"LOOK OUT!\", \"GO LEFT!\", \"LEFT!\", and \"STOP DUNKING AND FIND THE BALL!\".\n    * The players appear to be confused and disoriented, as they are not able to see the ball or understand what is happening.\n    \n    **Bottom Section:**\n    \n    * The caption at the bottom of the image reads: \"NO ONE LIKED MY NEW SPORTS SYSTEM, IN WHICH EACH PLAYER IS IN A SEPARATE ARENA SHARING A SINGLE VIRTUAL BALL THAT THEY CAN'T SEE WHILE ONLINE VIEWERS YELL INSTRUCTIONS, BUT IT WAS FUN TO WATCH WHILE IT LASTED.\"\n    * The caption explains that the game is a new sports system where players are in separate arenas, sharing a virtual ball that they cannot see.\n    * The online viewers are providing instructions to the players, but the system is not working well.\n    \n    **Overall:**\n    \n    * The comic strip is a humorous commentary on the challenges of designing a new sports system.\n    * It highlights the difficulties of creating a game that is enjoyable for both players and spectators.\n    * The image is a lighthearted way to poke fun at the idea of a game that is not working as intended.\n↓\n1249164160522387458 [2020-04-12] @QiaochuYuan 💜 4\n@Malcolm_Ocean related:\n\nhttps://t.co/56Gvv5X4mX\n  [Quoting Tweet 1173994559103262721 (missing)]\n↓\n1249192401777971205 [2020-04-12] @Malcolm_Ocean 💜 1\n@QiaochuYuan Wow these are great.\n\nActually as I keep reading them I'm finding them more cynical than my taste.\n\nI like the first one though, and its deep relevance to this thread.\n↓\n1249193553768714240 [2020-04-12] @QiaochuYuan 💜 1\n@Malcolm_Ocean i like the first one the best lol\n\n===\n\n1251652305159696385 [2020-04-18] @Malcolm_Ocean 💜 25 💬 1\nStill feeling kinda sad about a guy who wandered into strangely earnest twitter and got triggered and scared and angry.\n\nWondering what's got me hooked there.\n\n:thinking_heart: emoji\nhttps://t.co/gfHOAxwFbo\n  [Quoting @Malcolm_Ocean: @alifeofmovement @utotranslucence I think you're looking for :thinking-heart:  (I'm planning to submit an official proposal to add this to the canonical emoji, lmk if you have appetite to help (even just by RTing me later in the process)) https://t.co/995jY2EPCS]\n↓\n1251652306254340097 [2020-04-18] @Malcolm_Ocean 💜 11\nOn the immediate content level, there's like, a sadness of the limitations of this medium. A feeling that if he'd been able to get in the same room with me &amp; @jack_meditates &amp; @visakanv &amp; @selentelechia &amp; so on...\n\n...he'd be able to feel we're not trying to hurt him.\n↓\n1251652307114176512 [2020-04-18] @Malcolm_Ocean 💜 14 [(SEED) type=quote_of_root]\nThen there's a part of me that knows that it's not nearly that easy. Feeling safe &amp; being safe are just totally different things, and it's very easy to project your fear onto the situation and it continues to feel scary.\n\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1251652308217323521 [2020-04-18] @Malcolm_Ocean 💜 15\nI notice I keep having this urge to try to reach out &amp; try to connect with the guy, but he's been quite vocal in a leave-me-alone way so I guess I'm very transparently subtweeting the situation instead.\n↓\n1251652309035233284 [2020-04-18] @Malcolm_Ocean 💜 17\nDoes it help to remind myself that he's just the guy who happened to encounter my corner of the internet today and that there are a lot of such people?\n\n...idk, I feel sad for all of them.\n\nHow do we create onboarding pathways from people being sad/scared/lonely into connection?\n↓\n1251652309878218753 [2020-04-18] @Malcolm_Ocean 💜 30 🔁 2\nI think that this onboarding pathways thing is really key.\n\nPeople stuck in shitty attractors need gradual steps, where the pathway starts with something that makes sense to them in terms of what they already know &amp; understand.\n\nBest people to create = people who've been there?\n↓\n1251652310729666567 [2020-04-18] @Malcolm_Ocean 💜 21\nOne does not jump instantly from angry TLA* to spacious metamodern memetic mediator.\n\nThere's many pieces, not all of which can be streamlined: usually involves making some connection with real ppl outside\n\n*TLA = three-letter acronym; replace with SJW or MRA or NRX or whatever\n↓\n1552679811356786688 [2022-07-28] @Malcolm_Ocean 💜 3\nthis thread collects a bunch of stories along the lines of conspiracy deconversions and other shifts from extreme ideologies of various kinds to greater openness and uncertainty, and has some principles around that\n\nhttps://t.co/8m97KC4Hbc\n  [Quoting @stephlepp: Humans are capable of extraordinary transformation.  I spent five years interviewing people who did just that, like a former neo-Nazi and a paid climate skeptic who flipped.  Here are 15 insights about HOW PEOPLE CHANGE👇]\n\n===\n\n1267273586924019713 [2020-06-01] @nosilverv 💜 80 🔁 8\nAll discussions I’m a part of are utterly derailed by the fact that our society worships stage 4 - being rational or reasonable. This means you can’t acknowledge the emotional ghosts in play in yourself - to avoid being Other-ed - nor can you recognize them in others.\n↓\n1267273590069768202 [2020-06-01] @nosilverv 💜 26 🔁 1\nThis effectively ensures no one feels hear and everyone is don quixoting against projection windmills.\n↓\n1267273591407738881 [2020-06-01] @nosilverv 💜 38 🔁 6\nBeing rational, or rather, wise, is absolutely the goal but the hack of common plausible deniability via pretending we’re all already there is killing us.\n↓\n1267273593022537728 [2020-06-01] @nosilverv 💜 11\n@QiaochuYuan @Malcolm_Ocean I think this is a unitary new atomic theoretical piece in #sobsquad sociological analysis\n↓\n1267330132970057728 [2020-06-01] @QiaochuYuan 💜 7\n@nosilverv @Malcolm_Ocean 👍\n\none of my first tweets was kinda about this:\n\nhttps://t.co/qtWp4fchUy\n  [Quoting @QiaochuYuan: You know the thing where a husband and wife are arguing about the dishes but it isn't really about the dishes, it's about whether the wife feels loved or the husband feels respected or whatever? I assume by default that this is happening in literally every conversation.]\n↓\n1267940126124056576 [2020-06-02] @Malcolm_Ocean 💜 8 [(SEED) type=quote_of_root]\n@QiaochuYuan @nosilverv Yeah, Romeo Stevens once said to me \"mutual triggering is the bedrock of interaction\"\n\nAlso this tweet of mine illustrates this... maybe I shall soon do a longer write-up of it.\n\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1273110504618287104 [2020-06-17] @Malcolm_Ocean 💜 31 🔁 1\nI did this as part of some deep processing last Dec and it was very powerful. Went through classroom by classroom, teacher by teacher. \"I am free from that room.\" \"I am free from that building.\" \"I am free from those assignments.\" \"I never have to go back there.\"\n\n\"I am free.\" https://t.co/ib9RfKmALy\n  [Quoting @QiaochuYuan: literally just repeating to myself “i’m not in school anymore” and then going through every school i’ve attended and telling myself i’m not in that school anymore and it’s a wild ride, my shoulders are doing some funny things]\n↓\n1273110505645899783 [2020-06-17] @Malcolm_Ocean 💜 6 [(SEED) type=quote_of_root]\nThat processing was part of a retreat I did with a friend holding space. Same retreat this insight came from:\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1285948180597800967 [2020-07-22] @nosilverv 💜 87 🔁 3\nWait, so, via dreaming, my mind can generate arbitrary worlds that *feel* real. Why can’t I do that volitionally, when awake?\n↓\n1286007996091379713 [2020-07-22] @Malcolm_Ocean 💜 5 🔁 2\n@nosilverv I think this 👆 is actually kind of like this 👇\n\nBut instead of overwriting an internal prior (stored in your emotional brain) it's not safe to overwrite the strong prior provided by your senses.\n\nDreaming is the system reorganizing internally.\n\nhttps://t.co/cQ3kIwy0Rs\n  [Quoting @Malcolm_Ocean: Our brains aren't dumb enough to let us simply overwrite our old understanding of things with a new understanding. We'd lose hard-earned lessons.  Learning happens by holding the old &amp; new knowings together, til they form a clear, more complex picture 📔👇 https://t.co/H0rQYmC9b4]\n↓\n1286008598309613568 [2020-07-22] @Malcolm_Ocean 💜 4 🔁 1 [(SEED) type=quote_of_root]\n@nosilverv On the flipside, yeah, there is a sense in which most people are kind of dreaming during much of their waking life, which is to say living in a constructed world that's totally different than what most other people would experience in the same situation.\n\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1286011799108816905 [2020-07-22] @nosilverv 💜 2\n@Malcolm_Ocean Truly the metaphor that keeps on giving https://t.co/F6DbIUe6wv https://t.co/cbuMh84xAH\n  [Quoting @nosilverv: Oh, buddhism is like when you realize you’re dreaming in a lucid dream except in real life. Omg lol “AWAKENING” 😆 could it be anymote on the nose?]\n\n===\n\n1291789490999013376 [2020-08-07] @visakanv 💜 13 🔁 1 [(SEED) type=quote_of_root]\nI feel strange re-reading the first 200,000 words of @1000wordvomits. It's a physically unsettling experience to reinhabit those thoughts, those emotional states. It's like this phenomenon 👇🏾, but the mashup jumps out. It's truly surreal \n\nhttps://t.co/DFLB7R14yh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1291790426408534016 [2020-08-07] @visakanv 💜 12\nthe \"reality\" of daily consciousness, or the experience of it, or the remembered experienced of it, is \"artificially\" compressed\n\nthere's a sort of Chief Propaganda Officer of the Self that rewrites and reframes history, to make one's life seem far narrower than it actually is\n↓\n1291796322803003392 [2020-08-07] @visakanv 💜 12\nI never think to describe myself as angry, but I was very angry and upset. Having worked through those feelings, the memory of those states fade. When I describe the state on retrospect, I subconsciously sanitize it without thinking. But I was very, very angry, debilitatingly so\n↓\n1291798339642519552 [2020-08-07] @visakanv 💜 7\nif I didn't have a literal record of my feelings of worthlessness and despair at the time, I'm not even sure if *I* would believe me https://t.co/5ns2IJdtOe\nImages:\n  - [Image #0] The image is a screenshot of a text passage that conveys a sense of despair and hopelessness. The passage, transcribed below, is written in black text on a white background.\n    \n    \"I can't even be resentful about it. There's nothing to resent. There isn't a villain to overthrow. It's just us, we're just glorified pond scum- miserable little shits.\n    \n    Consider this- anybody can get killed. You're just a head injury away from being a completely different person. Whatever you're happy or sad about, you might find out tomorrow that you have cancer. I kinda wish I had cancer. More precisely I wish I could take it away from somebody who deserves a cancer-free life more than I do, someone who can bring more salvation or joy to this forsaken rock. There are thousands of kids who might go on to do great things with their lives but they never will. You know why? Because war, poverty, disease, corruption. Because humans are assholes. Nature is plain indifferent. Humans could mitigate some of the risk with science and research but most of us don't really give a shit. We wish we did but we don't.\n    \n    I don't deserve anything I have that's worth having. I whine and bitch and cry about problems that others would kill to have. All in all I'm an utter waste of the space I've been given.\"\n    \n    The passage is divided into three paragraphs, with the final sentence highlighted in a black text box. The highlighted text reads, \"All in all I'm an utter waste of the space I've been given.\"\n\n===\n\n1298471268396797957 [2020-08-26] @Malcolm_Ocean 💜 7\nSQUAD GOALS https://t.co/TucfI8KnMz\n  [Quoting Tweet 1297618978425245696 (missing)]\n↓\n1298471509950894081 [2020-08-26] @Malcolm_Ocean 💜 3\nImportant caveat:\nhttps://t.co/IzANYsAK1C\n  [Quoting Tweet 1298437434749976581 (missing)]\n↓\n1298476267474386949 [2020-08-26] @Malcolm_Ocean 💜 1\nI'll note that there are 2 elements to this. One is learning not to fear feeling whatever you're feeling. Bruce Tift speaks brilliantly to this, in eg this excerpt:\n\n(a substantial chunk of the dharma seems to be learning how to not need feelings go away)\nhttps://t.co/3flYM5CT7R\n  [Quoting @Malcolm_Ocean: &gt; However, if you can gradually learn to tolerate feeling abandoned—which is already how you feel; it’s nothing new—you may find it’s not going to kill you. It’s not going to harm you.  — Already Free by Bruce Tift.  This book is a loving, challenging friend. https://t.co/Dx0iSjVEaU]\n↓\n1298476268799889413 [2020-08-26] @Malcolm_Ocean \nThe other element, which is probably in some sense more what @emmalsalinas is referring to, is untangling whatever has your current system organized to produce panicked responses in relation to certain situations.\n\nhttps://t.co/GyLXVAUWRD\n  [Quoting @Malcolm_Ocean: @jonnym1ller With that in mind, I'll point you at this summary of Unlocking the Emotional Brain, along with their table of wtf sorts of things turn out to be under the overt \"symptoms\".  Summary 👉 https://t.co/qSkny3XNmk 🔥  (Read table bottom to top) https://t.co/rppKXUjvJb]\n↓\n1298476270414692352 [2020-08-26] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\nInasmuch as each emotion has a *purpose*, and panic (unlike straight up fear→run) seems to mostly make us helplessly freak out, it seems to me that panic's purpose is probably purely infantile: get comforted by parents, including found if lost.\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1298476271618359297 [2020-08-26] @Malcolm_Ocean 💜 1\nIf you're feeling panic, and you're an adult, ask yourself if you feel small. Your system may be having an emotional flashback to a time when you were very young.\n\nhttps://t.co/KVPKZmMCyo\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv Pete Walker has a great article about this phenomenon:  &gt; Because most emotional flashbacks do not have a visual or memory component to them, the triggered individual rarely realizes that she is re-experiencing a traumatic time from childhood.  https://t.co/5GCWlsD2tc]\n↓\n1298476272872574979 [2020-08-26] @Malcolm_Ocean 💜 6\nIf you're reading this and think you don't have childhood trauma, well... I don't know you!\n\nI do know that 4 years ago I didn't think I did and that is clearly false, and I also know that our society is built up to systematically traumatize people.\n\nhttps://t.co/GvVuJBRaOG\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv Note that while he's talking about Complex PTSD, schools are prisons so basically everybody is actually traumatized quite a lot.  In some dimensions this has gotten better; in others, worse: https://t.co/P6wmjrko5D]\n↓\n1298476274382524416 [2020-08-26] @Malcolm_Ocean 💜 4\nImportant caveat: having childhood experiences that got stuck in tangles and now generate adult flashbacks does NOT mean anyone did something wrong.\n\nIt just means you faced situations that you didn't know how to metabolize at the time.\n\nhttps://t.co/Iyr7u8IIb4\n  [Quoting @Malcolm_Ocean: I once did an emotional processing session starting w: \"I feel weird/bad trying to get out of bed\"  I found my way to expressing a hazy memory: \"Nobody woke me up and I missed the pancakes!\"  ...then I suddenly started sobbing 😭  Traumatic meaning can occur in benign situations.]\n↓\n1298694703253196801 [2020-08-26] @AskYatharth \n@Malcolm_Ocean Thanks for this. This is important. Escaping the “rightness” of the Trauma Narrative.\n\nhttps://t.co/8QQDCn7zNy\n\n===\n\n1314520047734321155 [2020-10-09] @visakanv 💜 76 🔁 2\nthread of my mutuals’ tweets that I quote most often\n↓\n1314520323966996480 [2020-10-09] @visakanv 💜 33 [(SEED) type=quote_of_root]\n1. this tweet should grow into a blogpost and maybe a book even https://t.co/KL01SsyLpY\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n├── 1314520681493610496 [2020-10-09] @visakanv 💜 3 🔁 1\n│   2. ^ actually that probably applies to all of these tweets https://t.co/nUwNeTP0JU\n│     [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n│   ↓\n│   1314520967406739456 [2020-10-09] @visakanv 💜 30 🔁 1\n│   3. https://t.co/0WOQkVj0Lz\n│     [Quoting Tweet 1027604793101959168 (missing)]\n│   ↓\n│   1314525843482308608 [2020-10-09] @visakanv 💜 16 🔁 1\n│   4. thread on being a knowledge worker https://t.co/I6Sm7PLOuL\n│     [Quoting Tweet 1050248832267640833 (missing)]\n│   ↓\n│   1314945947030355968 [2020-10-10] @visakanv 💜 38 🔁 3\n│   5. the writing process https://t.co/6fTiJ7Xz47\n│     [Quoting Tweet 877018612447313920 (missing)]\n│   ↓\n│   1326923781454004224 [2020-11-12] @visakanv 💜 41\n│   6. a recent one that I foresee myself quoting a lot\n│   \n│   https://t.co/O6od1IEJ2s\n│     [Quoting @GeniesLoki: 1. Instead of having a profound spiritual awakening you can just actually solve your problems.]\n│   ↓\n│   1341071127800516609 [2020-12-21] @visakanv 💜 30\n│   7. the eigenrobot classic https://t.co/BwqtjozP4W\n│     [Quoting @eigenrobot: everything 👏  is 👏  monocausal 👏 and 👏 specifically 👏 results 👏 from 👏 whatever 👏 shit 👏 I'm 👏 on 👏 about 👏 at 👏 any 👏 given 👏 time]\n│   ↓\n│   1341441748808003585 [2020-12-22] @visakanv 💜 15\n│   8. https://t.co/DWMXXRfyiq\n│     [Quoting Tweet 1300466339673501699 (missing)]\n│   ↓\n│   1369348609997742085 [2021-03-09] @visakanv 💜 13\n│   9. we aren't mutuals but I've quoted this tweet like a dozen times now  https://t.co/6jJJuH9jPe\n│     [Quoting Tweet 1080115336832339968 (missing)]\n│   ↓\n│   1389285524196663298 [2021-05-03] @visakanv 💜 11\n│   10. this tweet is me summarizing an absolute smash hit that @pragueyerrr casually dropped on @tasshinfogleman's podcast \n│    https://t.co/DfpVFTsvE8\n│     [Quoting @visakanv: ooh G connected some great dots here  - 3. gratitude feels physically amazing in the body - 2. you can't be grateful for something you don't notice - 1. how you direct your attention in the world affects what you notice  1 → 2 → 3: directing your attention leads to embodied joy]\n│   ↓\n│   1518878065396686849 [2022-04-26] @visakanv 💜 13\n│   11. https://t.co/WNzlBtsEgq\n│     [Quoting Tweet 1506451523835994121 (missing)]\n└── 1425049733089931266 [2021-08-10] @Malcolm_Ocean 💜 2\n    @visakanv we did it guys\n    \n    https://t.co/YfYe4989Oh\n      [Quoting @Malcolm_Ocean: After many repeated requests*, one of my best tweets (so far) is now a blog post!  *about half of which were @visakanv😜  https://t.co/8qP6ApK4pJ]\n\n===\n\n1346577576932753408 [2021-01-05] @Malcolm_Ocean 💜 4\nThread of tweets mentioned (or otherwise relevant) to a call I'm in with @m_ashcroft &amp; @visakanv.\n\nV: Malcolm I think you can do something stickier than this 👇\nhttps://t.co/RWEH8YenmF\n  [Quoting @Malcolm_Ocean: I'm like a VC but instead of investing money &amp; getting money as returns, I invest enthusiasm &amp; design perspective, and get satisfaction &amp; relationships as returns.]\n↓\n1346577578094546944 [2021-01-05] @Malcolm_Ocean 💜 2\nV mentioned \"my domino meme\"\n\nEnjoying the kind of reusable blockness of it even in the out-loud convo. \n\nhttps://t.co/iLvh2WYqXf\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1346577579386388480 [2021-01-05] @Malcolm_Ocean 💜 1\ntalking about how a small group doing something groovy can draw others in\n\nhttps://t.co/FF79f7PjiO\n  [Quoting @Malcolm_Ocean: \"If you want to change the world, throw a better party\" — Rick Ingrasci (@Bigmind) https://t.co/vbDVBBzJHh]\n↓\n1346577580351127552 [2021-01-05] @Malcolm_Ocean 💜 3\nMichael: Malcolm, I found this thread really useful\nhttps://t.co/71eZqA4dDz\n  [Quoting @Malcolm_Ocean: One thing most ppl don't realize about starting a small biz:  Say you have $16k and need $2k/mo to live on. That's 8mo runway.  Say that after 3mo, biz makes $1k/mo. Not sustainable yet, but now you have 10mo runway! ((16-2*3)/(2-1)=10)  Not-enough revenue is still real money 🤑]\n↓\n1346577581290622976 [2021-01-05] @Malcolm_Ocean 💜 1\ntalking about what inspires us to write\nhttps://t.co/zRRv3TsOhF\n  [Quoting @Malcolm_Ocean: whoa... are \"curious\" &amp; \"curate\" etymologically related...?  (inspired by thinking about @visakanv's threads that are him livetweeting wikipedia wanderings)  turns out... yes! also to \"care\"]\n↓\n1346577582129516545 [2021-01-05] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\n(which is also reminding me of Visa and others asking me to turn this into a blog post... I'll schedule a showtime for that!)\n\nhttps://t.co/CzEXNYtJlf\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1346577583110979584 [2021-01-05] @Malcolm_Ocean 💜 4 🔁 1\ntalking about the word \"ambition\" in Visa's \"friendly ambitious nerds\" thing\n\n= make a thing happen that hasn't happened\n\nhttps://t.co/K66XxxNAGu\n\n===\n\n1373430984671043584 [2021-03-21] @visakanv 💜 41 🔁 2 [(SEED) type=quote_of_root]\nstill one of the best tweets ever\n\nhow are you currently interpreting present circumstances through old emotional meanings? https://t.co/KL01SsyLpY\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1373456429521137668 [2021-03-21] @br___ian 💜 1\n@visakanv For years I've said you stop you seeing old friends visually because you have such a rich library of their past expressions and thoughts to compare to. \n\nYou lose visual bandwidth but it's replaced with by communication bandwidth.\n\nThis is a nice extension of that theory\n\n===\n\n1410155043760730114 [2021-06-30] @Malcolm_Ocean 💜 176 🔁 25 💬 2 [(SEED) type=semantic_search]\nEveryone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.\n\n&amp; as in dreams, somehow the weirdness of this mashup goes unnoticed\nhttps://t.co/8qP6ApK4pJ\n↓\n1410155044784119808 [2021-06-30] @Malcolm_Ocean 💜 27 🔁 2\nNot only does the weirdness of the mashup go unnoticed while you're dreaming, you sometimes don't even realize how weird it is after waking until you actually stop &amp; think about it. And then you’re just as fooled by the next dream, until you wake up again.\n↓\n1410155045664935938 [2021-06-30] @Malcolm_Ocean 💜 26 🔁 2\nThe emotional brain is experiencing something totally real—just as your high school is real. The part of you that’s taking in reality is experiencing something totally real—just as boats are real. But there is no real “my high school, except on an boat”.\n↓\n1410155046570889218 [2021-06-30] @Malcolm_Ocean 💜 27 🔁 2\nPeople experience these mashups in relationships as well, emotionally experiencing their friends &amp; partners as if they’re a parent, teacher, sibling, or bully from childhood, or an earlier friend or partner. Or, as adults, they project authority on their parents they had as kid.\n↓\n1410155047447515136 [2021-06-30] @Malcolm_Ocean 💜 10\nhttps://t.co/KVPKZn4dpW\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv Pete Walker has a great article about this phenomenon:  &gt; Because most emotional flashbacks do not have a visual or memory component to them, the triggered individual rarely realizes that she is re-experiencing a traumatic time from childhood.  https://t.co/5GCWlsD2tc]\n↓\n1410155048424787968 [2021-06-30] @Malcolm_Ocean 💜 11\nPete outlines over a dozen creative responses to the flashbacks, most of which are transformational and a few are counteractive. Using some counteractive approaches alongside transformational ones can produce short-term empowerment that fuels further transformation.\n↓\n1410155049246855171 [2021-06-30] @Malcolm_Ocean 💜 17 🔁 1\nWhat do I mean by counteractive &amp; transformational?\n\nThe distinction comes from Unlocking the Emotional Brain, an excellent book you can read an excellent summary of here:\nhttps://t.co/qSkny4fodS\n↓\n1410155050236665856 [2021-06-30] @Malcolm_Ocean 💜 13\nCounteractive approaches to behavior change are based on trying to train/convince oneself to do X instead of Y.\n\nOk for simple mechanical habits but for anything emotion-based requires ongoing maintenance to perform some new consciously-desired behavior in spite of one's urges.\n↓\n1410155051209818113 [2021-06-30] @Malcolm_Ocean 💜 16\nTransformational approaches are based on understanding what’s generating the behavior in the first place—how it’s understanding the situation such that it’s doing what it’s doing and it makes total sense to do that thing.\n\nThen the part doing X can *see* if Y makes more sense.\n↓\n1410155053638246402 [2021-06-30] @Malcolm_Ocean 💜 16 💬 2\nWhat to do if you notice you’re dreaming?\n\nAs anyone who’s tried to lucid dream can attest, noticing you’re dreaming is at least half the battle in the first place!\n\nEmotional untangling techniques like Bio-Emotive can make the move more accessible, internally AND culturally. https://t.co/mMUPfD0VtO\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1410155055173365761 [2021-06-30] @Malcolm_Ocean 💜 9\nHere's a way I like to go about disentangling two key dimensions of things.\n\nIf I'm on my game I can notice I'm having a strong emotional response to a situation that doesn't directly threaten me, and get curious and maybe reveal \"I'm activated/projecting\"\nhttps://t.co/5FUY8XMTQc\n  [Quoting @Malcolm_Ocean: While how I’m feeling is always a response to what’s happening, the size and shape of that response have more to do with my history than the particulars of the situation.  Important to honor the role of both the external situation and my internal context of interpretation.]\n\n===\n\n1410163206790598656 [2021-06-30] @Malcolm_Ocean 💜 19 🔁 2\nAfter many repeated requests*, one of my best tweets (so far) is now a blog post!\n\n*about half of which were @visakanv😜\n\nhttps://t.co/8qP6ApK4pJ\n↓\n1410163207906283523 [2021-06-30] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\nthe original Classic tweet 🎩\nhttps://t.co/CzEXNYtJlf\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1410163209022054400 [2021-06-30] @Malcolm_Ocean 💜 2\nI could've sworn that in addition to him DM'ing me about it multiple times Visa also tweeted at me about it but I haven't found anything except this:\n\n(on which note, maybe good timing for a salon on this? @TheAnnaGat shall I email you?)\n\nhttps://t.co/nwBYFaduGC\n  [Quoting @visakanv: @Malcolm_Ocean @TheAnnaGat @nibrasibn @ElodesNL @m_ashcroft @liekovarpio @pragueyerrr @tasshinfogleman @interintellect_ I actually do my salons by thinking “what do I wanna learn from other people” 😂  as always I’ll tell you you should keep fleshing out your dream-mashup idea. so you should do a salon about it and invite people to tell you their stories so you have more detail, resolution]\n↓\n1410163210355843072 [2021-06-30] @Malcolm_Ocean 💜 3\n@visakanv link us up with your tweets about the importance of encouraging people to expand on their best ideas\n↓\n1410163211219783680 [2021-06-30] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_semantic_search]\nI've also turned the whole post into a thread, so if you want to get seduced into it tweet-by-tweet rather than opening up a tab and forgetting about it for weeks, I've got you covered:\nhttps://t.co/95xa8DPm54\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1410163212566233089 [2021-06-30] @Malcolm_Ocean 💜 1\nturning the post into a thread was actually really helpful for my editing process! prompted a few new points of clarity, added punchiness, and spotting some typos\n↓\n1410163213597958144 [2021-06-30] @Malcolm_Ocean 💜 1\nspeaking of typos, here's a list of neologisms in this blog post (that I added to dict while writing it)\n- transformational\n- reconsolidation\n- unworkably\n- learnings\n\nwords not recognized by another dictionary but I'd already added them to mine:\n- sensemaking\n- ongoingly\n- grok\n\n===\n\n1417175750831067153 [2021-07-19] @visakanv 💜 9 🔁 2\nhttps://t.co/JKOeBDSf5Q https://t.co/pKcOtBl8rd\n  [Quoting Tweet 1417175483373047808 (missing)]\nImages:\n  - [Image #0] The image depicts two characters from the Dragon Ball Z series. The character on the left is a young boy with spiky black hair, wearing an orange robe over a blue shirt, while the character on the right is a woman with short white hair, dressed in a green robe tied with an orange sash and cuffs.\n↓\n1417176194949074944 [2021-07-19] @visakanv 💜 9 [(SEED) type=quote_of_root]\nthis entire salon is basically about one of my favorite tweets of all time- a tweet so good, I prodded @Malcolm_Ocean for months to expand it into a blogpost – and now we are doing a salon to talk to others about it https://t.co/DFLB7R14yh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1417546161125150720 [2021-07-20] @Malcolm_Ocean 💜 15 🔁 2\nBy popular request, an interintellect salon! 🎉 July 30\n\nWant to jam with me &amp; @visakanv about that epic metaphor I posted awhile back about how everybody is constantly living in a bizarre mashup of past memories and the present? 🤯 &amp; hear others' mashups!\nhttps://t.co/q2Xql8feJt\n↓\n1417546162563780610 [2021-07-20] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_semantic_search]\nTo learn more about the context/model here, check out this twitter thread / blog post:\n\nhttps://t.co/95xa8DPm54\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n\n===\n\n1419910591624347651 [2021-07-27] @rslantonie 💜 4 [(SEED) type=quote_of_root]\nToday I discovered my dream mashup is that I'm in a zoom call but I'm also called to sing karaoke https://t.co/5WgiZEhpeS\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1419911416069320706 [2021-07-27] @rslantonie 💜 6\nthanks to @beauhaan @KatieWongthip @tysona0 @tinahospodar @Fadenshine and everyone at RN for being there with me as I shared that insight\n\n===\n\n1421173724645003265 [2021-07-30] @Malcolm_Ocean 💜 4\n\"history is a series of dream mashups\" — @visakanv\n↓\n1421173843918417924 [2021-07-30] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_semantic_search]\n@visakanv (context on dream mashups)\nhttps://t.co/95xa8DPm54\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n\n===\n\n1429686347107811333 [2021-08-23] @Malcolm_Ocean 💜 13 💬 1\nThread on what I got out of Hades (video game)\n\nHas a few game element spoilers but doesn't actually talk about the story plot much so probably fine for most people 😊\n↓\n1429686348353523713 [2021-08-23] @Malcolm_Ocean 💜 7\nI got into it via @visakanv. This tweet sold me on it 👇 Built-in encouragement!\n\nThe game really does live up to that. Hell/Hades tries to sell you on \"there is no escape\" but the larger frame of the game makes you not buy it and inspired to try again 😤\nhttps://t.co/hkXKo7sMgN\n  [Quoting @visakanv: @diviacaroline @ehn Hades does this very explicitly, so much do that I would encourage someone who’s in a rut to play it bc it incepts you with “it’s ok to fail, you’ll do better the next time”]\n↓\n1429686349913862146 [2021-08-23] @Malcolm_Ocean 💜 7\nThere was something really satisfying about beholding the rich archetypes of the various Greek gods that support you. They all have strong, distinct, multi-faceted personalities, and encourage you in different ways.\n\nThe underlying message is always:\nhttps://t.co/aLb05Cis1n\n  [Quoting @Malcolm_Ocean: I love you.  You've got this.  It's worth it.]\n↓\n1429686356322791425 [2021-08-23] @Malcolm_Ocean 💜 9\nYou also get to see pairwise relationships between the Olympian gods, both re personalities &amp; in terms of the different ways they make you more powerful or change their attack style.\n\nThe combinatorics are a lot, and make every run different, even as you gain overall familiarity. https://t.co/CkJF4Hvyus\nImages:\n  - [Image #0] The image is a chart that displays the various aspects and combinations of a video game, specifically Hades. The chart is divided into several sections, each representing a different aspect of the game.\n    \n    *   The left side of the chart features a list of symbols, including hearts, flowers, and other icons, which are likely related to the game's mechanics or characters.\n    *   The main body of the chart is a grid that displays various combinations of boons (benefits or bonuses) that can be granted to the player by different gods. Each cell in the grid represents a specific combination of boons and describes its effects on the player's abilities or gameplay.\n    *   The chart includes information about the different gods and their corresponding boons, as well as the effects of combining multiple boons.\n    *   The bottom of the chart features a row of images depicting characters from the game, likely representing the different gods or characters that can grant boons to the player.\n    *   The background of the chart is black, with white text and colorful graphics used throughout.\n    \n    Overall, the chart appears to be a comprehensive guide to the game's mechanics and combinations, providing players with a detailed understanding of how to optimize their gameplay experience.\n↓\n1429686359816654851 [2021-08-23] @Malcolm_Ocean 💜 4\nSome chambers are \"Trial of the Gods\", where you have to pick one of two gods to accept a boon from first, &amp; then the other tries to smite you.\n\nBut after a short battle with the usual underground dudes while dodging lightning bolts or whatever, they forgive you!\n↓\n1429686361058168832 [2021-08-23] @Malcolm_Ocean 💜 5\nThis forgiveness and fighting-not-meaning-relationship-threat theme goes a lot deeper and permeates a lot of the game.\n\nWe all have to bear our choices, and if you're immortal, eventually you get bored of holding grudges! Which doesn't mean you get bored of *fighting*!\n↓\n1429686362219982850 [2021-08-23] @Malcolm_Ocean 💜 3\nFighting—the contest of wills, wits, &amp; wiles—is a pretty fundamental aspect of being.\n\nNow, if you're mortal, you don't want to fight to the death unless something even more important is on the line, but that's why we have sports and games and uhh status competitions 😅\n↓\n1429686363444629505 [2021-08-23] @Malcolm_Ocean 💜 4\nBut I can kinda see how if I were immortal, it could be cool to be lovers with someone who I also fight to the death periodically!\n\nFor us mortals, there's wrestling your partner, or something like this:\nhttps://t.co/sg0urVg9bd\n  [Quoting @Malcolm_Ocean: me &amp; @SarahAMcManus demo a technique we just came up with for healthily expressing frustration towards someone. basically you arrange your arms so they can frustrate you physically, and then you PUSH AS HARD AS YOU CAN 😡💪❤️‍🔥  (&amp; use mechanics/leverage to balance strength diffs) https://t.co/G7mXrdfgCc]\n↓\n1429686365042745344 [2021-08-23] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_semantic_search]\nIt's been cool to have contact with a metaphor of death being a temporary setback.\n\nIt helped me feel in touch with other reincarnation myths, and some recognition of how emotional flashbacks are a bit like dying and resetting to an earlier save point.\nhttps://t.co/95xa8E6XtE\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1429686366632296449 [2021-08-23] @Malcolm_Ocean 💜 3\nAnyway, as I wrote about in this thread👇 I've been playing more games lately and it's been inspiring thoughts on the nature of motivation.\n\nI'm trying not to use those insights to justify why I play games though. Games are fun! It's satisfying to improve.\nhttps://t.co/gmdHtKYVx5\n  [Quoting @Malcolm_Ocean: I spent dozens of hours in the last week getting a couple of achievements in Factorio (playtime shown below is overestimate; I left it running in the background some) and I'm struck by a sense of how it was motivating to be playing with the achievements pinned to the top left. 🤔 https://t.co/kae0uup6J6]\n↓\n1429686368217804800 [2021-08-23] @Malcolm_Ocean 💜 4\nBut yeah, there's a lot of juice there. How can I add excellent gamelike elements to my own life &amp; work, and to the productivity app I'm working on?\n\nIt'll be \"what if gamification, but good tho?\"\nhttps://t.co/SeSRTJfI54\n  [Quoting @visakanv: speaking into existence: @Malcolm_Ocean needs to write a post (kind of a poetry-ish post) called \"What If It Were Good Tho?\"]\n↓\n1429686369929027584 [2021-08-23] @Malcolm_Ocean 💜 3\nIn brief, as I see it, meh-gamification just sticks points and badges on top of stuff. It's an extra layer of fake proxy rewards, designed to tip the scale of an internal conflict.\n\nGamification-but-good-tho gets you in touch with the real rewards &amp; pleasures &amp; fun of your work!\n↓\n1429686371237642243 [2021-08-23] @Malcolm_Ocean 💜 8\n@visakanv captioned this meme below \"unclear vs clear reward\"\n\nWhich it is! But there's so much more:\n🎯 tough but reachable goals\n🌀 tight feedback loops\n👣 clear next actions\n🤷‍♀️ failure not scary\n🤔 visible choices\n💠 and more!\nhttps://t.co/r9GNqtdNZC\n  [Quoting Tweet 1353550914314002433 (missing)]\n↓\n1429686372818903041 [2021-08-23] @Malcolm_Ocean 💜 7\nSome design Qs for https://t.co/lRiGUxBh9B, inspired by Hades:\n- how can I make multigoal intentions feel more like Duo Boons?  ♥️+🔥→❤️‍🔥\n- how can I help people see other ways in which their goals help each other out?\n- is a day like a Hades run? 🤯😮🤔\n↓\n1429686374136008709 [2021-08-23] @Malcolm_Ocean 💜 3\n- how can I encourage people to try &amp; fail &amp; try again, rather than struggling to get started? 📈\n\nThese 3 short phrases actually came to me when I asked myself \"how do I want people to feel when they use Complice?\"\nhttps://t.co/aLb05Cis1n\n  [Quoting @Malcolm_Ocean: I love you.  You've got this.  It's worth it.]\n↓\n1429686375553589248 [2021-08-23] @Malcolm_Ocean 💜 3\n- how can I improve the text shown to the user in Complice to better incorporate what I know about them?\n\nHades does a *brilliant* job of this. Complice is already way better than most apps at presenting contextual info, but so much room for improvment.\nhttps://t.co/urGOatGPQm\n↓\n1429686376732282881 [2021-08-23] @Malcolm_Ocean 💜 4 🔁 1\nPS: I wrote this thread while listening to Hades soundtrack, which I highly recommend if you don't want to play the game.\n\nI've spent many hours listening to the Transistor soundtrack by the same game studio &amp; musicians! (tho have never played the game)\n\nhttps://t.co/EzcwSE4Nea\n↓\n1429686380624498689 [2021-08-23] @Malcolm_Ocean 💜 3\nPPS: video game music is a whole different thing now than it used to be in the gameboy days. Nothing against chiptunes either, but yeah.\n\nI sent this to my mom the other day: https://t.co/9H29EuYYou\nImages:\n  - [Image #0] The image shows a series of text messages discussing video game soundtracks. The text is presented in blue speech bubbles against a white background.\n    \n    To recreate the image, start with a white background. Then, create five blue speech bubbles, each containing a portion of the text. The text should be arranged as follows:\n    \n    * The first bubble contains the text: \"it's a video game soundtrack\"\n    * The second bubble contains the text: \"about a video game where the plot is a son trying to (break out of hell to) reunite with his mother\n    and as I was listening to it I was just thinking about how beautiful this music is, and how it's intended to be background music while also being distinct, and set a whole atmosphere, but be open-ended enough that you can play a game through it (whereas a movie soundtrack only leads one way)\"\n    * The third bubble contains the text: \"and then I was recalling you expressing concern about the 'casino music' coming out of my gameboy\n    and I'm just reflecting on how far we've come since then!\"\n    * The fourth bubble contains the text: \"interestingly, I've actually spent a bunch of time playing Hades in particular, but I used to listen repeatedly to a soundtrack of an earlier game by the same people including the same soundtrack artist!\"\n    * The fifth bubble contains the text: \"of a game I'd never played and didn't know much about\"\n    \n    The text should be written in a standard font, with no bolding or italicizing. The blue speech bubbles should be rounded rectangles with a slight shadow effect to give them a 3D appearance.\n↓\n1429704696856514561 [2021-08-23] @Malcolm_Ocean 💜 3\n@visakanv this thread was inspired in part by a tweet you had that I can't find, which is something like\n\nwhenever you do something, write up what you learned\n\n===\n\n1449568575249780742 [2021-10-17] @Malcolm_Ocean  [(SEED) type=quote_of_semantic_search]\nRT @captain_mrs: 🎶 school boat, boat that's a school 🎶 \n\nhttps://t.co/3jojMGOj7g\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n\n===\n\n1481328930401357826 [2022-01-12] @RomeoStevens76 💜 1378 🔁 169 💬 8\nThe reason to avoid lying is that the brain is not type safe. Lying to others and lying to yourself are the same motion.\n↓\n1481392198994169858 [2022-01-12] @RomeoStevens76 💜 49 🔁 2 [(SEED) type=quote_of_semantic_search]\nalso related:\nhttps://t.co/ulpBBoJ39h\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n\n===\n\n1485425975055634432 [2022-01-24] @Malcolm_Ocean 💜 11 🔁 2\nJust watched this video with @LordChisholm, of @AnnaLeptikon &amp; @vervaeke_john talking about reunderstanding rationality in light of relevance realization &amp; the latest cognitive science.\n\nsome notes/thoughts/intertwinglednesses in thread\nhttps://t.co/ySXtEGLcvY\n↓\n1485425976355876865 [2022-01-24] @Malcolm_Ocean 💜 3\n32mins: \"you cannot optimally overcome framing effects! because the framing does often matter, because we are embedded in a social environment\"\n\n\"What matters depends not only on the numbers!\"\n\nRelevant:\nhttps://t.co/ku4DwCqllr\n  [Quoting @Malcolm_Ocean: @Meaningness If I suddenly found myself on a trolley platform with perfect knowledge of trolleys and a weird choice to make, my attention would be on trying to understand the context of how the fuck I got there, not on the ethics of the weird choice.]\n↓\n1485425977924616193 [2022-01-24] @Malcolm_Ocean 💜 5\nat 39mins they're talking about use of procedural rationality as a way to step back from a default response. My thought was \"why not go straight for expanded awareness directly?\"\n\nsee @m_ashcroft's work on this:\nhttps://t.co/lrJd6voGrh\n  [Quoting @m_ashcroft: I have a talking point that I want to bang on about more in different ways  that is \"you can only respond to what you notice\"  not being able to notice something (if it lies outside your awareness) renders you choiceless  expanding your capacity to notice things gives you agency]\n↓\n1485425979539410947 [2022-01-24] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_semantic_search]\n41mins: self-knowledge as a way to debias\n\nThis is good but you can't simply apply a correction. Instead ask \"in what ways does this situation remind me of ones I know myself to be biased about? can I tell how it's different?\"\n\nSee [[dream mashups]]\nhttps://t.co/95xa8DPm54\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1485425981582049283 [2022-01-24] @Malcolm_Ocean 💜 1\n49mins: interface theory of perception\n\nI'd say in some sense \"there is no non-veridical\", there's just overgeneralizations.\n\nThough this may be the mistake JV says the pragmatists made of \"reducing truth to relevance\".\n\nhttps://t.co/9YeqIZ8MzD\n  [Quoting @Malcolm_Ocean: overgeneralizing is inevitable,  because we're always explaining the whole of our experience (so far) with whatever models etc we have,  and the models don't have enough detail, so we need to stretch them to cover the whole]\n↓\n1485425985252061184 [2022-01-24] @Malcolm_Ocean 💜 2\n53mins: stoked to hear a mention of Gary Klein's Naturalistic Decision Making framework.\n\nIt also gets a mention in my Dream Mashups post, talking about how triggers &amp; PTSD are poorly organized manifestations of how the brain is designed to encode wisdom: https://t.co/8qP6ApK4pJ https://t.co/sR7QYVZe4H\nImages:\n  - [Image #0] The image displays a text passage discussing the emotional brain and its role in decision-making, with a focus on Gary Klein's \"Sources of Power: How People Make Decisions.\" The passage is titled \"This is a cultural issue, not a biological issue\" in purple text.\n    \n    *   The passage begins by describing the emotional brain as a timeless sensemaking system that rapidly assesses situations and generates corresponding emotional states.\n        *   It explains that this is the same hardware used when meeting an old friend or cracking up at an inside joke.\n        *   The emotional memories and learnings are available immediately whenever the system discerns they're relevant.\n    *   The passage then discusses how this cognitive process allows a firefighter to rapidly recognize something suspicious about the temperature of the house he's in and get his team to safety before the floor collapses.\n        *   It cites a specific case study from \"Sources of Power: How People Make Decisions\" by Gary Klein, which describes recognition-primed decision-making.\n        *   This is a rare example of a decision-making model based on how experts actually do it in the field, not on rationalistic models of how undergrads in contrived experiments should make decisions.\n    *   The passage concludes by stating that the brain is constantly generating a best model of what's going on based on its past learnings, and this is a vital part of thinking.\n        *   It notes that most people are walking around and living their lives in different worlds depending on their different traumas and life histories.\n    \n    The passage provides a detailed explanation of the emotional brain's role in decision-making, highlighting its importance in rapidly assessing situations and generating emotional states. It also references Gary Klein's work on recognition-primed decision-making and its relevance to real-world decision-making.\n\n===\n\n1487705578415992835 [2022-01-30] @visakanv 💜 9 [(SEED) type=quote_of_root]\nschoolboat tweets https://t.co/DFLB7QK1wh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1487705651963129857 [2022-01-30] @visakanv 💜 4\nhttps://t.co/yziKHMgIaO\n  [Quoting Tweet 1336170349986136064 (missing)]\n↓\n1490727899418152960 [2022-02-07] @visakanv 💜 16\nmy illusions, by grant snider https://t.co/JHdW2wEf36\nImages:\n  - [Image #0] The image is a comic strip titled \"my illusions\" by Grant Snider, featuring six panels that explore the theme of illusions and self-perception.\n    \n    *   The first panel shows a person standing in an empty room, looking around, with the caption \"WHAT ILLUSIONS AM I FAILING TO SEE?\" \n        *   The panel is set against a white background, with the person dressed in a red shirt and black pants.\n        *   The room is empty except for a small chicken on the floor.\n    *   The second panel depicts a person standing under a structure with pillars, surrounded by birds flying around, with the caption \"WHICH PILLARS OF MY THINKING ARE FALSE?\" \n        *   The structure has four pillars, and the person is holding a book and looking up at it.\n        *   The background is a light yellow color.\n    *   The third panel features a person walking on a circular path, with the caption \"I FEEL LIKE A WALKING CONTRADICTION\" \n        *   The person is shown in mid-stride, with their arms outstretched.\n        *   The background is a pale yellow color.\n    *   The fourth panel shows a person standing on a block that appears to be defying gravity, with the caption \"LIVING ON AN IMPOSSIBLE BLOCK.\" \n        *   The block is depicted as being suspended in mid-air, with the person standing on top of it.\n        *   The background is a cityscape with buildings and a gray sky.\n    *   The fifth panel depicts a person escaping from a palm tree, with the caption \"WHEN I THINK I'VE ESCAPED MY ILLUSIONS...\" \n        *   The person is shown climbing down the trunk of the palm tree, with a look of determination on their face.\n        *   The background is a bright yellow color.\n    *   The sixth panel shows a person trapped inside a triangle, with the caption \"IT'S JUST ANOTHER DAY IN PARADOX.\" \n        *   The person is depicted as being stuck inside the triangle, with a resigned expression on their face.\n        *   The background is a red and yellow color, with a sunset or sunrise visible behind the triangle.\n    \n    Overall, the comic strip explores the idea that our perceptions and understanding of the world are often influenced by our illusions, and that these illusions can be difficult to escape. The use of simple yet effective visuals and clever wordplay adds to the humor and poignancy of the comic.\n\n===\n\n1555707629497856000 [2022-08-06] @AskYatharth 💜 11 🔁 1 [(SEED) type=quote_of_semantic_search]\nwhen i first read about Malcolm’s emotional dream mash-up idea, it felt theoretical \n\nbut fuck. the last few months it hasn’t felt theoretical at all\n\nit feels obvious. it feels 𝘩𝘦𝘳𝘦 https://t.co/HPAHrnmlTi\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1555707631485956096 [2022-08-06] @AskYatharth 💜 7\nit’s the idea that at any given moment, your body is experiencing a current version of the situation + an old one\n\nit’s somatically “elsewhere.” it shows up mostly clearly when i’m triggered. there’s usually a clear “elsewhere”\n↓\n1555707632626724865 [2022-08-06] @AskYatharth 💜 3\nwhen i’m triggered by some agro flirting, i *see* and feel i am like 7\n\nwhen i’m worried about eating the wrong thing, i *feel* like i’m 7 https://t.co/J6Xc6VukEN\n  [Quoting @AskYatharth: someone’s flirting with me, and i’m panicking. i have a right to be kind to myself  the only person i owe complete loyalty to is myself  she can walk away. she can walk into my life  the thing that remains is myself https://t.co/nXe7tXuiUS]\n↓\n1555707635160125441 [2022-08-06] @AskYatharth 💜 3\nthis is what Focusing, Coherence Therapy, etc were trying to get at \n\nto try to get me, a disembodied person, who did not have any room for this in his world view, to relate to this \n\nbut i laugh looking back on how “distant” and “hypothetical” those felt senses felt then\n↓\n1555707636527419393 [2022-08-06] @AskYatharth 💜 3\ncoherence therapy, ifs, etc felt nothing like this\n\nthis sense is immediate, present. it’s always available \n\nit doesn’t feel like i’m trying to get a conceptual handle on something that feels distant, hypothetical \n\nit feels here\n↓\n1555707637852909568 [2022-08-06] @AskYatharth 💜 3\nall through the power of Jungian functions that are opening me up to modes of perception i never knew…\n\ni could that consciously tap into\n↓\n1555707642844028928 [2022-08-06] @AskYatharth 💜 3\na few minutes of seeing things in “shroom space” (Ni) and i’m blasted by feels from my somatic dream mash-up (Si) https://t.co/VnR59OqjSM\n  [Quoting @AskYatharth: vibe-check on the jungian functions for perception]\n\n===\n\n1563377660721446913 [2022-08-27] @Malcolm_Ocean 💜 6\ngood thread\nI want to feel feelings appropriate to the situation, and sometimes that's gonna be eg grief or fear or anger\nI prefer not to stub my toe, but when I do, I embrace the pain with a satisfying \"FUCK!\" https://t.co/BQFgzlbyqG\n  [Quoting Tweet 1563021980831404037 (missing)]\n↓\n1563377663737114624 [2022-08-27] @Malcolm_Ocean 💜 2\nbut okay, stubbing one's toe is different from overwhelming or debilitating pain\n\nbut... there I think the issue is:\n- overwhelm (bodymind can't metabolize, can't emotionally manage, causes layering)\n- debilitation (can't live the life you want if getting out of bed hurts)\n↓\n1563377666425663495 [2022-08-27] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_semantic_search]\nalso my sense of what feeling fits the situation is going to hinge on what past situations I'm relating it to, and maybe I could come to realize that feeling &lt;panic&gt; is much less relevant/appropriate now than it was when I was an infant\n\nhttps://t.co/95xa8DPm54\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1563378048287666176 [2022-08-27] @Malcolm_Ocean 💜 2\n(go read the original thread, he says it better)\n\nhttps://t.co/SOhPuQuMpv\n  [Quoting Tweet 1563021984275251201 (missing)]\n\n===\n\n1571499316526686208 [2022-09-18] @relic_radiation 💜 28\nWoah, an update on my mold sensitivity –\n\nI went to an acupuncturist for this. She guided me through “remember a time you felt safe and relaxed - this is who you really are.”\n\nAnd then through feeling that feeling in my body, making it bigger, anchoring it in.\n↓\n1571499404305264641 [2022-09-18] @relic_radiation 💜 23 🔁 1\nIn my own words, what she was doing was – giving me write-access to my somatic sense of identity, so I could rearrange it into a form my immune system could take and work with to distinguish self from not-self.\n↓\n1571499491340992513 [2022-09-18] @relic_radiation 💜 16\nThe most novel part: her guidance that, what my “self” is, is best discovered by remembering times when I felt safe and relaxed ! \n\nThrough this lens, what is your true self?\n↓\n1571499797697204227 [2022-09-18] @relic_radiation 💜 15\nI chose this memory of my Esalen massage training, with the trees and sunlight and massages from friends, and adults around whose values I trusted 🥲 https://t.co/cI8207t6Zd\n  [Quoting @relic_radiation: I have been so thoroughly spoiled; I will never again learn anything in an environment that isn’t this fully alive.   school trauma? h e a l e d 😍 https://t.co/ngx72k3KX7]\n↓\n1571499882073972739 [2022-09-18] @relic_radiation 💜 15\nSo wild. Especially since the process involved stuff like putting my hands on my body and saying out loud “it’s safe for me to relax - the trees and the sunlight are with me. They've never left.”\n↓\n1571500039700189184 [2022-09-18] @relic_radiation 💜 12\nOf course a voice in me objected - \"well they're not here right now are they!!!\" \n\nand also... the fact that I created the feeling of them in my body, and let it in so deeply as to feel part of my identity, c o n s c i o u s l y was pretty unmistakeable.\n↓\n1571500278368686082 [2022-09-18] @relic_radiation 💜 14 🔁 1 💬 1 [(SEED) type=quote_of_root]\nSo, TIL that it's possible to gain write-access to \"what dream mashup does my body presently feel like it's walking around in\" - &amp; swap it out for healthier ones.\n\nBefore I was stumped on what to choose as the healthy dream identity, but now I've got it 💜 https://t.co/Qrd95nrNet\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1571500931535241216 [2022-09-18] @relic_radiation 💜 10\nSoo I feel like my body is made of trees&amp;friends&amp;massage&amp;sunlight.\n\nThis sounds similar to “get through the present by dissociating to a past memory,” but I suspect the difference is that 1. I feel my body more (vs checking out) &amp; 2. I feel the present more (vs checking out)\n↓\n1571501179196133376 [2022-09-18] @relic_radiation 💜 9\nAlso, another point re: distinguishing it from dissociation:\n\nthe acupuncturist emphasized – “it’s important that you actually feel it. Don’t say it out loud, don’t put your hands on your body yet, until you feel it. If you don't, let me know and we can do something else.”\n↓\n1571573259245584384 [2022-09-18] @relic_radiation 💜 10\na footnote discussion that I forget to add sometimes bc I've worked with this so much -\n\npls don't go trying to 'overwrite' yourself. this space of write-access can't be rushed or forced, ime it seems to emerge healthily when the old feels 1. safe 2. loved https://t.co/8o5nPBFhGN\n  [Quoting Tweet 1571514726504435716 (missing)]\n↓\n1573478273442521108 [2022-09-24] @Malcolm_Ocean 💜 3\n@relic_radiation your use of the word \"overwrite\" reminded me of this tweet I had from awhile ago. tho I'd caution that ofc it's possible to temporarily *suppress* the old knowing.\n\nhttps://t.co/cQ3kIwy0Rs\n  [Quoting @Malcolm_Ocean: Our brains aren't dumb enough to let us simply overwrite our old understanding of things with a new understanding. We'd lose hard-earned lessons.  Learning happens by holding the old &amp; new knowings together, til they form a clear, more complex picture 📔👇 https://t.co/H0rQYmC9b4]\n↓\n1573490998864396299 [2022-09-24] @relic_radiation 💜 1\n@Malcolm_Ocean ahahahaha when I wrote the ‘overwrite’ tweet I almost added a second that said “see also:” and linked to the e x a c t tweet of yours you just linked. \n\nI suppose you could say it’s influenced me 😊\n\n===\n\n1576698503505793025 [2022-10-02] @relic_radiation 💜 15 [(SEED) type=quote_of_root]\nI’m doing more and more local improvisational dance practices that work with embodying energy inside us and, hoo boy\n\nI get to surface and wander around in my dream mashup ….? ! https://t.co/JO7uIgp4bN\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1576703093060022272 [2022-10-02] @relic_radiation 💜 5\nand as I wander around sensate inside my dream mashup, I get to choose the parts I like and want, and feel and channel them deeper to the present\n\n&amp; also notice the parts that no longer serve - and offer healing energy to them? whether compost or expression or holding \n\nw o a h\n↓\n1576703635631017984 [2022-10-02] @relic_radiation 💜 2\nI finally understand those paintings that are like, little symbols everywhere! they are psychomagic! \n\nwell, specifically when the symbols ate anchored to real energy from within. otherwise they can fall flat\n↓\n1576704619761512450 [2022-10-02] @relic_radiation 💜 3\nhere’s a lens on my dream mashup y’all, after 15m of blindfolded dance\n\n* waves up top, a beach that I frolicked w friends\n\n* a “red truck” that I fell in love in, two energies, behind candles lighting breathwork around succulents of SFbay\n\n* Arizona land spirit cacti roadtrip https://t.co/nnkIayFQtF\nImages:\n  - [Image #0] The image shows a hand holding a spiral-bound notebook with a painting of flowers on the page. The painting features a mix of blue, red, purple, and yellow flowers, accompanied by green stems and leaves. The flowers are depicted in a loose, expressive style, with visible brushstrokes and vibrant colors. A handwritten note is visible along the left edge of the page, reading: \"luminous messes and covering this landscape in the forest of danger & wonder.\" The background of the image appears to be foliage or leaves, suggesting that the photo was taken outdoors.\n\n===\n\n1637692258571911168 [2023-03-20] @Prigoose 💜 42\nhow to dissolve anger? how to let go of anger?\n↓\n1637738522538041344 [2023-03-20] @Malcolm_Ocean 💜 10 🔁 1\n@Prigoose Sam Harris suggests repeating an emotional rxn deliberately, which I've found pretty interesting &amp; satisfying with anger\n\nhelps release the part that is just a feeling\n\nme: annoyed by something\n motherfucker 😠(😒)\n motherFUCKER 😡(🤭)\n GODDAMNIT MOTHERFUCKER 🤬(🤣)\n↓\n1637738986763612160 [2023-03-20] @Malcolm_Ocean 💜 2\n@Prigoose but then also the anger may well be telling you that something needs to change in your environment, or that someone close to you isn't loving you effectively\n\nin which case there is then some sort of action to take or communication to make\n\nhttps://t.co/m3YgRkuT8i\n  [Quoting @Malcolm_Ocean: anger is the means by which we assert \"this is your problem, not mine\"  (from a convo w @QiaochuYuan)]\n↓\n1637739232994422786 [2023-03-20] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_semantic_search]\n@Prigoose although before doing that, it might help to first figure out what schoolboat you've got going on\n\nhttps://t.co/95xa8E7vjc\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1637742411630923777 [2023-03-20] @Malcolm_Ocean 💜 2\n@Prigoose there are multiple factors that go into the size &amp; shape of the emotion you're having right now; worth paying attention to all of them (and I guess there's a learning process of discerning which is relevant each time)\n\nhttps://t.co/s3PmxKkL8H\n  [Quoting @Malcolm_Ocean: @reasonisfun So it's something like, emotions all mean *something*. They're all situated in all of: • the sense data you're perceiving (unless dreaming) • your whole backlog of life experiences that have created your brain organization • the current neurochemical baseline]\n\n===\n\n1653027586547564545 [2023-05-01] @abhayance 💜 1\ncomplete experience is that which cannot be enhanced by a reframe, because it cannot be framed (it’s also not an I-it transaction)just as the photograph of a tiger does not “improve”, and cannot contain, the photographer’s encounter with the tiger\n↓\n1653609087404498944 [2023-05-03] @Malcolm_Ocean 💜 1 [(SEED) type=semantic_search]\n@abhayance I'm (ongoingly) confused by how to integrate the truth of what you're saying here\n\nwith the dream mashups thing; the idea that our experience is in some sense constantly a projection (even if we're experiencing nonduality / nonattachment to it)\nhttps://t.co/bqqGn9vkZk\n  [Quoting @Malcolm_Ocean: In the original tweet Qiaochu wrote that I responded to with the dream mashup metaphor, he's talking about not just strong acute trigger moments but ongoing worldviews.  Dream mashups are basically the default mode! https://t.co/ZcjfPzOcf4]\n↓\n1653745917231546370 [2023-05-03] @abhayance 💜 1\n@Malcolm_Ocean one way to bridge these models is to consider that dream mashups are downstream of incomplete experienceanother is to distinguish between a conceptual truth about the nature of experience (“it is essentially a metafictional fabrication”) and the direct experience of completion\n↓\n1653751950880415745 [2023-05-03] @abhayance 💜 1\n@Malcolm_Ocean importantly, a dream mashup itself affords another opportunity for completion (especially when it is recognized as such, where the threads linking back to incomplete experiences become visible)\n↓\n1653752309967380481 [2023-05-03] @abhayance 💜 1\n@Malcolm_Ocean bold hypothesis: memory reconsolidation in coherence therapy could be one aspect of \"completion\"\n↓\n1660203704333770755 [2023-05-21] @Malcolm_Ocean 💜 1\n@abhayance something like that seems right\nhmmmmmmmmmmm\n\nalso \nhttps://t.co/GqYHHohkZ3\n  [Quoting @Malcolm_Ocean: meaning is a sense the units of it are units of context some are small, like a word you've heard before some are large, like a classic myth or archetype some are in between, like \"what you're doing reminds me of that time when I...\"]\n\n===\n\n1672834566262861826 [2023-06-25] @Malcolm_Ocean 💜 1336 🔁 115\nso many adults never get beyond kid-level of Theory of Mind (other people know different things than me)\n\n...to more advanced stages like:\n- other people think different things than me\n- no actually other people ACTUALLY think those things\n↓\n1673371336771551233 [2023-06-26] @Malcolm_Ocean 💜 9 💬 1 [(SEED) type=quote_of_semantic_search]\n...and that's just the tip of the intersubjective iceberg! Read about Dream Mashups for a deep look at projection &amp; perception.\n\nas blog post: https://t.co/8qP6Aq1FOj\n\nas twitter thread:\nhttps://t.co/95xa8E6XtE\n  [Quoting @Malcolm_Ocean: Everyone's basically living in a dream mashup of their current external situation &amp; their old emotional meanings. Like dreaming you're at high school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed https://t.co/8qP6ApK4pJ]\n↓\n1786492194032951787 [2024-05-03] @Malcolm_Ocean 💜 1\nwhat motivations, or what information\n\nbut \"someone like me\"\nhttps://t.co/KHnGaeQiX2\n  [Quoting @aleksil79: the default theory of mind is, implicitly, \"what motivations would cause someone like me to say and do what i think i'm seeing and hearing\"  much confusion is caused by failures to appreciate both differences of personality &amp; culture, and the significance of omitted context]\n\n===\n\n1691943267774967888 [2023-08-16] @Malcolm_Ocean 💜 6\n*squints* O.o\n\ngreat question! afaict...\n\nA) two-way total loyalty = total honesty + total *collective* control\n\nB) one-way total loyalty is not, afaict, compatible with the boss/guru/etc being totally honest. not a stable attractor, collapses to dishonesty or disloyalty https://t.co/t3xq43hHzP https://t.co/oGBUAin3Kw\n  [Quoting Tweet 1688761504672190465 (missing)]\n\n===\n\n1691943276687818835 [2023-08-16] @Malcolm_Ocean 💜 3\nless ideally, it might be that the only way for me to be honest with this person is to burst their projection-perception of me as a 100%-trustworthy guru, which might cause not just a small drop in loyalty but it might make them angry and distrustful towards me\n↓\n1691943277790945538 [2023-08-16] @Malcolm_Ocean 💜 2\nthus, as I said at the top:\n\n&gt; \"one-way total loyalty is not, afaict, compatible with the boss/guru/etc being totally honest. not a stable attractor, collapses to dishonesty or disloyalty\"\n↓\n1691943278935978412 [2023-08-16] @Malcolm_Ocean 💜 3\nwhy is one person being 100% loyal to another when the other isn't 100% loyal to them a liability to both of us?\n\n(80% vs 60% isn't such a big deal, btw! things get extreme around 100% because it makes betrayals infinitely bad)\n↓\n1691943280341074412 [2023-08-16] @Malcolm_Ocean 💜 2\nahh I guess it's not about a lack of loyalty in return, but about a lack of meta-trust.\n\nhttps://t.co/IAjWQyXUvi\n  [Quoting @Malcolm_Ocean: &gt; “Generalized trust” or “meta-trust” is “trust that whatever issues might arise between us, we can talk about things in a way that is workable for both of us and leads to issues getting resolved to our mutual satisfaction in good time.”  https://t.co/xndLqWm6jH]\n↓\n1691943281762979868 [2023-08-16] @Malcolm_Ocean 💜 4\nloyalty seems to combine (meta-)trust with something like putting the others' needs first\n\nbut symmetrical high-loyalty looks more like a superorganism where the parts are caring for the wholes' &amp; parts' needs on all scales\n↓\n1691943283063136310 [2023-08-16] @Malcolm_Ocean 💜 2\nnote that this isn't a discontinuity with asymmetric high-loyalty. in order to be the perfect servant, one must also care for oneself impeccably! otherwise one fails to be able to continue to serve\n\nbut in the asymmetric case the will of the boss steers aside from that\n↓\n1691943284237582380 [2023-08-16] @Malcolm_Ocean 💜 2\neither kind of loyalty comes from a sense that given one's options, this relationship is the best way to meet one's needs\n\nthis could be a coercive situation, (extreme of which is a chattel slave who doesn't run because they'd get killed)\nor it could be security of loving family\n↓\n1691943285403619467 [2023-08-16] @Malcolm_Ocean 💜 3\nanyway, if I don't have meta-trust with you then I am anticipating that at some point something I do will be experienced as a betrayal by you that is outside the bounds of what our relationship can handle, which would drop your loyalty suddenly and immensely\n↓\n1691943286577983573 [2023-08-16] @Malcolm_Ocean 💜 2\nthis would be problematic in part because the sudden drop in loyalty might blow up our lives, if eg it results in a breakup or mortgage default or company scandal or community schism\n\nbut could also be intrinsically dangerous to me—blowback on gurus once naive-trusted can be big\n↓\n1691943287710462303 [2023-08-16] @Malcolm_Ocean 💜 3\nand intrinsic to this situation is that I also do not know what will produce this sudden betrayal or why\n\nI may have guesses, but my knowledge is necessarily incomplete or confused, otherwise I'd be able to resolve this with you\n↓\n1691943288821965009 [2023-08-16] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\nlest it sound like I'm talking about mundane stuff here, well, I am—betrayals can come up around things like kitchen norms or being late\n\nbut also I'm not. meta-trust breakdowns invariably are downstream of people living in seemingly-incommensurate worlds\nhttps://t.co/CzEXNYLkJP\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1691943290243838459 [2023-08-16] @Malcolm_Ocean 💜 2\nbut this produces a huge paradox. as the person who has found their way into the guru role, my attempts to be honest can, as described above, *themselves* produce the very blowback that my honesty is attempting to warn about!\n↓\n1691943291481129321 [2023-08-16] @Malcolm_Ocean 💜 2\nall that to say, this is tricky and complex, and there are no right answers\n\nbut I would suggest not try to have total loyalty or trust! err towards amiable distrust\n\n&amp; respect others' distrusting you, even if you don't like it\nhttps://t.co/W0NyiXtWOX\n  [Quoting @Malcolm_Ocean: if someone can't trust me in some way, even if I or others *do* trust me in this way  then I cannot ask them to trust me more than they can trust me  each person has been betrayed in different ways, and their trust must thus be earned in different ways]\n↓\n1691955848745017543 [2023-08-16] @Malcolm_Ocean 💜 1\nah fuck, re-reading this thought after writing the rest of the thread, I figured out how to decompose the trust stuff out of loyalty\n\nyou can loyally TRY to do the best for someone else, but with inadequate honesty and safety and mutual trust, you'll fail\nhttps://t.co/IgJZjym6oJ\n  [Quoting @Malcolm_Ocean: loyalty seems to combine (meta-)trust with something like putting the others' needs first  but symmetrical high-loyalty looks more like a superorganism where the parts are caring for the wholes' &amp; parts' needs on all scales]\n\n===\n\n1714369537842503928 [2023-10-17] @visakanv 💜 377 🔁 42 💬 1\nu have interpreted an observation as an instruction. here is an actual instruction for comparison: consider reflecting on why u felt compelled to do that\n↓\n1714400518318219654 [2023-10-17] @pachabelcanon 💜 15\n@visakanv I wonder if it's because enough people express instructions as observations, 1) on purpose, 2) to be polite or 3) accidentally/unconsciously.\n↓\n1714401076324294959 [2023-10-17] @visakanv 💜 32 🔁 2\n@pachabelcanon having talked with a bunch of people about it over the years, imo the leading explanation is usually that people are seeing afterimages from past instructions, ie they’re often overzealously pattern-matching from a shitty dad/teacher/friend/ex\n↓\n1714401423142904119 [2023-10-17] @visakanv 💜 6 [(SEED) type=quote_of_root]\n@pachabelcanon current external situation + old emotional meanings https://t.co/KL01SshInY\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n\n===\n\n1730772686228304351 [2023-12-02] @visakanv 💜 118 🔁 5\ni'd buy a children's book version of this https://t.co/al6uP2jVMC\n  [Quoting Tweet 1730710239370936663 (missing)]\n↓\n1730773583188898125 [2023-12-02] @visakanv 💜 15\nand this, which is a direct complement https://t.co/sFwrZbq7WP\n  [Quoting @AskYatharth: there’s an important physicality to a fire, which is you can sit as close to it or far from it as you want, you can bask exactly at the distance most comfortable for you to enjoy this fire https://t.co/vif9GNzElR]\n↓\n1730773917214929186 [2023-12-02] @visakanv 💜 8 [(SEED) type=quote_of_root]\nand this \n\nhttps://t.co/DFLB7QK1wh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1730793622378021046 [2023-12-02] @Malcolm_Ocean 💜 2\n@visakanv ooooh, this would be fun\ntotally doable\n\nahhh so many potential projects\nhttps://t.co/yG1Fx1z50x\n  [Quoting @Malcolm_Ocean: \"Every day I discover more and more beautiful things. It's enough to drive one mad. I have such a desire to do everything, my head is bursting with it.\" — Claude Monet]\n↓\n1730794744542896551 [2023-12-02] @visakanv 💜 3\n@Malcolm_Ocean for some reason im thinking of: https://t.co/OTKW2xIr4y\nImages:\n  - [Image #0] The image is a four-panel comic strip featuring Winnie the Pooh. The comic is titled \"Safely Endangered\" and depicts Pooh eating something that is not honey, causing a leopard to exclaim, \"Sweet Jesus, Pooh, that's not honey.\" \n    \n    The comic's humor lies in the leopard's reaction, which is repeated in a recursive manner, with the leopard saying \"You're eating recursion\" and then experiencing the same reaction again. The final panel shows a series of smaller images illustrating this recursive effect, with the leopard's face becoming increasingly distorted as it continues to say \"You're eating recursion.\"\n\n===\n\n1737637848072007963 [2023-12-21] @visakanv 💜 86\nthread of me recommending my mutuals, quotes are in response to them rocking hard\n↓\n1737637915369537669 [2023-12-21] @visakanv 💜 10\nhttps://t.co/ik8fTiJd79\n  [Quoting @visakanv: @liminal_warmth jessica rocks so hard]\n↓\n1737637984961482821 [2023-12-21] @visakanv 💜 6\nhttps://t.co/FAHGVDSIp5\n  [Quoting @visakanv: @AskYatharth selene rocks so hard]\n↓\n1737639135895277928 [2023-12-21] @visakanv 💜 8 [(SEED) type=quote_of_root]\nmalcolm rocks so hard https://t.co/DFLB7QK1wh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1737639496030752805 [2023-12-21] @visakanv 💜 19\nyatharth rocks so hard https://t.co/sFwrZbq7WP\n  [Quoting @AskYatharth: there’s an important physicality to a fire, which is you can sit as close to it or far from it as you want, you can bask exactly at the distance most comfortable for you to enjoy this fire https://t.co/vif9GNzElR]\n↓\n1737640398133301735 [2023-12-21] @visakanv 💜 16\nwendell rocks so hard https://t.co/RHHQSyFIBf\n  [Quoting Tweet 1622022536438374407 (missing)]\n↓\n1737640548272681050 [2023-12-21] @visakanv 💜 16\nmauv rocks so hard https://t.co/WNzlBtsEgq\n  [Quoting Tweet 1506451523835994121 (missing)]\n\n===\n\n1748737418268967101 [2024-01-20] @visakanv 💜 285 🔁 11\nrival's best and most underappreciated tweet in my view https://t.co/6bPqbApnjg\n  [Quoting @nosilverv: Many kids become hyperrational as kids because that's the game adults are ostensibly playing. They get no purchase, ofc, because adults are just cosplaying being rational so that they don't get unpersoned. Take a long time to discover it's emotional disregulation all the way down]\n↓\n1748737675480461780 [2024-01-20] @visakanv 💜 70\npairs beautifully with what i consider one of the best tweets ever written by anyone ever https://t.co/6GNWB8mSFm\n  [Quoting @DRMacIver: A lot of visible problems that you can't seem to solve are secretly solutions you don't want to admit to adopting to problems you don't want to admit to having.]\n↓\n1748738064846082341 [2024-01-20] @visakanv 💜 38\nsince i'm listing out banger tweets, https://t.co/nUwNeTxXHU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1748738326360977471 [2024-01-20] @visakanv 💜 26 [(SEED) type=quote_of_root]\nhttps://t.co/DFLB7QK1wh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1748738417947803765 [2024-01-20] @visakanv 💜 31\nhttps://t.co/0WOQkVB9ZH\n  [Quoting Tweet 1027604793101959168 (missing)]\n↓\n1748743667265765721 [2024-01-20] @visakanv 💜 47 🔁 1\nstrong case could be made for \"no, this is rival's best tweet actually\" https://t.co/uZ3XQx8Sa8\n  [Quoting @nosilverv: Psychological maturity is realizing your dad was just some guy lol]\n├── 1748975591620243590 [2024-01-21] @visakanv 💜 9\n│   https://t.co/TUUvha1eLh\n│     [Quoting @mechanical_monk: life gives you problems (in the David Deutsch sense, or in the math textbook sense)  you transform them, in your head, into Problems (psychic entities)  you put them on pedestals. you walk around them all day, look at them, occupy yourself with them. you tremble at their might]\n└── 1750141317928129003 [2024-01-24] @nosilverv 💜 3\n    @visakanv Extremely touched by being featured twice in this thread.\n\n===\n\n1760150183931740334 [2024-02-21] @alcentian_one  [(SEED) type=quote_of_semantic_search]\ndream mashups + unblocking the emotional brain \n\nbig thread touching on self-awareness, introspect, curiosity, regulation, integrity. \ncool stuff!! https://t.co/nj24kE0O8L\n  [Quoting @Malcolm_Ocean: ...and that's just the tip of the intersubjective iceberg! Read about Dream Mashups for a deep look at projection &amp; perception.  as blog post: https://t.co/8qP6Aq1FOj  as twitter thread: https://t.co/95xa8E6XtE]\n\n===\n\n1826995632030335293 [2024-08-23] @visakanv 💜 4300 🔁 304 💬 3\nthis was me up until ~27. i still occasionally have a bit of it. ymmv, but in my journey my understanding has been, the way out is through. you can't banish the gut reaction. rather you gotta find a way to be deeply immersed in the feeling \"I am safe, I am loved, I am cared for\" https://t.co/7zw70kEoHc\n  [Quoting Tweet 1826785093094092966 (missing)]\n↓\n1826995956807868673 [2024-08-23] @visakanv 💜 320 🔁 25\nyou gotta focus on the feeling you want to be feeling, not on the feeling you want to banish. in fact, the act of trying to banish a feeling, itself creates more of the feeling \"something must be very wrong, that banishment is required\", and guess where that leads\n↓\n1826996290628014430 [2024-08-23] @visakanv 💜 88 🔁 6 [(SEED) type=semantic_search]\npart of it can seem really weird and silly, like literally rehearsing alternate interpretations, and revisiting past memories https://t.co/cAJWg6ay00\n  [Quoting @visakanv: 2. here is my quick-sketch summary of @Malcolm_Ocean's 2021 dream boat mashup post  https://t.co/3KCGsDP1Tb https://t.co/kp61uQyOA1]\n↓\n1826997888884560070 [2024-08-23] @visakanv 💜 78\na lot of my anxiety came via school. i used to be stressed all the time as a student. and so one day i decided to go to the bus interchange as an adult and just sit there and breathe and remind myself, I am safe, I am free. permanent ~20% stress reduction https://t.co/oO8Dgx3dQZ\n  [Quoting @visakanv: thought I’d capture a bit of footage to look at next time. from ages 10 to 21, this was the bus interchange I used the most, and spent the most time at. it’s deeply intertwined with many of my memories. It features in my dreams sometimes. https://t.co/DsffjBvhzM]\n↓\n1827000083541590425 [2024-08-23] @visakanv 💜 60\nand just for some visual evidence of what that stress reduction looks like in muscular tension in the face, particularly around the eyes etc. when i was in the depth of it, I couldn't actually even discern the tension. but now i see it in so many others https://t.co/ToZvwrNVs5\n  [Quoting @visakanv: wife took this pic of me (left) and i cant get over happy i look. 😍🥰 contrast with this other pic from almost a decade ago that, when I took it, it didn't even occur to me that I was stressed/unhappy/tired etc 😫 https://t.co/o4ySmCcTdd]\n↓\n1827001638579822629 [2024-08-23] @visakanv 💜 44 🔁 1\nanyway if you wanna read 300 pages of me going on and on on in circles about this stuff i have a pdf. hopefully an epub before christmas (free DLC)\n https://t.co/SPIIAqAtgD\n  [Quoting @visakanv: here's a 10-minute attempt to summarize my 300 page book @introspectVV into ~500 words. didn't precisely meet the brief of \"in one breath\" but i'll try again multiple times https://t.co/vdOSJt2DHf]\n↓\n1827005353030205502 [2024-08-23] @visakanv 💜 67 🔁 1\nsome of the specific things are like\n\n- make a list of the ppl you know, and spend more time around those you've connected well with\n- make a list of media you've loved in the past– movies, songs, etc– and revisit them\n- attend to your life as if it matters, even if its as a bit\n↓\n1827006006683193345 [2024-08-23] @visakanv 💜 39\nactually its really hard to properly contextualize everything in a few tweets lol hence the 300 page book. because you can go too far with the \"as if it matters\" thing and then be like \"oh god everything matters so much\":\n\nhttps://t.co/cLpQFc4h1N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand centers on Malcolm Ocean's \"Dream Mashups\" concept—the idea that people constantly experience reality as a blend of current situations and old emotional meanings, like \"dreaming you're at high school but it's also on a boat.\" The arc spans 2019-2024, evolving from a single metaphor into a full blog post, multiple salons, and integration into therapeutic/somatic practices. It's highly dialectical: Qiaochu introduces trauma, Malcolm synthesizes the metaphor, Visa evangelizes it, practitioners like relic_radiation apply it to bodywork. The concept becomes a boundary object for discussing emotional flashbacks, projection, and healing—moving from abstract theory to embodied practice. High cohesion among core participants (Malcolm, Visa, Qiaochu, Yatharth, relic_radiation), with clear utility for both psychological self-understanding and therapeutic application.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1209195568146325504,
        "annotation": "The Origin: Malcolm's original \"dream mashup\" metaphor responding to Qiaochu's trauma observation—the seed of everything that follows"
      },
      {
        "tweet_id": 1212491869390815232,
        "annotation": "Theoretical Foundation: Malcolm connects to Pete Walker's emotional flashbacks and Complex PTSD, establishing the psychological basis"
      },
      {
        "tweet_id": 1410155043760730114,
        "annotation": "The Crystallization: Malcolm expands the tweet into a full blog post after repeated requests from Visa—the concept matures"
      },
      {
        "tweet_id": 1410158782382960643,
        "annotation": "Blogpost Announcement: Malcolm finally publishes the full write-up with Visa's encouragement, making it accessible beyond Twitter"
      },
      {
        "tweet_id": 1417546161125150720,
        "annotation": "Community Integration: Malcolm and Visa host an Interintellect salon to discuss dream mashups with others—moving from theory to dialogue"
      },
      {
        "tweet_id": 1555707629497856000,
        "annotation": "Embodied Realization: Yatharth reports the concept shifting from \"theoretical\" to viscerally present in his somatic experience"
      },
      {
        "tweet_id": 1571500278368686082,
        "annotation": "Therapeutic Application: relic_radiation discovers how to gain \"write-access\" to dream mashup identity through acupuncture and bodywork"
      },
      {
        "tweet_id": 1576698503505793025,
        "annotation": "Integration with Movement: relic_radiation uses improvisational dance to \"wander around in my dream mashup\" and heal through it"
      },
      {
        "tweet_id": 1826996290628014430,
        "annotation": "Practical Synthesis: Visa connects dream mashups to his own anxiety healing journey, demonstrating real-world stress reduction"
      },
      {
        "tweet_id": 1748738326360977471,
        "annotation": "Canonization: Visa declares it \"one of the best tweets ever written by anyone ever\" in a thread of all-time bangers"
      }
    ]
  }
}