{
  "seed_tweet_id": 1318925777094778880,
  "thread_text": "1205990362050785281 [2019-12-14] @QiaochuYuan 💜 173 🔁 26 💬 1\n100-opinion challenge from @vgr on emotional self-regulation (might end up being more like @visakanv's \"machine gun brainstorm\" though, no guarantees) https://t.co/E7Tiw7b5LF\n  [Quoting Tweet 1205986374270062592 (missing)]\n\n===\n\n1205991865012506627 [2019-12-14] @QiaochuYuan 💜 31 🔁 1\n@Meaningness 6. for me it's especially helpful to relate to my parts as small children (which they often are in some sense), so i can feel compassion for their suffering\n\nsee also: https://t.co/lniaUCpfoj\n  [Quoting @QiaochuYuan: Internal Puppy Systems might help: https://t.co/q3kow0jktH]\n↓\n1205992848039936002 [2019-12-14] @QiaochuYuan 💜 56 🔁 3\n@Meaningness 7. the way many people emotionally self-regulate in practice is by either fighting an emotional energy with another one (e.g. sadness with anger as above) or shutting their emotions down generally; @Meaningness also talks about this; there's another way!\n\nhttps://t.co/HqZSUhm2Uj https://t.co/LKzFbJYyk6\nImages:\n  - [Image #0] The image is a screenshot of an article titled \"Unclogging internal energies.\" The article discusses how internal energies, such as emotions, have no inherent meaning and evolved to prompt particular patterns of action. It explains that people often try to prevent unwanted behaviors by addressing the root of the problem, which is the energy itself, rather than the symptom.\n    \n    The article is divided into four paragraphs, each discussing a different aspect of internal energies. The text is written in a formal tone and includes technical terms such as \"tantric point of view\" and \"high-energy internal stalemates.\" \n    \n    The article's content is as follows:\n    \n    \"Internal energies, such as emotions, have no inherent meaning.\n    Biologically, though, they evolved to prompt particular patterns of action. \n    Anger primes you for violence, for example. Often these evolved responses are unhelpful in our current environments, and so we (rightly) seek to prevent them. To do that, we often go to what seems the root of the problem — the energies themselves — rather than the unwanted behaviors, which are only a symptom.\n    \n    Unfortunately, it is not possible to turn off—or even turn down—individual energies. It would be handy if we had a row of volume knobs and could adjust anger and lust up or down as needed. But our bodies don't work that way. (From the tantric point of view, this is fortunate in the long run.)\n    \n    So one strategy is to oppose a problem energy with another. For example, to stop yourself from strangling your pointy-haired boss, you might focus on your intense desire for a promotion. That cuts off the channel through which the anger might flow.\n    \n    These deliberate blockages can lead to high-energy internal stalemates. Those are felt as frustration, internal division, and emotional turbulence. Generally they eventually erupt, when the opposing energies fail to balance.\"\n↓\n1205995673641865221 [2019-12-14] @QiaochuYuan 💜 53 🔁 5\n@Meaningness 8. it is possible to let go of the stance that emotions have any fixed meaning. feeling fear doesn't have to mean you're weak; feeling sadness doesn't have to mean you're a crybaby; feeling anger doesn't have to mean you're bad or evil\n\nmuch easier to allow emotion this way\n↓\n1205996221501849600 [2019-12-14] @QiaochuYuan 💜 33 🔁 1\n@Meaningness 9. you don't have to do emotional regulation alone, although sometimes you may have no other choice. we naturally regulate each other. being around a calm person who's attuned to you is calming. you can learn to be this sort of person for others as well\n↓\n1205996768841748481 [2019-12-14] @QiaochuYuan 💜 32 🔁 1\n@Meaningness 10. and, skillfully helping others with their emotions is hard and most people don't know how to do it! by default people also attach fixed meanings to *others'* emotions - e.g. if my friend is sad i must be sad with them and try to help them or else i'm a bad friend\n↓\n1205997265724137472 [2019-12-14] @QiaochuYuan 💜 38 🔁 3\n@Meaningness 11. you can learn to let go of your meanings about others' emotions as well, and just sit with their emotion and help them sit with it too. this may involve doing some work on your own about e.g. your insecurities around being a bad friend\n↓\n1205998281618145280 [2019-12-14] @QiaochuYuan 💜 46 🔁 5\n@Meaningness 12. it's actually not helpful to hold onto things like \"i have to be sad when my friend is sad\", it leads to other people holding things like \"i can't tell my friend i'm sad because i'll make them sad and that'll hurt them\"\n↓\n1205998649953546240 [2019-12-14] @QiaochuYuan 💜 50 🔁 5\n@Meaningness 13. what people want is *attunement*, which is hard to describe and hard to pin down and most people don't even have the word for it so they talk about other stuff that's nearby but not really it. attunement means you are *with them* in the emotion\n↓\n1205999961004892160 [2019-12-14] @QiaochuYuan 💜 54 🔁 4\n@Meaningness 14. a nearby thing that some people do is just feeling the emotion because the other person is feeling it; this is more properly termed \"not having emotional boundaries\" and while it is kinda cool as a kinda psychic power it's also a pain in the ass if you don't know how to stop\n↓\n1206000921135566848 [2019-12-15] @QiaochuYuan 💜 19\n@Meaningness 15. the term of art for this is \"highly sensitive person\" if you want to look up more although i haven't looked at that literature in detail and worry about it\n↓\n1206002986809356289 [2019-12-15] @QiaochuYuan 💜 37 🔁 4 [(SEED) type=semantic_search]\n@Meaningness 16. it can actually be dangerous to start looking at your own emotions in too much detail if you also have a strong inner critic; sometimes you just end up finding more stuff to criticize about yourself. in this situation prioritize working with the inner critic itself first\n↓\n1206008844138057729 [2019-12-15] @QiaochuYuan 💜 9\n@Meaningness (intermission; feel free to ask questions about any of this! also keep in mind that i'm not a trained professional and am just some guy yammering about my opinions based on my specific experiences)\n↓\n1206059634810744834 [2019-12-15] @QiaochuYuan 💜 11\n@Meaningness 17. this is turning into a thread about just straight up emotional regulation not just self-regulation and i'm okay with that; other-regulation and group regulation are super important topics and i wanna talk about them\n↓\n1206060587748220929 [2019-12-15] @QiaochuYuan 💜 22 🔁 1\n@Meaningness 18. i want to say more clearly that a lot of these tweets are coming from a strong sense that people's individual and group relationships to emotions could be so, so, so much better than they are. shit is ludicrously bad compared to what i've seen is possible\n↓\n1206063034143109120 [2019-12-15] @QiaochuYuan 💜 19 🔁 1\n@Meaningness 19. and, it's not all upside, there are genuine risks to making groups more emotionally open, a lot of which have to do with severely traumatized people and people with personality disorders (not a huge fan of that term but it's pointing at a real and important phenomenon)\n↓\n1206065639179223042 [2019-12-15] @QiaochuYuan 💜 44 🔁 4\n@Meaningness 20. one thing that can get out of hand is that emotional openness can release strong feelings of affection and intimacy that many people only know how to interpret romantically / sexually and that can cause lots of problems if people don't know how to sit with those also\n↓\n1206065979240747009 [2019-12-15] @QiaochuYuan 💜 50 🔁 4\n@Meaningness 21. there's a lot to learn about learning how to sit with strong feelings of attraction without needing them to mean anything (e.g. \"omg soulmates!\") or needing to act on them (e.g. \"omg i have to ask you out now!\"); you can learn to just enjoy their raw energy\n├── 1206067586431012864 [2019-12-15] @QiaochuYuan 💜 29 🔁 3\n│   @Meaningness 22. one of the most important practical lessons about strong emotions about other people is that they're often much more about you than about them. you fall for someone b/c they remind you of an ex; you hate someone b/c they remind you of an ex; projection is extremely real\n│   ↓\n│   1206067587945127941 [2019-12-15] @QiaochuYuan 💜 31 🔁 2\n│   23. important subexample of projection: if you've ever felt suspiciously strong desires to win the approval of somebody, especially a mentor kinda figure but even a romantic partner, consider the possibility that you're projecting a parent onto them\n│   ↓\n│   1206067898298466304 [2019-12-15] @QiaochuYuan 💜 13\n│   24. by the way 20-23 are all lessons i learned from chaotic and messy personal experience and i bet i have a ton more lessons to learn, i am not above any of this\n│   ↓\n│   1206072156032884738 [2019-12-15] @QiaochuYuan 💜 14 🔁 1\n│   25. gonna switch topics for a bit to tackling specific emotions. let's start with anger, i have a lot of trouble with that one. many of us judge ourselves for getting angry and/or are afraid of our anger because we don't want to be like our angry parents (in my case my dad)\n└── 1206109458662690816 [2019-12-15] @QiaochuYuan \n    @Meaningness lol \"a lot to learn about learning\" also kinda true but not what i meant welp\n\n===\n\n1318925777094778880 [2020-10-21] @nosilverv 💜 118 🔁 10 💬 19 [(SEED) type=root]\nSo, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:\n\nFirst thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7\nImages:\n  - [Image #0] The image is a screenshot of a text message conversation. The text is presented in three gray speech bubbles against a white background.\n    \n    The text in the speech bubbles reads:\n    \"i cry every time i try to make myself work out\n    but also i feel so good when i do it\n    help? what do u do??\"\n    \n    The first message is at the top, followed by the second, and then the third. Below the third message, in smaller gray text, it says \"Yesterday, 11:17 AM\". \n    \n    To the left of the time, there is a circular profile picture of a man with dark hair and a beard, wearing glasses.\n↓\n1318925780685029376 [2020-10-21] @nosilverv 💜 30 💬 2\n(This is a cue btw. Like, yea crying is good/fine but it's not THAT common to cry about working out - so something might be going on)\n\nAlso notice the conflict 'I cry BUT i feel good'\n\nNotice the coercion 'make myself'\n\nI side-step the coercion and ask about the emotion: y cry? https://t.co/ZNmpGQPkf5\nImages:\n  - [Image #0] The image shows a screenshot of a text conversation between two individuals. The conversation is presented in a white box with a black border at the top.\n    \n    * The conversation is initiated by a person with a profile picture of a man with dark hair and a beard, wearing a purple shirt.\n    \t+ The person's name is not visible.\n    \t+ The profile picture is a circular image with a yellow background.\n    * The first message is sent by the person with the profile picture.\n    \t+ The message reads: \"i cry every time i try to make myself work out\"\n    \t+ The message is displayed in a gray speech bubble.\n    \t+ The timestamp for this message is \"Yesterday, 11:17 AM\".\n    * The second message is also sent by the same person.\n    \t+ The message reads: \"but also i feel so good when i do it\"\n    \t+ The message is displayed in a gray speech bubble.\n    \t+ The timestamp for this message is not visible, but it appears to be sent immediately after the first message.\n    * The third message is sent by the same person again.\n    \t+ The message reads: \"help? what do u do??\"\n    \t+ The message is displayed in a gray speech bubble.\n    \t+ The timestamp for this message is not visible, but it appears to be sent immediately after the second message.\n    * The response to these messages is sent by the other person in the conversation.\n    \t+ The message reads: \"Y cry???\"\n    \t+ The message is displayed in a blue speech bubble.\n    \t+ The timestamp for this message is \"Yesterday, 11:55 AM\".\n    \t+ A checkmark is visible next to the timestamp, indicating that the message has been read.\n    \n    In summary, the image shows a text conversation between two individuals, where one person expresses their struggle with working out and crying, and the other person responds with a question about why they cry.\n↓\n1318925785093316608 [2020-10-21] @nosilverv 💜 32 🔁 1\nThe response is really sensible: it feels bad sometimes and I don't want to do it. Well, makes sense to cry in response to being forced to do something that feels bad and which you don't want to do. \n\nThere is also confusion \"what do\" https://t.co/LtVOuwBM6c\nImages:\n  - [Image #0] The image shows a screenshot of a text conversation between two individuals. The person on the left, with a profile picture of a man with dark hair and a beard, initiates the conversation by expressing their struggle to work out, stating they cry every time they try to make themselves do it, but feel good when they do. They ask for help, prompting the other person to respond with a simple \"Y cry???\".\n    \n    The original poster elaborates on their feelings, explaining that they don't want to work out, and on some days they feel great and energized, while on others they feel unmotivated and in pain. They end their message with \"What do\", seeking advice or guidance.\n    \n    The text bubbles are gray for the original poster's messages and blue for the responder's message, set against a white background.\n↓\n1318925789656657922 [2020-10-21] @nosilverv 💜 44 💬 1\nAt this point I'm confused so I just suggest the most straightforward solution:\n\nJust don't do it, lol. \n\nSeeing what the objection to the most straightforward solution is will teach you a lot about the structure underlying what's going on (crying in response to etc.) https://t.co/pocBQLoIcY\nImages:\n  - [Image #0] The image shows a screenshot of a text conversation on a mobile device. The text is presented in a series of blue speech bubbles against a white background.\n    \n    The conversation is initiated with the message \"Hmmm how about\" followed by \"Don't do it when don't feel like it??\", then \"Do when feel like it?\", and subsequently \"Or remember part that doesn't want t do it how good it feels when you actually get going?\" and finally \"And if still doesn't want allow it??\" \n    \n    The timestamp \"Yesterday, 12:02 PM\" is displayed at the bottom right corner of the image, accompanied by a blue checkmark indicating that the message has been read.\n↓\n1318925794052329472 [2020-10-21] @nosilverv 💜 32 🔁 1\nNow, PAY VERY CLOSE ATTENTION HERE: https://t.co/7DeCU5Fr5u\nImages:\n  - [Image #0] The image is a screenshot of a text conversation between two individuals, where one person is trying to motivate the other to do something they don't feel like doing. The conversation is presented in a series of text bubbles, with the blue bubbles representing the person sending the motivational messages and the gray bubbles representing the recipient's responses.\n    \n    **Text Conversation:**\n    \n    * The blue bubbles contain the following text:\n    \t+ \"Hmmm how about\"\n    \t+ \"Don't do it when don't feel like it??\"\n    \t+ \"Do when feel like it??\"\n    \t+ \"Or remember part that doesn't want t do it how good it feels when you actually get going?\"\n    \t+ \"And if still doesn't want allow it??\"\n    * The gray bubbles contain the following text:\n    \t+ \"BUT TI STILL DOESNT WANNA\"\n    \t+ \"Oh ok I can remind it it's good for me\"\n    \t+ \"And still be like ok u irrational part still don't wanna do it? that's ok bud whatever!\"\n    \t+ \"You will still survive!\"\n    \t+ \"Despite fear mongering from mum!\"\n    \t+ \"Hmm\"\n    \t+ \"Wait now I wanna go do that\"\n    \t+ \"What Jedi mind tricks did u pull on me\"\n    \t+ \"Just sent and did some pull ups\"\n    \n    **Key Points:**\n    \n    * The conversation is about motivating someone to do something they don't feel like doing.\n    * The person sending the motivational messages uses a mix of encouragement and humor to try to persuade the recipient.\n    * The recipient initially resists, but eventually becomes motivated and decides to take action.\n    * The conversation includes a reference to \"Jedi mind tricks,\" suggesting that the person sending the motivational messages has used a clever or persuasive tactic to influence the recipient.\n↓\n1318925796044689412 [2020-10-21] @nosilverv 💜 69 💬 3\nDo you see how what I said got subverted? I said 'just don't do it' it got parsed as 'just don't do it so that it wants to do it' and 'coerce it and call it irrational until it wants to do it'. \n\nThis shit is ENDEMIC in the mind:\n├── 1318925797512589315 [2020-10-21] @nosilverv 💜 61 💬 3\n│   Yatharth is siding with one intention (work out to feel good) in OPPOSITION to another (cry because working out feels bad). Because I'm helping him he ASSUMES I'm aligned with the intention he is aligned with\n│   \n│   (I'm not, I'm aligned with THE BEST POSSIBLE GLOBAL INTENTION FOR HIM)\n│   ├── 1318925801266597894 [2020-10-21] @nosilverv 💜 42\n│   │   At this point I start realising what's going on and pull him towards considering that the other intention is actually not-bad (hard to see because he's currently aligned with the intention that sees it as bad). He immediately rationalises my words :'adapt and rational given etc) https://t.co/ul0A1Bqnyc\n│   │   Images:\n│   │     - [Image #0] The image shows a screenshot of a text conversation between two individuals. The conversation is presented in a white box, with the text messages displayed in blue and gray bubbles.\n│   │       \n│   │       The conversation begins with a message from the blue bubble, which reads: \"I mean You should be open to the possibility that it is not irrational and knows something you don't!\" followed by \"Did it work?\" The gray bubble responds with \"Yeah,\" and then explains that the entity in question is \"adaptive and rational given its time stream that it has access too and its heuristic norms.\" The gray bubble also expresses a desire to \"accept it even if it's not.\"\n│   │       \n│   │       The blue bubble then advises against rationalizing the entity's actions, stating \"No no don't rationalize it bc you haven't heard from it yet\" and \"It might ACTUALLY KNOW something you know.\" The gray bubble responds with \"Hm\" and \"Maybe like.\"\n│   │       \n│   │       The conversation appears to be discussing the possibility of an artificial intelligence or other entity having knowledge or capabilities that surpass human understanding. The tone of the conversation is informal and speculative, with the participants exploring the idea that the entity may possess unique insights or abilities.\n│   │   ↓\n│   │   1318925803653074953 [2020-10-21] @nosilverv 💜 32\n│   │   Again, subversion, told you: E N D E M I C\n│   │   ↓\n│   │   1318925807763492869 [2020-10-21] @nosilverv 💜 50\n│   │   He starts considering that idea and this happens: https://t.co/EzGpbaDK2f\n│   │   Images:\n│   │     - [Image #0] The image is a screenshot of a text conversation between two individuals, with the first message being a response to an unseen initial message. The first message is a grey text bubble containing a statement about the importance of warming up before exercising and fixing one's posture, followed by the recipient's response in a white text bubble: \"is what I'm getting.\" The recipient then sends another message, \"it's kinda angry,\" three minutes later.\n│   │       \n│   │       The conversation continues with the recipient expressing feelings of resentment and frustration, stating, \"And also kinda resentful. At mom/world for fear mongering me. 'I'll be fineeee. And actually yeah there will be consequence but f u for coercing me, sad!\" They further express their desire to assert their sovereignty but feel unhappy and trapped, saying, \"I don't feel in control, I don't like this life, end it. Now I gotta go live in a hut and assert my sovereignty but actually that doesn't make me happy either. I wanna engage but from a very dynamic place and just making what I want to happen happen.\"\n│   │       \n│   │       The conversation continues with the original sender responding with a series of messages, including:\n│   │       \n│   │       * \"Hm. I might drop even more into just non symbolic feeling instead of parts work talk\"\n│   │       * \"Man that's painful\"\n│   │       * \"Awakening feels painful because I feel like a fool now\"\n│   │       * \"And embarassed\"\n│   │       * \"To see self sabotage\"\n│   │       \n│   │       The original sender concludes the conversation by asking, \"Hm what's the counter-story and outside-story here.\"\n│   │       \n│   │       The background of the image is white, and the text bubbles are grey and white, indicating the different speakers.\n│   │   ↓\n│   │   1318925809890041856 [2020-10-21] @nosilverv 💜 45\n│   │   There's just a SHITTON of knowledge that he was ignorant of by pushing away the part that held it. (The one with the intention that was being parsed as 'avoid exercise') Like, really, go read it again, see what shit is coming up here: his relationship to the world, his mum, ...\n│   └── 1319006058925428737 [2020-10-21] @Malcolm_Ocean 💜 1\n│       @nosilverv really well put\n│       https://t.co/keg7heAQbV\n│         [Quoting @Malcolm_Ocean: a great example of what I'll call [[surrogate selfing]]  = unsustainable but super-useful role where A takes on caring for all of B's parts when B is identified with one part/perspective, or otherwise unable to access Self and just feels like a collection of arguing parts https://t.co/ULra4qyqM2]\n└── 1318945377647734785 [2020-10-21] @TylerAlterman 💜 1\n    @nosilverv Dammit\n\n===\n\n1318925993835438081 [2020-10-21] @nosilverv 💜 3 [(SEED) type=quote_of_root]\nOh, Thread lol https://t.co/rUv9XYbrhD\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1318946646567358464 [2020-10-21] @TylerAlterman 💜 12 🔁 1 [(SEED) type=quote_of_root]\nIf you’re willing to go deep and have practiced introspection skills, this type of sequence @AskYatharth follows is the rule rather than the exception https://t.co/pE4pdSeFp4\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1318986060177788928 [2020-10-21] @SarahAMcManus  [(SEED) type=quote_of_root]\nRT @xuenay: Great example of transformative Focusing/IFS/Coherence Therapy/parts work happening quickly. https://t.co/OnohgY7I4C\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1318991989879296001 [2020-10-21] @nopranablem  [(SEED) type=quote_of_root]\nyoooo this is good https://t.co/VnAU4Z7KIU\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1318995725808668672 [2020-10-21] @visakanv 💜 9 [(SEED) type=quote_of_root]\ngood thread https://t.co/n6A5R8he3D\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1318996195302395916 [2020-10-21] @nosilverv 💜 2\n@visakanv 🤗\n\n===\n\n1319002257988276224 [2020-10-21] @dschorno  [(SEED) type=quote_of_root]\nDoes anyone want to give me free DM therapy? I could definitely use some. https://t.co/sycK8jKcjO\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1319011642580082696 [2020-10-21] @AskYatharth 💜 21 🔁 1 💬 1 [(SEED) type=quote_of_root]\nso bird app has been psychoanalysing me recently\n\nsome thoughts 🧵👇\n\nhttps://t.co/lMkhKrRCDm\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n├── 1319011644744355843 [2020-10-21] @AskYatharth 💜 18\n│   so @nosilverv gifted me something here every coach/therapist should.\n│   \n│   He helped me out, and then he *explained every single word* he said, why he said it, and what he was thinking at the time\n│   ↓\n│   1319013812419416064 [2020-10-21] @AskYatharth 💜 17\n│   It takes exemplary courage on part of a coach to show your process and admit just how much of it is guesswork (as it has to be!) and expose to other people how simple it *seems*\n│   ↓\n│   1319013825396543488 [2020-10-21] @AskYatharth 💜 15 🔁 1\n│   Look at the entire convo. Rival only ever says one of two things:\n│   \n│   (1) “Hmmm how about don’t do it when don’t feel like it?”\n│   (2) “Have you considered it might actually know something useful?”\n│   \n│   The rest is just iterations on (2). Over and over again. https://t.co/ssyAUnhyvj\n│   Images:\n│     - [Image #0] The image is a screenshot of a text conversation between two people. The conversation is about the person's difficulty in doing something due to pain and lack of energy. \n│       \n│       To reproduce the image, start with a white background. On the top left, show a red cartoon character with a concerned expression, followed by the text \"Y cry???\" and the timestamp \"Yesterday, 1:55 PM\". \n│       \n│       Below that, display a series of blue text bubbles on the right side, containing the following text:\n│       \"'I don't wanna do it' is what I hear\n│       Some days I want to do it and it feels great and I'm very in sensation of my muscles and the bursting feeling feels good\n│       But other days I don't even wanna move my neck, everything hurts\n│       Like right now. I feel scared / not energised, trying to do it feels painful\n│       What do\"\n│       \n│       On the left side, below the initial message, show three gray text bubbles with the following text:\n│       \"Hmmm how about\n│       Don't do it when don't feel like it??\n│       Do when feel like it?\n│       Or remember part that doesn't want t do it how good it feels when you actually get going?\n│       And if still doesn't want allow it??\"\n│       \n│       The timestamps for these messages are \"Yesterday, 1:57 PM\" and \"Yesterday, 2:02 PM\", respectively.\n│       \n│       The overall layout and design of the text conversation should resemble a typical messaging app, with the blue bubbles on the right representing the person's messages and the gray bubbles on the left representing the other person's responses.\n│   ↓\n│   1319014477770203136 [2020-10-21] @AskYatharth 💜 12\n│   Theoretically, you could code a bot to just ask you these questions. Theoretically.\n│   \n│   Here’s why Rival is still a genius*:\n│   \n│   (* more accurately: nuanced, experienced, ~gold~)\n│   ↓\n│   1319015977749762049 [2020-10-21] @AskYatharth 💜 14\n│   There is a vastly versatile yet parsimonious causal model Rival is building on-the-fly from patterns he’s seen.\n│   \n│   Noticing tiny cues and abducting bigger conjectures:\n│   \n│   every time i try to “make myself” → self-coercion\n│   \n│   https://t.co/45tuW7pwO2\n│     [Quoting @nosilverv: (This is a cue btw. Like, yea crying is good/fine but it's not THAT common to cry about working out - so something might be going on)  Also notice the conflict 'I cry BUT i feel good'  Notice the coercion 'make myself'  I side-step the coercion and ask about the emotion: y cry? https://t.co/ZNmpGQPkf5]\n│   ↓\n│   1319016442264719362 [2020-10-21] @AskYatharth 💜 10 💬 1\n│   “ok u irrational part . . . that’s ok, whatever” → blending with one part that feels responsible for (and incapable of) taking care of everything\n│   \n│   Rival is taking single word choices and building a model of my mind.\n│   \n│   This matters because . . .\n│   \n│   https://t.co/HldzzrQJeG\n│     [Quoting @nosilverv: Do you see how what I said got subverted? I said 'just don't do it' it got parsed as 'just don't do it so that it wants to do it' and 'coerce it and call it irrational until it wants to do it'.   This shit is ENDEMIC in the mind:]\n│   ↓\n│   1319020278811418624 [2020-10-21] @AskYatharth 💜 19\n│   . . . even though Rival essentially repeats himself up to 4 times — saying “have you considered that part could have KNOWLEDGE??” — it is not redundant\n│   \n│   each time, he encourages me to a follow a path, i go a bit of the way, turn back and look at him, and he says, “yeah continue”\n│   ↓\n│   1319020281114038273 [2020-10-21] @AskYatharth 💜 32 🔁 2 💬 2\n│   This is one of the most subtle and underrated things about having a mentor/coach.\n│   \n│   They will often say things you already knew. But somehow *it feels different after.* \n│   \n│   Because what matters is conviction.\n│   \n│   Not just knowledge, but your conviction in it.\n│   ├── 1319020283081183234 [2020-10-21] @AskYatharth 💜 23\n│   │   When you talk to your mentor, and they say something you already knew, they are also imparting their years worth of conviction built up from all their experiences.\n│   │   \n│   │   That conviction affects your boldness in action.\n│   │   ↓\n│   │   1319020285048328197 [2020-10-21] @AskYatharth 💜 12 🔁 1\n│   │   This reminds me of a conversation with @SarahAMcManus about “flat” vs “deep” learners.\n│   │   \n│   │   When your house of cards is shaky and your knowledge feels flimsy . . . you don’t end up building very much on top.\n│   │   \n│   │   https://t.co/s55d4mBExN\n│   │     [Quoting @AskYatharth: @SarahAMcManus Where flat-dominant learners lose their footing with deep-learning is each layer is not solidly built to the house of cards feels shaky. Like moving on to calc before grokking algebra]\n│   └── 1319177139695112192 [2020-10-22] @CountJ0ecool 💜 8 🔁 1\n│       @AskYatharth A coach gives you permission to actually believe the things you already know.\n│       \n│       You're essentially borrowing their credibility, and actually trusting your own intuitions rather than try to rationalize them away.\n│       ↓\n│       1319220490716794880 [2020-10-22] @AskYatharth 💜 5\n│       @CountJ0ecool Hm. This is an interesting formulation. @nosilverv \n│       \n│       Continuing this line of inquiry . . . if coaching gives you permission to trust your intuitions instead of rationalise them away . . . it must mean normally we’re hesitant to simply run with an intuition and not rationalise . .\n└── 1421025056923299844 [2021-07-30] @AskYatharth \n    keywords: rival, nosilverv, RivalVoices; gym, working out; coaching, coach; bird app, psychoanalysing\n\n===\n\n1319032692843970560 [2020-10-21] @nosilverv  [(SEED) type=quote_of_root]\nRT @AskYatharth: so bird app has been psychoanalysing me recently\n\nsome thoughts 🧵👇\n\nhttps://t.co/lMkhKrRCDm\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1319036898505977857 [2020-10-21] @easoncxz  [(SEED) type=quote_of_root]\nI'm unable to understand a single thing that is going on in this thread.\n\nPeople are infinitely diverse/weird and so when they say stuff in honesty, I have absolutely no base assumptions to work on top of. https://t.co/Nfls4dzaKj\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n\n===\n\n1319274431412269058 [2020-10-22] @natural_hazard 💜 2\n🧵 collecting various people's thoughts on coercion/non-coercion so that when ever I go to think about this, i can more easily respond to stances people actually hold\n↓\n1319274597489885191 [2020-10-22] @natural_hazard 💜 1\nalso leads to a tweet of monk saying optimal amount of coercion is not zero\nhttps://t.co/jMmvRCGgSV\n  [Quoting @mechanical_monk: ah, i think there are two things that you can imagine when people talk about non-self-coercion  1) \"only do things that are fun for you; find a way to make everything fun\" 2) \"hype/support/etc yourself into doing things that are not fun, instead of shaming yourself into them\" https://t.co/awyX7V6Cua]\n↓\n1319277358193360900 [2020-10-22] @natural_hazard 💜 2 [(SEED) type=quote_of_root]\nplay by play of @nosilverv working with @AskYatharth \nhttps://t.co/96wdBcU8fz\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1319609990269833216 [2020-10-23] @natural_hazard 💜 1\nfrom @xuenay in why coercion begets unhappiness (inspired by @Morphenius )\n\nscrolltotop for start of thread\n\nhttps://t.co/nVtsqKb5YL\n  [Quoting Tweet 1317048626225553408 (missing)]\n↓\n1320104029112963072 [2020-10-24] @natural_hazard 💜 1\nMatt always has good stuff. Often looks at the nitty gritty mental moves in our processes\n\nhttps://t.co/oAtiIuwtPQ\n  [Quoting @mattgoldenberg: 1/Let's talk a little bit about oscillating motivation, shadow values, non-coercion, and the problem of revolving productivity systems.  🧵.]\n\n===\n\n1329652200390463490 [2020-11-20] @Malcolm_Ocean 💜 2\nCan't guarantee you'll have the same results as @AskYatharth in that thread from a month ago (link in next tweet) but our GCI coaches are definitely wizards who understand deep change not just trying to push yourself hard again and again.\n\nTix: https://t.co/7GE1gwLSpW https://t.co/H5R2FY15Ev\n  [Quoting @nosilverv: your boy will be coaching here, sign up -- wat? i know, it's crazy for me too... https://t.co/WIVWk9TkV6]\n↓\n1329652201900421120 [2020-11-20] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\nAforementioned thread. This is cool stuff:\nhttps://t.co/wAq0YL7wYb\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1329664918514184192 [2020-11-20] @AskYatharth 💜 2\n@Malcolm_Ocean what a double-plug\n\nwin-win only\n↓\n1329671606222934016 [2020-11-20] @Malcolm_Ocean 💜 1\n@AskYatharth The only losers are people who don't like win-wins.\n\nhttps://t.co/J8RR10vnRm\n  [Quoting @Malcolm_Ocean: There is a war between the ones who say there is a war and the ones who say there isn't https://t.co/eFbjSrPMtT]\n\n===\n\n1339479057390469123 [2020-12-17] @Malcolm_Ocean 💜 11 🔁 2\nIn this thread, Malcolm is gonna hype up the many coaches we've got coaching at our Goal-Crafting Intensives next weekend &amp; in January. If you come to the event, you get a channel with 6-12 coaches in it answering your Qs in parallel.\n\nLet's go! 🔥🤩\nhttps://t.co/NfSoPS0ImD\n\n===\n\n1339479059156271104 [2020-12-17] @Malcolm_Ocean 💜 2\nBenjamin is cofounder of GCI - he &amp; I made the innovative many-coaches-via-chat format, 4y ago. He's also played a major role re workshop content, plus invented some exercises like Somatic Task-relevant Processing... this year he's bringing a new thing called Dharma Generator!\n↓\n1339479059965726724 [2020-12-17] @Malcolm_Ocean 💜 2\nMary Bajorek has got a knack for helping people figure out what's most important and facing fears &amp; shames in order to realize their vision. She's designed personal retreats for herself &amp; others, to really go deep into introspection &amp; self-discovery. https://t.co/GoLS9LnUig\n↓\n1339479060963966976 [2020-12-17] @Malcolm_Ocean 💜 4\n@SarahAMcManus has a background in systems ecology &amp; psychedelic facilitation with ayahuasca, and now brings that same cosmic groundedness to helping people develop resilience through emotional integration techniques.\n\nLoves to find new metaphors that empower new possibilities.\n↓\n1339479061781868549 [2020-12-17] @Malcolm_Ocean 💜 3\nAnd me of course! I tend to be drawn to helping encourage people to take the leap into working on a lifestyle business or some other self-directed project, or designing some system to help what's most important naturally stay in focus, without effort. \nhttps://t.co/YlBQlQ2tNB\n  [Quoting @Malcolm_Ocean: Coaching people at our Goal-Crafting Intensive workshop right now and man humanity is beautiful. I love all of these conversations about people's aspirations and challenges.]\n↓\n1339479062826295297 [2020-12-17] @Malcolm_Ocean 💜 5\n@mattgoldenberg is someone I really look up to in terms of how much deep research he's done into dozens of transformational change techniques. He recently synthesized a bunch of those into his own course framed around procrastination, &amp; has been a regular GCI coach for years.\n↓\n1339479064025780224 [2020-12-17] @Malcolm_Ocean 💜 3\nMike Plotz (@hyponymous) is a software engineer. Not all of our coaches are \"Coaches\"! I met him through the rationality community though he's gone post-rat since. A great person to talk to about meditation or for career advice.\nhttps://t.co/1dSH5Crrn4\n  [Quoting Tweet 1211441076491321344 (missing)]\n↓\n1339479065074360320 [2020-12-17] @Malcolm_Ocean 💜 4\n@chriswaterguy was one of our original coaches back in 2017, and he's coached every year since. He's a real pro at areas like procrastination, perfections, &amp; ADHD, and teaches concrete productivity techniques like no-willpower planning, timeboxing, &amp; project breakdowns.\n↓\n1339479065900675072 [2020-12-17] @Malcolm_Ocean 💜 3\n@utotranslucence is a close friend of mine who used to run a circus company, has worked in crypto, and is now building @marginaliaclub for social ebooks.\n\nHard to summarize her. She's real. She's there. She takes things seriously. She considers things deeply.\n↓\n1339479066697637889 [2020-12-17] @Malcolm_Ocean 💜 3\nZoe @CurziRose has a background in theatre and other psychotechnologies, and does a range of mind &amp; body techniques such as embodied introspection into action-generating beliefs &amp; internal dialoguing. Has a gentle yet active style.\n↓\n1339479067624521729 [2020-12-17] @Malcolm_Ocean 💜 8 💬 1\nNew this year is @DRMacIver, someone whose writing I've respected for a few years. He doesn't have one big theory afaict, just consistently shares original takes on a variety of topics that are one solid notch better than most other takes out there. eg\nhttps://t.co/loeXoEnbER\n  [Quoting @DRMacIver: When we have a giant backlog of tasks it's tempting to think we have to get on top of the backlog. This makes all the individual tasks seem too large to deal with. One way out of this is to explicitly decouple those tasks so they seem their true size.  https://t.co/gV2F3MeGXU]\n↓\n1339479068706684928 [2020-12-17] @Malcolm_Ocean 💜 3 [(SEED) type=quote_of_root]\n@nosilverv needs no intro - he's infamous around here for his classy &amp; sincere shitpoasting. What inspired me to reach out to him this year re coaching at GCI was this epic thread of him coaching @AskYatharth over twitter DM. Exactly the skillset we need.\nhttps://t.co/wAq0YLp7PJ\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1339479069713317888 [2020-12-17] @Malcolm_Ocean 💜 5\nWhile we were at it, we got @AskYatharth to coach too! He's got some advanced takes in the non-coercion space and very much shows up as an active learner in all domains, &amp; tries to make all spaces he's in more learning-oriented.\n\nLike me, he's got fear of *everyone* missing out.\n↓\n1339479070552125447 [2020-12-17] @Malcolm_Ocean 💜 4\nOkay, couldn't resist—another twitter fren. Sarah said \"let's reach out to @harveykrishna_\", who is full of playful, serious poetry and is very much a switch as far as coaching goes.\n\n(Honestly most of our coaches are—we don't take the role too seriously!)\nhttps://t.co/kQe3HgQ5Bn\n  [Quoting Tweet 1320381282300428288 (missing)]\n↓\n1339479071915294720 [2020-12-17] @Malcolm_Ocean 💜 2\nRelatedly, we have coaches who started as participants then Community of Practice hosts: Alisa Kuznetsova, Laura Green, @olimay. Most of them now have a better handle on the workshop content than I do even though I wrote it, because they've used it many times &amp; more recently!\n↓\n1339479072762519555 [2020-12-17] @Malcolm_Ocean 💜 4\nWoo! This was fun to write. I love getting the chance to collaborate with these friends &amp; mutuals.\n\nIt's a humbling thrill being in 40 coaching channels and encountering so much wisdom—from the coaches &amp; from the participants' introspection 🤯\n\nWant in? 👇\nhttps://t.co/CsjRo00CZ3\n\n===\n\n1339642903610728450 [2020-12-17] @nosilverv 💜 31 🔁 5\nin honor of v-@krzhang and @visakanv's requests:  100-tweet @threadapalooza of things that get me going IN DIFFERENT VOICES - i think voices would be unclear and hard to tell apart so ill just share one NOT my usual/default perspective on the thing that gets me going 1/100\n\n===\n\n1339646230935318530 [2020-12-17] @nosilverv 💜 8\nGEB. This is like the best thing in teh sequences looool - hofstadter's mind is like a wormhole between fields and it perfectly instantiates in you the fake memory of being his mind\n↓\n1339646232600473600 [2020-12-17] @nosilverv 💜 2\nPopulism. Sorry but true. Dovetails with the good above. Just want the best for all.\n↓\n1339646234185883650 [2020-12-17] @nosilverv 💜 4\nThinking about adversariality. There's portions of the world that are deliberately kept hidden and you can only think your way into them. I find this very fun.\n↓\n1339646235960090632 [2020-12-17] @nosilverv 💜 3\n@owenbroadcast's threads. Just go read them loool\n↓\n1339646237692354560 [2020-12-17] @nosilverv 💜 2\nAs per the above: making sense of '''trivial''' things. E.g.: \nhttps://t.co/NNpRvu0BHV\n  [Quoting @nosilverv: read this thread. https://t.co/zWU5hE66Vm]\n↓\n1339646239659487233 [2020-12-17] @nosilverv 💜 3\nLong threads. They push the right buttons. See the one we shall not talk about\n↓\n1339646241530114049 [2020-12-17] @nosilverv 💜 3\nmaking sense of a thing as another thing, more generally, tho loathe the word: 'sense-making'\n\nhttps://t.co/zOBujDpGzW\n  [Quoting @nosilverv: Twitter is like Wittgenstein’s conception of philosophy: just as the latter is a cure to existential problems the former should be a temporary asylum from there. Not supposed to stay for too long. That financial incentives are such to maximize your engagement is...  fucked up]\n↓\n1339646243446927361 [2020-12-17] @nosilverv 💜 3\nArcheology\n\nhttps://t.co/b6HFncxmem\n  [Quoting @nosilverv: ok, so ignore the fucking CULtUre wAR intro but -- I've cried repeatedly watching this video it never fails. I don't know why. I just feel so touched by it. I've seen some of these pieces and been in some of this places. Why does it make me cry  https://t.co/zONdPvfLxg]\n↓\n1339646245242081283 [2020-12-17] @nosilverv 💜 4\nIt really really gets me going\n\nhttps://t.co/knUwDh8B5M\n  [Quoting @nosilverv: Roman theater of Lisbon. Built 2000 years ago. This shit makes me wanna cry. Not sure why https://t.co/fGNoO2IlJk]\n↓\n1339646247125327872 [2020-12-17] @nosilverv 💜 4\nLike, REALLY\n\nhttps://t.co/QN7FcNSS8t\n  [Quoting @nosilverv: I get incredibly moved by archeology. Always have, never knew why. I cried seeing an arch in Sicily, and cried seeing the Rosetta stone. The other day Indiana Jones and the Last Crusade was playing. Welp I now know where a defining part of my personality comes from.]\n↓\n1339646249218269184 [2020-12-17] @nosilverv 💜 4 [(SEED) type=quote_of_root]\nHelping others and being COMPETENT while doing it\n\nhttps://t.co/rUv9XYbrhD\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1339646251411890177 [2020-12-17] @nosilverv 💜 2\nCuba.\n↓\n1339646253249032195 [2020-12-17] @nosilverv 💜 7\nTo expand on the above: spiritually rich, materially poor. Incredible place overall, like transitioning to a different place, outside of neoliberal reality\n↓\n1339646254993846273 [2020-12-17] @nosilverv 💜 5\nAlex Jones. His mind works different, he's occupying a very special place in the world. He is fiery and coleric. gets me GOING\n\nhttps://t.co/ZCFWVuL9wz\n  [Quoting @nosilverv: I’m now an Alex Jones apologist. An Alex Jones truther. Huge huge bearish sign on Big Tech. Sell sell sell https://t.co/xqwjmeDJgN]\n↓\n1339646257036480513 [2020-12-17] @nosilverv 💜 6\nKanye, obviously. 'Going full Kanye' is a real referent. To this: \nhttps://t.co/jBdIvwj3Fa\n\nhttps://t.co/uax4mFkQ1J\n↓\n1339646258961666050 [2020-12-17] @nosilverv 💜 4\nNew balance shoes. Looooool i'm sorry for my materialism but shit is like WALKING ON CLOUDS\n↓\n1339646260572270595 [2020-12-17] @nosilverv 💜 3\nProject management: i LOVE setting things up so that one ends when the next one should begin. I timed a nap today so that when i woke up the relevant person would've responded and i could just keep working. Yes, im the perfect american portuguese culture chimera\n↓\n1339646262543577094 [2020-12-17] @nosilverv 💜 3\nAt the risk of being 'the 30 year old traveleeerr': travelling. Actually genuinely earnestly good, low cost companies are based, this is just straightforwardly good.\n↓\n1339646264443609088 [2020-12-17] @nosilverv 💜 3\nOpportunism, as per - https://t.co/6uVIYt5ix1 - I hate doing and i LOVE impact. This squares taht circle for me.\n↓\n1339646266737893378 [2020-12-17] @nosilverv 💜 4\nPhenomenology: allows you to find what is truer than true in experience, the enduring patterns that each situation is only an instance of \n\nhttps://t.co/3poV7IVKzx\n  [Quoting @nosilverv: HEAVEN AND HELL ARE PHENOMENOLOGICAL SPACES; MYTHOLOGY IS ABOUT PHENOMENOLOGY; SUFFICIENTLY ADVANCED PHENOMENOLOGICAL SCIENCE WILL BE ABLE TO TOPOLOGICALLY MAP THESE PLACES HOLY SHIT - BOTTOMLESS PIT AND HIGHEST GROUND]\n↓\n1339646268658905089 [2020-12-17] @nosilverv 💜 5\n@0x49fa98 - his threads are magnificient.\n\n===\n\n1421022841017880578 [2021-07-30] @AskYatharth 💜 4\nMeditation doesn’t work (letting go of thought) if you don’t on some level WANT to let go of thought, aren’t bought in.\n↓\n1421022842636865540 [2021-07-30] @AskYatharth 💜 1\nI don’t mean having resistances or doubts.\n\nIt mean on some high level have your system give curiosity and assent to the exploration of this.\n\nhttps://t.co/bch2sBVjGg\n  [Quoting @AskYatharth: @ChanaMessinger I really, really think if you think coercion is “needed” then you’re taking coercion to means something it doesn’t have to.  Coercion ≠ discomfort  You don’t have to resolve all your objections, or feel 100% happy or playful or whatever.  https://t.co/AIGP9YUz6H]\n↓\n1421023351670247424 [2021-07-30] @AskYatharth 💜 1\nOtherwise it becomes drama. You’re setting yourself up to do something there is no high-level consent to do. You’re there because you’re super-ego is telling you to be don’t.\n\nhttps://t.co/Wn43PhZO8Y\n  [Quoting @AskYatharth: developing a strong sense of ego in this way helps cut drama  drama is the plea to have an authority see you are getting it right  https://t.co/sJR9Q3vKGX]\n↓\n1421024339219124224 [2021-07-30] @AskYatharth 💜 3\nHaving a relationship to something with your super-ego is like being in an unhappy relationship.\n\nFrom the perspective of a single person, it looks like they’re better off.\n\nBut in reality, the unhappy couple is 2 steps away from being a happy couple. https://t.co/94EqenWtLi\nImages:\n  - [Image #0] The image is a humorous cartoon that illustrates the concept of being in a relationship with one's super-ego. The cartoon features a stick figure standing on the bottom step of a staircase, labeled \"Figured It All Out Staircase.\" The stick figure is accompanied by the text \"Me\" and an arrow pointing to it.\n    \n    As the stick figure ascends the staircase, it eventually reaches the top, where it is joined by another stick figure, forming a couple. The couple is depicted with a heart above them, symbolizing their romantic relationship. The text \"Couples\" is written above the couple, with an arrow pointing to them.\n    \n    The cartoon suggests that when an individual is in a state of self-reflection and self-awareness (represented by being alone on the lower steps), they may appear to be better off than those in a romantic relationship. However, the cartoon implies that this is not necessarily the case, as the couple at the top of the staircase has reached a higher level of understanding and happiness.\n    \n    The image is attributed to waitbutwhy.com, as indicated by the text in the bottom-right corner. Overall, the cartoon provides a lighthearted and relatable representation of the complexities of relationships and personal growth.\n↓\n1421025490320732161 [2021-07-30] @AskYatharth 💜 1\nThey have to disentangle and go through the pain of a break-up first. A super-ego relationship with meditation can be beneficial, I will never look down upon it, because any engagement with the dharma sows the seeds of eventual liberation.\n↓\n1421025492799524866 [2021-07-30] @AskYatharth 💜 4\nBut it can be freeing to walk away and realise you were the unhappy couple in the bottom pic and step away and up.\n↓\n1421025494380732416 [2021-07-30] @AskYatharth 💜 2 [(SEED) type=quote_of_root]\nWhen I psychoanalysed with my gym relationship, it was such an unhappy one based on “IF I DON’T DO THIS I WILL DIE” that I let go of it.\n\nI wanted to skip to the step where I go to the them, but I didn’t get to.\n\nhttps://t.co/TnrwODeEaJ\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1421025791089860610 [2021-07-30] @AskYatharth 💜 2\nI got to move the single stage where I don’t have a relationship with the gym but at least don’t have an unhappy one.\n\nOne year later, and now I’m spontaneously finding myself going again.\n\nhttps://t.co/kcjerX159d\n  [Quoting @AskYatharth: Rule for going to the gym:  Don’t optimise anything till you’ve done it 5 times. https://t.co/BsyRrJNrC8]\n↓\n1421026736217595905 [2021-07-30] @AskYatharth \nMy meditations are the most disgusting, undisciplined things ever.\n\nBut I am doing them.\n\n===\n\n1439067975370227723 [2021-09-18] @visakanv 💜 658 🔁 104 💬 5\nThank you Mario! But the root of our problem is in another castle!\n\n===\n\n1454792382218584064 [2021-10-31] @visakanv 💜 7\n(some) misogyny https://t.co/iUwCGT0gYg\n  [Quoting @visakanv: watching the Hunchback of Notre Dame (1996) and there’s this whole song - Hellfire - where the vengeful villain gets angry about being horny and wants to kill the girl for tempting him to go to hell https://t.co/iJnO9An232]\n↓\n1455445316073713667 [2021-11-02] @visakanv 💜 6\nteenagers and technology https://t.co/3RxyuWdlG7\n  [Quoting @visakanv: So my question I guess is: if teenagers are self-harming with technology- and I’m willing to consider that it’s a possibility- why? What are the underlying issues there? My guesses from conversations with dozens of kids: lack of autonomy, sense of control, desire for connection]\n↓\n1468305606297538561 [2021-12-07] @visakanv 💜 20 🔁 1\nyou cannot solve your imposter syndrome inside your own head, you can only solve it by getting inside other people's heads\nhttps://t.co/Etgnn2FiZU\n  [Quoting @visakanv: no amount of private introspection can help you with a lack of knowledge of the interiority of other people]\n↓\n1490585337294319618 [2022-02-07] @visakanv 💜 9\ncardiac issues https://t.co/nuoThqUXYG\n  [Quoting Tweet 1490403263983796226 (missing)]\n↓\n1490798239389724673 [2022-02-07] @visakanv 💜 16\namy knows https://t.co/hNJBmvaxVd\n  [Quoting Tweet 1072576388518043656 (missing)]\n↓\n1518872877348831232 [2022-04-26] @visakanv 💜 13 🔁 1\n23. \"figuring out what to do with your life\"\n\nhttps://t.co/POTEujYeXf\n  [Quoting @visakanv: the question is fundamentally broken, misframed, designed (intentionally or otherwise) to perpetuate error and failure and despair. \"what to do with my life\" is not a question to be answered. it's a bug https://t.co/8JFDnSnsFX]\n↓\n1583099912484372480 [2022-10-20] @visakanv 💜 10 🔁 1\n24. blackout blinds https://t.co/3cJ2oPmyHc\n  [Quoting @visakanv: most advice is tactical but most persistent problems are deep-conceptual, deep-relational  blackout blinds and eye masks etc won't help you very much with your bad sleep if your real issue is that deep down in your heart of hearts you feel like you don't deserve to rest]\n↓\n1587728090444070912 [2022-11-02] @visakanv 💜 51 🔁 5 💬 1\n25. https://t.co/vbxqQVuZnz https://t.co/rtZJVyfrZC\n  [Quoting Tweet 1587726492955734016 (missing)]\nImages:\n  - [Image #0] The image is a screenshot of a webpage titled \"The XY Problem\" and contains a detailed explanation of the issue, its causes, and potential solutions.\n    \n    The webpage is divided into three main sections: \"What is it?\", \"What to do about it?\", and a concluding statement. The first section defines the XY problem as a situation where someone asks for help with their attempted solution (Y) rather than their actual problem (X). It lists several bullet points that illustrate how this problem arises, including:\n    \n    * The user wants to do X but doesn't know how.\n    * The user thinks they can solve X if they can just manage to do Y.\n    * Others try to help with Y, but are confused because Y seems like a strange problem.\n    * After much interaction and wasted time, it becomes clear that the user really wants help with X, and that Y wasn't even a suitable solution for X.\n    \n    The second section provides guidance on how to address the XY problem. It suggests that users should:\n    \n    1. Always include information about the broader picture along with any attempted solution.\n    2. If someone asks for more information, provide details.\n    3. If there are other solutions already ruled out, share why they were ruled out.\n    \n    The concluding statement reminds readers that if their diagnostic theories were accurate, they wouldn't be asking for help.\n    \n    Overall, the webpage aims to educate users on how to effectively ask for help by providing context and avoiding the XY problem.\n↓\n1602709346512957442 [2022-12-13] @visakanv 💜 20\n26. https://t.co/6GNWB8mSFm\n  [Quoting @DRMacIver: A lot of visible problems that you can't seem to solve are secretly solutions you don't want to admit to adopting to problems you don't want to admit to having.]\n↓\n1643322239054680064 [2023-04-04] @visakanv 💜 33 🔁 2\n27. a lot of people pick up cigarettes and alcohol to cope with loneliness, alienation, etc – and as long as *that* doesn’t get addressed, attempts to solve the problem will seem to fail for mysterious reasons https://t.co/xBvBVEA9Le\n  [Quoting Tweet 1643229784703660034 (missing)]\n↓\n1759821929379209311 [2024-02-20] @visakanv 💜 13 🔁 2 [(SEED) type=quote_of_root]\n28. EXCELLENT thread, ive encountered the same pattern in so many people’s entrenched/knotted problems https://t.co/n6A5R7ZDc5\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1814340467548692657 [2024-07-19] @visakanv 💜 3\n29. solving allergies https://t.co/UT4Y6m61fr\n  [Quoting @DefenderOfBasic: one way I'd love to see our society being more functional:  I go to the allergy specialist, and instead of him saying \"yup you're allergic, here's a series of 24 shots for the next few years\"  he would just say, \"have you tried buying a roomba\" (this is what solved my problem)]\n↓\n1846354973174423877 [2024-10-16] @visakanv 💜 13 🔁 1\n30. migraines\n↓\n1948058673588084920 [2025-07-23] @visakanv 💜 9 🔁 1\n31.\n\n===\n\n1452298399663919104 [2021-10-24] @AskYatharth 💜 26 🔁 1\nBefore I started going to the gym, I think I had this idea as nerd me that life should never actually feel that hard or uncomfortable. And if it was, something was wrong.\n\nIt’s . . . a hard idea to explain. But I’ll try. https://t.co/sEtOepPlhN\n  [Quoting @AskYatharth: It’s like there are two versions of me alive. The scared, intertia, self-blaming, time-wasting version of me, that no amount of introspection can ever fix.  And the proud, calm, just doing, working seamlessly version of me, that just does things. https://t.co/PtkVMycj9W]\n↓\n1452298402591617032 [2021-10-24] @AskYatharth 💜 6\nI would still:\n\n- go all the way to outdo myself on a hike in immense physical discomfort\n- go the the gym for a month with meticulous records and optimise my experience\n↓\n1452298403761770507 [2021-10-24] @AskYatharth 💜 6\n“Putting myself outside my comfort zone” and “competition” and “sense of mastery” were all great motivators that would make great physical discomfort feel okay.\n↓\n1452298404822978572 [2021-10-24] @AskYatharth 💜 8\nWhat I mean more is this: \n\nIf I’m lying on bed, and I’m thirsty to get up for water on the across . . . part of me won’t be able to reconcile the discomfort of getting up with the complete desire to stay in bed.\n\n(This was the motivating example for the thread yesterday.) https://t.co/tU4xv4kIuX\n  [Quoting @AskYatharth: The first version is too scared to even get up and grab water  Not that it can’t. But it doesn’t know if it should. Or what’s going on  When I think of moments I did something that I felt proud, I automatically find myself getting up to nourish &amp; hydrate my body. Its so automatic]\n↓\n1452298406286741511 [2021-10-24] @AskYatharth 💜 15\nOr something like:\n\nIf I have to go the gym every day, it might be fun the first few days because it’s novel, but once it stops being fun, and if it’s not contributing to a sense of visual or linear recorded progress, it stops feeling very good, and I want to stop doing it.\n↓\n1452298407419199491 [2021-10-24] @AskYatharth 💜 12 [(SEED) type=quote_of_root]\nIt’s not just discomfort: it’s just my entire body shuts down. “I don’t wanna!” is the cry. It doesn’t know why it’s doing anything anymore. It don’t make sense. https://t.co/lMkhKrRCDm\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1452298408933445633 [2021-10-24] @AskYatharth 💜 9\nExtreme as it sounds, I have that *exact same reaction* to getting up from the bed to get my bottle.\n\n“I don’t wanna!” I don’t understand *why* it should be so hard to get up.\n↓\n1452298413530390529 [2021-10-24] @AskYatharth 💜 9\nMy Worrying mind is pounding on my gates like they are the entrance to Valhalla and my inner baby shuts down out of a sense of the shoulds just . . . making me forget what I want, and making me completely lose myself.\n↓\n1452306133734023169 [2021-10-24] @AskYatharth 💜 14\nIt’s like Bay Area rationalist/adjacent circles have this idea that outside of motivating things like novelty, mastery, and competition, life shouldn’t feel hard, and if it does, something is very very wrong; maybe I could fix it with introspection. https://t.co/VbXANgrBoI\n  [Quoting Tweet 1450175267909947395 (missing)]\n↓\n1452306135403409411 [2021-10-24] @AskYatharth 💜 14\nAnd to be clear, just lying on my bed, trying to pick up the waterbottle, not being sure if I should, feels 𝘦𝘹𝘵𝘳𝘦𝘮𝘦𝘭𝘺 bad.\n\nIt’s one of the worst things I can experience, worse than a lot of physical pain. My mind torments me more than anything else can. https://t.co/chQa90Almm\n  [Quoting @AskYatharth: Neurotic nerds are more internally wired. It allows for certain forms of brilliance, creativity—and it also means the biggest torment of nerds is their own heads. Normies might stress more about external situations; for nerds, the stress comes from internal expectation errors.]\n↓\n1452306141812232197 [2021-10-24] @AskYatharth 💜 10\n&gt; not being sure if I should\n\nI think this is really indicative of something.\n\nWhat’s going on when I’m lying down in the bed is two very, very fucking strong shoulds grinding against each other:\n\n1. I should go get the waterbottle, this is the sensible thing to do. https://t.co/g78m8sy6gw\nImages:\n  - [Image #0] The image depicts a close-up of interlocking gears with sparks flying around them, conveying a sense of intense mechanical activity.\n    \n    The image is a stock photo from Alamy, as indicated by the watermarks and the black bar at the bottom featuring the company's logo and website.\n↓\n1452306143766880260 [2021-10-24] @AskYatharth 💜 15\n2. I should not allow myself to do anything I don’t want to.\n\nIf I am doing that, I am somehow mortally wounding myself by making my “happiness” or “success at life” score drop. https://t.co/gdcCNdgrCH\n  [Quoting @AskYatharth: I think I used to have an implicit model of “accumulating suffering,” like the fact I was sad was actively dropping my happy score.  Realising time was fake really broke this for me.]\n↓\n1452306145188761609 [2021-10-24] @AskYatharth 💜 8\nBoth of these are incredibly high-stakes\n\n1. If I don’t get the bottle, I am somehow mortally wounding myself by not doing something I so obviously should\n\n2. If I do compromise on doing something I don’t want to, then . . . https://t.co/D2hEXGRgKo\n  [Quoting @AskYatharth: “Else I’m losing.”  For a long time it felt like every moment was some sort of race, and if it’s “positive,” then I’m accumulating/keeping with it, and if it’s negative, I’m failing. https://t.co/gdcCNdgrCH]\n↓\n1452306151660523525 [2021-10-24] @AskYatharth 💜 19\nEven just tolerating even the brief discomfort of getting out of my bed was enough to activate this huge mashup of grinding.\n\nThis is what I mean by everything in my life felt high-stakes. https://t.co/dzsvJWrdjv https://t.co/hScp5XRq0o\n  [Quoting @AskYatharth: You can try applying more force . . . it’s probably how you got through your life . . . but it doesn’t feel very fun, and leaves your gears cammed out / burned out.  It can take time to heal from that.  https://t.co/upn1B2tnLD https://t.co/SdeQpixhNy]\nImages:\n  - [Image #0] The image depicts a close-up of interlocking gears, with sparks flying around them. The gears are black and have jagged teeth, with the largest gear in the center and two smaller ones on either side. The sparks are orange and yellow, and they appear to be flying outward from the center of the image.\n    \n    *   The background is dark, which makes the sparks stand out.\n    *   There are watermarks throughout the image that say \"alamy\" and \"a\".\n    *   At the bottom of the image, there is a black bar with white text that reads \"alamy\" on the left side and \"Image ID: A1A622 www.alamy.com\" on the right side.\n    \n    The overall effect of the image is one of energy and movement, as if the gears are in motion and generating the sparks.\n↓\n1452306154801991684 [2021-10-24] @AskYatharth 💜 7\nIt does feel high-stakes when you’re trying to do (or think you have to do) an any% perfect speedrun\n↓\n1452306155959726085 [2021-10-24] @AskYatharth 💜 8 🔁 1\nI wonder if this is the same group of people that find everything so high-stakes that get neurotically inwired to Effective Altruism and AI Safety and such, that give them and meet them in that sense of high-stakeness. https://t.co/tzDoNm5Ees\n  [Quoting Tweet 1450209489555099652 (missing)]\n\n===\n\n1486398240643760133 [2022-01-26] @m_ashcroft 💜 212 🔁 5\nso I’m pretty sure I just succeeded in doing something close to what Sasha talks about here\n\nDeep Okayness is exactly the right term\n\nit’s like 90% of the inner conflict I had is kinda gone and I have stable/background access to equanimity, joy and security \n\nmight write about it https://t.co/zxLfFM74Mf\n  [Quoting Tweet 1482799699333550082 (missing)]\n↓\n1569059719804772355 [2022-09-11] @neats29  [(SEED) type=quote_of_semantic_search]\n@m_ashcroft hmmm I just realised that I may have been getting a taste of this too. I kind of talked about it here, finally being able to “feel” my emotions on demand. and not getting attached to them. I’m curious how it’ll be once I’m working again. https://t.co/lfER4K8k2U\n  [Quoting @neats29: people say the biggest lesson in all this inner work stuff is to “feel” the emotions when they arise &amp; they will shift. I understood this well but couldn’t do it regularly. recently I noticed I’ve been doing it properly for the past couple months &amp; it’s improved my mental health]\n\n===\n\n1522606780412350464 [2022-05-06] @SarahAMcManus 💜 7 [(SEED) type=semantic_search]\nPretty good advice for internal emotional untangling as well! https://t.co/GbZF9DGXWL\n  [Quoting Tweet 1522606448999604233 (missing)]\n\n===\n\n1522808916907802624 [2022-05-07] @the_wilderless 💜 12 [(SEED) type=semantic_search]\nPost hard-won experiences and ideas around transformative inner work: moderate positive response.\n\nPost bus stuck in trench: wake up to broken notifications.\n\n===\n\n1522809698965233672 [2022-05-07] @the_wilderless 💜 8 🔁 1 [(SEED) type=quote_of_semantic_search]\n“Y’see, it’s like the bus of your soul has gotten stuck in the trench of your thinking mind and old patterns! The aim of imaginal work is to pull it out with the crane of Passion and repair it with the mechanic of awareness”\n\nIs that more relatable? Did I do it? https://t.co/LzeRDy3Bjt\n  [Quoting @the_wilderless: Post hard-won experiences and ideas around transformative inner work: moderate positive response.  Post bus stuck in trench: wake up to broken notifications.]\n↓\n1522936101178159104 [2022-05-07] @profoundish 💜 1\n@the_wilderless Big youth pastor energy\n↓\n1522936904953565185 [2022-05-07] @the_wilderless 💜 1\n@profoundish Nailed it\n\n===\n\n1555208839376654337 [2022-08-04] @neats29 💜 14 🔁 1 [(SEED) type=semantic_search]\npeople say the biggest lesson in all this inner work stuff is to “feel” the emotions when they arise &amp; they will shift. I understood this well but couldn’t do it regularly. recently I noticed I’ve been doing it properly for the past couple months &amp; it’s improved my mental health\n↓\n1555208841180184576 [2022-08-04] @neats29 💜 6\nthe issue was that before, I would feel some negative emotion, and immediately I would catch myself looking for a distraction, I had enough introspection skills to know that I was distracting myself not to feel x BUT I couldn’t get myself out of it or if I did, it wouldn’t work.\n↓\n1555208842438475779 [2022-08-04] @neats29 💜 5\nbut I think through doing therapy or maybe having lots of free time or something else? I managed to get through some backlog of unfelt emotions so now I either catch it before the distraction or during and then I can sit and feel the emotion, and then i feel it shift in real-time\n↓\n1555208843537383430 [2022-08-04] @neats29 💜 8\nand this is the key, seeing over and over again how the feelings shift and change from one moment to the next, has been so powerful. before, I knew that emotions are transient and had experience a few times, but now I get it on a much deeper level.\n↓\n1555208844711714816 [2022-08-04] @neats29 💜 12\nthe only time when the emotion stays the same from one moment to the next, is when I start making up stories about it and solidify that emotion, when I don’t do that, it literally keeps changing from one moment to the next, until the quality of my awareness changes completely…\n↓\n1555208846636982273 [2022-08-04] @neats29 💜 5\nand I feel differently. then later if I want to bring back that emotion I can, usually it’s not as strong, but also I haven’t actually resolved the underlying issue, so it can come back. but that’s not the point…\n↓\n1555208847853338627 [2022-08-04] @neats29 💜 6\nthe point is that, by going through this process I’m not being reactive and spiralling into sadness, anger or something else, and changing the course of my day. I just get to feel some transient emotion move through me.\n↓\n1555208849010970632 [2022-08-04] @neats29 💜 6\nan imperfect analogy that comes to mind is a bit like attending to hunger. you eat and then you move on with your day, or you don’t eat and the rest of your day is now impacted by the hunger.\n↓\n1555208850361524224 [2022-08-04] @neats29 💜 7\nI feel like these two lessons, that a) emotions are transient and b) you just have to “feel” them and things will improve, is one of those lessons in life that you have to learn and relearn a bunch of times and everyone has to viscerally learn it for themselves.\n↓\n1555208851766607878 [2022-08-04] @neats29 💜 4\nit’s so obvious and simple, yet it goes against the way most of us were raised.\n↓\n1610406130831736834 [2023-01-03] @neats29 💜 1\njust heard Sam Harris describe it this way: “the moment you become willing to feel them (native emotions)… they cease to be what they were a moment ago, and they cease to map back on to you in your self concept as meaningful in the same way… It’s just sensation.”\n\n===\n\n1568260012778086408 [2022-09-09] @neats29 💜 9\nidk what to blame/credit this to but recently when something/someone makes me feel uncomfortable I fully feel it in my body, like this icky feeling in my stomach as if I’ve just eaten bad food. I kinda wish it wasn’t so visceral but at the same time I’m more likely to listen 🤷‍♀️\n↓\n1568261334453686279 [2022-09-09] @_brentbaum 💜 4\n@neats29 i find i can relax more into what’s happening the more i feel those feelings. less need for “do i like this? does this bother me?” check when I can trust a full-body yes or full-body no will arise\n\nthe somatic responses come more often when they know i’m listening too\n↓\n1568262348921774081 [2022-09-09] @neats29 💜 3 [(SEED) type=quote_of_semantic_search]\n@_brentbaum ah interesting, I wonder if it has something to do with this https://t.co/lfER4K8RSs\n  [Quoting @neats29: people say the biggest lesson in all this inner work stuff is to “feel” the emotions when they arise &amp; they will shift. I understood this well but couldn’t do it regularly. recently I noticed I’ve been doing it properly for the past couple months &amp; it’s improved my mental health]\n↓\n1568263242069204992 [2022-09-09] @_brentbaum 💜 3\n@neats29 I think ifs is a useful way of seeing here too: the Feeling part learns the Self will actually listen and starts expressing itself more. then the Self gets more useful data &amp; wants to listen to the Feeling part even more. positive feedback loop ♻️\n↓\n1568264631931510786 [2022-09-09] @neats29 \n@_brentbaum yeah I like this framing\n\n===\n\n1727481939668664431 [2023-11-23] @RomeoStevens76 💜 52 🔁 1 [(SEED) type=semantic_search]\nI think one of the nicest things on here is seeing people post things that I assumed were unpostable bc to me they are internally angry rants, but when posted about with curiosity and compassion wind up being fine.\n\n===\n\n1759797683223433576 [2024-02-20] @visakanv 💜 340 🔁 2\nusing yatharth's tweet as an example because i'm sure he won't mind– this is a pattern of question I get all the time in my DMs, where the actual question isn't in the question https://t.co/ErCOFHmUXJ\n  [Quoting @AskYatharth: i want more daylight hours but i just end up using them for being happy and chilling help]\n↓\n1759816714445787583 [2024-02-20] @AskYatharth 💜 15\n@visakanv so it was a semi jokey tweet but how would you parse through the tangle in that confusion if you had to\n↓\n1759819589234700337 [2024-02-20] @AskYatharth 💜 6 [(SEED) type=quote_of_root]\n@visakanv im reminded of this- one part in an inner conflict sloppily enlisting another person for help from its POV\n\nwhich ends up being sloppy because it's not actually the inner seat of sovereignty and acceptance even when it thinks it is https://t.co/lMkhKrSasU\n  [Quoting @nosilverv: So, sharing the following (with permission) because its so perfect its basically a VIGNETTE for how inner work goes when it goes perfectly. Straddle on:  First thing - a problem, in the form of a surprisingly intense emotional reaction https://t.co/4JCtj6Xas7]\n↓\n1759821205341896813 [2024-02-20] @visakanv 💜 6\n@AskYatharth also this is exactly my approach and honestly i think probably the only approach that really works \n\ny cry? y need help? whats going on? https://t.co/IP6JztJPc1\n  [Quoting @nosilverv: (This is a cue btw. Like, yea crying is good/fine but it's not THAT common to cry about working out - so something might be going on)  Also notice the conflict 'I cry BUT i feel good'  Notice the coercion 'make myself'  I side-step the coercion and ask about the emotion: y cry? https://t.co/ZNmpGQPkf5]\n├── 1759821733920690622 [2024-02-20] @AskYatharth 💜 2\n│   @visakanv i.e. following the charge (cc @jessicamalonso)\n└── 1759822570952478930 [2024-02-20] @visakanv 💜 2\n    @AskYatharth @Malcolm_Ocean @MichelleAkin you’ll love the above thread, very relevant to your interests\n\n===\n\n1793276627868111222 [2024-05-22] @nopranablem 💜 37 🔁 5\n“I have a month or two in between jobs and want to focus on inner/emotional work, what do I do?”\n\nA friend of mine asked me. What would you say?\n\nThey've previously done a 10 day Goenka Vipassana retreat, t-groups, and a weekend authentic relating workshop\n↓\n1793318461281571083 [2024-05-22] @abhayance 💜 2 [(SEED) type=semantic_search]\n@nopranablem inner/emotional work is best iterated in the space of interaction (with beloveds) https://t.co/I6urYNsdjh\n\n===\n\n1884220578501927326 [2025-01-28] @Kat__Woods 💜 70 🔁 1\nI’m sorry. I publicly did something I’m embarrassed about and I want to apologize and do my best to make sure it doesn’t happen again.\n\nI got really angry about a recent trend online and posted saying that if you believed this thing I considered dumb and unethical, I didn’t want to be friends with you anymore.\n\nI then proceeded to block people who were disagreeing with me in the comments.\n\nThis sort of behavior is the opposite of what I stand for and I think contributes to so much unnecessary suffering.\n\nThe moment I realized what I had done, I removed the post, to stop a continuation of the social media outrage cycle. I spent the rest of the day trying to understand the problem so I could better never do it again. I wrote up some of how to do that in a recent post (link in comments)\n\nI DMd and unblocked the people I feel like I was particularly rude to, and apologized, and I’m also publicly apologizing in general, because I want to be the change I wish to see in the world.\n\nI don’t want to live in a world where people stop being friends because we disagree.\n\nI think a lot of opinions are dumb and unethical.\n\nI'm sure I have a lot of beliefs that others consider dumb and unethical\n\nThe way to improve isn’t to get mad at people then threaten to withdraw your friendship.\n\nIt’s to try to come to mutual understanding and respect and discuss ideas civilly. It’s to persuade, not freak out. It’s to use ethical reasoning. It’s to defend ideas calmly and assume good intentions unless you have strong evidence to the contrary.\n\nI've also had my mind changed more times than I can count, discovering that things I thought were dumb and unethical were not in fact so. And I wouldn't have discovered that if I only talked to people who thought as I did.\n\nI'm sorry. I feel ashamed, because I broke my own moral code and caused unnecessary suffering to people I care about. And it's made all the worse because I have no mitigating circumstances. I just felt angry. It was my fault.\n\nI hope that my realizing what I'd done and quickly removing the ongoing source of hurt and then problem solving to make sure it won't happen again are enough to have people forgive me and trust that I've taken steps to fix things.\n\nI'm sure I'll mess up again, but hopefully in new and different ways, and I'll have friends who will be able to gently point it out, and I can grow and learn from it.\n\nSorry, guys. Even if I deeply disagree with you, that doesn't mean we can't get along.\n\nLove you all ❤️\n↓\n1884319440575373342 [2025-01-28] @leo_guinan  [(SEED) type=semantic_search]\n@Kat__Woods Would you mind DMing me the topic? I’m studying how these kinds of outrage cycles and just a few words about how it felt during and after would be super helpful. I had a similar issue a few years ago and I realized how much we get incentivized to react that way.\n\n===\n\n1885483050295058584 [2025-02-01] @franki3stone 💜 3 [(SEED) type=semantic_search]\nI dont often post things like this but in the benefit of learning about this pattern, or at least seeing it and developing ways to learn from/with it, im gunna share it.trigger - its full of emotional reactions🧵\n↓\n1885483911452774537 [2025-02-01] @franki3stone 💜 1\nWhat's happened here?How would you converse w someone when anger/power is involved?I really wanna learn here. https://t.co/sYzZpgyBoy\nImages:\n  - [Image #0] The image is a screenshot of a text conversation between two individuals, with a purple text bubble at the top and a longer, dark gray text bubble below it. The conversation appears to be about a room rental and a house meeting.\n    \n    Here is a transcription of the text in the image:\n    \n    **Purple Text Bubble:**\n    \"Apologies if it's put you guys out but as it's my room I think it's better if I sort it out.\"\n    \n    **Dark Gray Text Bubble:**\n    \"Again we need to have a conversation. We did say there were viewings yesterday but as it was my room I'm not sure why it matters?\n    \n    It's not your room Frankie. I am the leaseholder and it's on me if the space is unoccupied to cover rent etc. You already said you wanted to take the space so I'm not sure what happened but obviously it is a bit frustrating to now have to depend on scheduling around viewings the three of us can accommodate.\n    \n    Let's do the house meeting on Tuesday but let me know if you have anyone who comes in the meantime?\"\n    \n    The background of the image is black, and there are profile pictures visible at the bottom of the text bubbles, indicating that the conversation is taking place on a messaging platform.\n↓\n1887275467688059356 [2025-02-05] @lemonaut1 💜 2\n@franki3stone @DefenderOfBasic has a pair of goggles for this\n↓\n1887281786457370649 [2025-02-05] @franki3stone 💜 2\n@lemonaut1 @DefenderOfBasic So turns out this entire thing was birthed from assumption. Once I address the misunderstanding in assumption, the issue wasn’t there at all and all fear masking as perspective and power disappeared. ITS LIKE MAGIC 🪄\n↓\n1887285224389702041 [2025-02-05] @lemonaut1 💜 2\n@franki3stone @DefenderOfBasic Let’s be friends!\n↓\n1887302281114390898 [2025-02-06] @franki3stone 💜 1\n@lemonaut1 @DefenderOfBasic 🥹👉👈I’d like that\n\n===\n\n1909041591190269964 [2025-04-07] @heynibras 💜 86 🔁 5 💬 1 [(SEED) type=semantic_search]\ni realised there's a consistent process i use (for myself &amp; clients) when working with tough emotions\n\ninstead of writing a how to guide, i had claude create short stories where people use these techniques\n\nmy hope is you can read them &amp; absorb healthy emotional processing tools: https://t.co/oaMHK7DgAV\nImages:\n  - [Image #0] The image is a digital illustration of a text passage about anxiety, with a pale yellow background and black text. The passage is divided into four paragraphs.\n    \n    *   The first paragraph describes Jamie taking a slow breath to create space around his anxiety, glancing out the window at the wide-open sky.\n        *   Jamie took a slow breath, not to make the anxiety go away, but to create a little more space around it.\n        *   He glanced out the window at the wide-open sky.\n        *   His anxiety was just one small part of this moment—not the whole story.\n    *   The second paragraph describes Jamie standing up as Ms. Rodriguez called his name, and feeling okay with the anxiety that came with him to the front of the class.\n        *   As Ms. Rodriguez called his name, Jamie stood up.\n        *   The anxiety came with him to the front of the class—and that was okay.\n        *   It wasn't an enemy to defeat or a problem to solve.\n        *   It was just part of being human sometimes.\n    *   The third paragraph describes Jamie walking to the podium, feeling a flash of warmth toward himself and everyone else in the room, and thinking that they all feel this way sometimes.\n        *   Walking to the podium, Jamie felt a flash of warmth toward himself and everyone else in the room.\n        *   We all feel this way sometimes, he thought.\n        *   May we all be okay with whatever we're feeling.\n    *   The fourth paragraph describes Jamie's anxiety not disappearing as he began speaking, but no longer controlling him.\n        *   The anxiety didn't disappear as he began speaking, but it no longer controlled him.\n        *   It was just along for the ride.\n    \n    The passage conveys a message of acceptance and self-compassion, encouraging readers to acknowledge and accept their anxiety rather than trying to eliminate it.\n  - [Image #1] The image displays a passage of text on a beige background, with a black border around the edges. The text is in black font and appears to be a continuation of a story about a person named Jamie who is experiencing anxiety.\n    \n    The passage is divided into six paragraphs, each describing Jamie's thoughts and feelings as he tries to manage his anxiety. The text is written in a narrative style, with the author using descriptive language to convey Jamie's emotions and physical sensations.\n    \n    To reproduce the image, one would need to create a digital document or graphic with a beige background and black text, using a font that matches the one used in the original image. The text would need to be arranged in the same six-paragraph structure, with the same content and formatting as the original.\n    \n    Here is the text from the image:\n    \n    \"Jamie stared at the clock: ten minutes until his turn to present. His stomach knotted and his hands trembled slightly as he sat in the back of the classroom.\n    \n    There it is again, he thought, recognising the familiar feeling of anxiety. Instead of trying to ignore it or wish it away, he decided to try something different this time.\n    \n    First, he just noticed what was happening in his body. My heart's beating really fast. My shoulders are tight. My breathing is shallow. He didn't try to change these sensations-just observed them with curiosity, like a scientist studying something interesting.\n    \n    \"It's okay that you're here,\" he silently told the anxiety. Usually, he'd get frustrated with himself for feeling this way, but today he was trying to be a friend to his feelings rather than fighting them.\n    \n    As his mind raced with thoughts like \"I'm going to mess up\" and \"Everyone will laugh,\" Jamie didn't push these thoughts away. Instead, he noticed them passing through his mind like clouds in the sky. There's a worried thought. There's another one. Just thoughts, not facts.\n    \n    He placed one hand on his chest, feeling his heartbeat. My toes aren't anxious, he realized. My knees aren't anxious either. The anxiety wasn't everywhere-just in certain places.\n    \n    Jamie took a slow breath, not to make the anxiety\"\n    \n    This text describes Jamie's experience of anxiety and his attempts to manage it by observing his physical sensations and thoughts, and practicing self-compassion.\n↓\n1909163976535003618 [2025-04-07] @_brentbaum \n@heynibras woh there's something very very good here. I want to try this format\n\n===\n\n1909324468834738197 [2025-04-07] @tasshinfogleman 💜 12 🔁 1 [(SEED) type=quote_of_semantic_search]\ni think U want to read these loving, psychoactive, very short stories https://t.co/VTCwqYsnCL\n  [Quoting @heynibras: i realised there's a consistent process i use (for myself &amp; clients) when working with tough emotions  instead of writing a how to guide, i had claude create short stories where people use these techniques  my hope is you can read them &amp; absorb healthy emotional processing tools: https://t.co/oaMHK7DgAV]\n\n===\n\n1909381493694116042 [2025-04-07] @heynibras 💜 4 [(SEED) type=semantic_search]\na short story to show the process of working with physical (and emotional) pain in the quoted tweet. part 1 below, p2 in reply\n\ncontinuing the experiment of illustrating emotional processing and inner work via stories to make it easier to see the techniques in action https://t.co/McsXxJOetw\n\n===\n\n1916863469900513286 [2025-04-28] @heynibras 💜 63 🔁 2\nso is the key to skilful conflict:\n\n1/ a sense of love &amp; care for the other, 2/ balanced with a calm feeling of “i refuse to be fucked with” and 3/ the ability to remain genuinely non-reactive (non-triggered) throughout the conflict?\n\nif so, 3 is where it gets expert lvl hard\n↓\n1916977884779983129 [2025-04-28] @justavagrant_  [(SEED) type=semantic_search]\n@heynibras IME emotional work bottoms out at unwinding triggers, so that a thing that used to trigger stops triggering https://t.co/WKyJOu1m22\n  [Quoting @justavagrant_: the most hurtful things she says to me are variations on \"wish i didn't have you as a son\"  i'm proud of how i responded when that came today - i havent felt the volcano in a while, i held myself, i felt my pain/sadness, i stayed present with me and her https://t.co/wA9rlJQb0C]\n\n===\n\n1923132133138211175 [2025-05-15] @ChrisChipMonk 💜 64 🔁 2\ni love helping people become securely attached. it's one of the most fun things for me right now\n↓\n1923137755896226299 [2025-05-15] @marcusquest 💜 1\n@ChrisChipMonk ur teachings have given me so much confidence that i can achieve this one day\n\nstudied all ur blog posts intensely. ik what to do. just need to dedicate time to doing it\n├── 1923137820773777818 [2025-05-15] @marcusquest \n│   @ChrisChipMonk also, thank you\n│   ↓\n│   1923138099745267726 [2025-05-15] @ChrisChipMonk 💜 1 [(SEED) type=semantic_search]\n│   @marcusquest even i think that's a little fast https://t.co/28GpjXUHUZ\n│     [Quoting @ChrisChipMonk: my heart goes out to everyone doing inner work who doesn't understand this idea https://t.co/3zGKPRmwxS]\n│   ↓\n│   1923138857375088666 [2025-05-15] @marcusquest \n│   @ChrisChipMonk by \"one day\" i didnt mean \"in one day\". more like \"eventually\"\n│   \n│   but in general, i do need to be careful about setting strict, fast expectations on my growth. seems to only make things worse\n│   ↓\n│   1923139285617693153 [2025-05-15] @ChrisChipMonk 💜 1\n│   @marcusquest ohh i misread- yes exactly great!\n└── 1923137953594822774 [2025-05-15] @ChrisChipMonk  [(SEED) type=semantic_search]\n    @marcusquest even i think that's a little fast https://t.co/28GpjXUHUZ\n      [Quoting @ChrisChipMonk: my heart goes out to everyone doing inner work who doesn't understand this idea https://t.co/3zGKPRmwxS]\n\n===\n\n1942055218465636429 [2025-07-07] @patriciamou_ 💜 126 🔁 10 💬 1 [(SEED) type=semantic_search]\na powerful indicator of where you are on the journey to wholeness is how intensely you're triggered or disturbed by others. the more triggered, the more work you have  \n\nhere are good qs to work with when you get triggered: \n1) what are they doing that's unacceptable in my eyes? 2) what do they get to do that I don't allow myself to do? what quality allows them to do that?  \n3) how have those qualities been dangerous for me to fully inhabit and express? what's the risk to me? \n4) why do i need that capacity now? what's the risk if I don't step into those characteristics my shadow is holding?  \n5) what facet of wholeness do i need to reincorporate this characteristic into my being?  \n\n additional tip: assume all projections being levied at you are somewhat true. try it on. what's true about it? how are you exactly like that?\n↓\n1942324418308628900 [2025-07-07] @TVachaW 💜 2\nI agree with the idea that getting reflexively triggered by things is a pointer towards opportunity for growth.\n\nNot sure about these questions though.\n\nI imagine for many people the answer to 1 will often be that it is unethical / harmful etc.. The following questions then almost hint that’s something we should want to embody.\n\n===\n\n1950030755293516126 [2025-07-29] @ChrisChipMonk 💜 110 🔁 1\nHave you “coached yourself” into secure self-worth *without* coaching or therapy (or psychedelics)? \nI'm pretty sure this isn't possible for the vast majority but would be curious to hear exceptions\n↓\n1950125848381546886 [2025-07-29] @jakozloski 💜 2\n@ChrisChipMonk I’ve done it for a few specific things now with a single GPT prompt I found on here a while ago\n↓\n1950220729984962947 [2025-07-29] @ChrisChipMonk \n@jakozloski Ooooh could you share more? (dm?)\n↓\n1950492897221968225 [2025-07-30] @jakozloski  [(SEED) type=semantic_search]\nI forget who posted the prompt originally to give them credit (might have been you?) but I set a recurring reminder in my phone to do this prompt every two weeks:\n\nI tend to think I understand my own unresolved “inner work” (“I contract here because I’m afraid of X from event Y”), but almost every time I’m wrong. When the contraction finally releases, the real reason surprises me. If I’d truly understood, it would already be gone. Or I’ll think, “I intellectually understand why I’m doing X but haven’t emotionally processed it,” and that’s wrong too—I’m always missing deeper layers. When the real insight arrives, it makes way more sense both felt-emotionally and intellectually. Based on this help me understand (x)\n\nWhere x is just something I’ve noticed where my emotional reaction isn’t optimal. Then it’s a five minute conversation digging deeper until I typically come to the insight that I hadn’t had yet.\n↓\n1950582922446270964 [2025-07-30] @ChrisChipMonk 💜 1\n@jakozloski Oh cool!!\n\n===\n\n1956199818201850249 [2025-08-15] @blissbrah 💜 183 🔁 15\nLast year in June, I dropped the default behavior of resisting “negative” emotions. I posted at the top [1], declaring that I no longer suffered. It’s been over a year since then, and that original statement wasn’t 100% accurate. More like 97%.\n\nSince last June, there’s been a handful of emotional and a couple physical experiences that have caused me to suffer. A ten hour tattoo session, McDonalds binge that triggered stomach pain and returning cancer fear, indoor olympics performance issue caused much shame and disappointment, intense waves of prolonged fear caused by airplane turbulence [2], and a few other periods I’m sure happened but I didn’t log. So about ten or less days where I suffered. 355/365 days, or 97% of the rest of the year I didn’t suffer.\n\nI mean suffering with a capital S. What remained after that shift in June didn’t feel like I was Suffering. What remained included occasional slight, subtler meh-ness here and there, slight unsatisfactoriness. Calling those “suffering” feels inaccurate, like it trivializes the level of suck I felt when experiencing the components I bundled up in what I called “negative” emotions in the past. And those subtler ouchies that prevent 100 proof peace have dissolved more and more in the momentum gained from that before-after event last June.\n\nWhy have some moments still caused suffering? Maybe there’s experiences that are rare and trigger dusty conditioning which hasn’t been rewritten yet, where the logic behind resistance to emotional experience still lingers. Some patterns of my experience support that idea.\n\nOr perhaps certain levels of combined duration and intensity of “negative” emotions still cause suffering, that the June shift just raised the capacity much higher but not all the way to account for the full range of what god’s gonna gift me. Some patterns of my experience support that idea, but maybe it’s also a characteristic of the former, where high levels of both duration and intensity of “negative” emotion trigger not-updated code.\n\nI didn’t need off-retreat deterministic access to higher jhanas or multiple cessations or 35 noticings per second to stop resisting emotions, just a sporadic practice of looking in direct experience in specific ways (for like four months). But deterministic access to the second jhana, and the emotional work needed to get high without drugs, certainly helped weaken resistance to emotions.\n\nIt’s exciting that the jhanas are more widely known, even if still much an open secret outside meditation/tech twitter. And that it’s possible to nix the default assumptions causing emotional resistance using seemingly simple inquiry practices, or most suffering, is an even bigger open secret.\n\nThere’s a handful of other folks who publicly share that they've reproduced the results I’m talking about using the same practices, and I hope lots more do so. The shift last June has been the biggest upgrade to my wellbeing, but I’m not a special person who did something exceedingly hard. You can drop emotional resistance too, and there can be lots of ease and enjoyment along the way.\n\nIt took me a long time to experience my first jhana, and now most people learn in a week via Jhourney [3]. I hope a similar quickening happens with these inquiry practices.\n\nI don’t know if how I feel is permanent, but over a year is great, and I don’t know why it’d stop being this way anytime soon. I’d love to help others drop default resistance to emotion using jhanas and inquiry. I’m doing more 1:1 calls with folks when I’m not working Jhourney retreats. See here [4]\nImages:\n  - [Image #0] The image is a serene scene of a child sleeping next to a white reindeer, with the text \"A year after 'achieving' deep okayness\" overlaid on top. The image is accompanied by a URL, \"WWW.BLISSBRAH.BLOG\", at the bottom.\n↓\n1956664568505119125 [2025-08-16] @Michael43372432 💜 1 [(SEED) type=semantic_search]\n@blissbrah Hi-Just found your blog, fantastic, exactly what I needed!  \n\nHow long did it take you to clear all emotional reactivity with this practice? \n\nSo basically: get triggered → program runs → look beyond program and check if the emotion has any actual cause in reality. Correct?\n↓\n1956691334892560736 [2025-08-16] @blissbrah \nso i was doing inquiry for like 4 months until the shift happened, but I'd also been meditating awhile before that and alongside doing the inquiry up until the shift. \n\naccording to going theory, you also have to drop another prior before reactivity. i have blog posts on f1-5 which talk about the techniques and provide more resources\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand traces a multi-year evolution in understanding emotional self-regulation and 'non-coercion,' anchored by Qiaochu's 2019 conceptual foundation and crystallized through Rival's 2020 'gym crying' case study with Yatharth. The boundary object is the tension between 'doing what you should' vs. 'allowing what you feel'—a dialectical exploration that moves from abstract parts-work theory to concrete coaching demonstrations to longitudinal testimonials of transformation. The arc shows high evolution: from identifying the problem (inner critic warfare, coercion-as-default) to developing vocabulary ('attunement,' 'blending,' 'surrogate selfing') to practitioners reporting sustained shifts in baseline emotional reactivity. Utility is exceptionally high for the rationalist/post-rat community struggling with productivity-shame spirals, offering both theoretical maps and replicable techniques.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1205995673641865221,
        "annotation": "Pre-context: Qiaochu's foundational thread on letting go of fixed meanings attached to emotions—the intellectual scaffolding for all later work"
      },
      {
        "tweet_id": 1206002986809356289,
        "annotation": "Critical warning: Don't weaponize introspection against yourself if you have a strong inner critic—prioritize that first"
      },
      {
        "tweet_id": 1318925777094778880,
        "annotation": "The Artifact: Rival's play-by-play coaching of Yatharth's gym resistance—the 'perfect vignette' that becomes the strand's central case study"
      },
      {
        "tweet_id": 1318925796044689412,
        "annotation": "The Endemic Pattern: Revealing how 'just don't do it' gets subverted into 'coerce yourself until you want to'—the core insight about self-deception"
      },
      {
        "tweet_id": 1318925807763492869,
        "annotation": "The Breakthrough: Yatharth accessing the angry, resentful part that holds crucial knowledge about autonomy and mom's fear-mongering"
      },
      {
        "tweet_id": 1319020281114038273,
        "annotation": "Meta-lesson on coaching: It's not about new information but about conviction—borrowing the mentor's years of experience to trust your own knowing"
      },
      {
        "tweet_id": 1452298407419199491,
        "annotation": "Yatharth's retrospective: The 'I don't wanna' shutdown as rationalist culture's unacknowledged failure mode—life shouldn't feel hard without novelty/mastery"
      },
      {
        "tweet_id": 1452306143766880260,
        "annotation": "The High-Stakes Grinding: Two incompatible shoulds (get the water bottle vs. never do what you don't want) creating paralysis even in trivial moments"
      },
      {
        "tweet_id": 1421025494380732416,
        "annotation": "One year later: Yatharth reports letting go of the gym relationship entirely, then spontaneously returning without coercion—proof of concept"
      },
      {
        "tweet_id": 1956199818201850249,
        "annotation": "Endpoint: Blissbrah's longitudinal data—355/365 days without suffering after dropping emotional resistance, validating the entire arc's promise"
      }
    ]
  }
}