{
  "seed_tweet_id": 1394772091660951555,
  "thread_text": "1271886699119828993 [2020-06-13] @visakanv 💜 414 🔁 24 💬 1\nrandom intrusive thought: imagine if mark zuckerberg got super swole, got into MMA and just started beating people's asses\n↓\n1271886965634265089 [2020-06-13] @visakanv 💜 143 🔁 14 💬 2\nwhy did I think this? I do not know. my brain is an autonomous zone beyond my jurisdiction\n↓\n1271887433391431680 [2020-06-13] @visakanv 💜 89 🔁 1\nimportantly, he doesn't change his speaking style or mannerisms or anything whatsoever. just rips dudes to shreds, and then be like https://t.co/4o0Vv1KQr1\nImages:\n  - [Image #0] The image shows a screenshot of a live video featuring Mark Zuckerberg speaking into a microphone. \n    \n    The image is a still shot of Mark Zuckerberg, dressed in a blue suit and light blue tie, speaking into a black microphone. He has short brown hair and is looking to the left of the camera. A black box at the bottom of the image contains white text that reads \"BUSINESS.\" followed by \"[APPLAUSE]\" in square brackets. \n    \n    In the background, several people are visible, including a man wearing a black top hat and glasses to Zuckerberg's left. The top-left corner of the image displays a red \"LIVE\" button next to an eye icon with \"80.5K\" written beside it. The bottom of the image features various reaction icons, including hearts and thumbs-up symbols.\n↓\n1566309438348152834 [2022-09-04] @visakanv 💜 38 🔁 1\nhttps://t.co/CFOKIYczQ4\n  [Quoting Tweet 1566086983600021504 (missing)]\n↓\n1566312127086067714 [2022-09-04] @nopranablem 💜 11 [(SEED) type=semantic_search]\n@visakanv Tfw you joke about outcomes you want\n\n===\n\n1394772091660951555 [2021-05-18] @visakanv 💜 3333 🔁 559 💬 45 [(SEED) type=root]\nthe stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want\n├── 1394772561985097729 [2021-05-18] @visakanv 💜 496 🔁 16 💬 1\n│   I used to joke about being broke and I started making more money when I decided that I wasn’t gonna do that anymore\n│   ↓\n│   1394774032625528835 [2021-05-18] @visakanv 💜 333 🔁 10 💬 1\n│   see when a person talks about what they want I can take actions that might help them get what they want\n│   \n│   and in a sense we are all doing this all the time\n│   \n│   when we complain we are inviting others to complain with us and help us complain more https://t.co/SMmyBD9HxK\n│   Images:\n│     - [Image #0] [PIC NOT AVAILABLE]\n│   ├── 1394774429654077444 [2021-05-18] @visakanv 💜 210 🔁 10\n│   │   When you spend your time and energy focusing on what you don’t want, you’ll likely end up getting more of it: https://t.co/Pu3xZQeiQM\n│   │     [Quoting @visakanv: 29. just discovered /r/enoughpetersonspam, where 31,000+ people voluntarily subscribe to posts about Jordan Peterson, including posts indicating  shock at reddit suggesting that maybe they might be interested in Jordan Peterson https://t.co/SnGQ7iSuWf]\n│   │   ↓\n│   │   1394774649129476100 [2021-05-18] @visakanv 💜 269 🔁 23\n│   │   so as always the primary winning move is https://t.co/tFaWtEZM1p\n│   │     [Quoting @visakanv: focus your time and energy on what you want to see more of]\n│   │   ↓\n│   │   1394777207688466433 [2021-05-18] @visakanv 💜 258 🔁 29\n│   │   yes it can be worthwhile to direct attention to cruel, ugly, terrible things – but the tricky thing is to stay focused on the goal: a more just, kind, equitable world. If one loses sight of that it’s unfortunately easy to get swept up in despair and vindictiveness etc\n│   │   ↓\n│   │   1394778028383686658 [2021-05-18] @visakanv 💜 151 🔁 1\n│   │   just remembered this classic https://t.co/cGplJfM82R\n│   │     [Quoting @visakanv: I JUST WANT 10,000 TWITTER FOLLOWERS FOR BEING A PRETTY PRETTY PRINCESS IS THAT TOO MUCH TO ASK]\n│   │   ↓\n│   │   1394778621542211584 [2021-05-18] @visakanv 💜 136 🔁 5\n│   │   you’re very unlikely to get what you don’t ask for if it’s significant\n│   │   \n│   │   if you ask for something totally “impractical/unrealistic”, it’ll likely require a bunch of additional work — you’ll have to stay with the ask consistently for months, years, and answer the followup questions\n│   │   ↓\n│   │   1394779035390025729 [2021-05-18] @visakanv 💜 208 🔁 11\n│   │   so if it’s like, “I wanna be rich, it’ll be so funny if I were rich haha” – you can’t just say it once. it’s not THAT simple. you have to keep thinking it. then you’ll start to notice silly opportunities and silly business ideas more than you used to, and it compounds from there\n│   │   ↓\n│   │   1394779581580775428 [2021-05-18] @visakanv 💜 137 🔁 3 💬 1\n│   │   aside: I was reading some Borges recently and I noticed for the first time in months (over a year??) that the olive oil in my kitchen is Borges. I somehow never noticed it before. Similarly there are always things we are missing in plain sight until we start looking out for them https://t.co/fgw2PnUhX8\n│   │   Images:\n│   │     - [Image #0] The image shows a bottle of olive oil on a black surface, with a white paper towel to its left. The bottle is clear glass with a yellow label that reads \"BORGES\" in white letters on a red banner, and \"Extra Light Olive Oil\" in green letters below. The label also features an illustration of trees and the text \"Maintains the original flavor of your dishes\". A yellow sticker on the cap reads \"EXCLUSIVE CAP DUO IDEAL FOR COOKING & DRESSING\".\n│   │   ↓\n│   │   1421543225790275596 [2021-07-31] @mykola \n│   │   @visakanv Coincidences are magical doorways.\n│   │   \n│   │   https://t.co/laOdI5tcQs\n│   │     [Quoting @mykola: Quick thread on coincidences, synchronicity and magic. I think it was Gordon White who defined magical practice as working to maximize the number of meaningful coincidences in life.  Coincidences are powerful, in a way that's hard to understand at first.]\n│   ├── 1394781112652730368 [2021-05-18] @blisstweeting 💜 1\n│   │   @visakanv lol I should certainly try this out. setting my Patreon page up already brb\n│   └── 1425944864894619655 [2021-08-12] @relic_radiation 💜 2\n│       @visakanv Hmm, I feel complaining has its place. There’s a way to do it consciously - you step into complain-space and unearth new stuff you don’t realize is affecting you! \n│       \n│       I agree abt the spell-power of words, tho. Finishing a complain sesh w the reversal? ++\n│       \n│       https://t.co/YnOVqBykCl\n│       ↓\n│       1425945847452377089 [2021-08-12] @relic_radiation 💜 4 🔁 1\n│       @visakanv I find conscious complaining works best for “I feel terrible and I have no idea why!!!” \n│       \n│       Last pain-point I unearthed this way was “nobody touches each other and everybody leaves!” \n│       \n│       Now I’m at a 30-yr-plan homestead and enrolled in massage school. Lol 🙏💕\n│       ↓\n│       1425952637904723972 [2021-08-12] @relic_radiation 💜 1\n│       @visakanv Actually I don’t think the article gets to the whole depth of the practice. Here are book pages instead! \n│       \n│       Conscious complaining as a practice to restore flow to a clogged-up psyche: https://t.co/cPRRsgAjaI\n│       Images:\n│         - [Image #0] The image shows a page from a book titled \"CONSCIOUS COMPLAINING\" on page 146. The text discusses the importance of maintaining a balance between focus and relaxation, and how ignoring or repressing emotions can lead to negative consequences.\n│           \n│           Here is the full text:\n│           \n│           **CONSCIOUS COMPLAINING**\n│           \n│           Focus, grounding, and definition are states to aspire to, but no one can maintain them at all times. The brain doesn't appreciate constant focus, and life is a drag if all you do is work. Resting, daydreaming, fooling around, laughing, napping, and playing are extremely important in a whole and happy life. Learning to flow means learning to relax; it's important to keep things light. However, if you can't ground, focus, or define yourself when you want to, that's a horse of a different color.\n│           \n│           It is easy to get into troubling moods or stagnant places and forget all your skills and all your emotional wisdom; it's easy to fall into emotional repression and incompetent expression. When this happens (and it will), your ignored and mismanaged emotions will intensify and repeat themselves—because neither repression nor improper expression can ever address the issues your emotions are trying to bring forward. If you continue to ignore your emotions (and you will), they'll become louder and more aggressive. Soon, they'll arise in response to totally unrelated situations. Cycling depressions and rages, anxiety attacks, and obsessive worry are all examples of emotions that have become trapped in a bothersome feedback loop. What started out as mobile emotions become monotonous, tormenting, and chronic responses to the world.\n│           \n│           When your emotions are welcomed and honored, they move easily and quickly—they arise in response to real situations, they contribute precisely what you need, and then they retreat cheerfully. In contrast, a disruption\n│       ↓\n│       1425953167657906181 [2021-08-12] @relic_radiation 💜 1\n│       @visakanv Go for it, make a complaining shrine with dark or annoying colors.\n│       \n│       &amp; now after reading your tweet, I’ll end the sessions with jokes about “haha what if &lt;inverse of complaint&gt; HAHAHA”\n│       \n│       🎉 https://t.co/TQmX1cb7rt\n│       Images:\n│         - [Image #0] The image is a photo of a book with a section of black text on a white page. The text reads: \n│           \n│           \"...Conscious complaining (see pages 146–49) is another wonderful tool that can be considered an emergency first-aid kit for depression. Conscious complaining unlocks the chains that wrap themselves around your psyche, and it kick-starts your flow in a powerful way. This practice is so important for the healing of depression that I'd suggest creating a specific complaining shrine (with dark or annoying colors, pictures of bratty children and grumpy animals, and so forth) in order to sanctify and honor\"\n│           \n│           The page number \"336\" is visible at the bottom left.\n│       ↓\n│       1425953307177078791 [2021-08-12] @visakanv 💜 1\n│       @relic_radiation Ooo what book is this\n│       ↓\n│       1425955143011426307 [2021-08-12] @relic_radiation 💜 2\n│       @visakanv My good ol’ standby.\n│       \n│       I first picked it up in November, and keep re-reading and getting more and more out of it. \n│       \n│       After massage school I wanna study directly w the author !\n│       \n│       https://t.co/1WX1K2lcY6\n│         [Quoting @relic_radiation: I’m now reading: this completely life changing book.   The Language of Emotions by Karla McLaren https://t.co/qqNMGLwLCG]\n│       ↓\n│       1425956090513088517 [2021-08-12] @relic_radiation 💜 2\n│       @visakanv Actually, she has a training coming up in October\n│       \n│       &amp; if I knew I could both **not burn out from overcommitment** and also enroll in it \n│       \n│       I totally would\n│       \n│       HAHAHA\n│       ↓\n│       1425956916954484736 [2021-08-12] @visakanv 💜 1\n│       @relic_radiation sounds like you should try and make it happen + work!\n├── 1394837722716532737 [2021-05-19] @VividVoid_ 💜 20\n│   @visakanv No offense man but I don't buy it\n│   \n│   Of course you can always analyze a joke for the anxiety underlying it and excessive neg self-talk is harmful. \n│   \n│   But life is really fucked up sometimes and in many situations dark humor is a gift.\n│   ↓\n│   1394966538579550208 [2021-05-19] @visakanv 💜 38 🔁 1\n│   @VividVoid_ I am not against dark humor if it’s used well\n│   \n│   I said “be careful and deliberate about it”\n│   ↓\n│   1394967167456645121 [2021-05-19] @visakanv 💜 10\n│   @VividVoid_ https://t.co/GEWDTc8Q9I\n│     [Quoting @visakanv: thinking about how sometimes the only thing that really matters is the right vibe. you can have dark humor that's nourishing and supportive. you can have cheery positivity that's cruel and oppressive. the thing itself is so often secondary to the context, the delivery, the frame]\n├── 1398272545745367042 [2021-05-28] @visakanv 💜 206 🔁 20 💬 1 [(SEED) type=semantic_search]\n│   you might as well joke about the outcomes you do want https://t.co/X3TjrYViCt\n│     [Quoting Tweet 1397615393439633413 (missing)]\n│   ├── 1398274309597155332 [2021-05-28] @blisstweeting 💜 1\n│   │   @visakanv waiting for the first president who runs for it as a joke and gets the position\n│   │   ↓\n│   │   1398274607522598920 [2021-05-28] @visakanv 💜 2\n│   │   @blisstweeting Some argue this was @POTUS45\n│   │   ↓\n│   │   1398275509864198146 [2021-05-28] @blisstweeting \n│   │   @visakanv @POTUS45 Something similar happened to the Best Party in Iceland (though that was a run for seats in the city council)\n│   └── 1411498944891265026 [2021-07-04] @visakanv 💜 81 [(SEED) type=semantic_search]\n│       you might as well joke about the outcomes you want\n│       \n│       https://t.co/FDgjMNMhYb\n│         [Quoting Tweet 1411450663016579078 (missing)]\n│       ↓\n│       1415468844806598656 [2021-07-15] @visakanv 💜 61 🔁 3 [(SEED) type=semantic_search]\n│       you might as well joke about the outcomes you want https://t.co/iavLAFxYj3\n│         [Quoting Tweet 1403383750671491073 (missing)]\n│       ↓\n│       1417292165030420483 [2021-07-20] @visakanv 💜 40 [(SEED) type=semantic_search]\n│       you might as well joke about the outcomes you want https://t.co/GLnSdDRVaL\n│         [Quoting Tweet 1417289953877262336 (missing)]\n│       ↓\n│       1419302419465342984 [2021-07-25] @visakanv 💜 95 🔁 2 [(SEED) type=semantic_search]\n│       love him or hate him, \n│       \n│       you might as well joke about the outcomes you want https://t.co/TtEDkqYl11\n│         [Quoting Tweet 1417432761867161613 (missing)]\n│       ↓\n│       1421351704587497473 [2021-07-31] @visakanv 💜 68 🔁 3\n│       don’t joke about what you don’t want, joke about what you want https://t.co/JeELByojvL\n│         [Quoting Tweet 1421241793945948168 (missing)]\n│       ↓\n│       1442515883025321993 [2021-09-27] @visakanv 💜 81 🔁 5 💬 1\n│       joke about the outcomes you want https://t.co/SGzNLgGpvU\n│         [Quoting Tweet 1442495533860356102 (missing)]\n│       ↓\n│       1450909370926002178 [2021-10-20] @visakanv 💜 40 🔁 2\n│       joke about the outcomes you want https://t.co/gXd4tV5sYw\n│         [Quoting Tweet 1450827806351441922 (missing)]\n│       ├── 1450916784295583748 [2021-10-20] @strangestloop 💜 3\n│       │   @visakanv visa what is the rebuttal to:\n│       │   \n│       │   “if i joke about the outcomes i want then those who could help me get there will see i’m joking and they will think i’m not serious about working toward that outcome and they will not help me”\n│       │   ↓\n│       │   1450948067620917251 [2021-10-20] @Malcolm_Ocean 💜 5\n│       │   @strangestloop @visakanv also talk seriously about the outcomes you want\n│       │   ↓\n│       │   1451062697575940096 [2021-10-21] @visakanv 💜 4\n│       │   @Malcolm_Ocean @strangestloop yup. demonstrate seriousness with proof-of-work\n│       └── 1455452824825782274 [2021-11-02] @visakanv 💜 63 🔁 2 💬 2\n│           joke about the outcomes you want https://t.co/HrE78JST82\n│             [Quoting Tweet 1455234889712865296 (missing)]\n│           ↓\n│           1455794543538831370 [2021-11-03] @visakanv 💜 40 🔁 2\n│           joke about the outcomes you want https://t.co/NLhx7Kkqug\n│             [Quoting Tweet 1455715859754897409 (missing)]\n│           ↓\n│           1460988541857505284 [2021-11-17] @visakanv 💜 42 🔁 3\n│           musician jokingly asks his fans to send him money, raises $100k in 2 hours (h/t @seyitaylor) \n│           \n│           joke about the outcomes you want\n│           \n│           https://t.co/p1hOpkbdAL\n│             [Quoting Tweet 1460951236732022785 (missing)]\n│           ↓\n│           1476733521859276801 [2021-12-31] @visakanv 💜 57 🔁 7\n│           joke about the outcomes you want https://t.co/iADXk9UhGQ\n│           Images:\n│             - [Image #0] The image depicts a tweet thread, which shows a series of tweets from different users.\n│               \n│               To reproduce the image, start with a dark background and the following elements:\n│               * A tweet from Philippe Lemoine (@phl43) posted at 2:47 AM on Sep 8, 2021, stating, \"Has anyone ever considered genetically engineering SARS-CoV-2 to make it super-transmissible but harmless, while still having enough epitopes in common with the natural strains to confer immunity against them? It would effectively be a transmissible vaccine.\"\n│               * A retweet of a New York Times article posted by @nytimes at an unspecified time, titled \"Breaking News: South Africa said health data suggested its Omicron peak had passed with no major spike in deaths, offering cautious hope to other countries.\"\n│               * A response tweet from shakoist (@cauchyfriend) posted 2 hours prior to the screenshot, asking, \"So you have any idea as to whether the skills/tech exists that a sufficiently motivated team could have done this?\"\n│               * A reply from Philippe Lemoine (@phl43) to shakoist (@cauchyfriend) posted at 7:17 AM on Dec 31, 2021, stating, \"I have no idea, but I was just joking, I don't actually believe it leaked from a lab although I know some people do.\"\n│           ↓\n│           1481923633622974465 [2022-01-14] @visakanv 💜 65 🔁 6\n│           joke about the outcomes you want\n│           (also, raise your prices) https://t.co/7MrzzIKMbl\n│             [Quoting Tweet 1481391792474013697 (missing)]\n│           ↓\n│           1483437949287284739 [2022-01-18] @visakanv 💜 30 🔁 2 💬 1\n│           tweet about the outcomes you want \n│           \n│           (thread) https://t.co/HMSmx6oTT9\n│             [Quoting Tweet 1483427664518164485 (missing)]\n│           ↓\n│           1487151455023042561 [2022-01-28] @visakanv 💜 35 🔁 2\n│           joke about the outcomes you want https://t.co/diYLe6yjKZ\n│             [Quoting Tweet 1487150854297714695 (missing)]\n│           ↓\n│           1488498406645723144 [2022-02-01] @visakanv 💜 41 🔁 3\n│           joke about the outcomes you want https://t.co/lMWSnwJ5Vn\n│             [Quoting Tweet 1483001708355723265 (missing)]\n│           ↓\n│           1494189971107811329 [2022-02-17] @visakanv 💜 24\n│           joke about the outcomes you want https://t.co/2Mspj496sk\n│             [Quoting Tweet 1494080370991501313 (missing)]\n│           ↓\n│           1496020200730558467 [2022-02-22] @visakanv 💜 33 🔁 1\n│           19. https://t.co/R7BWDkbWA5\n│             [Quoting Tweet 1495874689222258702 (missing)]\n│           ↓\n│           1497861847336185856 [2022-02-27] @visakanv 💜 142 🔁 16 💬 4 [(SEED) type=semantic_search]\n│           20. joke about the outcomes you want https://t.co/L3QHbwSh1k\n│             [Quoting Tweet 1497771809751588864 (missing)]\n│           ↓\n│           1498568500406673408 [2022-03-01] @visakanv 💜 37 🔁 4\n│           21. joke about the outcomes you want https://t.co/74KBRDsy6p https://t.co/r1Fj6mv3Ox\n│             [Quoting @eigenrobot: my Influence knows no bound's 😎 https://t.co/iwWMrXpQaQ]\n│           Images:\n│             - [Image #0] [PIC NOT AVAILABLE]\n│           ↓\n│           1499686834212773893 [2022-03-04] @visakanv 💜 24 🔁 3\n│           22. joke about the outcomes you want https://t.co/NWRtESMa4s\n│             [Quoting Tweet 1499456982302228482 (missing)]\n│           ↓\n│           1500399966484774912 [2022-03-06] @visakanv 💜 33 🔁 1\n│           23. joke about the outcomes you want https://t.co/6dJD0TYyzi\n│           Images:\n│             - [Image #0] The image is a screenshot of a news article with a quote from Prady about Stephen Hawking. The text is in black font on a white background, with a highlighted section in light blue. The quote reads: \"When people would ask us who a 'dream guest star' for the show would be, we would always joke and say Stephen Hawking—knowing that it was a long shot of astronomical proportions,\" Prady said in a statement announcing the news. \"In fact, we're not exactly sure how we got him. It's the kind of mystery that could only be understood by, say, a Stephen Hawking.\"\n│             - [Image #1] The image depicts two men in a study, with one seated in a wheelchair and the other standing beside him. The man in the wheelchair is dressed in a tan jacket over a blue shirt and dark pants, while the standing man wears a gray suit jacket over a green shirt featuring colorful shapes.\n│               \n│               *   The man in the wheelchair:\n│                   *   Has short blond hair\n│                   *   Wears glasses\n│                   *   Is seated in a black wheelchair with a computer monitor attached to it\n│                   *   Has his hands clasped together in his lap\n│               *   The standing man:\n│                   *   Has short brown hair\n│                   *   Wears a gray suit jacket over a green shirt with colorful shapes\n│                   *   Has his hands in his pockets\n│               *   The background of the image features:\n│                   *   A wooden desk with a lamp on it\n│                   *   A bookshelf filled with books\n│                   *   A painting hanging on the wall above the bookshelf\n│                   *   A yellow wall behind the standing man\n│               \n│               The image appears to be a still from the TV show \"The Big Bang Theory,\" featuring the characters Stephen Hawking and Sheldon Cooper.\n│           ↓\n│           1501043839821221889 [2022-03-08] @visakanv 💜 41 💬 1\n│           24. joke about the outcomes you want https://t.co/wSx4tJChvD\n│             [Quoting @yashkaf: joking about what you want to see in the world is undefeated and now basically becoming the main MO of TPOT https://t.co/mb7Qz8Codw]\n│           ↓\n│           1501575975330480128 [2022-03-09] @visakanv 💜 20\n│           25. joke about the outcomes you want https://t.co/kz7pptSTZb\n│           Images:\n│             - [Image #0] [PIC NOT AVAILABLE]\n│           ↓\n│           1508147602625216512 [2022-03-27] @visakanv 💜 21 🔁 2\n│           26. joke about the outcomes you want https://t.co/ZXhmprASKt\n│             [Quoting Tweet 1508104342682972164 (missing)]\n│           ↓\n│           1509888044425379846 [2022-04-01] @visakanv 💜 89 🔁 12 💬 5\n│           Happy April Fool’s! consider joking about the outcomes that you want 👀\n│           ├── 1509888832203857921 [2022-04-01] @mechanical_monk 💜 5\n│           │   @visakanv https://t.co/kNe6bQggqZ\n│           │     [Quoting @mechanical_monk: today i will be a productive member of society haha april fools]\n│           ├── 1518862038302294016 [2022-04-26] @visakanv 💜 69 🔁 5\n│           │   27. joke about the outcomes you want https://t.co/iwquBOZVao\n│           │     [Quoting Tweet 1518585718012059648 (missing)]\n│           │   ↓\n│           │   1518862243902853122 [2022-04-26] @visakanv 💜 54 🔁 1 💬 1 [(SEED) type=semantic_search]\n│           │   28. joke about the outcomes you want https://t.co/Wm6NYzqkfh\n│           │   Images:\n│           │     - [Image #0] The image is a screenshot of a Twitter conversation between Donald Trump and Russell Steinberg. \n│           │       \n│           │       The conversation includes three tweets: \n│           │       1. Donald Trump's initial tweet, dated February 7, 2013, stating, \"Obama can kill Americans at will with drones but waterboarding is not allowed -only in America!\"\n│           │       2. Russell Steinberg's response, also dated February 7, 2013, suggesting that if Trump hates America so much, he should run for President and fix things.\n│           │       3. Donald Trump's reply to Steinberg, stating, \"Be careful!\" \n│           │       \n│           │       The image includes the usernames, profile pictures, and the number of likes and retweets for each tweet.\n│           │   ↓\n│           │   1519491905851060224 [2022-04-28] @visakanv 💜 21\n│           │   29. joke about the outcomes you want https://t.co/fRDV43p6MB\n│           ├── 1642327617566126080 [2023-04-02] @blisstweeting \n│           │   @visakanv I'm not sure I want it but that would be absolutely hilarious https://t.co/Y964Pm7HkE\n│           │     [Quoting @blisstweeting: Would it be too much of a stretch to say that Balenciaga representatives have approached me and are asking me to work together with their PR team? Should I embrace the opportunity? I guess I don't belong to the world of fashion but]\n│           └── 1642454333462544385 [2023-04-02] @neats29 💜 1\n│               @visakanv I never get tired of going through this thread ❤️\n└── 1737624163731333378 [2023-12-21] @TBagsMusings 💜 2\n    @visakanv A wedding ceremony might be the wrong place to joke about outcomes you don't want.https://t.co/Pk3NqprCIM\n      [Quoting Tweet 1734213948927307876 (missing)]\n\n===\n\n1547006057800933376 [2022-07-12] @visakanv 💜 38 🔁 2\n33. joke about the outcomes you want https://t.co/ezOECUCAgW\n  [Quoting Tweet 1546979382811676672 (missing)]\n↓\n1551224245862428672 [2022-07-24] @visakanv 💜 23\n34. joke about the outcomes you want https://t.co/FkV9a2epF2\n  [Quoting Tweet 1550937039448616960 (missing)]\n↓\n1553741390236233730 [2022-07-31] @visakanv 💜 7\n35. joke about the outcomes you want https://t.co/c9vXixPrRn\n  [Quoting Tweet 1553382307926798336 (missing)]\n↓\n1565308934394560513 [2022-09-01] @visakanv 💜 26\n36. joke about the outcomes you want https://t.co/65u39ttKKU\n  [Quoting Tweet 1564786198756831233 (missing)]\n↓\n1567720861549105153 [2022-09-08] @visakanv 💜 20\n37. joke about the outcomes you want https://t.co/3ClxcXbCxa\n  [Quoting Tweet 1567316661891473408 (missing)]\n↓\n1568045385675075586 [2022-09-09] @visakanv 💜 20 🔁 1\n38. joke about the outcomes you want https://t.co/nXulHr9jpG\n  [Quoting Tweet 1455278852419117056 (missing)]\n↓\n1570978097582964737 [2022-09-17] @visakanv 💜 42\n39. joke about the outcomes you want https://t.co/rvzRf288JT\nImages:\n  - [Image #0] The image is a screenshot of a Twitter thread. The thread starts with a tweet from \"Lukas (e/acc)\" (@_LukasBlog) saying \"Add me pls\" in response to \"@storebrandguy\". \n    \n    * The original tweet is not visible, but \"@storebrandguy\" responds with \"sadly this was a joke. I don't like GCs (it's always too much traffic for me) so I'll never make one\".\n    \t+ This tweet has 2 replies and 1 retweet.\n    * \"@elizabethholmie\" responds to \"@storebrandguy\" with \"Oh shit sign me up I'm lowest of the low magma level\".\n    \t+ This tweet has 1 reply and 4 likes.\n    * \"@storebrandguy\" responds again, repeating their previous statement.\n    \t+ This tweet has 1 reply and 1 like.\n    \n    The background of the image is dark blue, and the text is white or light gray. The overall tone of the conversation appears to be humorous and lighthearted.\n  - [Image #1] The image is a screenshot of a tweet. The text reads: \"is there a GC for ingroup lowbies? we can talk shit about the ingroup influencers all day\". To reproduce the tweet, one should:\n    * Use a dark background.\n    * Include a profile picture on the left, followed by the username \"storebrandguy\" and handle \"@storebrandguy\".\n    * Write the main text in white.\n    * Display the timestamp \"9:55 AM · 16/9/22\" and the source \"Twitter for Android\" below the main text.\n    * Show engagement metrics: 2 Retweets, 3 Quote Tweets, and 157 Likes.\n    * Include icons for reply, retweet, like, and share at the bottom.\n  - [Image #2] The image shows a screenshot of a Twitter conversation between several users. The main elements to describe are:\n    \n    * A tweet from @storebrandguy stating \"sadly this was a joke. I don't like GCs (it's always too much traffic for me) so I'll never make one\" with 1 like and 1 reply.\n    * A reply from @wannabe533 asking \"can I get in if you made one\" with 2 likes and 1 reply.\n    * A reply from @actuallykenneth saying \"im in\" with 2 likes.\n    \n    To recreate this image, you would need to:\n    \n    1. Create a dark blue background.\n    2. Display the tweets in white text, with the usernames in bold.\n    3. Include the profile pictures for each user, with @omphaloskepsis having a picture of a stack of rocks and @actuallykenneth having a picture of a dinosaur-like creature.\n    4. Show the number of likes and replies for each tweet.\n    5. Indicate that there are more replies available by displaying \"Show replies\".\n    \n    By following these steps, you can recreate the image accurately.\n↓\n1582118791890096128 [2022-10-17] @visakanv 💜 14\n40. joke about the outcomes you want https://t.co/bdZfcGlTcT\n  [Quoting Tweet 1582081555333144577 (missing)]\n↓\n1593527108382646272 [2022-11-18] @visakanv 💜 31 🔁 2\n41. joke about the outcomes you want https://t.co/HLEPX2hn2T\n  [Quoting Tweet 1068840807212429312 (missing)]\n↓\n1601934084757921793 [2022-12-11] @visakanv 💜 12 🔁 3\n42. joke about the outcomes you want https://t.co/4O1qzRhE4H\n  [Quoting Tweet 1601903509669957633 (missing)]\n↓\n1604487628320935936 [2022-12-18] @visakanv 💜 45 🔁 6 💬 1 [(SEED) type=semantic_search]\n43. joke about the outcomes you want https://t.co/9AoqZbJ9gX\nImages:\n  - [Image #0] The image is a text passage on a black background describing an experiment involving a steak in a wind tunnel. The passage is written in white text and discusses how researchers from the University of Manchester used a wind tunnel to test the effects of hypersonic heat transfer on a steak, with the results showing that the surface was charred while the interior remained raw.\n    \n    The text is divided into five paragraphs, each describing a different aspect of the experiment. The first paragraph introduces the researchers and their experiment, while the second and third paragraphs describe the two videos taken during the experiment, one using Schlieren imaging and the other using an infrared thermal camera. The fourth paragraph summarizes the results of the experiment, concluding that cooking a steak in a wind tunnel is not an effective method. The final paragraph thanks the researchers and promotes the author's book, \"What If? 2\", which is available for purchase.\n    \n    The text includes a link to the author's website, https://xkcd.com/what-if-2/, at the bottom.\n  - [Image #1] The image shows a screenshot of an Instagram post featuring a page from the book \"What If?\" by xkcd. The page discusses the hypothetical scenario of dropping a steak from space and its effects on the steak's temperature and composition.\n    \n    **Text from the Image:**\n    \n    *   \"into a semi-stable spheroid shape. However, this is little more than a wild guess. **If anyone puts a steak in a hypersonic wind tunnel to get better data on this, please, send me the video.** \n    *   If you drop the steak from 250 kilometers, things start to heat up; 250 kilometers puts us in the range of low Earth orbit. However, the steak, since it's dropped from a standstill, isn't moving nearly as fast as an object reentering from orbit. \n    *   In this scenario, the steak reaches a top speed of Mach 6, and the outer surface may even get pleasantly seared. The inside, unfortunately, is still uncooked. Unless, that is, it goes into a hypersonic tumble and explodes into chunks. \n    *   From higher altitudes, the heat starts to get really substantial. The shockwave in front of the steak reaches thousands of degrees (Fahrenheit or Celsius; it's true in both). The problem with this level of heat is that it burns the surface layer completely, converting it to little more than carbon. That is, it becomes charred.\"\n    *   **Diagram:**\n        *   A graph titled \"Steak Speed\" on the y-axis and \"Steak Altitude\" on the x-axis.\n        *   Two lines are plotted: \"Path Without Atmosphere\" and \"Path With Atmosphere.\"\n        *   The graph illustrates the steak's speed as it descends through the atmosphere, with the \"Path With Atmosphere\" line showing a significant increase in speed due to atmospheric friction.\n    *   **Instagram Post:**\n        *   \"xkcd In the first What If? book, I answered a question about cooking a steak by dropping it from space. At one point, I commented—jokingly—that if anyone put a steak in a hypersonic wind tunnel to gather better data, I'd love to see the video.\"\n        *   \"Well, I have good news.\"\n↓\n1611658433203408896 [2023-01-07] @visakanv 💜 28 🔁 2\n44. joke about the outcomes you want https://t.co/QStkHd5KSt\n  [Quoting Tweet 1611585370461986816 (missing)]\n↓\n1625105632495034368 [2023-02-13] @visakanv 💜 39 🔁 3\n45. joke about the outcomes you want https://t.co/xGq6PYKzsj https://t.co/aeDBTv8JAQ\n  [Quoting Tweet 1624949778516680704 (missing)]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1650417599338139648 [2023-04-24] @visakanv 💜 52 🔁 1 💬 1\n46. joke about the outcomes you want https://t.co/7joTusg9Ue\n  [Quoting Tweet 706943077798297601 (missing)]\n↓\n1653459513146773504 [2023-05-02] @visakanv 💜 28 🔁 1\n47. publicly advocate for the outcomes you want https://t.co/olFm4N9ERR\n  [Quoting Tweet 1638965829294489600 (missing)]\n↓\n1658853604529258497 [2023-05-17] @visakanv 💜 22 🔁 1\n48. joke about the outcomes you want https://t.co/1oDAQt7twr\n  [Quoting Tweet 1658500883846504448 (missing)]\n├── 1664880963443396609 [2023-06-03] @hargup13 💜 1\n│   @visakanv A joke lead to the production of the famous Cobra Kai series ☺️😆🥋🐍🏯 https://t.co/zwPhRfICLk\n│   Images:\n│     - [Image #0] [PIC NOT AVAILABLE]\n├── 1669826012245528577 [2023-06-16] @visakanv 💜 11\n│   49. joke about the outcomes you want https://t.co/RpeTJhiFpk\n│     [Quoting Tweet 1669760261761433600 (missing)]\n│   ↓\n│   1672458251819175936 [2023-06-24] @visakanv 💜 14 🔁 1\n│   50. joke about the outcomes you want https://t.co/97J7o7cb7t\n│     [Quoting Tweet 1672389371863900167 (missing)]\n│   ↓\n│   1680541591193124866 [2023-07-16] @visakanv 💜 11 🔁 1\n│   51. joke about the outcomes you want https://t.co/drPrURtGp6\n│     [Quoting Tweet 1680322669756006400 (missing)]\n│   ↓\n│   1688114116806967296 [2023-08-06] @visakanv 💜 19 🔁 2 💬 1\n│   52. joke about the outcomes you want https://t.co/X4BJ8Snzq5\n│     [Quoting Tweet 1688006817454985216 (missing)]\n│   ↓\n│   1698294613088571721 [2023-09-03] @visakanv 💜 18 🔁 3\n│   53. do not joke about outcomes you do not want https://t.co/YZi0l2LM5v\n│     [Quoting Tweet 1698114396671918495 (missing)]\n└── 1669827595901313025 [2023-06-16] @adam_kranz 💜 1\n    @visakanv If only someone had warned him\n    https://t.co/hFyA5ncDn2\n      [Quoting Tweet 1658530515371147264 (missing)]\n\n===\n\n1394833584481968130 [2021-05-19] @the_wilderless 💜 13 [(SEED) type=quote_of_root]\nA couple of my friends in high school dipped into irony senior year, started listening to Justin Bieber as a joke, then shakira as a joke, then...\n\nI checked in on them two years later and they had full My Little Pony bed-sets (sheets, comforter, pillow cases...), https://t.co/qUTBTSo13h\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1394833586222632961 [2021-05-19] @the_wilderless 💜 14\nThey’d gotten extremely anti-Semitic, dropped out of college to play more Warcraft, literally hissed if you asked them to do something outdoors, and used the n-word pretty much constantly. \n\nEvery single one of those had started as a brief little joke that just grew and grew\n\n===\n\n1400208911186100224 [2021-06-02] @visakanv 💜 216 🔁 22 💬 2 [(SEED) type=semantic_search]\nposts become reality, this should not surprise anyone anymore \n\nwhat you joke about has a real chance of coming true, so as always, joke about the outcomes you want https://t.co/REXzPMK85j\n  [Quoting Tweet 1400151021607809024 (missing)]\n├── 1400209032648921088 [2021-06-02] @visakanv 💜 15\n│   https://t.co/6tabXPKmws\n│     [Quoting @visakanv: I’m gonna get weirdly solemn and serious about this:  By repeating the “people say I remind them of Tony Hawk” story several times, Tony has set into motion an old and powerful magic that now summons people to contribute to the story, reinforcing it https://t.co/JpB1XmfNHw]\n└── 1422214609512013826 [2021-08-02] @visakanv 💜 35 🔁 3\n    memes become reality, this should not surprise anyone anymore (h/t @knipps) \n    \n    https://t.co/LgzczTIYNm\n      [Quoting Tweet 1421885765328543752 (missing)]\n    ├── 1422215277257785344 [2021-08-02] @visakanv 💜 19 🔁 2\n    │   interestingly, it seems likely that some people will continue to be surprised every time\n    │   \n    │   this is because they expect reality to be \"realistic\", in accordance with their expectations\n    │   \n    │   reality has no obligation to behave the way we think it should\n    │   \n    │   https://t.co/1r9nRWxEQx\n    │     [Quoting @visakanv: If reality seems unrealistic, it’s because you were holding on to a false idea about how reality is.  Reality isn’t unrealistic; your expectations were   Reality isn’t unrealistic, your expectations were  Reality isn’t unrealistic, your expectations were  Reality isn’t unrealisti https://t.co/Ygl39kad2Z]\n    │   ↓\n    │   1429115307877015557 [2021-08-21] @visakanv 💜 10 🔁 1\n    │   every so often reality shifts dramatically in ways that break commonplace intuitions\n    │   \n    │   reality is not obliged to behave itself\n    │   \n    │   https://t.co/gZWfhgVNCW https://t.co/DUGASlx2At\n    │     [Quoting @visakanv: @adedo7un @balajis yea we expect reality to be \"realistic\", but reality can be at extremely unrealistic at the seams]\n    │   Images:\n    │     - [Image #0] The image is a diagram illustrating three types of earthquakes, titled \"EARTHQUAKE\" in bold black text at the top center.\n    │       \n    │       Below the title, three 3D diagrams are arranged horizontally, each depicting a different type of earthquake. The diagrams feature green grassy areas on top of brown dirt, with a gray road running through them. Red arrows indicate the direction of movement.\n    │       \n    │       The first diagram on the left shows a \"NORMAL FAULT,\" where the ground on the right side has moved down relative to the left side. The second diagram in the middle illustrates a \"REVERSE FAULT,\" where the ground on the right side has moved up relative to the left side. The third diagram on the right depicts a \"STRIKE-SLIP FAULT,\" where the ground on the right side has moved horizontally to the right relative to the left side.\n    │       \n    │       Each diagram is labeled with its corresponding type of fault in black text below it. The background of the image is white.\n    └── 1432636926343876610 [2021-08-31] @visakanv 💜 11\n        https://t.co/Blmsuek0Gk\n          [Quoting Tweet 1432518489726672898 (missing)]\n        ↓\n        1439405127018762241 [2021-09-19] @visakanv 💜 19 🔁 1\n        joke about the outcomes you want (h/t @DavidDworetzky) https://t.co/M8dXXN3IPw\n        Images:\n          - [Image #0] The image shows a Twitter thread discussing the Amazon rainforest. The text is as follows:\n            \n            * James Medlock (@jdmedlock) on 19/7/21: \"Rich countries should collectively pay countries like Brazil to preserve the Amazon\"\n            * NPR (@NPR) on 19/7/21: \"Humans have cleared millions of acres of Brazil's forest and grasslands in the last 30 years to grow soybeans. But that deforestation is now actually making...\"\n            \t+ 53 comments\n            \t+ 115 retweets\n            \t+ 1,402 likes\n            * David Dworetzky (@DavidDworetzky) replying to @jdmedlock: \"Jeff Bezos should purchase a bunch of land in the Amazon as an eco-preserve and bring it full circle.\"\n            \t+ 11:46 AM - 19/7/21\n            \t+ Twitter for Android\n            \t+ 6 Likes\n            \n            The tweet thread is on a dark blue background, and the text is in white.\n        ↓\n        1439669909185712131 [2021-09-19] @visakanv 💜 17\n        it’s her! https://t.co/xghrgL1UCv https://t.co/EKwbxj3RNJ\n          [Quoting Tweet 1439390642036162562 (missing)]\n        Images:\n          - [Image #0] [PIC NOT AVAILABLE]\n\n===\n\n1400212863508107267 [2021-06-02] @uberstuber 💜 19 [(SEED) type=quote_of_semantic_search]\nhaha imagine if I made a living doing the things I love 🤣 https://t.co/CXzoUXvhQ9\n  [Quoting @visakanv: posts become reality, this should not surprise anyone anymore   what you joke about has a real chance of coming true, so as always, joke about the outcomes you want https://t.co/REXzPMK85j]\n↓\n1400240119156822022 [2021-06-02] @tasshinfogleman 💜 1\n@uberstuber we're getting there king\n\n===\n\n1421126385800675328 [2021-07-30] @visakanv 💜 35 🔁 3 💬 1 [(SEED) type=semantic_search]\nyou might as well joke about the outcomes you want! https://t.co/l4BXsg15zT\n  [Quoting Tweet 1421004415834759169 (missing)]\n\n===\n\n1421539595859021824 [2021-07-31] @QiaochuYuan 💜 51 🔁 3 [(SEED) type=quote_of_root]\ni think it’s even odds the causality goes the other way: the stuff you joke about is presciently intuitively anticipating the way your reality is headed. i don’t think you can “force” the joking in whatever direction you want, i think the jokes will feel staler https://t.co/Q6nHt6scM6\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1421539599034159104 [2021-07-31] @QiaochuYuan 💜 24\ncausality is weird. when you do some kind of magical / intention-based / will-based practice to change the course of your life, are you actually causally influencing the future or just coming into better alignment with the future that’s already happening? i genuinely dunno\n↓\n1421540133673705478 [2021-07-31] @QiaochuYuan 💜 18\ne.g. with this example in the next tweet: why did he decide to stop joking about being broke when he did? did a part of him anticipate that he was about to start making more money? https://t.co/U8Otk7feS7\n  [Quoting @visakanv: I used to joke about being broke and I started making more money when I decided that I wasn’t gonna do that anymore]\n↓\n1421540136811069444 [2021-07-31] @QiaochuYuan 💜 8\nthese are the kinds of questions i start asking myself after being on an astrology podcast. actually @maybegray @sadalsvvd would love to hear your thoughts here, how do you guys reconcile astrology with will and intention?\n↓\n1421540689599352834 [2021-07-31] @QiaochuYuan 💜 7\noh hmm maybe it’s a false dichotomy. maybe will and intention are the same thing as coming into better alignment with the future. wack. i can sort of see the possibility intellectually but i don’t grok it at all really\n↓\n1421543964792922112 [2021-07-31] @QiaochuYuan 💜 10\nanyway tbc this doesn’t really affect visa’s conclusion either way; i def agree that it pays off to be more careful about your words. but maybe there are people who are destined to do that after coming across the idea and there are people who aren’t 😬\n↓\n1421549987544985601 [2021-07-31] @QiaochuYuan 💜 7\nooh i like this. so here’s a suggestion then maybe: if you’re gonna joke around, at least check if the jokes are getting stale. might as well try out fresh material https://t.co/jtfmRrLPSN\n  [Quoting Tweet 1421549172214358022 (missing)]\n\n===\n\n1422215285034074116 [2021-08-02] @NathanpmYoung 💜 2 [(SEED) type=quote_of_semantic_search]\nMany jokes are questions framed in a deniable way https://t.co/vCVPeWLOL3\n  [Quoting @visakanv: posts become reality, this should not surprise anyone anymore   what you joke about has a real chance of coming true, so as always, joke about the outcomes you want https://t.co/REXzPMK85j]\n\n===\n\n1426224566930534410 [2021-08-13] @QiaochuYuan 💜 29\nplanning on going to the airport in a P100 just to be safe, really hoping nobody’s gonna give me any shit for it, didn’t manage to track down a second vax in time. hmm\n↓\n1426233793019408385 [2021-08-13] @QiaochuYuan 💜 9\ni also have KN95s so if they need me to do a second mask i can do that\n↓\n1426258468655095811 [2021-08-13] @QiaochuYuan 💜 12\nwow putting a P100 on immediately makes me feel like i'm at burning man again lmao\n↓\n1426258777385226240 [2021-08-13] @QiaochuYuan 💜 7\nholy crap this thing is filtering the air so good\n↓\n1426260268833595395 [2021-08-13] @QiaochuYuan 💜 10\nlowkey don't want to take this off after i land the air feels so good in here\n↓\n1426263247418650626 [2021-08-13] @QiaochuYuan 💜 23\nromcom meet-cute where there's exactly one other person at the airport wearing a P100 and it's a cute girl and we get married\n\nhaha jk unless...?\n↓\n1426264153233129475 [2021-08-13] @QiaochuYuan 💜 20 [(SEED) type=quote_of_root]\nam i doing this right visa\n\nhttps://t.co/UtbgnxVh6M\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n├── 1426290740347367429 [2021-08-13] @QiaochuYuan 💜 3\n│   there was some kind of important-sounding announcement about my flight but i didn’t catch most of it. a bunch of people are lining up and i am just going to hope i don’t have to. i think they said a connection was delayed but i am flying directly so... probably fine?\n└── 1426297935944306689 [2021-08-13] @visakanv 💜 1\n    @QiaochuYuan Yep\n    ↓\n    1426299094939496448 [2021-08-13] @QiaochuYuan 💜 1\n    @visakanv it didn’t happen but maybe she’ll be in seattle\n\n===\n\n1458720657928175624 [2021-11-11] @visakanv 💜 100\ni miss this guy so much https://t.co/sS6UiuVcOJ\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1458732152502120448 [2021-11-11] @visakanv 💜 24\nit's quite a trippy experience to have someone devote months of their life to parodying you, it's like having a guy following you around with a circus mirror\n↓\n1458732449601515522 [2021-11-11] @visakanv 💜 35 🔁 1\nthe part where I call his bluff tho: he can repeat after me about long games, but he couldn't play this game longer than 9 months. weak. at least minimum 9 years to be a respectable VV parody account\n↓\n1458732693110210561 [2021-11-11] @visakanv 💜 37\nmore seriously, how I'm choosing to spin it is, he kept reading my tweets, kept repeating my talking points about doing what you love, and eventually realized that he didn't love wasting his precious time on this earth being a parody account. I hope he is living his best life now\n↓\n1458733127732396039 [2021-11-11] @visakanv 💜 19\nit is possible to do parodies from a place of joy, Weird Al is a delightful example of this, and he's been doing it for decades\n↓\n1458733481719066627 [2021-11-11] @visakanv 💜 29 🔁 1 [(SEED) type=semantic_search]\nyou can't keep making fun of a thing without having some of it seep into you via osmosis, so be careful about what you choose to make fun of, and joke about the outcomes you want \nhttps://t.co/fqmn3X3T8Q\n  [Quoting Tweet 1435406109183934464 (missing)]\n↓\n1459749408866639874 [2021-11-14] @Malcolm_Ocean 💜 3 🔁 1\n@visakanv &gt; you can't keep making fun of a thing without having some of it seep into you via osmosis\n\nreminds me of this brilliant short story\nhttps://t.co/4Yfjl63a0z\n  [Quoting Tweet 1191578402383249409 (missing)]\n\n===\n\n1471225728880586753 [2021-12-15] @neats29 💜 13 💬 1 [(SEED) type=quote_of_root]\nhow funny would it be if I wound up working in the personal growth/healing line of work 😂\n\ngrowing up I used to feel emotions very intensely and was prone to existential thinking, even at 5. I dampened these as a survival strategy but have spent many years unravelling it https://t.co/pz9UQtxdid\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1471225731002863627 [2021-12-15] @neats29 💜 3\nI've learnt a tremendous amount in this time. it's a very deep and fascinating rabbit hole that never ceases to amaze. the vagus nerve anyone?\n\nincidentally I've been grappling with the idea of \"meaning\" and how to make sense of it, perhaps helping others heal would be rewarding\n↓\n1471225732785446913 [2021-12-15] @neats29 💜 4\nthere's a hubris to wanting to heal others, and I don't currently have a desire to, or feel qualified to do so, but I have a (perhaps naive) belief that when you keep pursuing something, your repertoire grows and eventually, serendipitously, you end up giving it back to others.\n↓\n1471225734236672004 [2021-12-15] @neats29 💜 2\nso to even pose the thought is funny to me, hence the jokiness element of it, but there's also often some truth to most jokes 🤷‍♀️\n\n===\n\n1477838709454036995 [2022-01-03] @visakanv 💜 102\nOk I need some help for the final stretch: can you tell me about any of my tweets, talking points, etc that you found personally helpful? Would be great if you can point to it, but if you only vaguely remember it that’s also useful\n↓\n1477839388918833155 [2022-01-03] @ulkar_aghayeva 💜 36 [(SEED) type=quote_of_root]\n@visakanv definitely this one, among manyhttps://t.co/InuXC19D0j\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n├── 1477839961806286853 [2022-01-03] @ulkar_aghayeva 💜 3\n│   @visakanv and this one too! i'm trying to work on this rn :)https://t.co/dtrvKtNhIU\n│     [Quoting @visakanv: one of my recurring talking points to anybody who's willing to listen:   any small group of people loosely-but-truly aligned on something can create powerful vectors by producing public-facing work that's directed at each other  talking about the creation of scenes, basically]\n├── 1477839966432415746 [2022-01-03] @visakanv 💜 23\n│   @ulkar_aghayeva OH MAN can you believe this isn’t in the book 💀 I have to fix this immediately\n│   ↓\n│   1477845236176982020 [2022-01-03] @QiaochuYuan 💜 7\n│   @visakanv @ulkar_aghayeva probably obvious but for me this is a corollary of \"focus on what you want\"\n│   ↓\n│   1477850712415432704 [2022-01-03] @tnorthcutt 💜 4\n│   @QiaochuYuan @visakanv @ulkar_aghayeva and also goes with the classic @visakanv + @sharanvkaur “what gets measured gets managed” https://t.co/69cSIHpiuv\n│     [Quoting @visakanv: me: I love you  wife: how much  me: why this obsession with quantification   wife: what gets measured gets managed]\n└── 1477842683456598017 [2022-01-03] @CountJ0ecool 💜 2\n    @ulkar_aghayeva @visakanv I was just thinking about this one yesterday\n    Realized I was joking about something \"because I secretly wanted to see it happen\", and realized that the things I joke about are things I'm spending my attention on, and thus setting an intention towards things turning out that way\n    ↓\n    1477843758528053252 [2022-01-03] @ulkar_aghayeva 💜 3\n    @CountJ0ecool @visakanv yes, for me as well this was a completely new insight from Visa, and i'm now more intentional with my jokes :)\n\n===\n\n1483440674624409602 [2022-01-18] @easoncxz  [(SEED) type=quote_of_root]\nSuch a good thread. https://t.co/QkPKLc2GuB\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1483441279342346240 [2022-01-18] @easoncxz \nIn the spirit of the thread, let me make this joke now:\n\nI'm about to move somewhere where the social norm is anti-social/introverted, and I feel great about it -- I already have that in common with them, so I'll probably make loads of good friends there!\n\n===\n\n1488501124403544068 [2022-02-01] @NathanpmYoung 💜 3 [(SEED) type=quote_of_root]\nWas thinking about this with all the jokes about Boris Johnson and Trump leading their respective countries. It was all a joke, until it wasn't. https://t.co/K8tFR1oZUl\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1491100129134538754 [2022-02-08] @tasshinfogleman 💜 15\nfondly remembering the time pinboard asked for user advice from the fanfic community, and wishing twitter would do the same from tpothttps://t.co/jgmv46UzBZ\n  [Quoting Tweet 119038600250789889 (missing)]\n↓\n1493976067501174785 [2022-02-16] @tasshinfogleman 💜 24\nmy prayers... are being answered???? https://t.co/IiFCtGAOG7\nImages:\n  - [Image #0] The image is a screenshot of an email on a mobile device. The email is from \"research@twitter.com\" and invites the recipient to participate in a Twitter user research study.\n    \n    The email is displayed in a clean and simple format, with a white background and black text. The Twitter logo is prominently displayed at the top of the email, accompanied by a brief greeting and an introduction to the study.\n    \n    The main body of the email outlines the details of the study, including the format (1:1 interviews with a researcher), the duration (approximately 75 minutes), and the requirements for participation (being at least 18 years old, having access to the internet, and allowing video and audio recording).\n    \n    To participate, the recipient is asked to fill out a questionnaire, which is linked at the bottom of the email. The email also includes a note that the recipient does not need to be a Twitter user to participate.\n    \n    Overall, the email is clear and concise, providing all the necessary information for the recipient to decide whether to participate in the study.\n↓\n1493976996925218819 [2022-02-16] @visakanv 💜 33 🔁 3 💬 2 [(SEED) type=semantic_search]\n@tasshinfogleman always joke about the outcomes you want\n↓\n1493977429131599872 [2022-02-16] @tasshinfogleman 💜 6\n@visakanv it's like I know that and then it's always so delightfully surprising when it works 🤣\n↓\n1493982494466658312 [2022-02-16] @tasshinfogleman 💜 10\n@visakanv wait it gets better, they might want to PAY ME to talk to them about how to improve Twitter?!?!?! https://t.co/3A3omMhOzg\nImages:\n  - [Image #0] The image displays a notice about a screener and interview process, with the text: \"**Please note that you will not be compensated for responding to this screener; you will receive an incentive only if you participate in and complete the 1:1 interview.**\" The text is in black, on a white background.\n\n===\n\n1499092420843085824 [2022-03-02] @tasshinfogleman 💜 17 🔁 2\n. @yochanting i hope you get to see this video I made with @DnlJW_shington and @ZacharyHundley - your videos have deeply inspired me 🙏 https://t.co/JadGtND6Om\n  [Quoting @tasshinfogleman: you’re tasshin, loving the whole universe [music video] https://t.co/SncXFNtSRU]\n↓\n1499092422067822592 [2022-03-02] @tasshinfogleman 💜 7\nwould love to collaborate one day ❤️\n↓\n1499094901799239684 [2022-03-02] @RichDecibels 💜 5\n@tasshinfogleman yes!! let's see that combo 😍\n↓\n1499095262156910593 [2022-03-02] @tasshinfogleman 💜 3 [(SEED) type=quote_of_semantic_search]\n@RichDecibels https://t.co/UaFHmCuWEi\n  [Quoting @visakanv: @tasshinfogleman always joke about the outcomes you want]\n\n===\n\n1499095993228267520 [2022-03-02] @QiaochuYuan 💜 118 💬 1 [(SEED) type=quote_of_semantic_search]\nhaha wouldn't it be funny if i met my future wife at vibecamp https://t.co/2dsOKTeIwZ\n  [Quoting @visakanv: @tasshinfogleman always joke about the outcomes you want]\n↓\n1499096822907908096 [2022-03-02] @RichDecibels 💜 20\n@QiaochuYuan did you hear the one about QC getting the lay of his life at vibecamp and then subsequently marrying forever\n↓\n1499098192519974913 [2022-03-02] @QiaochuYuan 💜 11\n@RichDecibels hey i may be easy but i'm not that easy\n\nwe are going to share some passionate kisses and i am going to leave her begging for more, obviously\n\n===\n\n1499718453812506629 [2022-03-04] @pepijndevos 💜 1 [(SEED) type=quote_of_root]\nlmao would be funny if russia undergoes the  hitler-&gt;merkel transformation. hilarious even. foreign minister besties https://t.co/ReBezWACtF https://t.co/sWzVYINxal\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1504726237415104522 [2022-03-18] @pepijndevos  [(SEED) type=quote_of_root]\nI wonder if this is why \"Joe Knife\" becomes a surgeon etc. Nothing forces you to take a job related to your name but you will become aware of such options. Imagine your name is \"Mathew\" and you're trying to pick a degree and you aren't bad at math. Ay lmao math degree. https://t.co/ReBezWACtF\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1509635715247718403 [2022-03-31] @AskYatharth 💜 14\n1. portugal castle (@nosilverv @exGenesis)\n2. vibecamp (@gptbrooke and co)\n3. what else?? https://t.co/fea0NU35CS\n  [Quoting Tweet 1509562196245811204 (missing)]\n↓\n1509636107754881025 [2022-03-31] @AskYatharth 💜 1 [(SEED) type=quote_of_semantic_search]\nhttps://t.co/9m9w1p3R8C\n  [Quoting @visakanv: 20. joke about the outcomes you want https://t.co/L3QHbwSh1k]\n\n===\n\n1509991203697164288 [2022-04-01] @QiaochuYuan 💜 9 [(SEED) type=quote_of_root]\napril fools day is the day where you just RT and QT this thread a lot https://t.co/Q6nHt6scM6\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1510738485564506116 [2022-04-03] @QiaochuYuan 💜 52 🔁 1\na few years ago i started replacing “believer” in my internal monologue with “belieber” as a justin bieber joke and now i can’t stop\n↓\n1510740559886893063 [2022-04-03] @QiaochuYuan 💜 20\netymologically it *almost* checks out, “believe” and the german “liebe” actually share the same root meaning love. sadly “bieber” appears to mean beaver https://t.co/dlBw8pf0dS\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1510740890809118726 [2022-04-03] @QiaochuYuan 💜 23 [(SEED) type=quote_of_root]\nanyway don’t make my mistakes https://t.co/Q6nHt6scM6\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1510848636782931968 [2022-04-04] @visakanv 💜 8\n@QiaochuYuan https://t.co/om0EZtIBuJ\n  [Quoting Tweet 988782759366791174 (missing)]\n↓\n1510849525274984454 [2022-04-04] @QiaochuYuan 💜 3\n@visakanv the really fucked up question is, did this only happen because i read this tweet and started beliebing that things like this would happen\n↓\n1510849713603444736 [2022-04-04] @visakanv 💜 3\n@QiaochuYuan Tbh I don’t think so I think this is true even if you don’t know it\n↓\n1510849820071669763 [2022-04-04] @visakanv 💜 4\n@QiaochuYuan Eg https://t.co/Pu3xZQeiQM\n  [Quoting @visakanv: 29. just discovered /r/enoughpetersonspam, where 31,000+ people voluntarily subscribe to posts about Jordan Peterson, including posts indicating  shock at reddit suggesting that maybe they might be interested in Jordan Peterson https://t.co/SnGQ7iSuWf]\n↓\n1510850028155260931 [2022-04-04] @QiaochuYuan 💜 2\n@visakanv haha yeah this one is pretty good\n\n===\n\n1511884973208489991 [2022-04-07] @ultimape 💜 15\nI love reading about all these fancy ways to gain muscle and seeing my grip strength increase without doing fuck all. https://t.co/WburX4sLZw\n  [Quoting Tweet 1511862028452999169 (missing)]\n\n===\n\n1843153112317731187 [2024-10-07] @ultimape 💜 1\nMy well balanced primate diet is going to include all the ingredients necessary to regrow a brain.https://t.co/hwtGN5CQUf\n  [Quoting @ultimape: @Evolving_Moloch Modeling this as a cholesterol/fat/lipid driven bias that interacts with the immune system makes a lot of these weird behaviors fall into place. Like the idea that a chimp would target brain and liver opportunistically.https://t.co/yiIACGnTn3]\n↓\n1843153996283810081 [2024-10-07] @ultimape 💜 5\nThe last time I learned about a horse food craze, I learned that I could have just bought Ivermectin from a farm supply store and massively lower the risk of getting parasites from the dog FMT I did.https://t.co/KBxsdjQy8V\n  [Quoting @ultimape: MM... Apple flavored horse dewormer might cure brain cancer by the same pathway that ubiquinol impacts neurodegenerative disease like Multiple Sclerosis?Fake news.https://t.co/GwB7rAzesD https://t.co/vttbdx2Dvk]\n↓\n1843163560031269162 [2024-10-07] @ultimape 💜 5\nUltimApe is officially GorillaMaxxing.I also picked up a local Vermont brand of Miso and Natto to ensure I have the enzymes in me to digest the soy.Miso taste like ketchup and will go good with the biscuits.https://t.co/t5sSCCGf9B https://t.co/xeEPVs4NeE\n  [Quoting @ultimape: @nosilverv @0x49fa98 Hashtag GorillaMaxxing\"•Zinc deficiency could be a crucial issue in sport performance for athletes.•Exercise could modulate zinc serum and cellular homeostasis.•Zinc is part of proteostatic systems critical during exercise.\"https://t.co/IoHMzWzqT3https://t.co/3uCAogMves]\nImages:\n  - [Image #0] The image shows a refrigerator shelf with various food and drink items. The visible items include a bottle of apple cider vinegar, a bottle of probiotics, a large jug of apple cider, a jar of miso, and a container of natto.\n↓\n1843164157014835489 [2024-10-07] @ultimape 💜 3\nMiso is gonna let me digest the phytates and turn them into good stuff. https://t.co/pL3bknobxW\nImages:\n  - [Image #0] The image shows a tweet from \"Mg2+ Papi, the BowTied Mg2+\" with a reply to \"@Grimhood\" that reads, \"Miso contains the phytase enzyme so you get better digestion and nutrient absorption out of any vegetable.\" The tweet has 1 reply, 1 retweet, 1 like, and 34 views. The background is black, and the text is white. The original tweet is from \"UltimApe's Monster\" and says, \"It's so salty, I love it.\"\n↓\n1843394890538869241 [2024-10-07] @ultimape 💜 5\nFormally requesting access to parasite free gorilla feces for me to experiment with.https://t.co/79Lhw3beXS\n  [Quoting Tweet 1601927249556643840 (missing)]\n↓\n1843401002214731822 [2024-10-07] @ultimape 💜 2\nBefore my FMT 3 years ago, I would have never dreamed of being able to eat a plant based diet. Now I'm going to become based.https://t.co/TyvBLI2gio\n  [Quoting @ultimape: @VeganReignmaker Reducing initial antinutrient load seems to be more than enough to let what I now have in my gut to cover the rest. Between the improved mucus barrier and what little phytate digestion happens in my gut, it doesn't cause me problems anymore.]\n↓\n1843401818661175343 [2024-10-07] @ultimape \nI will become good.https://t.co/LxuY5rqOt3\n  [Quoting @ultimape: I want to become vegan.https://t.co/4tLnc1PTnW https://t.co/Yey3C9w88n]\n↓\n1843402165542670391 [2024-10-07] @ultimape 💜 1\n🙏 RIP my friend, you are still an inspiration after all these years. Thank you for your wisdom @Grognorhttps://t.co/acZVsoltLb\n  [Quoting @ultimape: @bennymaloneUK @DoctorTro I'm a grown human adult who's spent most of his adult life trying to figure out why veganism made my mom lose her ability to walk and what to do about.https://t.co/YDSVaiMeQ4]\n↓\n1844410418862883319 [2024-10-10] @ultimape \n\"Eating ANIMAL FOOD to ascend and leave humanity behind\"https://t.co/0axLuRnrMq\n↓\n1844416683391451219 [2024-10-10] @ultimape \nI will become good.https://t.co/o4hmcBeVt0\n  [Quoting @ultimape: I don't make idle jokes.This place currently has a \"Buddhism for AI\" program.https://t.co/v6CJJkOxqAAttached is a screenshot from my email from before covid. @dthorson can confirm (he replied)I still want to do this.https://t.co/daVqSXN0Cz https://t.co/Aj6lO5nA9d]\n↓\n1844417402899136598 [2024-10-10] @ultimape 💜 1 [(SEED) type=quote_of_root]\nJoke about a outcomes you want.https://t.co/KA0vpWCYus\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1844455665911333304 [2024-10-10] @ultimape 💜 3 🔁 1\nI joked about becoming a monkey king.And now I have Primate food.https://t.co/oBldOJIwVx https://t.co/CbnOrzdopM\n  [Quoting @ultimape: @atypicalhippy @Bonecondor @BackyardBrains Thankfully we can compare chimps and gorillas to their monkey ancestors to try and figure out how to avoid a penis bone while still having a proper backbone'd tail (gorilla are the opposite: penis bone but no tail)]\nImages:\n  - [Image #0] The image shows a bag of primate food on a cluttered desk, accompanied by a bowl of the food. The bag is white with a purple and black design, featuring a monkey on it, and has the text \"Mazuri Primate Diet\" printed on it. \n    \n    To recreate the image, one would need to arrange a cluttered desk with a computer, headphones, and other items, place the bag of primate food on the desk, and put a bowl of the food next to it. The bag should be positioned upright, with the label facing outward, and the bowl should be filled with the same type of food as in the bag.\n↓\n1844458074196889974 [2024-10-10] @ultimape \nDon't tell me how to pray.https://t.co/mGYbxAK7kmhttps://t.co/SN05ctv17I https://t.co/rR4sqoRHQO\n  [Quoting @ultimape: \"Madness Is Like Gravity, All it takes Is A Little Push.\"— Some trickster god story recapitulating an archetype.https://t.co/AgsA1Frb4OI am the dog faced monkey - an ape who calls himself puppy. A lunatic who wants to eat the moon's immortality.https://t.co/oparbGI0lJ]\nImages:\n  - [Image #0] The image depicts a statue of the Hindu deity Hanuman, standing in front of an intricately carved stone structure. The statue is painted in shades of green, gold, and red, with Hanuman holding a pink flower in his hands together in prayer.\n    \n    * The statue:\n    \t+ Painted in shades of green, gold, and red\n    \t+ Depicts Hanuman with a monkey face and human body\n    \t+ Wearing a dhoti and jewelry\n    \t+ Holding a pink flower in his hands together in prayer\n    \t+ Standing on a circular base\n    * The stone structure:\n    \t+ Intricately carved with floral patterns and designs\n    \t+ Colored in shades of blue and gold\n    \t+ Features a red roof with gold accents\n    \t+ Has a doorway or entrance behind the statue\n    * The base of the statue:\n    \t+ Circular and made of stone\n    \t+ Has a small plaque with text on it (not legible)\n    \t+ Surrounded by flower petals\n    \n    The image appears to be taken at a Hindu temple or shrine, with the statue of Hanuman being a central feature. The intricate carvings and colorful decorations suggest a place of worship and reverence.\n↓\n1844458446768439411 [2024-10-10] @ultimape \nWoof.https://t.co/wU85Q3hObg\n  [Quoting @ultimape: @pee_zombie @ecree429 @esrtweet woof\"Aani is the dog-headed ape sacred to the Egyptian god Thoth.\" https://t.co/ImHLaTFB7xhttps://t.co/ULc51dCvbA]\n↓\n1844459239278055900 [2024-10-10] @ultimape 💜 1\nA dog who fetches mountains.https://t.co/mxMQv0o8tX\n  [Quoting @ultimape: @nosilverv @0x49fa98 Wim hoff, talking to the strongest man in the world, about a mountain full of herbs.I know this story because I want to be an avatar of the monkey king. https://t.co/PvGqtuJ9pZ]\n↓\n1844474434700390536 [2024-10-10] @ultimape 💜 1\n\"We found that within fibre types, chimp and human muscle fibres were actually very similar. However, we also found that chimps have about twice as many fast-twitch fibres as humans,\" https://t.co/pP52ozRsDw🧐https://t.co/RSM5sBt1bm\n  [Quoting @ultimape: I'm not training to grow my grip strength thru muscles. I'm training to increase my tendon strength and nerve function so I can support more muscle without my tendons ripping off my body. https://t.co/Rl6L2XfDJV]\n↓\n1844500812829163552 [2024-10-10] @ultimape 💜 1 🔁 1\nThey are yummy.https://t.co/jP5WUGbghG\n↓\n1844573447805972974 [2024-10-11] @ultimape 💜 1 🔁 1\nLast time I ate these, they made my Crohn's symptoms flair really bad. No issues so far.\n↓\n1844573682481459291 [2024-10-11] @ultimape \nThinking a lot about what a healthy gorilla diet might be in the wild.https://t.co/3PuEvyIzN2\n  [Quoting @ultimape: Gorilla ⇒ MonkeyGiraffe ⇒ Forest DeerGenotyping Gorilla scat, find Monkey and Deer DNA.\"The discovery raises the possibility that gorillas might have a secret meat habit—scavenging or hunting discretely.\"https://t.co/EJCk8wHLmyIs this origin of Sasquatch myths🤔]\n↓\n1844573919866405314 [2024-10-11] @ultimape \nWhat they eat?https://t.co/kGnxyfWWTV\n  [Quoting @ultimape: Turns out the research on it is relatively new, and people were just parroting their assumptions.\"Gut microbiomes of wild great apes fluctuate seasonally in response to diet\" https://t.co/VZ3kRcP2IM]\n↓\n1844574476991656256 [2024-10-11] @ultimape 💜 1\nOh no.https://t.co/UhmiF7cWK6\n  [Quoting @ultimape: Tired: Plant based burger substituteWired: Cloned meat based cruelty free burgerInspired: Some fungus are carniviorous, lets eat them.Hired: Westerns afraid of fat and cholesterol, necessary for the production of vitamin D, may be promoting stroke https://t.co/gOyN5SwD1v]\n\n===\n\n1512131837304483843 [2022-04-07] @wayfaring_tim \nChapter 2: Be impeccable with your word \n\nThis chapter helped me understand the importance of speaking with consideration.\n↓\n1512131839439298561 [2022-04-07] @wayfaring_tim \nTo speak \"impeccably\" is not just to speak flawlessly but to speak without sin (\"impeccable\" originates from the Latin word for sin, \"pecatus\"). This framing encourages us consider our words in relation to our values.\n↓\n1512131841737871362 [2022-04-07] @wayfaring_tim 💜 1\nThe notion of \"sin\" has unhelpful connotations so I try to see it in terms of love. For me, to speak impeccably means to me to speak with love.\n↓\n1512131844027867138 [2022-04-07] @wayfaring_tim 💜 1\n\"The word is not just a sound ... the word is a force; it is the power you have to express and communicate, to think and thereby to create events in your life.\"\n\nYour word is a your way to manifest your intention, to bring what you believe to life.\n↓\n1512131846603223050 [2022-04-07] @wayfaring_tim  [(SEED) type=quote_of_root]\nUse it carelessly and you will manifest cruelty, use it kindly you will manifest kindness. \n\nhttps://t.co/U4YLOeVOyU\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1512131849681833989 [2022-04-07] @wayfaring_tim 💜 1 🔁 1\nWe can be sloppy when it comes to those we are close to because we assume that they understand our inner world, but no one can read your mind.\n↓\n1512131852525518850 [2022-04-07] @wayfaring_tim 💜 1\nIt is actually when we speak to the ones close to us that we should be most careful as they are the ones that trust our word the most.\n↓\n1512131855188992004 [2022-04-07] @wayfaring_tim \nBeing impeccable means to make an active choice to remove negative energy from your words before speaking. If you are having a bad day, it means you have a choice in how you present it to others with your speech.\n↓\n1512131857713967104 [2022-04-07] @wayfaring_tim \nBy thinking before speaking you have the chance to decide that any negative energy you are carrying stops with you.\n↓\n1512131859999870980 [2022-04-07] @wayfaring_tim \nWe can elegantly avoid hurt by giving context to our statements. Telling someone to be quiet is very different from telling someone to be quiet because you have a headache.\n↓\n1512131864601010179 [2022-04-07] @wayfaring_tim 💜 1\nPutting someone close to you down (consciously or subconsciously) can warp the way they see themselves. Similarly, praise given by a loved one can be kept like a precious jewel that shines even in the darkest of times.\n↓\n1512131866865897475 [2022-04-07] @wayfaring_tim \nHow we speak to others applies also to how we speak to ourselves.\n\nhttps://t.co/AT3hr07NUJ\n  [Quoting @wayfaring_tim: although we speak with many, the person we hear most often is ourselves. be kind in what you say for what you say, you say to yourself. https://t.co/cTlupVAra7]\n↓\n1512131870624043012 [2022-04-07] @wayfaring_tim 💜 1\nYour words are the magic through which you relate to the world. Speak with love and you shall manifest love.\n↓\n1512131873622966272 [2022-04-07] @wayfaring_tim \nThe main thread:\nhttps://t.co/t6aiBuep4d\n  [Quoting @wayfaring_tim: The Four Agreements by Miguel Ruiz.   I found some truth in here even if I would have preferred if he didn't frame it as \"wisdom from an ancient tribe in Mexico\" but sometimes one just has to lean into the theatre. https://t.co/nvlUIij378]\n\n===\n\n1520420766763913217 [2022-04-30] @eshear 💜 9 [(SEED) type=semantic_search]\nThou shalt joke only about the outcomes you want. https://t.co/vkLIq3vYTc\n  [Quoting Tweet 1520410582977069056 (missing)]\n\n===\n\n1523694170753634304 [2022-05-09] @mold_time 💜 56 🔁 8\nThis is a job posting, but we’re not hiring. Reddit is hiring. Well, not REDDIT. The abstract spirit of reddit is hiring. The universe is hiring. \n\nhttps://t.co/krgMioxZtb\n↓\n1524181868366729217 [2022-05-11] @mold_time 💜 10 🔁 3\nwow someone should really do a study\n\nhttps://t.co/C5MxWEkeKI\n  [Quoting Tweet 1524082593951592449 (missing)]\n↓\n1524182542945079296 [2022-05-11] @mold_time 💜 7\nbut we'd need some kind of... Chronic Virology Czar, haha what a stupid idea right\n↓\n1524182937733894145 [2022-05-11] @mold_time 💜 6 🔁 1 [(SEED) type=quote_of_semantic_search]\nhttps://t.co/UuIHBe3PGQ\n  [Quoting @visakanv: 20. joke about the outcomes you want https://t.co/L3QHbwSh1k]\n\n===\n\n1526608630509973504 [2022-05-17] @DanielleFong  [(SEED) type=quote_of_semantic_search]\nRT @mold_time: https://t.co/UuIHBe3PGQ\n  [Quoting @visakanv: 20. joke about the outcomes you want https://t.co/L3QHbwSh1k]\n\n===\n\n1542224665313251329 [2022-06-29] @blisstweeting 💜 4 [(SEED) type=quote_of_root]\nI'm seeing a lot of jokes (?) in the form \"Xs are bad\" or \"Ys are ugly\" or \"Zs don't add utility\" lately and those jokes are starting to worry me.\n\nFolks, please. Joke about the outcomes you want. https://t.co/VwcAiulCIX\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1542225197851463684 [2022-06-29] @blisstweeting 💜 2\nThis is especially worrying since I've got a considerably strongly curated timeline.\n\n===\n\n1543284713271730176 [2022-07-02] @visakanv 💜 52\nindulge me? 🤓🙏🏾 which of my tweets/threads do you have saved, reference, etc? i'm making yet another list\n\n===\n\n1543646092822478848 [2022-07-03] @zrkrlc \nhttps://t.co/PDV9VO5YUN\n  [Quoting @visakanv: sloppy thread of a buncha stuff that i think/believe, that are maybe not super widespread, idk]\n↓\n1543646184048594944 [2022-07-03] @zrkrlc \nhttps://t.co/mmLTodRat3\n  [Quoting @visakanv: I am once again asking y’all to watch this guy go from like a 5 to a 9 in sex appeal in seconds https://t.co/dOPKyFyI7m]\n↓\n1543646285634637825 [2022-07-03] @zrkrlc \nhttps://t.co/xBOvBOQ5ZB\n  [Quoting @visakanv: The most powerful IRL interview/conversation/flirting skill isn’t asking good questions nearly as much as asking good followup questions - it’s being sensitive to interesting micro-reactions. When you ask a question and they respond “😂... no”, and you go “Why 😂?” Etc]\n↓\n1543646364353327104 [2022-07-03] @zrkrlc \nhttps://t.co/D6oPbNNU7X\n  [Quoting @visakanv: “Only when we accept unconditionally people whose values differ from our own can we really say that we have finished tidying.” – Marie Kondo]\n↓\n1543646434041679872 [2022-07-03] @zrkrlc 💜 1\nhttps://t.co/oyQjQYM1N4\n  [Quoting @visakanv: anyway this was about Dua Lipa - she’s already moderately big now, roughly around “you belong with me” era Taylor or “SOS” era Rihanna - at age 23. She’s thoughtful, sensitive, smart, in-tune: she’s going to be much, much bigger if she keeps up what she’s doing https://t.co/tshPFphzL2]\n↓\n1543646500261351424 [2022-07-03] @zrkrlc 💜 2\nhttps://t.co/D0V17EagBA\n  [Quoting @visakanv: when I first started making videos of myself talking, I was stiff, awkward, nervous, anxious, frozen. but I kept at it, because I wanted to git gud. I believed that I could learn to become confident and charismatic on camera. here's some of that journey: https://t.co/MSllrsufdQ]\n↓\n1543646602082291712 [2022-07-03] @zrkrlc \nhttps://t.co/vEuxghQYvl\n  [Quoting @visakanv: a @sighswoon classic: https://t.co/lRRS2x2OSm]\n↓\n1543646665856659456 [2022-07-03] @zrkrlc \nhttps://t.co/Jrwx5PNrLa\n  [Quoting @visakanv: \"The problem most people have with marriages that fail is that they go in thinking, \"This person will make me happy.\" The fuck they will.\"  \"You aren't signing on for happiness. You are signing on for sharing human life, and a human life is a complete chaotic crazy mess.\" https://t.co/YucqwcSgpg]\n↓\n1543646758773092353 [2022-07-03] @zrkrlc \nhttps://t.co/O02cyWPcDQ\n  [Quoting @visakanv: @eigenrobot Ancient Greek, sucking a dick: gods, this is so gay  his buddy, getting his dick sucked: what the fuck is gay]\n↓\n1543646823541526528 [2022-07-03] @zrkrlc \nhttps://t.co/biAnbvPIy3\n  [Quoting @visakanv: millionaire vs billionaire https://t.co/NSkUxkM4iD]\n↓\n1543646901752709120 [2022-07-03] @zrkrlc  [(SEED) type=quote_of_root]\nhttps://t.co/PvjA3dhsn8\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1543647020904501251 [2022-07-03] @zrkrlc \nhttps://t.co/U4kWj50STI\n  [Quoting @visakanv: was having a chat with a prospective consulting client and they had a very impressive list of \"things to improve\" re: their brand new first-vid-live youtube channel. detailed notes. and I found myself saying... this is really cool, but I actually wouldn't worry about any of this]\n↓\n1543647113158230016 [2022-07-03] @zrkrlc \nhttps://t.co/snZ0YcGJ16\n  [Quoting @visakanv: https://t.co/R8aiysJg5e]\n↓\n1543647192380243968 [2022-07-03] @zrkrlc \nhttps://t.co/XqhWJTQJyY\n  [Quoting @visakanv: 1. mice raised in a warm nest with plenty of food scurried home immediately when subjected to loud, intrusive noises.  2. mice raised in noisy homes with little food similarly returned home EVEN WHEN BEING IN MORE PLEASANT ENVIRONMENTS.  I guess home is home even if it's hell]\n↓\n1543647274534064128 [2022-07-03] @zrkrlc \nhttps://t.co/FpibKnu3yh\n  [Quoting @visakanv: it’s funny how when I was a teenager I was 100% convinced that if I put this stuff in my hair girls would like me more https://t.co/oOktnptcYQ]\n↓\n1543647439252783104 [2022-07-03] @zrkrlc 💜 1\nhttps://t.co/txmaGdZE4y\n  [Quoting @visakanv: being able to appropriately bring up your genuine curiosity into any random given social interaction is a superpower. it's sort of like the brainy equivalent of being able to bring out some yummy food]\n↓\n1543647500070158336 [2022-07-03] @zrkrlc \nhttps://t.co/gopULBOZXA\n  [Quoting @visakanv: 48. this was too much chemistry for two humans to have https://t.co/QuImDLb1Gb]\n↓\n1543647602230829056 [2022-07-03] @zrkrlc \nhttps://t.co/3HSUdHr3xa\n  [Quoting @visakanv: \"It costs nothing to encourage an artist, and the potential benefits are staggering.  [...]  Discourage an artist... you get absolutely nothing in return, ever.\"  https://t.co/Muq8nTTne9 https://t.co/IEWxbz2LmD]\n↓\n1543647709051355136 [2022-07-03] @zrkrlc \nhttps://t.co/huqD6C6pxD\n  [Quoting @visakanv: 🚭 it's been just about a month since i decided to stop smoking cigarettes  was smoking over 200/month last month, i had 2 with friends this month  I think i'm done with about 70% of the brainfog, feels like the worst of that is prooobably past...]\n↓\n1543647776768405504 [2022-07-03] @zrkrlc \nhttps://t.co/hlmz23En7W\n  [Quoting @visakanv: \"smaller portions!\" \"calories in, calories out!\" doesn't stick very well if you're an emotional eater who uses food to stave off your existential despair]\n↓\n1543648221884731394 [2022-07-03] @zrkrlc 💜 1\nfun fact i just finished (up to s4p1 of) aot as well! but more on this later https://t.co/d2FFSqBjn8\n  [Quoting @visakanv: damn, attack on titan has no chill…]\n\n===\n\n1548786713178374150 [2022-07-17] @Malcolm_Ocean 💜 6 🔁 1\nmy medium-term plot involves becoming a guerrilla design/product consultant for companies that don't know how to ask \"what if it were good tho?\"\n\nmostly doing this by trying to meme features into existence, tho I suspect some co could get a huge win out of hiring me for a day https://t.co/KsGHD2BghE\n  [Quoting @QiaochuYuan: short of figuring out how to get hired by twitter the best we can probably do is just talk obsessively about the features we think twitter should have until they add them  it worked for @visakanv: https://t.co/fkG7KhSrZu https://t.co/At2V1ilit7]\n↓\n1548789230327013376 [2022-07-17] @Malcolm_Ocean 💜 18 🔁 1 [(SEED) type=quote_of_semantic_search]\nhaha wouldn't it be wild if eventually someone paid me $5k/day to rant about all the obvious-to-me mistakes they're making in their interface design priorities? 😂😂\n\nhttps://t.co/wvIyu41TeR\n  [Quoting @visakanv: you might as well joke about the outcomes you want! https://t.co/l4BXsg15zT]\n\n===\n\n1550688330802536449 [2022-07-23] @lemonaut1 💜 11\nit's my intention in life to transmute hellishly painful lived experiences into heavenly blissful onesto manufacture &amp; distribute so-called \"Get-out-of-Hell-Free\" cards via psychotechnologieshttps://t.co/Fs78lsPtbp\n  [Quoting @algekalipso: If life gives you lemons, become a @lemonaut1]\n↓\n1550970236257456129 [2022-07-23] @lemonaut1 💜 5\ni guess my main method of doing this is the re-framing of hellish experiences. laughing at the cosmic absurdity of the universe, finding something hilarious about the trauma you went through, is integral to the alchemical process of transforming pain into pleasantness.\n↓\n1550970475622252544 [2022-07-23] @lemonaut1 💜 10 🔁 2\nhaving a meta-frame that \"transcends and includes\" the victim frame, and re-writes it in a positive context, is extremely important. maybe it's THE thing thats important when it comes to healing from traumatic life events.\n↓\n1550973453305401345 [2022-07-23] @lemonaut1 💜 6 [(SEED) type=quote_of_root]\nit is a survival-level need to joke about (and, in the process, create) a post-traumatic realityhttps://t.co/8As7GQTcqC\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1551094918679973888 [2022-07-24] @visakanv 💜 1\n@lemonaut1 Hell yea ❤️💪🏾🔥\n↓\n1551748401208836096 [2022-07-26] @lemonaut1 💜 1\n@visakanv Fuck yes, a visa in the wild!\n\n===\n\n1565765694519656448 [2022-09-02] @s0ulDirect0r 💜 23 🔁 2\nwouldn’t it be crazy if I got all my artist BS out of my system and I started making beautiful useful things that people could enjoy at scale?\n↓\n1565766030517063682 [2022-09-02] @s0ulDirect0r 💜 4 [(SEED) type=quote_of_root]\nhttps://t.co/geYqTQ3Mqc\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1580747914153906176 [2022-10-14] @ultimape 💜 6\nBeen kind quiet, so I will update what I've been doing the past few days.\n\n===\n\n1580750544905568256 [2022-10-14] @ultimape 💜 3\nThankfully the reason we moved (to help GF's health issue) has been mostly resolved, so she'll be able to move back home for a while without worrying about her dying. https://t.co/j1NetWKdJz\n  [Quoting @ultimape: Happy with the decisions to move. Her flair ups already much more under control and I've been able to cook for her and make healthy foods. :3https://t.co/oaVsi32YH0]\n↓\n1580751031956574208 [2022-10-14] @ultimape 💜 1\nThat living situation was miserable for me, and we wouldn't be able to do Project Viril from the tiny space I'd have.But we can't get a 12month lease with what we had budgeted... What to do?\n↓\n1580751876311511040 [2022-10-14] @ultimape 💜 10\nWell, we made a joke about Panic-buying a bus.Long story short: so Praetor Labs is now operating out of bus as of tonight!\n↓\n1580754000013856769 [2022-10-14] @ultimape 💜 7\nBy sheer luck: first entry we found on Craigslist was a pre-gutted Shortbus. For about 30% of what I would have expected to pay for a used one. The guy was using it to haul wood and didn't have space.\n↓\n1580755922053308417 [2022-10-14] @ultimape 💜 5\nSo some 260 miles later... So much room for activities! https://t.co/QLrHytVvYj\nImages:\n  - [Image #0] The image shows a man standing in the back of a van, surrounded by empty space and a few pieces of furniture. The van's interior is dimly lit, with a single light fixture hanging from the ceiling, illuminating the area.\n↓\n1580758516981108736 [2022-10-14] @ultimape 💜 2\nThe 'lab space' is 13' 3\" long, 7' 6\" wide, and 6' 2\" tall.It's going to be an interesting challenge to fit all the hackerbase things in this small space, but doable. https://t.co/mlhimE4OaF\nImages:\n  - [Image #0] The image shows a dimly lit, cluttered space with a metal wall and door on the right side. The room is filled with various items, including a ladder, a light source, and what appears to be a pile of clothing or fabric on the floor, illuminated by a faint light.\n↓\n1580760520012967936 [2022-10-14] @ultimape 💜 2\nThe neat thing about a bus like this is it's basically a moving truck with a funny opening in the back.The next few weeks will be focused on moving GF and putting some stuff in storage.\n↓\n1580761884114194432 [2022-10-14] @ultimape \nIf things go as planned, we'll be aiming for mid November to have a somewhat insulated bus with some 3d printers set up on a shelf. https://t.co/636VHzrLXs\n  [Quoting Tweet 1578914442011881473 (missing)]\n↓\n1580763630219710465 [2022-10-14] @ultimape 💜 3\nWe're still working on details, but we have some neat ideas of merging a sleeping area with modular workbench to save on space.Tired: hackerbaseWired: hackerbus\n↓\n1580765130484113410 [2022-10-14] @ultimape 💜 4\nIt's a downgrade on our current situation, so we're kinda sad. But the freedom we'll have moving forward will more than make up for it.\n↓\n1580772213959323648 [2022-10-14] @ultimape 💜 6 [(SEED) type=quote_of_root]\n\"joke about the outcomes you want\" https://t.co/8ylogeAUbU\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1581129426599043072 [2022-10-15] @ultimape 💜 1\nNow that I'm actually going nomadic, I'll be able to put my knowledge to the test!https://t.co/dnG8ujRGSc\n  [Quoting @ultimape: Spent some time to get all my Nomadic Lifestyle / Homesteading collection into a separate arena group so I can share it out to people who might be interested in them.I've watched every single thing here personally.https://t.co/c2Mzb2rZ77 https://t.co/i725HivNfk]\n↓\n1581130055237132288 [2022-10-15] @ultimape 💜 6\nFound a picture of the Bus from the outside that we took when we picked it up. https://t.co/fAGhfjtQRZ\nImages:\n  - [Image #0] The image depicts a blue bus parked on a dirt lot, with its hood open. The bus is a blue 3500 model with a white roof and features several windows along its side. The front of the bus is visible, showcasing the open hood, which reveals the engine compartment. A black umbrella is partially visible to the left of the bus, while trees with pink leaves are seen in the background. To the right of the bus, a house and another vehicle are partially visible.\n↓\n1581174330205286400 [2022-10-15] @ultimape \nStanding desk party or bust.https://t.co/hy4VDChOci\n  [Quoting @ultimape: Thanks @UpDesk! A dev's got to dev!#TMMTO: https://t.co/8YDI6KYUjs]\n↓\n1581175038543532032 [2022-10-15] @ultimape \nBalmer Energy.https://t.co/zLHnz9wZvp\n↓\n1584444955895832576 [2022-10-24] @ultimape \nWonder what it would take to go full Wild Thornberry.https://t.co/FFazmJ5JYl\n↓\n1585840401822322689 [2022-10-28] @ultimape 💜 2\nMe and @nsreed had a fun grueling day of moving heavy things. We even made really sketchy ramp to help move stuff like a bed and an extremely heavy laptop cart. https://t.co/P9BfDotGri\nImages:\n  - [Image #0] The image shows a blue and white bus parked on a cracked asphalt road, with a makeshift ramp leading into its open rear door. The ramp is constructed from a large piece of plywood and wooden planks.\n  - [Image #1] The image depicts a large, gray metal cabinet with two open doors, revealing three columns of shelves inside. The top of the cabinet holds a black plastic box and a yellow-and-black tool.\n    \n    To recreate this image, start by creating a large, gray metal cabinet with two doors that open outward. The cabinet should have three columns of shelves inside, with the top surface holding a black plastic box on the left side and a yellow-and-black tool on the right side. The cabinet is situated on a dark gray stone floor, and the background features a wooden wall or fence to the right and a white wall or window frame to the left.\n↓\n1586977389636100097 [2022-10-31] @ultimape 💜 4\nGoing to tear down my computer for now. Not sure how long until I'm back online again.I am thinking a lot about being out in the cold a lot when I started my journey to get healthy.https://t.co/CUnTgPruRy\n  [Quoting @ultimape: Balaclava + Bus = first therapy appointment achievement.Thank you everyone who helped me reach this point. http://t.co/StGcwx5Vc2]\n↓\n1587015679982592004 [2022-10-31] @ultimape 💜 6\nAlright, shutting the thing off for real. Ciao for now.\n↓\n1588750023202070528 [2022-11-05] @ultimape 💜 5\nI spent 18 hours straight packing, and another 12+ unpacking. Putting the dog shit energy to good use.Now I'm working off of my old laptop for few days while I let my body heal.\n↓\n1588751606711209984 [2022-11-05] @ultimape 💜 6\nStill tired, haha. https://t.co/x538qcmvke\nImages:\n  - [Image #0] The image shows the back of a U-Haul truck, open and filled with various items. \n    \n    The truck is parked on grass, with trees visible in the background. The rear doors are open, revealing a cluttered interior. The contents include several boxes, bags, and other household items, such as a portable heater, a plastic crate, and a black plastic crate filled with various objects. The overall atmosphere suggests that someone is in the process of moving or transporting their belongings.\n\n===\n\n1642399409609605120 [2023-04-02] @hargup13 💜 10 [(SEED) type=quote_of_root]\nI want a billion dollars in disposable cash in my business to play with, lol. https://t.co/IbN6lOIFdT\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1650429119438503936 [2023-04-24] @wayfaring_tim 💜 4 [(SEED) type=quote_of_root]\nIf I’ve learned anything in my short life, it’s when someone jokes about suicide take it very seriously https://t.co/4THa9XHFLt\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1652389020746276868 [2023-04-29] @neats29 💜 11\never since I was a kid I would have these strong convictions about something I believed happening and then it would happen, even though I had no idea HOW it was gonna happen. it’s some sort of a positive feedback cycle of things happening because you believe they would happen.\n↓\n1652389023174868996 [2023-04-29] @neats29 💜 6 🔁 1 [(SEED) type=quote_of_root]\nnow I realise it’s been one of the most helpful life philosophies. It’s a bit like visa’s joke about the outcomes you want philosophy. so this is to say, go have your convictions! 😎 https://t.co/pz9UQtxdid\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1664878415059484679 [2023-06-03] @hargup13  [(SEED) type=quote_of_root]\nThis one of my favorite threads, joke about the outcomes you want and Inshallah they will come true! https://t.co/IbN6lOIFdT\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1676641798188576768 [2023-07-05] @QiaochuYuan 💜 72 🔁 3\nthe causality of intention-setting or manifesting can be read in either direction - did the thing happen because you set the intention / manifested it, or were you *ready* to set the intention / manifest because you sensed the thing was *ready* to happen?\n↓\n1676641799283314689 [2023-07-05] @QiaochuYuan 💜 26 🔁 1 [(SEED) type=quote_of_root]\nthis is the main question i have about \"joke about the outcomes you want\" - how much control do you really have over what you joke about? it can be read as advice *or* as a description of what you're ready to joke about\n\nhttps://t.co/GSAfbaMaVc\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1676641800642269185 [2023-07-05] @QiaochuYuan 💜 29 🔁 1\niow all acts of magic can be interpreted as prophecy\n↓\n1676672846473449479 [2023-07-05] @puheenix 💜 3\n@QiaochuYuan @AbstractFairy love this. I think of causality to be at least bidirectional (past/future) and mb even more dimensional (parallel universes interacting)\n\nso, joking about the future may be a *response to* the future, or to another universe forking left as we fork right.\n\nprophecy, man.\n\n===\n\n1737538039260356989 [2023-12-20] @tasshinfogleman 💜 68 🔁 3\nfor @threadapalooza 2023 i am going to riff on my friends and internet neighbors' recurring ideas and talking pointsi thought it'd be fun to reflect on what's impacted me and try saying the same ideas in new and different ways\n↓\n1737538168583246069 [2023-12-20] @tasshinfogleman 💜 12\n1. live the days of your life weaving a loving web of friends and relationshipshttps://t.co/gLRequDoJC\n  [Quoting @mary_bajorek: end goal: leave this world held by a dense network of intimate and supportive relationships]\n↓\n1737538221188272319 [2023-12-20] @tasshinfogleman 💜 9\n2. try new things, make new mistakes, learn new lessons—fail differently, fail brilliantlyhttps://t.co/ZK6JQO2R6a\n  [Quoting @strangestloop: Make different mistakes in order to progress. Look at every dimension of the problem and try to tackle it from a broader or narrower or higher or lower or parallel or perpendicular perspective to see something you were previously missing and to learn from your different mistakes.]\n↓\n1737538267350802868 [2023-12-20] @tasshinfogleman 💜 8\n3. worldbuilding is for me and you and all our friends. imagine characters and worlds that bring you joy, for yourself, just becausehttps://t.co/No9NB2CWvb\n  [Quoting Tweet 1473044713263575046 (missing)]\n↓\n1737538327899726128 [2023-12-20] @tasshinfogleman 💜 9\n4. plan your days and your life so that you shine even on your hardest and worst days, so that you still work even when everything else changes and breakshttps://t.co/Vx9EV0AbkU\n  [Quoting @uberstuber: Design your systems for the laziest, most exhausted version of you]\n↓\n1737538367695311000 [2023-12-20] @tasshinfogleman 💜 9 [(SEED) type=quote_of_root]\n5. laugh your way into futures you want to create; learn to tell jokes that are portals to the worlds you want to live inhttps://t.co/szOd7QOJNc\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1737538416475025618 [2023-12-20] @tasshinfogleman 💜 10\n6. you're \"procrastinating\" for subconsciously, intuitively brilliant reasons you'll find out later https://t.co/k61lf7gj9E\n  [Quoting Tweet 1104556732267749378 (missing)]\n↓\n1737538470569001206 [2023-12-20] @tasshinfogleman 💜 7\n7. train yourself to notice again and again that the way that things didn't work out like you wanted is precisely the way that the universe delights you, in ways you never could have planned https://t.co/OtSdvKeWCn\n  [Quoting @neats29: in the last year or so, my brain has become surprisingly good at seeing the upside (silver lining) of anything “bad” I experience. happens without conscious effort. and when it does I start taking action on or focusing on the silver lining which increases the odds of that outcome]\n↓\n1737538519101329419 [2023-12-20] @tasshinfogleman 💜 7\n8. you can just decide to be the kind of person who is more curious about others' perspectives than you are insistent on being right or justifying your ownhttps://t.co/y2sTvPrJ7X\n  [Quoting @strangestloop: The best interlocutors are curious about others' perspectives. In conversation they seek to understand alternative points of view rather than advance their own. They make others feel heard and considered rather than ignored and belittled.]\n↓\n1737538559047843870 [2023-12-20] @tasshinfogleman 💜 8\n9. let love start from within, then radiate outwards, in expanding circles of concern—love yourself, love your friends, love your neighborhood, love your country, love the world, love all beings https://t.co/JuWH2twymq\n  [Quoting @TylerAlterman: Fractal altruism: scaling altruism from inner altruism (positive relations amidst your IFS parts) to your community to the wider world]\n↓\n1737538590509269196 [2023-12-20] @tasshinfogleman 💜 6\n10. you can see the whole world like it's a cute girl, like you are too https://t.co/WCyCHIKD20\n  [Quoting Tweet 1397297447089500160 (missing)]\n↓\n1737538629289832753 [2023-12-20] @tasshinfogleman 💜 7\n11. cultivating self love is good and so is letting yourself be loved by your friends https://t.co/6Yu8KKGllw\n  [Quoting @_brentbaum: it is good and right to not be relationally self suffient. the end goal here is not to live in a cave :)]\n↓\n1737538674860900613 [2023-12-20] @tasshinfogleman 💜 8\n12. say \"i love you\" when you tell your friends goodbye https://t.co/pANxgovRnV\n  [Quoting Tweet 1498915339723108355 (missing)]\n↓\n1737538747221102719 [2023-12-20] @tasshinfogleman 💜 10 🔁 1\n13. use your poetry and your precision to tell the most beautiful story about the future you can; use the paintbrush of your imagination to see the world you want to live in as beautiful, alive, vibrant https://t.co/IQQnjpSOaI\n  [Quoting @made_in_cosmos: Just met husband’s mom. In the last few months she lost 30lbs, practiced yoga daily without a single miss, quit carbs, started learning English, and is now on her way to quitting smoking.  Her secret? Every day on commute she imagines her ideal future in vivid detail.]\n↓\n1737538912329847233 [2023-12-20] @tasshinfogleman 💜 7 🔁 1\n14. there is an underserved gap in scales between individuals/family-scale coordination and regional/national coordination that causes systemic problems https://t.co/TYD3EGDUC6\n  [Quoting @exgenesis: Scales:Pure attentionBody-Emotion1-on-1Squad-FamilyCongregation - Dunbar Number ~150City - Local Commons, local cultureBioregion - High CultureGlobal - Historic, unhinged bc no evolutionary pressure, Science, MathPost-humanism: Metaphysics, Consciousness(wraps around)]\n↓\n1737538947583000635 [2023-12-20] @tasshinfogleman 💜 8\n15. the brain is not type safe—if you lie to others, you risk lying to yourself. if you are unkind to others, you risk being unkind to yourself https://t.co/nS6t5yS7GU\n  [Quoting @RomeoStevens76: The reason to avoid lying is that the brain is not type safe. Lying to others and lying to yourself are the same motion.]\n\n===\n\n1752778538107691280 [2024-01-31] @__drewface 💜 11\nme: ...i wonder what's going on in US politics...?\nthe right: \"2024 will be MAGA vs. Swifties\"\nme: \"wait wtf is Taylor Swift running?\"\nthe right: \"no, but she definitely WILL and SHOULDN'T\"\n\nlmao, joke about the outcomes you want. https://t.co/w04XNWR4QY\nImages:\n  - [Image #0] The image shows a news article about the conspiracy theories surrounding Taylor Swift and her fans, known as \"Swifties.\" The text discusses how some people on the right-wing believe that Taylor Swift will run for president in 2024 and that her fans will support her. \n    \n    The text in the image reads: \n    \"Much of the Swift paranoia has lurked on the MAGA fringes, with people like Ms. Loomer, the conspiracy theorist from Florida who declared in December that “2024 will be MAGA vs Swifties” and Mr. Kirk, who declared in November that Ms. Swift would “come out for the presidential election” after Democrats had another strong showing in an election that demonstrated the issue of abortion motivated voters to the polls.\n    \n    “All the Swifties want is swift abortion,” he said.\n    \n    Then Swift-bashing reached Fox News in mid-January. The host Jesse Watters suggested the superstar was a Defense Department asset engaging in psychological warfare. He tied Ms. Swift’s political voice with her boyfriend’s Pfizer endorsement to the remarkable success of her Eras tour, which bolstered local economies and landed her on the cover of Time.\n    \n    “Have you ever wondered why or how she blew up like this?” Mr. Watters wondered on air. “Well, around four years ago, the Pentagon psychological operations unit floated turning Taylor Swift into an asset during a NATO meeting.”\n  - [Image #1] The image shows a screenshot of an article discussing the conspiracy theories surrounding Taylor Swift and her fans, known as \"Swifties.\" The text is divided into four paragraphs, with the first paragraph stating that some people believe \"2024 will be MAGA vs. Swifties\" and that Taylor Swift may run for president. \n    \n    The article exhaustively transcribed is as follows:\n    \n    Much of the Swift paranoia has lurked on the MAGA fringes, with people like Ms. Loomer, the conspiracy theorist from Florida who declared in December that \"2024 will be MAGA vs. Swifties\" and Mr. Kirk, who declared in November that Ms. Swift would \"come out for the presidential election\" after Democrats had another strong showing in an election that demonstrated the issue of abortion motivated voters to the polls.\n    \n    \"All the Swifties want is swift abortion,\" he said.\n    \n    Then Swift-bashing reached Fox News in mid-January. The host Jesse Watters suggested the superstar was a Defense Department asset engaging in psychological warfare. He tied Ms. Swift's political voice with her boyfriend's Pfizer endorsement to the remarkable success of her Eras tour, which bolstered local economies and landed her on the cover of Time.\n    \n    \"Have you ever wondered why or how she blew up like this?\" Mr. Watters wondered on air. \"Well, around four years ago, the Pentagon psychological operations unit floated turning Taylor Swift into an asset during a NATO meeting.\"\n↓\n1752779046268641611 [2024-01-31] @__drewface 💜 7 [(SEED) type=quote_of_semantic_search]\nit would not be unprecedented for a media celebrity to run for president after people on social media taunt them about it:\n\nhttps://t.co/Ja1NEsiX45\n  [Quoting @visakanv: 28. joke about the outcomes you want https://t.co/Wm6NYzqkfh]\n↓\n1752779498381033706 [2024-01-31] @__drewface 💜 7\nalso, to be clear, I would be voting for Taylor Swift.\n↓\n1752779945544237458 [2024-01-31] @__drewface 💜 20 [(SEED) type=quote_of_root]\nthe best timeline for america is that people meme Taylor Swift into being President, and then she performs a Presidential Concert tour across the US.\n\ninstant golden age\n\nhttps://t.co/1diTVssJGg\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1752825260540346785 [2024-01-31] @danielbrottman 💜 45 🔁 3\nme: hierarchy is a cancer, anarchist systems are the only way for humanity to meaningfully address its ills\n\nalso me: king felipe VI of spain is my favorite king and also i support his legal claim as the heir to the roman empire\n↓\n1752825533354643929 [2024-01-31] @sedatesnail 💜 2\n@danielbrottman it's because of his impeccable fashion sense, isn't it\n↓\n1752825863878410445 [2024-01-31] @danielbrottman 💜 2\n@sedatesnail i already loved him for that, absolutely, and then just now i learned that the last byzantine emperor left the title of roman emperor to the spanish crown in his will, so there's a legal argument that felipe has the strongest extant claim\n↓\n1752826085509578786 [2024-01-31] @danielbrottman 💜 1\n@sedatesnail other possibilities, for various reasons, include the heir to the hapsburg family, napolean's heirs, the heirs of the russian romanovs, and the heirs of the ottoman empire. i like the legal claim though, it makes the most internal logic to me\n↓\n1752826117449269700 [2024-01-31] @danielbrottman 💜 1\n@sedatesnail https://t.co/vUPoh9cAhm\n↓\n1752827322376335778 [2024-01-31] @sedatesnail 💜 3\n@danielbrottman hahah incredible\nAnd! he's only \"wealthy\" not \"unbelievably extravagantly wealthy\" (net worth eu$2.8m).\nAll this to say, I'll support his claim, provided his tailor is appointed as vice emperor, and Menswear Guy as court jester\n↓\n1752827909763461408 [2024-01-31] @danielbrottman 💜 1\n@sedatesnail oh that's a nice touch haha. yeah i don't actually know anything about the man, his political beliefs, etc, just going on vibes. i absolutely agree with your court appointments\n↓\n1752828558538359108 [2024-01-31] @sedatesnail 💜 1\n@danielbrottman yeah\npublic announcement on this public forum, to be read in the event of his inevitable milkshake ducking: I don't know anything about his beliefs policies actions whatever either\nbut I agree, he has good vibes\n↓\n1752828841989447928 [2024-01-31] @sedatesnail 💜 2\n@danielbrottman hmm... we already know @dieworkwear is coming to vibecamp this year, think we can convince Felipe VI too?\n↓\n1752828997208014960 [2024-01-31] @danielbrottman 💜 2\n@sedatesnail @dieworkwear HE IS?!?!?!?!?!?!\n↓\n1752829305753636980 [2024-01-31] @sedatesnail 💜 2 [(SEED) type=quote_of_root]\n@danielbrottman @dieworkwear yes definitely 100% and so is Felipe\nhttps://t.co/hu4WIY17im\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1752829999780876340 [2024-01-31] @danielbrottman 💜 2\n@sedatesnail @dieworkwear hahaha\n\n===\n\n1779280966856372627 [2024-04-13] @__drewface 💜 56\nAnnouncing the 100 True Fans NYC marketing agency:\n1. meet with me\n2. identify 1 first follower through Fractal and form a mastermind\n3. we write essays, tweets, and videos from your heart\n4. we host in-person talks, dinners, and pitches\n5. we find your 100 true fans\n↓\n1779283967788663081 [2024-04-13] @__drewface 💜 12 [(SEED) type=quote_of_root]\nthis is kind of a LARP, i probably don't have time to do this. Although I already have a call scheduled because I'm hopeless.\n\nAnyway, in this house we joke about the outcomes we want -- one of you should do this:\n\nhttps://t.co/tIthhfATjE\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n\n1785657825458376889 [2024-05-01] @peakexperiments 💜 8 [(SEED) type=quote_of_root]\n\"God forbid\" is a ward against accidentally manifesting something you don't want. It's notable that even many Christians pay at least some small degree of mind to this apparent superstition. The belief in the power of words runs deep. https://t.co/pEDfockSnf\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1785662350839709738 [2024-05-01] @peakexperiments 💜 1\nOfc it's also in many cases just a public concession to what is believed to be a collective superstition, but I'm not sure this substantially alters the point about it running deep\n↓\n1785663749023519053 [2024-05-01] @peakexperiments 💜 1\nIt can also just be a way of signaling \"I'm not usually this morbid I promise\" but it feels like this could be done without invoking the Most High. But maybe it's done like this to remove all question of one's sincerity.\n↓\n1785664317976613007 [2024-05-01] @peakexperiments 💜 2\nI wonder if this is just a problem of conciseness though. Verbosity increases suspicion of sincerity and \"God forbid\" is only two words. Maybe social protocol just needs a new phrase.\n\n===\n\n1819214844077527473 [2024-08-02] @visakanv 💜 868 🔁 29\nI am never leaving this site https://t.co/mwAdNr9jit\n  [Quoting Tweet 1819167876109971654 (missing)]\n↓\n1819214950440812816 [2024-08-02] @visakanv 💜 91 [(SEED) type=semantic_search]\nalso joke about outcomes you want etc\n\n===\n\n\n===\n\n1831988534896386053 [2024-09-06] @forthrighter 💜 5\nThe year is 1615 and an anonymous manifesto has just been published.  A secret brotherhood of alchemists and sages has a plan: inspire a renaissance through secret knowledge for the betterment of humanity\n\nLet's talk about the crazy story of the Confessio Fraternitatis 🧵\n\n===\n\n1831989667979235435 [2024-09-06] @forthrighter \nSo what does Confessio have to say?\n\nCritique: contemporary (1600s) philosophy, science, and religion is corrupt; establishment churches are corrupt, and dominant academic systems are ineffective.\n↓\n1831990143927935278 [2024-09-06] @forthrighter \nPromise of Reformation.  we need spiritual and intellectual renewal; the secret brotherhood signals now is the moment. Rosicrucians (\"The Brotherhood of the Rosy Cross\") claim to have esoteric knowledge that can transform religion, society, and science\n↓\n1831990484731932683 [2024-09-06] @forthrighter \nMystical &amp; Alchemical Wisdom: Confessio Fraternitatis says the group has access to hidden truths about nature and the cosmos, and that these truths will soon be revealed to the world.\n↓\n1831990767360831593 [2024-09-06] @forthrighter \nSecrecy: the group intends to share their knowledge, but must remain hidden to protect the work from corruption and misuse\n\nInvitation: those who are genuinely seeking truth can join the fraternity. Only open to those who are ready\n↓\n1831991081715605959 [2024-09-06] @forthrighter \nSelf-Defense: the fraternity are not heretics or sorcerers, arguing that their intentions are pure; presenting themselves as servants of God. This would've been important at a time of high levels of expected religious orthodoxy, to not get members killed\n↓\n1831991330190336460 [2024-09-06] @forthrighter 💜 1\nProphecy: a coming era of enlightenment and peace; Rosicrucian knowledge will transform the world. The\"Golden Age\" will be marked by the harmony of science, religion, and art.\n↓\n1831992123572240782 [2024-09-06] @forthrighter \nthis is ... kinda crazy? How would readers have interpreted this when it came out?\n\nWell, it was the meme text because it very much reflected the spirit of the day https://t.co/52JuNmLXMK\nImages:\n  - [Image #0] The image is a slide about the religious climate in Europe during the 17th century. The title, \"1. Religious Climate:\", is prominently displayed at the top left of the image in white text against a black background.\n    \n    Below the title are three bullet points that provide information about the religious climate during this time period:\n    \n    *   **Protestant Reformation and Catholic Counter-Reformation**: This section explains how Europe was deeply divided by the Reformation, which began in the early 16th century with Martin Luther's challenge to the Catholic Church. By 1615, Protestant and Catholic factions were entrenched in opposition. The Protestant Reformation had led to the establishment of various Protestant denominations (Lutheran, Calvinist, Anglican, etc.), while the Catholic Church responded with the Counter-Reformation, aimed at internal reform and the suppression of Protestant movements.\n    *   **Religious Wars**: This section discusses how religious tensions often spilled over into violent conflict. The Thirty Years' War (1618-1648) was about to erupt, driven largely by the clash between Protestant and Catholic states in the Holy Roman Empire. This war would devastate much of Central Europe, exacerbating religious and political divisions.\n    *   **Religious Persecution**: This section highlights how both Protestant and Catholic authorities engaged in persecution of religious minorities. Heretics, witches, and nonconformists were often prosecuted, tortured, and executed. The Inquisition, particularly in Catholic regions, sought to enforce orthodoxy and suppress dissent.\n    \n    Overall, the image provides a concise overview of the complex and often contentious religious landscape of 17th-century Europe.\n↓\n1831992704915402819 [2024-09-06] @forthrighter \nits publishing kicked off broad speculation. Following from the first pamphlet, you got all the same reactions of skepticism &amp; enthusiasm that one got, intrigue at the key ideas, and also some growing hostility: these people are heretics and need to be killed. https://t.co/RVgIyrvDvE\nImages:\n  - [Image #0] The image is a still from the movie \"The Witches of Eastwick\" with a superimposed caption. The scene shows a crowd of people shouting, with two women in the foreground and a man behind them. The caption reads 'BURN THE WITCH!' 'BURN HER!' in white text at the bottom of the image.\n↓\n1831993081056379054 [2024-09-06] @forthrighter 💜 1\nbut seriously guys this is the second anonymous pamphlet, and this brotherhood is secret, so people started looking for Rosicrucians. (Who will raise their hand?) People across Europe claim to have met them. Letters are written by people trying to make contact\n↓\n1831993439681957911 [2024-09-06] @forthrighter 💜 2\nno public confirmation of the group's existence is ever made. Which just adds to the mystique and the meme 🤔\n\nRemember, society is ripe, it wants to transform, so all of this speculation becomes part of the actual transformation whether or not the Rosicrucians are real!\n↓\n1831994108971262100 [2024-09-06] @forthrighter 💜 2 [(SEED) type=quote_of_root]\nthe Confessio actually feeding back into the actual transformation in society at the time is a great historical large scale example of \"joke about the outcomes you want\"\n\nyou can think the whole thing is a hoax or a joke...still worked\n\nhttps://t.co/bjcf2uu6yi\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1831994503961391542 [2024-09-06] @forthrighter \nunsurprisingly Confessio, essentially a meme pamphlet, became extremely influential in the time period because it expressed the zeitgeist and promised society what they secretly most desired: transformation, freedom from old orthodoxy, the dawning of a new positive age\n↓\n1831994890818887938 [2024-09-06] @forthrighter \nremember; this is 1615, the Martin Luther reformation had happened about 100 years before, and that \"New Age\" that got promised by the Rosicrucians?  It got delivered!\nImages:\n  - [Image #0] The image is a screenshot of a Wikipedia page about the Age of Enlightenment, featuring a title, three images, and a brief description. \n    \n    The title \"Age of Enlightenment\" is displayed in white text at the top left, accompanied by a small icon to its left. To the right of the title are three buttons: \"Overview\", \"Videos\", and \"Purpose\". Below the title and buttons are three images depicting scenes from the Enlightenment era, showcasing people in formal attire gathered in rooms. \n    \n    Underneath the images is a paragraph of white text on a black background that reads: \"The Enlightenment featured a range of social ideas centered on the value of knowledge learned by way of rationalism and of empiricism and political ideals such as natural law, liberty, and progress, toleration and fraternity, constitutional government, and the formal separation of church and state.\"\n↓\n1831995517145895182 [2024-09-06] @forthrighter 💜 1\nthis 🧵 isn't asking you to believe in the actual literal existence of a brotherhood of alchemists who changed the world behind some veil of secrecy, but the mere suggestion of it did actually create ripples &amp; impact https://t.co/bQDh9CGhi8\nImages:\n  - [Image #0] The image depicts a still from an animated movie or series, showing three robed figures standing around a large, ornate object. The figures are dressed in black robes with pointed hoods and gold accents, and their faces are obscured by gold masks featuring two circular holes for the eyes.\n    \n    *   Three robed figures:\n        *   Standing around a large, ornate object\n        *   Wearing black robes with pointed hoods and gold accents\n        *   Faces obscured by gold masks with two circular holes for the eyes\n    *   Large, ornate object:\n        *   Center of the image\n        *   Gold accents and a green glow emanating from it\n    *   Background:\n        *   Dark stone wall with a carved stone pillar in the center\n        *   Pillar features a knight's helmet and other symbols\n        *   Two torches on either side of the image, casting a warm glow\n    \n    The overall atmosphere of the image is one of mystery and intrigue, with the robed figures and ornate object creating a sense of secrecy and ritual.\n↓\n1831995888824398109 [2024-09-06] @forthrighter \nyeah ok but still this document had to be written by somebody right? We still don't know who, but we have some ideas. Lots of people claimed it, there are various ideas; leading hypothesis (not proven) is that it was this guy, Francis Bacon https://t.co/9qFEmYjFQa\nImages:\n  - [Image #0] This image is a Wikipedia page featuring a portrait of Francis Bacon, with text describing his title and position. The text reads: \"The Right Honourable / The Viscount St Alban / PC\" at the top, followed by the portrait, and then \"Portrait, 1617\" and \"Lord High Chancellor of England / In office / 7 March 1617 - 3 May 1621\" below.\n↓\n1831996638119834069 [2024-09-06] @forthrighter \nBacon was considered one of the fathers of modern science and had some wild ideas (\"The Great Insaturation\") about big big transformations of society\n↓\n1831996976159715491 [2024-09-06] @forthrighter \nBacon and this other guy ran in similar intellectual circles and if such a brotherhood ever existed, these sorts of guys would be top of the list of who might have been in it (again, if it existed)\n\nbut admittedly: it's speculation on top of speculation\n\nhttps://t.co/Tf4rRlnhVp\n  [Quoting @forthrighter: It may have been Johann Valentin Andreae; member of the Protestant utopian movement that wanted education and the encouragement of sciences in public life. In his autobiography he claimed to have written a later Rosicrucian text we might get to in another thread https://t.co/MhWlB1mrV9]\n↓\n1831997475336392705 [2024-09-06] @forthrighter 💜 1\nfor those interested, the original text can be found here. If the link breaks in the future, \"Confessio Fraternitatis pdf\" will get you the full text.  No copyright on texts from 1615!\n\nhttps://t.co/uVCNLxSsLb\n↓\n1831997692458721349 [2024-09-06] @forthrighter \nthe main two questions for consideration &amp; thought at the end of this thread are these:\n\n⁉️ did the Brotherhood of the Rosy Cross actually exist?\n⁉️ does it matter?\n\n===\n\n1858660054461018472 [2024-11-18] @imitationlearn 💜 18 🔁 1 [(SEED) type=quote_of_root]\nIt would be so funny if I ended up trying the things I wanted each day, loving the people that I care about, finding joy in the small things, and discovering more about myself and life! HAHAHA! https://t.co/8xJQ8iGxjs\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n↓\n1891307434548834582 [2025-02-17] @Karmancer 💜 1\n@imitationlearn You got this, I believe in you!\n↓\n1891446851653493220 [2025-02-17] @imitationlearn 💜 1\n@Karmancer &lt;3\n\n===\n\n1891336587507581065 [2025-02-17] @franki3stone  [(SEED) type=quote_of_root]\nThis got me so good when I was like “oh I WONDER what it’s like to be in a DV relationship” - a week later I found out and couldn’t leave until 2 years later. 🥵🤦 https://t.co/RyxmRjkqaG\n  [Quoting @visakanv: the stuff you joke about (even ironically or whatever) has a way of shaping your reality so be careful and deliberate with that stuff. a lot of people out here fumbling their own bags by joking about outcomes they don’t want. you might as well joke about the outcomes you do want]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand centers on Visakanv's viral 2021 insight: 'joke about the outcomes you want.' The boundary object is the concept that speech acts—especially jokes—have causal power over reality, functioning as intention-setting or manifestation. The arc spans 2020-2025, beginning with a throwaway joke about Mark Zuckerberg doing MMA, crystallizing into the core thesis in May 2021, then evolving through 50+ numbered examples where jokes-become-reality (Trump's presidency, Omicron as 'natural vaccine,' meeting partners at Vibecamp). The discourse is *constructive*—people adopt the frame as a practical heuristic, applying it to career moves, relationships, and community-building. By 2024, it's become embedded TPOT vocabulary ('joke about outcomes you want' is shorthand). High cohesion (same core group riffing for years), medium-high evolution (from observation to praxis to meta-commentary), and high utility (actionable life advice with receipts).",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1271886699119828993,
        "annotation": "Pre-history: The Zuck MMA joke (2020)—earliest example of Visa joking about an outcome, setting the template"
      },
      {
        "tweet_id": 1394772091660951555,
        "annotation": "The Catalyst: 'joke about outcomes you want' thesis statement (May 2021)—becomes the boundary object"
      },
      {
        "tweet_id": 1394772561985097729,
        "annotation": "Personal proof-of-concept: Visa stopped joking about being broke, started making money"
      },
      {
        "tweet_id": 1421539595859021824,
        "annotation": "Dialectic: Qiaochu introduces bidirectional causality—are you manifesting or presciently sensing the future?"
      },
      {
        "tweet_id": 1426264153233129475,
        "annotation": "Application: Qiaochu jokes about meeting his wife at the airport in a P100 mask (becomes running meme)"
      },
      {
        "tweet_id": 1458733481719066627,
        "annotation": "Synthesis: 'You can't make fun of a thing without it seeping into you'—extends the frame beyond aspiration to critique"
      },
      {
        "tweet_id": 1518862243902853122,
        "annotation": "The Trump Receipt: Screenshot showing Trump was taunted into running for president via joke (validates thesis)"
      },
      {
        "tweet_id": 1604487628320935936,
        "annotation": "The Steak Experiment: XKCD jokingly asks for hypersonic wind tunnel data, researchers deliver—pure meme→reality"
      },
      {
        "tweet_id": 1831994108971262100,
        "annotation": "Historical Deep Dive: Confessio Fraternitatis as 1615 example of 'joke about outcomes you want' at societal scale"
      },
      {
        "tweet_id": 1844417402899136598,
        "annotation": "Long Arc Payoff: Ultimape jokes about gorilla diet for years, finally buys primate food and goes 'GorillaMaxxing' (2024)"
      }
    ]
  }
}