{
  "seed_tweet_id": 1455068457091756034,
  "thread_text": "603219684402601984 [2015-05-26] @loopholekid 💜 2 🔁 1 [(SEED) type=semantic_search]\nIf you grow up and still want to be a child, you might have done something wrong.\n\n===\n\n1206274851545026560 [2019-12-15] @QiaochuYuan 💜 67 🔁 6\none way to reframe the childhood trauma stuff i keep talking about is that people adapt to the environment parents + school create growing up and then are thrust into a completely different environment they're no longer adapted to upon adulthood\n↓\n1206274875112841217 [2019-12-15] @QiaochuYuan 💜 44 🔁 4 [(SEED) type=semantic_search]\nin some sense parents + school can end up making and then breaking a promise: if you just keep obeying us, keep your head down and do what you're s'posed to, everything will be fine. that wouldn't be so bad if it were *true*!\n↓\n1206274882251575296 [2019-12-15] @QiaochuYuan 💜 37 🔁 1\nyou get a visceral sense of how much of this conditioning people still have if you teach a class or run a workshop for adults. you can tell those fuckers to do all sorts of crap and they'll mostly just do it! you're standing up in front of a room, that means you're the teacher!\n↓\n1206274888979214336 [2019-12-15] @QiaochuYuan 💜 27\ndoubly true if you have them do something where blindly following instructions is not a guarantee of good results, eg improv. you can learn to spot the \"good students\" who are trying to get \"good grades\" on the task, and i'm calling myself out here\n\n===\n\n1285353971054452741 [2020-07-20] @natural_hazard 💜 30 🔁 2 [(SEED) type=semantic_search]\n\"But I think there’s something ominous about a kid so eager-to-please that he sits perfectly still for fifteen minutes waiting for a marshmallow.\"\n↓\n1285368351255072769 [2020-07-21] @natural_hazard 💜 7\nlol :)\ni tried this sort of stats dump\nexistential crisis left me feeling valueless, so i aimed at gaining \"general strength\"\n\nworked for a bit, but eventually realized that \"arbitrary motivational abilities\" aren't real. https://t.co/uev7clOCc0\n\n===\n\n1293884729901514753 [2020-08-13] @visakanv 💜 118 🔁 8 [(SEED) type=semantic_search]\nJust saw a child holding an ice cream  with reverence and licking it delicately like it’s the nectar of the gods. When I grow up I would like to be a child\n\n===\n\n1357756592746352643 [2021-02-05] @RichDecibels 💜 272 🔁 39 💬 6\ncringe is the path of awakening\n\n===\n\n1532674797926227969 [2022-06-03] @RichDecibels 💜 11 🔁 2\nhttps://t.co/mxRzpddfud\n  [Quoting Tweet 1532436046285357056 (missing)]\n↓\n1550185037957570565 [2022-07-21] @RichDecibels 💜 8\nhttps://t.co/mf5W8ZiTYJ\n  [Quoting Tweet 1550130374696521729 (missing)]\n↓\n1575468082306375681 [2022-09-29] @RichDecibels 💜 4\nhttps://t.co/9JJ7DvjcE5\n  [Quoting Tweet 1575467653145440256 (missing)]\n↓\n1591459982985334785 [2022-11-12] @RichDecibels 💜 12\nperfect 😍\n\nhttps://t.co/TWLV7I5Yak\n  [Quoting Tweet 1589721996862316544 (missing)]\n↓\n1595415843927728133 [2022-11-23] @RichDecibels 💜 4\nhttps://t.co/Zt4Ky8cobT\n  [Quoting Tweet 1595344819119095810 (missing)]\n↓\n1600446401757868034 [2022-12-07] @RichDecibels 💜 4\nhttps://t.co/x50QgYe8VT\n  [Quoting Tweet 1600304318573604865 (missing)]\n↓\n1603282373424168963 [2022-12-15] @RichDecibels 💜 13\nhttps://t.co/hwE2TivRtb\n  [Quoting Tweet 1603182820402380800 (missing)]\n↓\n1653708316856532993 [2023-05-03] @RichDecibels 💜 11\nhttps://t.co/F7cI4DtTFK\n  [Quoting Tweet 1651014471307984899 (missing)]\n↓\n1668653637885624321 [2023-06-13] @RichDecibels 💜 13\nhttps://t.co/Lk24udSK04\n  [Quoting Tweet 1668631302780887042 (missing)]\n↓\n1672608672541814785 [2023-06-24] @RichDecibels 💜 7\nhttps://t.co/icz9kKZCMG\n  [Quoting Tweet 1672280948245770256 (missing)]\n↓\n1712449665302433822 [2023-10-12] @RichDecibels 💜 3 [(SEED) type=quote_of_root]\nhttps://t.co/hxm4EIGFzO\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1733229279918395469 [2023-12-08] @RichDecibels 💜 4\nhttps://t.co/CKjN5CP6xB\n  [Quoting Tweet 1732833408689315875 (missing)]\n\n===\n\n1455068457091756034 [2021-11-01] @RomeoStevens76 💜 3280 🔁 528 💬 34 [(SEED) type=root]\n\"If you manage to control yourself there will be ice cream\" said the parent.\n\n\"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.\n├── 1455088418279460865 [2021-11-01] @HephaistosF 💜 14 🔁 1\n│   @RomeoStevens76 @Malcolm_Ocean The child that this damages is not the child we wanted succeeding anyways, so fuck em\n├── 1455098421237399552 [2021-11-01] @m_ashcroft 💜 58\n│   @RomeoStevens76 excellent\n├── 1455167344553218050 [2021-11-01] @BuddhistSanta 💜 3\n│   @RomeoStevens76 The cow goes moo\n├── 1455505419800088584 [2021-11-02] @dirtymagus 💜 11\n│   @RomeoStevens76 Amazing. On the level of the fear line from Evangelion.\n│   ↓\n│   1456090447688855554 [2021-11-04] @AskYatharth 💜 3\n│   @dirtymagus @RomeoStevens76 which line\n├── 1575062620436017152 [2022-09-28] @levity 💜 19\n│   @RomeoStevens76 pairs well with https://t.co/KrBec3pLoK\n│     [Quoting @iwelsh: One of the lowest levels of \"enlightenment\" is the moment you really realize that you don't have to do whatever it is.]\n├── 1610918413807005696 [2023-01-05] @meaning_enjoyer 💜 102 🔁 2\n│   @RomeoStevens76 this is necessary\n│   https://t.co/R6YR5UT5vs\n│     [Quoting @meaning_enjoyer: Your parents fucked you up, even if they did their best not to.  Who you were was stifled in a very fundamental way as a child.  The complaint is something like:  “If mom hadn’t taken my teddy bear when I was 8, maybe I’d be happy and self actualized today!”  A thread 1/12]\n├── 1611031339607678983 [2023-01-05] @blisstweeting 💜 14\n│   @RomeoStevens76 @embryosophy This is art\n├── 1657552405989294085 [2023-05-14] @leifolsenwrites 💜 1\n│   @RomeoStevens76 @sashachapin Future reward immediately signals present pain. \n│   \n│   When you change your story, you change your perspective.\n├── 1699405470815887748 [2023-09-06] @RyanHVaughn 💜 2\n│   @RomeoStevens76 @josephkelly Ugggg\n├── 1710681653712912621 [2023-10-07] @LucidBrot 💜 49\n│   @RomeoStevens76 I don't get it. Is it not good to have lifelong consequences from being raised to learn skills like self control?\n│   ↓\n│   1710693456694374503 [2023-10-07] @RomeoStevens76 💜 63 🔁 1\n│   @LucidBrot Self control via trending the body doesn't actually make logical sense\n├── 1711915168211292652 [2023-10-11] @cheerpoasting 💜 3\n│   @RomeoStevens76 No idea what this even means\n├── 1716342866203607423 [2023-10-23] @nickcammarata 💜 182 🔁 4 💬 1\n│   @RomeoStevens76 https://t.co/cHDBeVVRii\n├── 1724591998060167472 [2023-11-15] @justavagrant_ \n│   @RomeoStevens76 fucking hell lol\n├── 1728986360508457268 [2023-11-27] @crostipunctus 💜 2\n│   @RomeoStevens76 😓\n├── 1749086516800803305 [2024-01-21] @ClickingSeason 💜 51\n│   @RomeoStevens76 I mean aren’t the lifetime consequences of taking on the challenge of self discipline likely highly positive?\n├── 1749737307316298140 [2024-01-23] @fritzdev 💜 4\n│   @RomeoStevens76 Curious if you have children.\n├── 1816653213556195661 [2024-07-26] @tasshinfogleman 💜 19\n│   @RomeoStevens76 oh no https://t.co/L587e0wl1d\n│     [Quoting Tweet 1816562737130144051 (missing)]\n├── 1836707386213417368 [2024-09-19] @shanemelaugh 💜 3\n│   @RomeoStevens76 This is one of those tweets that just stuck in my mind ever since I read it. \n│   \n│   I featured it in my recent video: https://t.co/1IBqTs1dhv\n├── 1856736750443598242 [2024-11-13] @RomeoStevens76 💜 36 🔁 2\n│   I gave this tweet to Claude and asked it to write a song, then piped that to Suno:\n│   https://t.co/ayrN5n8Zcm\n│   ├── 1856776530791469419 [2024-11-13] @QiaochuYuan 💜 9\n│   │   @RomeoStevens76 wait this is actually pretty good\n│   ├── 1856777585415626902 [2024-11-13] @cowtung 💜 1\n│   │   @RomeoStevens76 I love this.\n│   ├── 1856828555658690890 [2024-11-13] @ad_astraea 💜 5\n│   │   @RomeoStevens76 Why is this an actual banger?? Origami of the soul?? We forget how to unfold!?!?\n│   └── 1860485619891245404 [2024-11-24] @thesaurosie 💜 2\n│       @RomeoStevens76 Sharks beneath a wooden floor is awesome. Like the opposite of the horse-ebooks experience\n└── 1857103358747627930 [2024-11-14] @drethelin 💜 1\n    @RomeoStevens76 I still don't get why everyone resonates with this tweet so strongly. Is there like a blogpost about it or an explanation?\n\n===\n\n1455957919770497025 [2021-11-03] @m_ashcroft 💜 99 🔁 4\nEvery so often I think back to the ridiculous grading system I had at school.\n\nA - E meant performance\n\n1 - 5 meant effort\n\nOf course getting an A1 was considered better than an A5. \"He's doing well, but he's not TRYING!\"\n\nWell, good! What good would looking like I'm trying do?\n↓\n1455958356934467588 [2021-11-03] @m_ashcroft 💜 46 🔁 3\n\"you must try to think, you must try to pay attention!\"\n\nno, actually, these things happen in spite of any trying, not because of it\n\ntrying interferes, in fact, because the part of me that tries isn't the part of me that actually thinks or pays attention\n\nnonsense, all of it\n↓\n1455958834111995908 [2021-11-03] @m_ashcroft 💜 27\nthis is one of the most important things in life to unlearn of course\n\nbut if the illusion is too strong you have no other way to get rid of it than to try not to try\n\nand then you are lost, until one day you see that cessation of trying is quite different from trying not to try\n↓\n1455960073210105866 [2021-11-03] @m_ashcroft 💜 24\nit's the *cessation of trying* that I teach\n\nand it's funny to reflect on how easy it is to forget that simple move of \"stop trying\"\n\nI got trapped, my fellow AT trainees got stuck, etc\n\nit takes time to realise that all the tricks you thought it was are just different tryings\n↓\n1455960917485801489 [2021-11-03] @m_ashcroft 💜 29\nand if I sound like Alan Watts then that should come as no surprise\n\nit's all the same illusion, pointed out over and over in different words, in different times\n\nI hope that more people become able to see through it, our future depends on it\n↓\n1455961512330285062 [2021-11-03] @m_ashcroft 💜 15\nc.f. connection with brain lateralisation as Iain McGilchrist talks about it - the left hemisphere is like a hall of mirrors @Malcolm_Ocean @Jeanvaljean689\n↓\n1455961711282950145 [2021-11-03] @m_ashcroft 💜 15 [(SEED) type=quote_of_root]\nworthy inclusion in this thread, captures the bind perfectly\n\njust imagine you were that child and you forgot you were doing this, it just became automatic\n\nhttps://t.co/j3yqH9wL8L\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1479317787747123200 [2022-01-07] @QiaochuYuan 💜 88 🔁 4\nit's not exactly as if undoing social conditioning is a pure good. it's more that obeying social conditioning is your end of keeping up the social contract, and insofar as the social contract sucks, undoing social conditioning is a prerequisite to renegotiating it\n↓\n1479318450082246657 [2022-01-07] @QiaochuYuan 💜 16 🔁 1 [(SEED) type=quote_of_semantic_search]\nespecially relevant if your social conditioning comes from an environment you're not in anymore\n\nhttps://t.co/AW05WS0lxf\n  [Quoting @QiaochuYuan: in some sense parents + school can end up making and then breaking a promise: if you just keep obeying us, keep your head down and do what you're s'posed to, everything will be fine. that wouldn't be so bad if it were *true*!]\n\n===\n\n1502783983729446912 [2022-03-12] @IaimforGOAT \nWhen I was a kid, for a short while I got attracted into poetry, my poems were not good but they were very fun to write\n↓\n1502783986430623745 [2022-03-12] @IaimforGOAT \nSo I wrote a few and then some more. It was fun, so I kept playing with the words like a puzzle. \n\nLearning by doing and not caring how you call that technique or wtv\n↓\n1502783988875907073 [2022-03-12] @IaimforGOAT \nAfter a few days of doing this I noticed that something was **different**, a very small difference but it was there. I couldn't pinpoint what it was tho, so I kinda ignored it.\n↓\n1502783991811878915 [2022-03-12] @IaimforGOAT \nSome time after that I realized the structure of my thoughts was mutating... EVERY. SINGLE. THOUGHT. Now came in the structure of a poem.\n↓\n1502783994408144902 [2022-03-12] @IaimforGOAT \nI got scared af. I thought I broke my brain. The (bad) poems were flowing as naturally as any other thought before. \n\nSo... As soon as I noticed it I immediately stopped writing poems!\n↓\n1502783997004374018 [2022-03-12] @IaimforGOAT \nLooking back at it... It's a bit sad. I was having a lot of fun and it probably would not have any negative impact at all...\n\nMaybe this was even one of the first instances I experienced the flow state ─ this may be even before I started gaming, not sure tho.\n↓\n1502783999814602753 [2022-03-12] @IaimforGOAT  [(SEED) type=semantic_search]\nI wish I could go back and talk with that kid. Don't be scared kid, it is just good as is! Enjoy it. This good thing will not be balanced by a bad thing later.\n↓\n1502784002788364297 [2022-03-12] @IaimforGOAT \nThis good thing will not be balanced by a bad thing later.\n\nThis good thing will not be balanced by a bad thing later.\n\nThis good thing will not be balanced by a bad thing later.\n↓\n1502784006013825026 [2022-03-12] @IaimforGOAT \nThis is a pattern, this kid didn't knew he would come back to. But he did, and so do I.\n↓\n1502784008563961857 [2022-03-12] @IaimforGOAT \nWhen something very good happens that manages to capture my whole self into it, my attention is 110% on it, I put one of my feet a little bit back. As if at some point I will have to sprint out of it...\n↓\n1502784011327918086 [2022-03-12] @IaimforGOAT \nIn my experience, I have never have had to sprint out of it. Never. So why do I have this instinct?\n↓\n1502784013685121028 [2022-03-12] @IaimforGOAT \nI feel like this is something I need to figure out, because if I want to do great things it will come out of times where something captures me so hard I forget to eat and sleep. I almost forget to breathe.\n↓\n1502784016205893640 [2022-03-12] @IaimforGOAT \nCompounding on this is how you end up doing great things, and to be able to compound I need to figure this out.\n↓\n1502784018999398400 [2022-03-12] @IaimforGOAT \nThere's a dot to connect here.\n\n===\n\n1524408561144668161 [2022-05-11] @TylerAlterman 💜 438 🔁 29 💬 1\nmfs confused about why we adults have problems w consent when everyone spent their first ~18 yrs in training to accept that our consent doesn’t matter\n↓\n1524410668660801536 [2022-05-11] @TylerAlterman 💜 181 🔁 7\nmfs confused about why we adults have problems identifying what we want…when everyone spent their first ~18yrs being taught that what we want might be overridden by authority figures who Know Better at any time\n↓\n1524411385987448832 [2022-05-11] @TylerAlterman 💜 47 [(SEED) type=semantic_search]\n(Granted, a lot of things we want as kids are literally impossible or might severely injure us. Writing this here before someone comments with this banal bs 😘)\n↓\n1524687209533648897 [2022-05-12] @puheenix \n@TylerAlterman yep, and discerning needs/wants/possibilities is the path to adulthood. so we block that path by forbidding desire itself &amp; then wonder why modern adults are anything but\n\n===\n\n1534561301237727238 [2022-06-08] @eigenrobot 💜 153 🔁 1\naella is our generations kershnar https://t.co/6M66OYmssC\n  [Quoting Tweet 1534557511751282689 (missing)]\n↓\n1534563823750991873 [2022-06-08] @eigenrobot 💜 304 🔁 9\nim being told many of you have determined that taking kids to sexually coded environments is good actually and well ive finally lived long enough to become the villain https://t.co/LvjlYHco36\n↓\n1534568899454423046 [2022-06-08] @eigenrobot 💜 67\ni say this as someone who has zero objection to drag and who has attended more than one rocky horror show in fishnets\n↓\n1534569250664349699 [2022-06-08] @eigenrobot 💜 138 🔁 2\nif minors want to go see risque things they can do it the traditional way: under their parents noses\n\nby trying to be cool and just take them adults deprive their children of the opportunity to connive\n↓\n1534570207833907200 [2022-06-08] @aleksil79  [(SEED) type=semantic_search]\n@eigenrobot Children WILL connive. Where will they turn when you take this opportunity away?\n\n===\n\n1544679054636650497 [2022-07-06] @m_ashcroft 💜 25 [(SEED) type=quote_of_root]\njust came across this tweet again and it is still an absolute banger https://t.co/2TJogIvjrw\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1574342815429304320 [2022-09-26] @visakanv 💜 106 🔁 8 [(SEED) type=semantic_search]\nsometimes i feel like a child who's been given free rein to eat whatever he likes at an ice cream shop and i'm crying because there's too much ice cream\n↓\n1754199988660502604 [2024-02-04] @visakanv 💜 20 🔁 3\ni was trying really hard to find this comic a while ago, and now that i've found it, i've lost the thread that i wanted to put it in, lol. but i'll find it here next time https://t.co/3V9Z0DudSp\n\n===\n\n1574596837721669632 [2022-09-27] @m_ashcroft 💜 75 🔁 2\nOnce again thinking back to when I noticed some part of me that was convinced it needed to 'do' the world, as if it had taken on responsibility and burden for the ongoing existence of everything\n\nAnd it was using muscle tension to do it\n\nWhen it let go everything got more vivid\n↓\n1574597467395747840 [2022-09-27] @m_ashcroft 💜 16\nI suspect this pattern is probably quite common, just going on below conscious awareness\n\nprobably an example of inappropriate learning of cause and effect in childhood\n\n\"I wanted to X happen, and when I happened to be doing Y, X happened, so Y must cause X. I must always Y.\"\n↓\n1574597642864435200 [2022-09-27] @m_ashcroft 💜 23 🔁 1 [(SEED) type=quote_of_root]\nI will again QT one of the finest tweets on the bird site\n\nhttps://t.co/zH2ZT1pa32\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1574597996742062080 [2022-09-27] @m_ashcroft 💜 21\nthis is one of the things that Alexander Technique gets you to notice and let go of\n\nyou start to notice \"huh I sure do something weird for some reason under certain circumstances, that's interesting... what if I were to explore how I might not do that in those circumstances\"\n↓\n1574598387458281474 [2022-09-27] @m_ashcroft 💜 20\nI've never encountered any version of this where you can force not doing the thing\n\nit's more like, if the thing is something that is ready to be not done, then not doing it becomes available\n\nthis is not the same as \"in fact it is not safe to not X, but I shall not X anyway\"\n\n===\n\n1585624132984897538 [2022-10-27] @m_ashcroft 💜 63 🔁 1 [(SEED) type=quote_of_root]\nI just shared this in a group chat so it feels right to retweet what might be my favourite ever tweet again https://t.co/2TJogIvjrw\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1610358856273592324 [2023-01-03] @RichDecibels 💜 104 🔁 5\nwowwwww big discovery: spontaneous TRE muscle trembling plus MDMA is hecking big deal for somatic healing without a therapist\n\n===\n\n1610360579998482434 [2023-01-03] @RichDecibels 💜 47 🔁 1\nclub wisdom tells you how to deal with muscle tension on ecstacy= chew gum, suck on a dummy, take magnesium\n\nWRONG ANSWER (for me)\n\nthe muscle tension IS THE MEDICINE. listen to what the muscle wants, if it wants to twitch let it, just let the animal parts of you take over\n↓\n1610360947071385600 [2023-01-03] @RichDecibels 💜 52\nhypothesis: mdma induces felt sense of safety in your animal body so you have an opportunity to STOP RESISTING the muscle tension that you have been carrying around all these months and years\n\ninhibitions drop, shakes take over, tension oscillates back and forth till its done\n↓\n1610363358712107008 [2023-01-03] @RichDecibels 💜 35\nand maybe you tender nerds love magnesium so much because it gives you some relief from the pent up feelings you have stuck in your muscles eh\n↓\n1610370762975903746 [2023-01-03] @RichDecibels 💜 22 🔁 2\n👀👀👀👀 here is a necessary warning\n\nhttps://t.co/4rKO6u83au\n  [Quoting @hormeze: @RichDecibels in case u havent been warned, plz be careful with TRE, and with recommending it to people with trauma, IMO it is employed very irresponsibly, ive seen the main guy (david) hurt people very badly with this technique, and i myself was hurt by it as well]\n↓\n1610373873706627072 [2023-01-03] @RichDecibels 💜 14\nhttps://t.co/5TanlJM1aM\n  [Quoting @RichDecibels: @bastard_brian I noticed muscles trembling, welcomed them, then I imagined Peter Levine asking me to \"complete the movement\", what does my body want to do? answer, push hard against a very heavy thing  did that then: \"what does this remind you of?\"  then, flood of intense memories]\n↓\n1610374299243745283 [2023-01-03] @RichDecibels 💜 14\nPS I'm doing this with my most trusted friend in the world, FFS don't try to deal with trauma on your own people!!\n↓\n1610375137890639872 [2023-01-03] @RichDecibels 💜 28 🔁 2\nI was a wriggly kid, always wanted to move in peculiar ways, tapping fingers, making noise, bouncing my heels under the school desk\n\nall that movement was a brilliant mammal strategy for dealing with stress and all of it was physically punished out of me when I was a little boy\n↓\n1610376578600693761 [2023-01-03] @RichDecibels 💜 21 🔁 1\nvery grateful I met @awarenesss this year, he is a grown up, who moves thru a room just like my little boy self wanted to move. he reads group vibe and changes posture to serve it. eg this is getting tense, I will make sure you don't sweep it under the rug. or, OK, PLAY TIME\n↓\n1610411115195809793 [2023-01-03] @RichDecibels 💜 10\nshit I wondering how this intersects with stammering!? phenomenologically correlated at least\n\nany reacts @aprivatething\n↓\n1610634815430066176 [2023-01-04] @RichDecibels 💜 12\n@embryosophy do you have any reaction to my hunch that long term locked up muscle tension is the result of actively resisting the body's need to tremble. so the way to release is to find the conditions where you can stop resisting\n↓\n1610720789535547392 [2023-01-04] @SarahAMcManus 💜 9 [(SEED) type=quote_of_root]\n@RichDecibels @embryosophy https://t.co/jE2kxoHqO1\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1610917513252212736 [2023-01-05] @RichDecibels 💜 4\n@SarahAMcManus @embryosophy wow bingo\n\n===\n\n1617509945607614467 [2023-01-23] @nosilverv 💜 5 🔁 1 [(SEED) type=quote_of_root]\nNon-doing/wu-wei: \"being done\"/doing-without-contraction\n\nActive doing-/active doing-not: \"doing\"/doing-with/thorugh-contraction\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1617509947662635008 [2023-01-23] @nosilverv 💜 3\nhttps://t.co/PGctZz2Mlm\n  [Quoting @nosilverv: You want high valence, not pleasure.  Resisting present state (either by fleeing pain OR pursuing pleasure) --&gt; low valence. Want other than what is: not here now -- Contraction  Surrendering to/accepting present state --&gt; high valence. Want what is: here now -- Uncontraction]\n↓\n1617510080668393477 [2023-01-23] @nosilverv 💜 3 🔁 1\nNon-doing/wu-wei: \"being done\"/doing-without-contraction -- high valence\n\nActive doing-/active doing-not: \"doing\"/doing-with/thorugh-contraction -- low valence\n\n===\n\n1633615145749430272 [2023-03-08] @nosilverv 💜 5 [(SEED) type=quote_of_root]\nBecause of the way the human mind works (see below) active injunctions are much better to formulate negatively, than positively (“Thou shall not” ~ “All not prohibited is allowed” - empowering - while “Thou shall” ~ “All is prohibited except what is allowed” - disabling -.) https://t.co/TW25qdneW1\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1633983452927098882 [2023-03-10] @nosilverv 💜 14 [(SEED) type=quote_of_root]\nI’m still on that “suffering is phantom limb pain” train. Like… it just feels to me like an affordance misfiring: like there’s something in my environment/experience I fail to accept and that I attempt to will into non-existence through the intensity of my suffering. https://t.co/TW25qdneW1\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1639879181386301442 [2023-03-26] @RichDecibels 💜 161 🔁 15\nemotional intelligence is the bottleneck on human progress\n↓\n1641110805339840513 [2023-03-29] @RichDecibels 💜 19 🔁 1\nno worries then\n\nhttps://t.co/0GRnnAcrPk\n  [Quoting Tweet 1640551881033367553 (missing)]\n↓\n1641112234406588419 [2023-03-29] @VividVoid_ 💜 28 [(SEED) type=semantic_search]\n@RichDecibels That kid is gonna grow up to have the most labyrinthine superego the world has ever known\n\nHope he makes it out alive\n\n===\n\n1664383827916242944 [2023-06-01] @5matthewdub 💜 12 🔁 2 [(SEED) type=quote_of_root]\nMy mother was always angry, and my job was soothing her. The family system would not permit my anger, so what could I do?\n\nOh, my young self noticed, I get mad when I want stuff. I'll just contort myself into this \"strangle desire at the root\" shape, that should fix everything! https://t.co/x0rQzsCpdX\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1705686577156948040 [2023-09-23] @m_ashcroft 💜 263 🔁 7 [(SEED) type=quote_of_root]\nThis is the best tweet on this site and I have no shame about boosting it again https://t.co/2TJogIuLBY\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n├── 1705703674536747042 [2023-09-23] @Rusty_Swarf 💜 1\n│   @m_ashcroft right up there withhttps://t.co/0HTQtoN1uK\n│     [Quoting @AskYatharth: if you do not feel comfortable with everything in your awareness, your awareness will narrow till you are]\n├── 1705724683067539641 [2023-09-23] @visakanv 💜 22\n│   @m_ashcroft my fav in this class of thing is this one, (which nicely complements your fav; congrats to everyone!) https://t.co/efg1rNTox0\n│     [Quoting @DRMacIver: A lot of visible problems that you can't seem to solve are secretly solutions you don't want to admit to adopting to problems you don't want to admit to having.]\n└── 1718373345186783547 [2023-10-28] @goblinodds 💜 3\n    @m_ashcroft omg directly pertinent to @dschorno's essay\n\n===\n\n1706286001130180877 [2023-09-25] @m_ashcroft 💜 95 🔁 6\nI genuinely believe we should teach the idea of letting go of accumulated physical tensions associated with internal and external expectations / predictions in schools https://t.co/l2SLfoX1g8\n  [Quoting Tweet 1699793240361484524 (missing)]\n↓\n1706286151600922845 [2023-09-25] @m_ashcroft 💜 14 [(SEED) type=quote_of_root]\nding ding ding https://t.co/Wgg6LtuJko\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1706286327933665596 [2023-09-25] @m_ashcroft 💜 12\nyep https://t.co/YkLJ7CZrrN\n  [Quoting @johnsonmxe: @metaLulie @moissanist Essentially, the muscular system (in particular smooth muscles &amp; fascia, and in particular VSMCs) holds tension as a way to restrict the patterns of the neural system. Sort of like how pinching a vibrating system reduces the ways it can vibrate. These pinches can be brief, or can…]\n↓\n1706286526244495413 [2023-09-25] @m_ashcroft 💜 13 🔁 1\nMmhmm https://t.co/WN0hVTbQzp\n  [Quoting @m_ashcroft: @myconautic “You translate everything, whether physical, mental or spiritual, into muscular tension.” F.M. Alexander.]\n\n===\n\n1706654787587002783 [2023-09-26] @loopholekid 💜 5 [(SEED) type=quote_of_root]\n\"tense the body into the higher &lt;OUTCOME&gt; probability shape\" is such a great handle on the clench https://t.co/zlikvpulew\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1706847264897995204 [2023-09-27] @profoundish 💜 3\nDoes anyone have a link to the \"Tensing myself into the ice cream position\" tweet? Search is not working out for me.\n↓\n1706854501036990467 [2023-09-27] @profoundish 💜 2 [(SEED) type=quote_of_root]\nThere we go! I think about this tweet a *lot*.\n\nhttps://t.co/86GDVd3MJ0\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1739580414573138168 [2023-12-26] @AskYatharth 💜 2421 🔁 108\na lot's changed for me. i no longer feel the need to be exceptional. i love myself. i love life\n\nbut the most jarring part of my experience still is how much residual judgment i feel of people i meet in everyday life. i call it the walmart problem\n↓\n1739581438998319200 [2023-12-26] @AskYatharth 💜 300 🔁 4\nit’s a niggling feeling of \"i wouldn’t want to be them.\" \"they’re another kind of people.\" not a class thing, it’s mostly anyone and everyone\n\nexcept a few people who i think are going to \"make it\", be able to change enough in their life to have peace\n↓\n1739581683631001861 [2023-12-26] @AskYatharth 💜 235 🔁 4\ni feel that judgment to anyone who doesn’t have specific pattern of tension in their body that says \"i am trying hard, i am fixing the thing\"\n\nit freaks a part of me out, when they don’t have it,\n↓\n1739581703897935923 [2023-12-26] @AskYatharth 💜 98\ni spent so much of my life thinking only a narrow set of people \"make it\", and still sort of do, that for me,\nhttps://t.co/cSUx1CKvte\n  [Quoting @AskYatharth: i can’t fix them as immediately. i couldn’t fix myself immediately either, but at least i could quiet the pain with fixing energy  it hurts to revisit that pain without the buffer of fixing energy]\n↓\n1739581970341048703 [2023-12-26] @AskYatharth 💜 79 [(SEED) type=quote_of_root]\nthe higher ice cream probability tension tweet\nhttps://t.co/V2ZGOBLEfZ\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1739825195916099774 [2023-12-27] @AskYatharth 💜 37\noh https://t.co/xOCYmwh1et\n  [Quoting @AskYatharth: sometimes i hate past versions of myself, or people who remind me of past versions of myself, because i consider him irredeemable  i worry, looking upon them, that they cannot be saved. so far are they from the painstaking growth i now have and cling to. so forsaken]\n↓\n1739925056363593930 [2023-12-27] @AskYatharth 💜 5\nwhy are people retweeting this personal tweet so much\n\n===\n\n1751707474867216864 [2024-01-28] @AskYatharth 💜 7 🔁 1\nnotes and observations on being around children 🧵 https://t.co/PYmLHid40e\n  [Quoting @AskYatharth: i still feel quite overwhelmed/afraid of children often   did this change for you? what changed?]\n↓\n1751707477178261989 [2024-01-28] @AskYatharth 💜 2\non betraying warmth towards kids https://t.co/x0tt0VLkXS\n  [Quoting @AskYatharth: american teachers often seem to lack something my indian teachers had-- a kind of warmth, and motherliness. without which it felt really hard to respect an adult as a kid  especially for kids 6yo and younger, that warmth is what gives attachment to an adult]\n↓\n1751707480902823961 [2024-01-28] @AskYatharth 💜 2\non expecting kids to be kids, not something else https://t.co/LvYJeYLdcO\n  [Quoting @AskYatharth: toddlers were expected to behave like toddlers  here, it seems parents are stressed every moment they have a kid in a restuarant, expecting them to behave like... not a toddler]\n↓\n1751707483310317920 [2024-01-28] @AskYatharth 💜 2\non helping kids do what they want to do https://t.co/wVp450zev7\n  [Quoting @AskYatharth: .@lilastories: the secret i was told to being around kids was \"figure out what they want to do, and help them do it\"]\n↓\n1751707486233731543 [2024-01-28] @AskYatharth 💜 2\non not being preoccupied with self, but actually paying attention https://t.co/6yhZjDnA2g\n  [Quoting @AskYatharth: it takes an actual kind of empathy  if you're preoccupied with self, you can't really pay attention]\n↓\n1751709555136893128 [2024-01-28] @sunriseoath  [(SEED) type=semantic_search]\n@AskYatharth This reminds me of a tweet I once saw about a father who kept saying that the ice cream parlor was too far whenever his daughter asked for some. One day, he decided to try saying, \"Yes, you want ice cream.\" And then she goes quiet and hugs him. I wish I could find it.\n\n===\n\n1758145964857057359 [2024-02-15] @nosilverv 💜 7 [(SEED) type=quote_of_root]\nThis analogy has layers bc undoing or dissolving that tension - the best strategy you had as a child - feels exactly like being an ice-cream ball, melting away on a hot summer day… https://t.co/TW25qdneW1\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1763509122081665027 [2024-03-01] @nosilverv 💜 106 🔁 6\nStarting to suspect that what I have, \"my\" whole life thought of as \"myself\", is in fact literally just tension, LMAO\n↓\n1763522294972825787 [2024-03-01] @rickbenger 💜 1 [(SEED) type=quote_of_root]\n@nosilverv I think of this tweet often\n\nhttps://t.co/ew6JVQhuLY\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1763522654038897016 [2024-03-01] @rickbenger 💜 2\n@nosilverv “Myself” is a higher x probability shape, held in tension\n\n===\n\n1787687636242669988 [2024-05-07] @tr_babb 💜 39 🔁 4 💬 1\nthe body abounds with software errors\n\nI had an upper respiratory virus this past winter (covid negative), and my throat got very sore\n\nsince healing, discomfort (not pain) with swallowing has lingered. my throat felt like it wasn't fully clearing saliva\n↓\n1787687637727564081 [2024-05-07] @tr_babb 💜 11 🔁 1\nthis feeling came and went, but finally yesterday I decided to direct serious body-attention to figuring out what was going on. was worried maybe there was scar tissue on my epiglottis, or worse, neuron damage\n↓\n1787687639237489103 [2024-05-07] @tr_babb 💜 11 🔁 2\nafter some minutes of experimenting, I think I figured it out: the sore throat had trained my tongue to swallow without touching it there, lest it spike with pain. it'd retained this habit past the original problem\n↓\n1787687640629961154 [2024-05-07] @tr_babb 💜 17 🔁 2\nI noticed this when I tried forcing my tongue in different positions while swallowing, and discovered a subtle \"flinch\" sensation, expecting pain to come when pushing on the back of my throat; and \"surprise\" when none came\n↓\n1787687642072821976 [2024-05-07] @tr_babb 💜 17 🔁 1\nI'd unconsciously adapted to lose an important \"wiping\" gesture that was clearing away saliva. when I deliberately put it back, it felt better\n\nI've been deliberately practicing the normal motion all day and I think it's working. repetition should extinguish the pain-expectation\n↓\n1787687643523981737 [2024-05-07] @tr_babb 💜 26 🔁 2 [(SEED) type=quote_of_root]\nI think this kind of stuff is common in the human condition. the direct emotional equivalent to this is  trauma; aka carrying an adaptive behavior into a situation where it is no longer helpful\n\n(that pattern is the source of a huge amt of human suffering)\nhttps://t.co/zZ6XSRYAiS\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1787687645851889761 [2024-05-07] @tr_babb 💜 12 🔁 1\nI've seen this in myself in other cases too. an arm muscle problem fixed by very slightly adjusting how I held my hands on my keyboard. adjusting my running gait months after an ankle injury months after it had healed\n\nostensible hardware problems that were all entirely software\n↓\n1787687647307354175 [2024-05-07] @tr_babb 💜 6\nI wonder if this is just me, but I see hints of the same shape of problem sometimes in other people— a coworker who held his weight strangely on his left foot; his entire shoe crushed and contorted under his heel. years of that would certainly do Bad Things to joints, tendons\n↓\n1787687648620097652 [2024-05-07] @tr_babb 💜 9\nsomeone else who was battling neck problems; had micro-adjusted every aspect of their work setup; was on painkillers, etc etc\n\n\"what's your sleeping position?\"\n\n\"...\"\n\"hmm, yeah, it is kind of contorted\"\n\nproblems went away shortly after that discussion\n↓\n1787687650188734483 [2024-05-07] @tr_babb 💜 8\nI've said this in another thread, but I think unusual shoes (i.e. barefoot / toe shoes) do their work by forcing people to totally reinvent bad gaits that are probably enabled by cushy modern shoes. if your gait is ~okay, these will probably do ~nothing for you\n↓\n1787687651610624472 [2024-05-07] @tr_babb 💜 14 🔁 2\nI wonder what fraction of chronic, bizarre, idiopathic health problems are things that could potentially be solved by very careful observation and introspection. sadly these moves are hard to teach\n↓\n1787687653066105148 [2024-05-07] @tr_babb 💜 9\nI'm still somewhat unsure of whether to characterize my current experience as tiny-brain body awareness or giant-brain. it's quite possible I'm only able to make these simple fixes because I'm dumb enough to have them in the first place\n↓\n1787687654454444451 [2024-05-07] @tr_babb 💜 5\nbut in other areas of life I think I tend to be outlier-observant, so 🤷\n\n===\n\n1796064134402031920 [2024-05-30] @tr_babb 💜 2\nsaw a guy on the street today who was wearing quite a deep frown, it looked very much like that's just how he holds his face; the lines of its shape worn in, skin grown to accommodate the strain\n\nmade me realize the ol \"stop making that face, it'll stay that way\" is totally true\n↓\n1796064466309673360 [2024-05-30] @tr_babb 💜 1 [(SEED) type=quote_of_root]\n\"ice cream probability shape\" but for a long-held feeling that puts particular muscle tension in your face\nhttps://t.co/rf3cDrbtsa\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1796065158453719272 [2024-05-30] @tr_babb \nactually I was waiting in line for ice cream when I saw this, come to think of it\n\nimagine the guy with the deepest frown &amp; world-weary face queueing up for ice cream\n\n===\n\n1802789213886365759 [2024-06-17] @johnsonmxe 💜 259 🔁 19\nQuick model of jhanaThe vasomuscular system (“tension”) acts to collapse uncertainty, set context &amp; stabilize local neural patterns. Actions of this system typically feel bad. But you can also use it as a wave machine to feel good. Each jhana is a different wave machine setting\n↓\n1802789308304445919 [2024-06-17] @johnsonmxe 💜 34 🔁 1\nI wrote about the computational role of the vasomuscular system last year. Basically, vascular smooth muscle cells (VSMCs) shake nearby neurons when they get stuck in ambivalence, and clench to freeze nearby neural patternshttps://t.co/vzGxzCVukw\n↓\n1802789372326236460 [2024-06-17] @johnsonmxe 💜 30 🔁 1\nUsually this muscle contraction logic is highly local. VSMCs essentially act as busybody micromanagers of nearby neurons: a little more blood *here* &amp; a little more tension *there*, and prediction error goes down…https://t.co/205pbA3nRw\n↓\n1802789577364828411 [2024-06-17] @johnsonmxe 💜 30 [(SEED) type=quote_of_root]\nA great example of this system is how muscles focus our eyes by micro-adjustments in tension — probably something similar happens in lots of tissues. The primary task of VSMCs is to contract, release, &amp; clench in a way that minimizes prediction errorhttps://t.co/XCb1s2Jr5T\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1802789735192240568 [2024-06-17] @johnsonmxe 💜 32\nWe have two ways of minimizing prediction error: passive inference (build good models of the world) and active inference (create predictions, then make them true). I believe the latter is managed by VSMCs: tension is prediction, prediction is tensionhttps://t.co/OXkqzVRUfg\n  [Quoting @johnsonmxe: @metaLulie @moissanist Essentially, the muscular system (in particular smooth muscles &amp; fascia, and in particular VSMCs) holds tension as a way to restrict the patterns of the neural system. Sort of like how pinching a vibrating system reduces the ways it can vibrate. These pinches can be brief, or can…]\n↓\n1802789805992059140 [2024-06-17] @johnsonmxe 💜 42 🔁 5\nHuman imagination (and thus tension) is roughly the most powerful force in the universe: if we imagine something, we slowly reorganize our bodies, families, &amp; civilizations to expect and conjure it — whether it’s good or bad\n↓\n1802789867203838066 [2024-06-17] @johnsonmxe 💜 31\nJhanas repurpose this system by pointing it at predicting (creating) internal harmony. “There is a warm and pleasant feeling here.” Now your VSMCs’ job is to make that true. The most effective way to instantiate this is coordinated waves traveling through the body’s muscles\n↓\n1802790088797299172 [2024-06-17] @johnsonmxe 💜 29\nI.e. jhanas turn the body’s muscles into a wave machine that rhythmically agitates nearby neurons. We’re not in the habit of using our muscles like this because most settings produce destructive interference — feels bad. But some produce constructive interferencehttps://t.co/qBNazJ6xMW\n↓\n1802790161975288104 [2024-06-17] @johnsonmxe 💜 22\nIt can be slow to find the right rhythms for constructive interference — most regions have a dominant frequency but bodies have many regions. But harmony anywhere makes harmony easier everywhere else: once we dial it in somewhere, the muscular waves can slowly spread\n↓\n1802790264437969134 [2024-06-17] @johnsonmxe 💜 22\nJhana 1 would be the most frothy harmony. Once it becomes strong and recruits most of the body, the most effective way to further reduce the prediction error for bodily pleasure is to turn down the froth — to reduce the power of rhythmic agitation\n↓\n1802790329449681077 [2024-06-17] @johnsonmxe 💜 23\nPutting you into jhana 2, a less frothy state. This repeats with each step, until the neural system can find its own subtle resonances by itself — the “formless jhanas”. The wave machine is just a whisper at this point, ripples on a glassy lake\n↓\n1802790406083531138 [2024-06-17] @johnsonmxe 💜 22\nThe lower jhanas have to happen first because your vasomuscular system is busy trying to reduce local prediction error. As you point it inwards &amp; recruit it into helping create global waves, it helps then ‘gets out of the way’. The pleasure becomes more refined\n↓\n1802790498840842251 [2024-06-17] @johnsonmxe 💜 22\nI.e. you can’t jump into upper jhanas directly because your attention is external, vasomuscular system is busy, and neural system is noisy. Solution: point your busybody vasomuscular system inwards by predicting a certain sort of pleasure; as it succeeds it attenuates itselfhttps://t.co/e5RzoqPUnz\n↓\n1802790586946363662 [2024-06-17] @johnsonmxe 💜 21\nI’ve written before that each jhana is like a new phase of matter — and such phase shifts will change system resonant frequencies. But with the vasomuscular system quiet and everything so close to criticality, the system can immediately snap to the new rhythmhttps://t.co/jdik8ncD9Ghttps://t.co/xwcnuXnY7i\n\n===\n\n1825215568338899070 [2024-08-18] @danallison 💜 16\nI made this drawing about 20 years ago after having a dream about a kid running around screaming I AM AN ANIMAL!This animal child character has recently demanded my attention again. I’m writing this 🧵 to process and to share whatever insights it yields. https://t.co/RyC5KEkvAG\n↓\n1825215571551723780 [2024-08-18] @danallison 💜 2 [(SEED) type=quote_of_root]\nI think it’s safe to say that most people have some version of this character in their psyche. Anyone who was forced to sit still in a classroom for hours a day for most of their childhood is not going to come out of that with a well integrated inner animal child. https://t.co/4UsxpsGwCc\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1825215573758030003 [2024-08-18] @danallison 💜 1\nInner animal child popped up for me a few days ago after I posted this tweet. I posted it half jokingly, but I’m actually taking the intention pretty seriously as a long term commitment to becoming this kind of person. However, inner animal child was not happy about this plan. https://t.co/s1Poeyph71\n  [Quoting @danallison: Starting today, I am a calm focused guy. https://t.co/7X2tbdeXQ8]\n↓\n1825215580015824978 [2024-08-18] @danallison 💜 3\nInner animal child knows how this story ends and has zero interest in cooperating. https://t.co/qia5CC6aye\n↓\n1825215585342677165 [2024-08-18] @danallison 💜 1\nSeems like an impasse. Inner responsible adult wants me to become “calm focused guy”, inner animal child refuses to cooperate. What do?\n↓\n1825215587272032753 [2024-08-18] @danallison 💜 2\nThere’s a temptation to frame this situation as a Problem To Solve. But if that’s how we frame it, then we’ve already lost. Inner animal child knows exactly who we’re talking about when we say “problem”.\n↓\n1825215589398516054 [2024-08-18] @danallison 💜 3\nSo if it’s not a problem, what is it? One answer that feels resonant right now is play. We’re playing. We’re always playing. Life is play. There are no Problems, only Games.\n↓\n1825215591520887193 [2024-08-18] @danallison 💜 2\nSo what’s the game we’re playing? That’s up to us. We get to be creative and see what’s fun and what’s not. One game idea I’ll call CF guy. If animal child doesn’t want to be Calm Focused guy today, then maybe Curious Friendly guy or Compassionate Funny guy or Creative Fast guy.\n↓\n1825215593555153281 [2024-08-18] @danallison 💜 1\nI guess I’m basically just doing inner parenting here. That’s all I’m really talking about. Animal child wants a loving parent who is present and willing to play, not a disciplinarian who seeks to control.\n↓\n1825215595467702587 [2024-08-18] @danallison 💜 1\nRelevant thread https://t.co/9tuRSoz8iF\n  [Quoting @danallison: Every man needs at least one deep loving bond with an imaginary animal. https://t.co/0C9vz24zyk https://t.co/Xge1LwHfqp]\n↓\n1825215598626037779 [2024-08-18] @danallison 💜 1\nOk so that was part 1 of the story. Part 2 requires some context. In 2017 I switched to a vegan diet. In 2019 I started having health problems. Digestion issues, thyroid issues, fatigue, PEM, brain fog. These problems have made it difficult to function.\n↓\n1825215600567959674 [2024-08-18] @danallison 💜 1\nI recently started an Ayurvedic treatment program with @findradiance after reading @the_wilderless’s tweets about his positive experience. https://t.co/qww9JRKdQS\n  [Quoting @the_wilderless: In the past 3 days, I’ve given 3 different impromptu hype sessions on how good my Ayurvedic treatment with @findradiance has been,,  so now seems like a good time to put some milestones in public without needing to rant at people one by one.  https://t.co/ZQTDiYYC3C]\n\n===\n\n1828489015298761129 [2024-08-27] @pepijndevos 💜 7 [(SEED) type=semantic_search]\n\"If you get a good grade there will be ice cream\" said the parent.\n\n\"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to structure their life in the high grade probability shape. https://t.co/T57CdO92Ix\n  [Quoting @yashkaf: for most young people, dating is the first pursuit of their lives that isn't about getting a grade or satisfying an authority figure  as a result, they find dating incomprehensible and terrifying and seek to avoid it as much as possible https://t.co/cDIWe5GmcK]\n\n===\n\n1847916573463380416 [2024-10-20] @tasshinfogleman 💜 25 🔁 1 [(SEED) type=quote_of_root]\nshe’s bouncing on it doing her best to physically relax her body out of the higher ice cream probability shape she contorted herself into as a child https://t.co/V2Z5RgdvRX\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1854686899283411364 [2024-11-08] @__venki__ 💜 4\na steelman for labor conflict theoryso the lefty/marxist claim of labor goes like ~= labor is adversarial, employers seek to best employees, it'll always be like this.the optimistic neolib claim is ~ actually we can all be reasonably aligned via progress/growth.\n↓\n1854686900327793147 [2024-11-08] @__venki__ 💜 1\nlabor becomes more productive - and we split the gains. you see higher real wages.if we can eg: solve growing costs of housing, healthcare, infra - we can all win.my counter-claim: high costs of housing/healthcare are a feature not a bug\n↓\n1854686901409923393 [2024-11-08] @__venki__ \nthe outline goes as follows: the carrot of greater consumption alone is insufficient. people begin to opt-out a la mr money mustache &amp; FIRE.if you wanna maximize growth, actually, you should actively encourage other non-govt taxers on the working to middle class\n↓\n1854686902622077288 [2024-11-08] @__venki__ 💜 1 [(SEED) type=quote_of_root]\nif housing was cheap &amp; healthcare was state provided, maybe more people would work a part-time job and make art. this is bad for gdp-maxxing.you want your populace to physically tense their body into the higher expected economic contribution state.https://t.co/00d8E85VMi\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n↓\n1854686904391991476 [2024-11-08] @__venki__ 💜 1\nyour citizenry shouldn't have slack, you should foster systems that are Out to Get Themthey must believe that if they're not maximizing their expected income they're going to have a bad time. no slow boho life for them!! https://t.co/ULQKKtBa2f\n↓\n1854686906585694468 [2024-11-08] @__venki__ 💜 1\nso, as real wages grow, you must ensure that the share of gdp from industries that are best at being \"out to get you\" also grow fast.you want to foster more of a sense that if you don't attempt income maximization catastrophe could hit\n↓\n1854686907588133082 [2024-11-08] @__venki__ 💜 1\nso yeah that's the case for why ~the lefties may be right, and there could be these fundamentally misaligned incentives between the coalition of those interested in gdp growth and the workers\n↓\n1854686908649291791 [2024-11-08] @__venki__ 💜 1\nunclear to me if this is real, also this feels rather conspiratorial. buuut - this is imo a good case for why, eg: non-nationalized health insurance might improve growth, even if nationalized health insurance may seem pareto optimal in terms of {care, money spent}\n\n===\n\n1901909392418803747 [2025-03-18] @etirabys 💜 52 [(SEED) type=semantic_search]\nwhen I was a kid I would ask for an ice cream outing, and depending on her mood my mom would either cheerfully agree or scold me for wanting/suggesting it. this was a kind of annoying trait I didn't mind too much, but I also see myself accidentally doing this and I'd like to not\n\n===\n\n1902431082957447170 [2025-03-19] @anesmithbeck 💜 3\n\"Oh, the shapes we learn to hold\nLike origami of the soul\nFolded neat and folded clean\nTill we forget how to unfold\"\n\nhttps://t.co/qiUz7oG2Q3\n↓\n1902431111587737899 [2025-03-19] @anesmithbeck  [(SEED) type=quote_of_root]\nContext https://t.co/u0yIKmTh7H\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1921221820008542315 [2025-05-10] @Tangrenin 💜 6\n@reconfigurthing liking that tweet reminds me of the time he taught me tetris rolling (insane finger technic for competitive fast inputs), and it was the same. I had to pause and re-embody myself otherwise all my muscles were trying to tense my whole body into a 'focused' shape https://t.co/hKTn6uijfD https://t.co/DzF2OBjjd7\n  [Quoting @Tangrenin: Parrying in games is a really fun mindfulness/non-doing exerciseYou can notice all kinds of doing prepping bracing etc arise, and notice how it fucks you up lolAnd when your fingers parry a full combo right before your empty mind, you're just left there in awe, \"I\" did that?!]\n↓\n1921221823791788239 [2025-05-10] @Tangrenin 💜 4\nI think he said \"it's the most tensed i've seen you lmao\". Really a good quick example of how Alexander Technique can prevent injuries you wouldn't even see coming\n↓\n1921222298972860736 [2025-05-10] @Tangrenin 💜 3 [(SEED) type=quote_of_root]\nrelated: this old time classic https://t.co/bmHC5mcGCC\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1929001827175117246 [2025-06-01] @the_wilderless 💜 752 🔁 27\njust went and got coffee and there were a couple young kids (~2 & ~5ish?) there w their parents; a song came on they liked and they immediately leapt up and started dancing,\n\nand my first impression was the whole 'kids are so free and uninhibited, they just get up and dance' thing,,\n\nand then i noticed how that thought felt automatic-habitual, and not from presence, so I dropped into Presence,\n\nand actually Saw the kids dancing and realized that train of thought is bullshit in a lot of ways I haven't seen people talk about before? \n\nLike, kids aren't these free-flowing uninhibited streams of energy before society taught them how to behave,\n\ntheir movements were jerky, stiff, they were clearly locked up in a lot of their torso and limbs, their attention laser-focused on how their parents were responding and re-adjusting their movements around that,\n\nthey were just as anxious and locked-up as a lot of adults, just in a very different orientation, an orientation aimed entirely at trying to pull approval from their parents, rather than to avoid disapproval from strangers\n↓\n1929022991439896645 [2025-06-01] @nekyias 💜 11 [(SEED) type=quote_of_root]\n@the_wilderless YES. THANK YOU. \n\nAlso an echo of one of my fav tweets of all time: \n\nhttps://t.co/d44hEtprPK\n  [Quoting @RomeoStevens76: \"If you manage to control yourself there will be ice cream\" said the parent.  \"I sure hope this doesn't have unforeseen lifelong consequences\" thought the child, doing their best to physically tense the body in the higher ice cream probability shape.]\n\n===\n\n1950657485372559765 [2025-07-30] @LeahLibresco 💜 2236 🔁 172 💬 1\nMy 1y: (grabs my hands and claps them)\n\nMe: Oh, sweetie, when a measure becomes a target, it ceases to be a good measure\n↓\n1950717474204237958 [2025-07-31] @plovener  [(SEED) type=semantic_search]\n@LeahLibresco The kid may not understand now, but when this is needed it will come back to them.\n\n===\n\n1959657740109783123 [2025-08-24] @eigenrobot 💜 6758 🔁 205\nafter becoming a parent i subconsciously classified everyone i know into \"trust to watch my kids,\" \"trust only with direct supervision,\" and \"you will never meet my children\"\n\nfairly stressful when latter two groups include family\n\nbut what can one do\n↓\n1959659316463714776 [2025-08-24] @eigenrobot 💜 31 [(SEED) type=semantic_search]\n\"can i take your child out for ice cream\"\n\n(well the truth is you have the maturity of a twelve year old and i do not trust you to drive with my daughter in your car)\n\n\"why dont i meet you at the ice cream place, easier than switching car seats\"\n↓\n1959662369392497095 [2025-08-24] @eigenrobot 💜 437 🔁 8\nthird category is like\n\nare you incapable of not being on drugs or not talking about sex in front of kids. or do you have an Agenda about how to raise kids that you feel obligated to impose on mine\n\nterrible signal! you should know not to do that!\nhttps://t.co/mgCtOaiQDT\n  [Quoting @eigenrobot: @PuzzlerSharpe its rare but man some people just have no concept of how terrible their lifestyles are for kids to be exposed to, and no filter]\n↓\n1959674833077195021 [2025-08-24] @BellaRudd1 💜 2\n@eigenrobot true sex people do not limit opportunities w parents by being weird around their kids\n\nergo someone that desires to talk about sex around kids should not be trusted regarding sex\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand traces the multi-year evolution of a psychological/somatic concept anchored by RomeoStevens76's 'Ice Cream Probability Shape' tweet (2021). The boundary object is the metaphor of childhood conditioning creating lifelong muscle tension patterns. The discourse is primarily constructive—practitioners of Alexander Technique, somatic therapies, and contemplative practice use the tweet as a shared reference point to explore how early conditioning manifests as physical tension, and how to release it. The arc moves from initial recognition (Qiaochu's 2019 pre-context on school conditioning) through Romeo's crystallization, into practical applications (Rich's TRE/MDMA experiments, Yatharth's 'Walmart problem'), and finally theoretical synthesis (Johnsonmxe's vasomuscular computation model). The strand demonstrates high evolution—from abstract critique to embodied practice to mechanistic theory—and high utility for both the contemplative community and outsiders seeking to understand psychosomatic patterns.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1206274875112841217,
        "annotation": "Pre-context: Qiaochu identifying the core problem—school/parents create conditioning that doesn't serve adult life"
      },
      {
        "tweet_id": 1455068457091756034,
        "annotation": "The Artifact: Romeo's Ice Cream tweet—the boundary object that crystallizes the concept of tension-as-strategy"
      },
      {
        "tweet_id": 1455958356934467588,
        "annotation": "Early interpretation: M_ashcroft connecting to 'trying not to try' and Alexander Technique's cessation of effort"
      },
      {
        "tweet_id": 1524408561144668161,
        "annotation": "Expansion into consent: Tyler linking childhood conditioning to adult problems with agency and desire"
      },
      {
        "tweet_id": 1574597642864435200,
        "annotation": "Somatic application: M_ashcroft on muscle tension as inappropriate cause-effect learning, introducing AT as solution"
      },
      {
        "tweet_id": 1610358856273592324,
        "annotation": "Experimental breakthrough: Rich's discovery of TRE+MDMA for releasing stored tension without therapist"
      },
      {
        "tweet_id": 1739581970341048703,
        "annotation": "The Walmart Problem: Yatharth's viral thread on judging people who lack 'fixing tension'—showing cultural spread"
      },
      {
        "tweet_id": 1787687643523981737,
        "annotation": "Case study: Tr_babb's throat tension as software error—concrete example of the pattern in daily life"
      },
      {
        "tweet_id": 1802789577364828411,
        "annotation": "Theoretical synthesis: Johnsonmxe's vasomuscular computation model explaining the mechanism behind tension-as-prediction"
      },
      {
        "tweet_id": 1929001827175117246,
        "annotation": "Present-day application: The_wilderless noticing the pattern in dancing children—showing concept's ongoing utility"
      }
    ]
  }
}