{
  "seed_tweet_id": 1459068390669176832,
  "thread_text": "1259564748997308419 [2020-05-10] @strangestloop 💜 499 🔁 45 💬 1 [(SEED) type=semantic_search]\nintended vibes: friendly, intentional, thoughtful, playful, empathetic, authentic, creative, optimistic, curious, kind 💪🦚\n\n===\n\n1313353150460497923 [2020-10-06] @BLUNDERBUSSTED 💜 10 [(SEED) type=semantic_search]\ni love you guys, i live this space on twitter i inhabit. weird minds, creative, supportive. right mix of shitposting and effortposting. people looking for a confederacy of friends and attention without pretense or too many airs. good people, you.\n\n===\n\n1389186670000545807 [2021-05-03] @tasshinfogleman 💜 35 🔁 5\nthis is a @Knipps appreciation thread: sharing what I’ve learned from him about the Art of the Reply. In case you didn’t know, Knipps is the BEST REPLY GUY: \nhttps://t.co/1yd8Tpdegd\n  [Quoting @tasshinfogleman: @Knipps your brand is BEST REPLY GUY]\n\n===\n\n1389187344293670915 [2021-05-03] @tasshinfogleman 💜 12\nhere are some of the inspirations he shared:Jeff Bezos: \"It’s harder to be kind than clever\"\n↓\n1389187345044361221 [2021-05-03] @tasshinfogleman 💜 10\nhttps://t.co/ba2FvuaoB3\n  [Quoting Tweet 551130145340153856 (missing)]\n↓\n1389187347263201280 [2021-05-03] @tasshinfogleman 💜 27\nthis quote from Tyler Cowen on the Tim Ferriss show (#413, 1:19:22):https://t.co/5oyZum4Stw https://t.co/tiaS7Eyfyr\nImages:\n  - [Image #0] The image is a text-based image showing a transcript of a conversation between Tim Ferriss (TF) and Tyler Cowen (TC). The text reads:\n    \n    TF - What does that look like - being kinder to people? Why did that become a focus for you?\n    \n    TC - If you can be encouraging in a non-trivial way - it can really mean a lot to people, and it takes several kinds of effort. There's effort in the moment, but also the skill of how to sincerely have a sense of what would be the encouraging thing to say - and it seems to me that's greatly undersupplied in the world. Like some of the things that are undersupplied are just people telling people what they're good at, which happens plenty, but really kind of accurate and incisive. \"This is what you're good at and why\" - greatly undersupplied. Supplying people, especially younger people, visions of what they could be - greatly undersupplied.\n    \n    To recreate this image, you would need to copy the exact text and formatting, including the attribution of the speakers (TF and TC) and the content of their conversation, and present it on a plain white background.\n↓\n1389187348420829186 [2021-05-03] @tasshinfogleman 💜 12\n(Tyler goes on to explain in that episode that that's why he does his EV grants... the money is symbolic, a way to encourage people and make it real for them that he believes in them)\n↓\n1389187349305860096 [2021-05-03] @tasshinfogleman 💜 12\n\"People share things that make them look 💯\"https://t.co/qUUyJa4K3Q\n  [Quoting Tweet 1387463948312719370 (missing)]\n↓\n1389188149016936452 [2021-05-03] @tasshinfogleman 💜 10\nhere's some of the wisdom he shared with me about excellent reply game:\n↓\n1389188149826441216 [2021-05-03] @tasshinfogleman 💜 15\n\"Reply game is an infinite game, akin to improv, 'yes and'\"\n↓\n1389188151072247809 [2021-05-03] @tasshinfogleman 💜 15\n\"Make it easy for people to understand/continue the game/dance of replies\"\n↓\n1389188151973908481 [2021-05-03] @tasshinfogleman 💜 17\n\"people LOVE to be showered in likes. And they cost nothing\"\n↓\n1389188152800288768 [2021-05-03] @tasshinfogleman 💜 13\nEmbody: \"Energy, enthusiasm, &amp; energy. Gratitude. Making people feel appreciated. Warm &amp; fuzzies.\"\n↓\n1389188153630658566 [2021-05-03] @tasshinfogleman 💜 11 [(SEED) type=semantic_search]\n\"Make it relevant with universal feelings. Helps to know who you're replying to\"\n↓\n1389188154494697474 [2021-05-03] @tasshinfogleman 💜 15\n\"Mirroring also very good. Should not only be fun for you, but recipient. I used to make a lot of jokes that were to entertain me, that no one else got. Everyone wants to be in on the joke\"\n↓\n1389188155425890305 [2021-05-03] @tasshinfogleman 💜 14\n\"Sometimes a good reply is finding that thread from 3 days (or months) ago\"\n↓\n1389188156252172291 [2021-05-03] @tasshinfogleman 💜 10\n\"I like to share relevant threads, but most folks don’t want to work for a response\"\n↓\n1389188157061713921 [2021-05-03] @tasshinfogleman 💜 13\n\"QT is good if you have a lot of thoughts to add, to avoid clogging someone else’s mentions. and it goes without saying: no dunking\"\n↓\n1389188157997035523 [2021-05-03] @tasshinfogleman 💜 12\n\"you can’t keep every conversation going indefinitely, you’ll go mad\"\n↓\n1389188158810693636 [2021-05-03] @tasshinfogleman 💜 14\ni asked @Knipps about some of his favorite replies. here's my favorite of the ones he shared: https://t.co/N97LUs1o1r\n  [Quoting Tweet 1373393632930131968 (missing)]\n↓\n1389188160010309633 [2021-05-03] @tasshinfogleman 💜 12\nand some final words of wisdom from Knipps: \"I’m also still learning...\"\n↓\n1389188160916279297 [2021-05-03] @tasshinfogleman 💜 18\nif you haven't already followed @Knipps, can't recommend following him enough! he's friendly and fun to be around and I've learned a lot from his example. here's to cultivating the art of the reply together, and being better friends!\n↓\n1462699512300916736 [2021-11-22] @tasshinfogleman 💜 6\n@Knipps https://t.co/VPhQcpoS3X\n  [Quoting Tweet 1459247300119707652 (missing)]\n\n===\n\n1450685539825319938 [2021-10-20] @visakanv 💜 458 🔁 43 [(SEED) type=semantic_search]\nin this house we believe in:\n\n- let curiosity drive\n- QT to support, never to dunk\n- joke about outcomes you want\n- introduce people to each other\n- practice good reply game\n- give sincere compliments\n- experiment with frames\n- baby steps\n- do 100 thing\n- shitposting\n- ayy lmao\n\n===\n\n1459068390669176832 [2021-11-12] @MasterTimBlais 💜 1585 🔁 174 💬 26 [(SEED) type=root]\nIN THIS HOUSE WE\n\n- REPLY like it's IMPROV\n- hold our beliefs LOOSELY\n- be FRIENDLY, AMBITIOUS NERDS\n- FLIRT with ABANDON\n- MUTE POLITICAL RETWEETS\n- AMPLIFY the GOOD\n- DISTRUST UNHAPPY INTELLIGENCE\n\nand always ALWAYS like before replying\n↓\n1499003481843290121 [2022-03-02] @frideswyth 💜 3\n@MasterTimBlais - Always kindly quote tweets\n\n===\n\n1464784752259608581 [2021-11-28] @frideswyth 💜 16 🔁 1 [(SEED) type=semantic_search]\nThis house believes: \n\nWe’re on each others team\n\n===\n\n1470498565608853517 [2021-12-13] @grin_io 💜 25 🔁 2\na vibe board 🧵 on the ingroup network state\n↓\n1470499338996625409 [2021-12-13] @grin_io 💜 12\nthe goal\n\nhttps://t.co/ShB1l4CEzy\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1470499459834466309 [2021-12-13] @grin_io 💜 11\nthe roadmap\n\nhttps://t.co/VJwLvHDLXc\n  [Quoting Tweet 1269178671086006273 (missing)]\n↓\n1470501022275706880 [2021-12-13] @grin_io 💜 6\nmore from @balajis \n\n(https://t.co/LS5aSqhALs is also good)\n\nhttps://t.co/nlikMSJWxH\n↓\n1470501837694541827 [2021-12-13] @grin_io 💜 9\n\"squads allow social currency and financial capital to inter-convert, creating opportunities and group resiliency that would have been impossible to achieve alone.\"\n\nhttps://t.co/QPqe6ZxZRs\n↓\n1470503954937176067 [2021-12-13] @grin_io 💜 7\ningroup thrives in public. no dark forest needed\n\nhttps://t.co/L0ri14YYG1\n↓\n1470504803239448583 [2021-12-13] @grin_io 💜 12\nbridging dark forests with Moving Castles\n\nhttps://t.co/j21AxWOU9y\n↓\n1470505499716108303 [2021-12-13] @grin_io 💜 8 [(SEED) type=quote_of_root]\nbenefits\n\nhttps://t.co/4dMAYJV9oO\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1471505280718426115 [2021-12-16] @grin_io 💜 6\nnext steps: distill vision\n\nhttps://t.co/BmBIOJQ8oH\n  [Quoting Tweet 1302682614701068288 (missing)]\n↓\n1471505739998908417 [2021-12-16] @grin_io 💜 6\nuntil we can explain how to do this\nhttps://t.co/qhp3QkGYfR\n  [Quoting Tweet 1459657233428410373 (missing)]\n↓\n1475284398127910919 [2021-12-27] @grin_io 💜 9\nmore of us are into this than you'd think\n\nhttps://t.co/fOY2svyjSr\n  [Quoting @loopholekid: Here's the vision:  Autonomous villages spread across the globe that are guided by Living Well that establish their own industry and are networked together by frequent travel between locations    Less commune, more loose assemblages w/ access to the foundational tech for civs]\n├── 1475302725185327110 [2021-12-27] @loopholekid 💜 2\n│   @grin_io Feeling like this might be the Big Project™ here\n└── 1475309120605634561 [2021-12-27] @grin_io 💜 6\n    https://t.co/1Rl9q6Qebt\n      [Quoting Tweet 1475288339859214338 (missing)]\n    ↓\n    1483566821332692999 [2022-01-18] @grin_io 💜 4\n    https://t.co/Hk2Au9jWlZ\n      [Quoting Tweet 1478480640131567625 (missing)]\n    ↓\n    1484208869131890689 [2022-01-20] @grin_io 💜 2\n    alternate framing: not a network state but a @metalabel_xyz \n    \n    https://t.co/z0c6DkQoSf\n\n===\n\n1472956318105452547 [2021-12-20] @AskYatharth 💜 5 [(SEED) type=quote_of_root]\nit’s strange, right? what’s wrong right making this explicit\n\nit’s fun as an injoke seriousshitpost in its context\n\nit’s even fine as a set of guidelines for a group of rats https://t.co/LhmmHtE2Kn\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1472956326405976071 [2021-12-20] @AskYatharth 💜 3\nbut there’s something about group of people holding up “REPLY like its IMPROV” as a value that can corrupt the whole vibe\n↓\n1472956329560096775 [2021-12-20] @AskYatharth 💜 3\nit’s the kind of thing where rigour is brought to an intermediate value in a way that allows for the wholer thing to be forgotten or lost\n\nand it seems *fine* in the moment\n↓\n1472956332701470720 [2021-12-20] @AskYatharth 💜 3\nbut eventually people who don’t understand the whole thing very well but do understand goodharting this thing well take over\n\nthe others downscale their engagement or leave\n\nnothing particularly explicit\n↓\n1472956335448891392 [2021-12-20] @AskYatharth 💜 2\nin its place is a vibe that is only a touch more desperate than the original, but the flavour is visible to see\n\nthis is what happened with the circling institute community and a many others\n\nhttps://t.co/NgVRplq6mf\n  [Quoting @AskYatharth: @magghu Personally, it can feel like these people have an axe to grind. They found some modicum of control and expression here, if not in their normal social worlds and normal lives. Then there is a defence of it. “You’re doing this wrong!”]\n↓\n1472962891376742405 [2021-12-20] @AskYatharth \nthe people that remain remain with a touch more desperation\n\ni would know\n\nim one of them https://t.co/GcdgTWX73k\nImages:\n  - [Image #0] The image is a screenshot of a Twitter profile page.\n    \n    The image shows a man lying on the ground, with a Twitter profile page superimposed over it. The profile page is dark blue and features the following information:\n    * Profile picture: A circular photo of a man with dark hair and a beard.\n    * Username: @AskYatharth\n    * Display name: Yatharth\n    * Bio: A series of emojis representing various themes, followed by the text \"vibes | rigorously sensitive | DMs welcome |\" with the words \"rigorously sensitive\" highlighted in olive green.\n    * Additional information:\n      + Alternative Twitter handle: @AltYatharth\n      + Location: Stanford\n      + Website: admonymous.co/yatharth\n      + Birthdate: July 30, 1990\n      + Join date: September 2010\n      + Follower count: 1,962\n      + Following count: 1,303\n↓\n1472962894388240399 [2021-12-20] @AskYatharth 💜 1\nthis is partly a joke\n\nthere’s nothing actually wrong with orienting towards being rigorously sensitive\n\nbut . . . there’s something about it that is compatible with and can mask a certain desperate goodharting\n↓\n1472962918002089987 [2021-12-20] @AskYatharth 💜 1\nthere’s something about that desperation that is familiar to me\n\nto the extent it’s been part of me, i smell it with a certain clarity \n\nto the extent ive participated in those dynamics as someone who did not know how to be *real*, i can see the corruption it can produce https://t.co/pXSGSGJAWj\nImages:\n  - [Image #0] The image is a screenshot of a text conversation. The text is transcribed as follows:\n    \n    - 7:41 PM: \">What's the style / I dont know how to explain, but this sentence is actually part of it\"\n    - 7:41 PM: \"dang\"\n    - 7:42 PM: \"Heh 'rigorous sensitivity' is a good descriptor actually\"\n    - 7:43 PM: \"reallyyyyy\"\n    - 7:44 PM: \n      - \"Yes.\"\n      - \"Basically, ANYTHING that has positive social returns is ripe for goodharting\"\n      - \"And it gets goodharted at the bottom well before the people at the top notice\"\n      - \"So the people at the top and middle wind up unknowingly endorsing the predatory abuse at the bottom\"\n    \n    To recreate the image, create a dark background. Add a series of text bubbles in the style of a messaging app, with the left side having gray bubbles with white text, and the right side having blue bubbles with white text. Include the transcribed text in the respective bubbles, maintaining the same timing and order.\n↓\n1472962921412059136 [2021-12-20] @AskYatharth \nnone of this is a *serious* problem\n\nto take it seriously is to kind of contribute to the problem itself\n\ninstead, there is a certain lightness called for instead. the working out of something through illegibility and ambiguity https://t.co/BKAi1SrazE\n  [Quoting @Malcolm_Ocean: @AskYatharth Game A is almost entirely composed of defenses against Game A  (viewed through a certain lens)]\n↓\n1472962924981456901 [2021-12-20] @AskYatharth 💜 1\nthis is part of the tacit reason illegibility gets talked about \n\nthere is a virgin defence-through-illegibility and a chad defence-through-illegibility and the chad one can almost misunderstand the own ways it works\n↓\n1472962927527448576 [2021-12-20] @AskYatharth \nthis is part of the tacit reason illegibility gets talked about \n\nthere is a virgin defence-through-illegibility and a chad defence-through-illegibility and the chad one can almost misunderstand the own ways it works https://t.co/Exc4zwQTjB\n  [Quoting @AskYatharth: Question:  Why does ingroup need illegibility?]\n\n===\n\n1539950758317154311 [2022-06-23] @peakexperiments 💜 2 [(SEED) type=quote_of_root]\nGonna try to start living my online life this way https://t.co/VM1V0hS7ZR\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1605469746882678784 [2022-12-21] @christineist 💜 32 🔁 1\nPattern language friends—  what are the patterns that show up here/in this part of twitter that make the space feel alive, and which make the space feel dead? \n\ncomment ideas on top level tweet and I will attach them along with my own brainstorm in the thread\n↓\n1605470316536352769 [2022-12-21] @christineist 💜 7\nWe have memes. Memes are effectively packaging and \"naming\" patterns in a way that is easily shareable \n\nhttps://t.co/jigZMcFG7b\n  [Quoting @gnostrils: all right, i guess it's time for me to share my list of ingroup memes that i've been collecting all year  tell me which ones i'm missing and i'll add them to this list  in no particular order... 🧵]\n↓\n1605471251274747904 [2022-12-21] @christineist 💜 8\nI would argue that \"good reply game\" is a pattern. It has elements (accounts, tweets), relationships (mutuals, replies), space (twitter), repeated events (replies), etc\n\nhttps://t.co/KLlRlYREx1\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1605471492354953217 [2022-12-21] @christineist 💜 8 [(SEED) type=quote_of_root]\nthere is some sense of \"norms\" that also serve as \"shared language\" or \"common patterns\"\n\nhttps://t.co/psaPLwb6Ry\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1605472267298754560 [2022-12-21] @christineist 💜 6\nHighest level pattern: People come to twitter to tweet and reply to each other's tweets\n\nWithin twitterspace: Ability to thread, Ability to branch off any particular node, Temporality of feed &amp; profile posts\n\nWithin twitterevents: tweeting, making threads, replies...\n↓\n1605472845747740673 [2022-12-21] @christineist 💜 6\nmore twitter-space-events: repeated online and IRL events. Picnics, vibecamp, bigger parties, get togethers, discord servers, book clubs, birthday parties, group chats, twitterspaces, interintellect salons\n↓\n1605473360153939970 [2022-12-21] @christineist 💜 6\nEase of entry and access. Anyone can reply to anyones tweets (given they are public). You can say anything (mostly lol). \n\nThere is no dislike button, so the worst that can happen is you get ignored. I want to say that the lack of dislike actually does a lot of heavy lifting.\n↓\n1605473907418353664 [2022-12-21] @christineist 💜 6\nThings that make this space feel alive: \nWhen you get your first mutual interaction. when someone compliments you on your tweet. a voice responds from the void, and it is friendly. Close quarters with brilliant / genius minds.\n↓\n1605474260297740288 [2022-12-21] @christineist 💜 8\nThings that make things feel dead: \nboring content, bad engagement, non-thoughtful replies, lack of people creating or thinking on their own, judgment, shaming, acrimonious/combative discussion, riffing that goes too far\n↓\n1605475713460473857 [2022-12-21] @christineist 💜 7\nOh, one of my favorite patterns in this space is people who build in public, make things, share progress, and show it to friends. There is the music channel, the occasional \"look I made this\" photo, tweeting of how things are going, Make 100 Things\n↓\n1605475848210894855 [2022-12-21] @christineist 💜 6\nAnother pattern— lots of programmers. Lots of male programmers.\n↓\n1605476343994388481 [2022-12-21] @christineist 💜 5\nGoing into communities as patterns... rationalist, post rationalist, EA, IFS, meditation/spirituality, Qualia research institute, VC and startup area, therapy and life coaching, Interintellect, the stoa, Open AI, Blogs with community followings (ribbonfarm, astral codex ten, etc)\n↓\n1605476611721084929 [2022-12-21] @christineist 💜 4\nIf we were to follow the prescribed way and pick out the nearest larger patterns that this part of twitter falls under, and pick out the major patterns underneath this space, what would those be?\n↓\n1605642036383621120 [2022-12-21] @christineist 💜 2\nOverlapping venn diagrams of mutuals/sim clusters that regularly engage with eachother. Often created through little bursts of replies-to-replies within the comments section of a top level tweet from a larger account everyone follows.\n\nhttps://t.co/up23zqW7nn\n  [Quoting Tweet 1605535816956006409 (missing)]\n\n===\n\n1655962943387729920 [2023-05-09] @peakexperiments 💜 3 [(SEED) type=quote_of_root]\nHaving beliefs but holding them loosely is such a superpower https://t.co/VM1V0hS7ZR\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1683515395200913408 [2023-07-24] @VividVoid_ 💜 91 🔁 3 [(SEED) type=semantic_search]\nPOV: You are Twitter, suspending my account for REPLYING like it's IMPROV, HOLDING my beliefs LOOSELY, MUTING political RETWEETS, FLIRTING with ABANDON, AMPLIFYING the GOOD, DISTRUSTING unhappy intelligence and always, always LIKING before I leave a REPLY https://t.co/GTdANG6ZZU\nImages:\n  - [Image #0] The image is a comic strip panel featuring a man with red hair, a brown jacket, and a purple shirt. He has a yellowish complexion, red eyebrows, and is sweating, with a menacing expression on his face, showing his teeth. \n    \n    The text in the image reads: \"DO IT!\" in a speech bubble.\n↓\n1683516051487850496 [2023-07-24] @VividVoid_ 💜 12\nWith respect to the CEO: @MasterTimBlais\n\n===\n\n1702254777961254956 [2023-09-14] @Tangrenin 💜 17\n*always like before replying*I just realized another reason I like this norm:+It encourages a way of seeing what's likeable about each tweet, what it addsBut also!+It gets you to only reply to tweets you like!If you'd rather not like a post, mb you don't want to reply to it\n↓\n1702254780217798963 [2023-09-14] @Tangrenin 💜 1\n(obviously there are tons of nuances for this last point and this general \"you\" mostly means \"me\" 😅)\n↓\n1702254781962527223 [2023-09-14] @Tangrenin 💜 6 🔁 1 [(SEED) type=quote_of_root]\nSo \"always like before replying\" is about friendliness and improv's 'yes-and-ing' AND ALSO about amplify the good! It's very cool to notice now how these precepts can \"secretly\" all stem from and to each other in resonance 😌tpot is nice 🔥https://t.co/wITCSCmBiB\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1708689285845794827 [2023-10-02] @nobu_hibiki 💜 1\nWhat's the best tweet that explains what \"TPOT norms\" are?\n↓\n1708706248299004257 [2023-10-02] @visakanv 💜 9 [(SEED) type=quote_of_root]\n@nobu_hibiki I’m partial to this one, no particular reason… https://t.co/fuP53ZZVZJ\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1727016854928183557 [2023-11-21] @RichDecibels 💜 346 🔁 12 💬 1 [(SEED) type=semantic_search]\nwelcome new followers! you have stumbled into a part of twitter that plays by different rules than you may be used to\n\nyou are invited to every conversation. you can expect to find respect &amp; curiosity from me and my friends. your real self is welcome here\n\nthanks for coming 🙏\n\n===\n\n1727030336415228050 [2023-11-21] @univrsw3th4rt 💜 9 [(SEED) type=quote_of_semantic_search]\npiggybacking on this to say the same to my new followers! glad to have you around! https://t.co/U9O1jyHdIB\n  [Quoting @RichDecibels: welcome new followers! you have stumbled into a part of twitter that plays by different rules than you may be used to  you are invited to every conversation. you can expect to find respect &amp; curiosity from me and my friends. your real self is welcome here  thanks for coming 🙏]\n↓\n1727030697016348915 [2023-11-21] @RichDecibels 💜 2\n@univrsw3th4rt for future reference: if we ever get to hang out in person I am basically always down for actual piggybacking too 😂\n↓\n1727032449816011064 [2023-11-21] @univrsw3th4rt 💜 1\n@RichDecibels EXCELLENT NEWS\n\n===\n\n1728473772070515125 [2023-11-25] @danielbrottman 💜 37 [(SEED) type=quote_of_root]\nidk who needs to hear this, but: https://t.co/kUmUbLdxpb\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1728582690369363975 [2023-11-26] @eshear 💜 1570 🔁 43\nWelcome new followers. We have returned to our regularly scheduled programming where I post whatever idle thoughts or silly jokes come to mind, interspersed with occasional threads or interactive games.\n↓\n1728582692114235731 [2023-11-26] @eshear 💜 137 🔁 4 [(SEED) type=quote_of_root]\nSome social norms from around these parts https://t.co/yhM5DAA16K\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1728582693867474951 [2023-11-26] @eshear 💜 113\nTopic policing, being rude or tiresome in my replies, being a boor (“won’t shut up and can’t change the topic”), and bad faith argument will be rewarded with blocks.\n\n===\n\n1737204791825101218 [2023-12-19] @moissanist 💜 4\nohh look at that, I'm read to swear my second ideal of tpot:\n- I will follow even those that will get me blocked by mid celebs. https://t.co/dUnRrpeZQN\nImages:\n  - [Image #0] The image shows a screenshot of a blocked Twitter account. The text on the image reads: \"Lex Fridman 3,053 posts\" at the top, followed by a profile picture of a man in a suit and tie, with the name \"Lex Fridman\" and handle \"@lexfridman\" below. The main content of the image is a message stating \"You're blocked\" and \"You can't follow or see @lexfridman's posts. Learn more\".\n↓\n1737205150102548974 [2023-12-19] @moissanist 💜 2 [(SEED) type=semantic_search]\nin case you're curious, the first is:\n- Likes before replying, cuddles before drama, psychedelics before politics\n↓\n1737205268587368559 [2023-12-19] @moissanist 💜 1\nand ofc there's a secret 0th:\n- I will keep staring even if the microceleb is discomforted\n\n===\n\n1740125408052543577 [2023-12-27] @tasshinfogleman 💜 19 💬 1 [(SEED) type=quote_of_root]\nin this house i OFTEN forget to like before replying https://t.co/6o8omlvBTj\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1740129052386885903 [2023-12-27] @danielbrottman 💜 7\n@tasshinfogleman I came across this tweet fairly early in my tpothood and took it heart, I almost ALWAYS like before replying hahaha. if not I either forgot (rare) or am offended (also rare)\n\n===\n\n1751662641880162582 [2024-01-28] @strangestloop 💜 44\nI'm fresh off of a call with a friend and I want to think out loud about something that is core to my twitter experience that I may not have talked about much on here: I want to be seen. I want you to have an understanding of who I am, one that resonates with how I see myself.\n↓\n1751663712014893496 [2024-01-28] @strangestloop 💜 16 [(SEED) type=quote_of_semantic_search]\nHow do I see myself? I articulated much of it in my pinned tweet. Some of those labels feel truer than others at different times. Right now, I feel most secure in my creativity and curiosity. I feel least secure in my intentionality and thoughtfulness.\nhttps://t.co/y1AvHN0yMR\n  [Quoting @strangestloop: intended vibes: friendly, intentional, thoughtful, playful, empathetic, authentic, creative, optimistic, curious, kind 💪🦚]\n↓\n1751667976808415418 [2024-01-28] @strangestloop 💜 9\nOf course, I cannot control how you see me, nor would I want to. You see me how you see me. Some of you extrapolate my virtues and some of you extrapolate my flaws. I don't hold any resentment about this. I also do this to some people.\nhttps://t.co/OoIAdDD5QF\n  [Quoting @strangestloop: A person's biggest fans overemphasize their virtues and discount their flaws. A person's biggest haters overemphasize their flaws and discount their virtues. Both perspectives fail to see the person as they are, they don't recognize the person's full and irreducible complexity.]\n↓\n1751669060310347876 [2024-01-28] @strangestloop 💜 7\nSometimes I tweet things that evoke a lot of hurt or anger or sadness or ridicule from readers. These tweets point to blindspots that I have: too much focus on myself at the expense of others, lack of thoughtfulness and consideration of how my words will be received.\n↓\n1751671634807709879 [2024-01-28] @strangestloop 💜 6\nI own these mistakes, I own the hurt that they cause. I'm sorry that these tweets are so hurtful. I want to have the foresight to not cause such hurt. These tweets show me that I have room to grow, they help me better understand and internalize the impact that my words have.\n↓\n1751673270628130947 [2024-01-28] @strangestloop 💜 6\nJust as some readers don't feel seen when they read these tweets, I don't feel seen when the tweets are used to draw conclusions about me that do not resonate whatsoever with how I see myself, how I show up in life outside of twitter, what is in my heart, but...\n↓\n1751673761210777978 [2024-01-28] @strangestloop 💜 3\n...I know, understand, and accept that those conclusions are ultimately my fault. I went first by sharing the hurtful tweets, by failing to anticipate how people would receive these tweets and acting accordingly. I believe that who goes first in a chain of hurt matters a lot.\n↓\n1751675436713566698 [2024-01-28] @strangestloop 💜 6\nI believe that here on twitter, we all teach each other how we want to be seen and what makes us feel seen. My tweets teach you how I want to be seen, my profile picture teaches you how I want to be seen, my handle teaches you how I want to be seen.\n↓\n1751676446081233067 [2024-01-28] @strangestloop 💜 7\nIt's great that we get to teach each other how we want to be seen. When this is communicated effectively, everyone gets to decide for themselves whether they want to participate in this seeing, whether they want to go along with the seeing frame that is presented to them.\n↓\n1751678232754000067 [2024-01-28] @strangestloop 💜 9\nI'm grateful for the immense amount of grace that has been extended to me in my most unaware moments on twitter, and I'm grateful for the attention and care you're giving me in this moment by reading this thread.\n\n===\n\n1769000906371064282 [2024-03-16] @visakanv 💜 347 🔁 13\ni just feel in my bones that there are about 5-12 essays knocking around inside me that if i just get out of my system i will feel a relief i have not known since childhood\n\n===\n\n1769001987142459463 [2024-03-16] @visakanv 💜 30 🔁 1\nluckmaxxing: past the birth lottery which you have no control over, it is discernable that there are some contexts that have higher rates of collision than others. you can increase the exposure you have to luck through a myriad of ways. you do have to survive long enough tho\n↓\n1769002376927514714 [2024-03-16] @visakanv 💜 18\nvariance: there's good variance and bad variance. a lot of culture and the structure of civilization exists to suppress bad variance; prevent bad shit from happening. but you can't really suppress variance selectively. can be very lucrative to examine how u r suppressing urself\n↓\n1769003225997267354 [2024-03-16] @visakanv 💜 25\ndeviance: greatness is deviance. there's so much time and energy that gets weirdly misallocated imo because we don't really want to acknowledge this properly. people talk in euphemisms about this. success is alienating and dehumanizing! some fresh clarity here will be v good imo\n↓\n1769003750557966429 [2024-03-16] @visakanv 💜 18 🔁 1\nlanguage is always being renegotiated in real time. we can make it better or worse. clear language allows people to think clear thoughts. when terminology gets clouded, it can be useful to redefine things from scratch. clear thinkers and writers are a huge public good\n↓\n1769004293913203096 [2024-03-16] @visakanv 💜 13\nmedia is the means by which we interface with the wider world beyond our immediate senses. it becomes more powerful every year, it shapes our thoughts, our sense of ourselves, our peers, the world, our identities, everything. navigating it well requires several kinds of finesse\n↓\n1769004649439174819 [2024-03-16] @visakanv 💜 12\ncommunication was always challenging; even in the ancestral environment people were surely struggling with miscommunication. it's harder than ever in the modern media environment. it's magic that anybody understands anyone ever. we are too quick to blame each other when it fails\n↓\n1769005220229448132 [2024-03-16] @visakanv 💜 11\nperceptions rarely capture the truth of anything. we seldom think to question our perceptions. of course nobody has the time to reexamine everything all the time, but we can learn to at least step lightly. it might seem like a lot of work but it's v gratifying, essay to explain\n↓\n1769005789664977251 [2024-03-16] @visakanv 💜 11 🔁 1\ndynamism: as the opposite of stasis. things are always changing all the time. the environment is always responding. everything is ecologies. there's something both startling and soothing when you really see how this cascades through everything. the second note changes the first\n↓\n1769006450842501283 [2024-03-16] @visakanv 💜 15 🔁 1\neverything is resource-constrained. if you wanna do anything substantial, you're going to have to be sensitive to this, or something is gonna \"run out of battery\" unexpectedly and jam your whole operation. often the best way to know how things work is to study how they fail\n↓\n1769007498336292869 [2024-03-16] @visakanv 💜 20\nchaos-surfing is largely about understanding all of the other things i'm talking about here. a lot of it is about focusing on what you want and not getting swept into any particular whirlpool. gotta hop from wave to wave and stay afloat\n↓\n1769008060142325889 [2024-03-16] @visakanv 💜 19 [(SEED) type=semantic_search]\nreply-game about is deeply understanding \"the second note changes the first\", and responding to people and things in ways that are additive. that build out on the implicit proposal in the first utterance. get good at this and you improve everything around you by yr mere presence\n├── 1769008413470544197 [2024-03-16] @visakanv 💜 13\n│   teamwork is just people practicing good reply game with teach other. there's the utterance-level play, and then there's the setup play where you set things up for each other to make better utterances. small groups of friends who get good at this birth entire new genres, worlds\n│   ↓\n│   1769008645663043748 [2024-03-16] @visakanv 💜 13\n│   actually collaboration and project management etc are just me repeating the reply game thing again. to collaborate is to labor together. a project is anything that cannot be completed in a single sitting by a single individual. good reply game is the essence of all of it\n│   ↓\n│   1769010004806209813 [2024-03-16] @visakanv 💜 10\n│   a frame is a container within which something happens. there's artistry that happens within existing frames, but truly exalted artistry imo is the stuff that subverts those frames. this ties up with deviance: existing frames tend to be \"burnt in\" and can't surprise people much\n│   ↓\n│   1769010869684363612 [2024-03-16] @visakanv 💜 13\n│   stories are maps of meaning, significance, consequence, etc. \"what's the point of stories\" is a funny Qn, because stories are how we answer \"what's the point\" of anything. we determine our values, priorities, everything from our stories. introspection is abt inspecting yr story\n│   ↓\n│   1769011779021983909 [2024-03-16] @visakanv 💜 14 🔁 1\n│   winning– the important thing here is that it doesn't have to be within popular existing games, existing frames, existing models of success. you can define for yourself the outcomes you want and then celebrate the progress you make towards those outcomes. helps tremendously\n│   ↓\n│   1769012232757661991 [2024-03-16] @visakanv 💜 10\n│   strategy to me is just a matter of thinking about what you want, examining the landscape of possibilities, plotting out possible paths, trying things out, evaluating what works, repeating. weird to me how uncommon this is. probably seems like a lot of work to ppl who havent won\n│   ↓\n│   1769012862557524065 [2024-03-16] @visakanv 💜 10\n│   -fin. \n│   \n│   useful thing i got out of this thread was a reminder of \"the second note changes the first\" (remix of Miles Davis / Victor Wooten's ideas), that's going to be useful in multiple contexts\n│   ↓\n│   1769014203824664729 [2024-03-16] @visakanv 💜 6\n│   having done some light sketches, i'd now take a different approach and ask what are the itches i'm looking to scratch? I think a better frame here might be, what do I keep getting annoyed by re: people's misunderstandings?\n│   ↓\n│   1769014933671367147 [2024-03-16] @visakanv 💜 8\n│   there's a lot there, lol, i'm tired just asking the question. gotta pace myself. but the tiredness confirms the relief suspicion. writing Introspect was a huge relief for me, there are several other knots to unknot that will be of similar relief, and i do allude to them above\n└── 1769068040296038569 [2024-03-16] @camino_delsol_ 💜 1\n    @visakanv This falls in sync with thoughts of my own surrounding the process of communication 1 on 1. Generally , disagreements can be avoided (or deter process of breaking down) if we recognized we have just as responsibility to communicate ourselves consciously.\n    ↓\n    1769068499354226734 [2024-03-16] @camino_delsol_ 💜 1\n    @visakanv My own nebulous essays in my head flare up whenever I witness or am involved in issues that confirm the things I’ve learned and live by.\n    ↓\n    1769068856587264007 [2024-03-16] @camino_delsol_ 💜 1\n    @visakanv Eager to read your future essays 👁️👌🏽\n\n===\n\n1837668336853045699 [2024-09-22] @RhysLindmark 💜 28 🔁 2\nWhen trying to pill people into Twitter, it's hard to find someone better to model off of and learn from than @visakanv.\n\nLots of evergreen content:\n- How past heroes were all friendly ambitious nerds https://t.co/oOsx0KRh0U\n- Good reply game https://t.co/0fFjWDEECc\n- Make friends online: https://t.co/cP6xoRsqoO\n- Iteratively move through a social graph by vibing with top 10 existing friends, expanding that to 100 new ones, then repeating: https://t.co/wtKOt2f3hs\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1863747114083422515 [2024-12-03] @RhysLindmark 💜 3 [(SEED) type=semantic_search]\ncc @DefenderOfBasic \n\nHere are the tweets your semantic search gave for the prompt \"Visa talking about how to be a reply guy and friendly ambitious nerd\"\n\nvs. What I wanted/expected was the tweets above. (Not necessarily bad!)\n\n- https://t.co/JEEGrHd6BG \n- https://t.co/20rkG0aEjh\n- https://t.co/icEOHlngph\n  [Quoting @visakanv: this has been so effective for me it feels like I'm cheating https://t.co/9ElCmKsf6T]\n\n===\n\n1856004764800258552 [2024-11-11] @chercher_ai 💜 23 [(SEED) type=quote_of_root]\nIs anyone using this as their system prompt? https://t.co/fO8xYmv56g\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1876964441650020708 [2025-01-08] @emergentvibe 💜 3 [(SEED) type=semantic_search]\nfuck politeness. love fiercely. be real.\n\n===\n\n1893006741035532771 [2025-02-21] @Karmancer  [(SEED) type=quote_of_semantic_search]\nI love these vibes! https://t.co/FuKS6h0QqS\n  [Quoting @strangestloop: intended vibes: friendly, intentional, thoughtful, playful, empathetic, authentic, creative, optimistic, curious, kind 💪🦚]\n\n===\n\n1902452734261129242 [2025-03-19] @DavidDuvenaud 💜 96 🔁 6 [(SEED) type=semantic_search]\nMy single rule for productive Twitter discussions:\n\nStart every single reply with a point of agreement.  It disarms the combative impulse on both sides, and forces you to try to interpret their words in the most sensible possible way.\n\n===\n\n1909178391967760806 [2025-04-07] @frideswyth 💜 201 🔁 23\nMimetic Defence Protcols\n\n-Never accept the frame\n-Never trust a graph \n-Never believe out of context assertions\n-Always check reality (go outside)\n-Always question purpose/motivation\n-See all of what’s happening, not just a part\n-Resist tendency to ignore \n-Build self-trust\n↓\n1909186783012651269 [2025-04-07] @frideswyth 💜 35 🔁 2\n-Do not memory-hole\n-Watch outcomes, not arguments \n-Never defect first \n-Amplify the good\n-Try to see the pattern, but don’t overfit\n-It’s bad on purpose to make you click\n-The way to win is not to play\n↓\n1911882342475407850 [2025-04-14] @forthrighter 💜 2 [(SEED) type=quote_of_root]\n@frideswyth \"distrust unhappy intelligence\" seems like a good one too, imo\n\nhttps://t.co/n0QOqaPnEe\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n↓\n1911884756712841695 [2025-04-14] @frideswyth \n@forthrighter Yup I tried to not repeat this list even though I was totally copying / expanding this amazing list\n\n===\n\n1940905229291344141 [2025-07-03] @kramerposts 💜 38 🔁 1\nsome of the rules that guide my twitter posting:\n- no Current Thing\n- no politics\n- try to avoid negativity / orient towards positivity except when emotions must be expressed honestly\n- try to do my best with every post\n- post stupid jokes too because life is not about perfection\n↓\n1948633147882836228 [2025-07-25] @kramerposts 💜 5 [(SEED) type=semantic_search]\n- replying is like improv, it's fun to give that energy to others\n- no dunking\n- my twitter is my house\n- your twitter is your house\n- instantly block anyone who is rude to me or my friends\n- if i am debating whether to block someone for more than 30s just block them\n\n===\n\n1961451396139823496 [2025-08-29] @shaggysurvives 💜 62 🔁 2\ndoes anyone have a list of like, good faith engagement norms in tpot? or just general social norms like liking before replying\n↓\n1961452696868995504 [2025-08-29] @danielbrottman 💜 26 🔁 1 [(SEED) type=quote_of_root]\n@shaggysurvives just the classic - https://t.co/LEtgZkH1o7\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n\n1961496400816214063 [2025-08-29] @generativist 🔁 1 [(SEED) type=quote_of_root]\nRT @danielbrottman: @shaggysurvives just the classic - https://t.co/LEtgZkH1o7\n  [Quoting @MasterTimBlais: IN THIS HOUSE WE  - REPLY like it's IMPROV - hold our beliefs LOOSELY - be FRIENDLY, AMBITIOUS NERDS - FLIRT with ABANDON - MUTE POLITICAL RETWEETS - AMPLIFY the GOOD - DISTRUST UNHAPPY INTELLIGENCE  and always ALWAYS like before replying]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand documents the codification and evolution of 'TPOT social norms' as a boundary object, anchored by MasterTimBlais's viral 2021 'IN THIS HOUSE WE' tweet. The discourse is primarily constructive rather than dialectical—people adopt, celebrate, and occasionally critique these norms, but the core artifact remains stable. The strand shows high cohesion (recurring references over 4 years) but low conceptual evolution (the norms are repeated, not refined). Utility is medium: high for scene insiders (provides shared language and identity markers) but low for outsiders (lacks actionable frameworks beyond vibes). Yatharth's 2021 critique about 'goodharting' represents the only substantive challenge, warning that explicit norms can corrupt organic culture, but this thread is largely ignored by the community.",
    "rating": 5,
    "evolution": "low",
    "cohesion": "high",
    "utility": "medium",
    "essential_tweets": [
      {
        "tweet_id": 1259564748997308419,
        "annotation": "Pre-history: Strangestloop articulates aspirational vibes (2020) before they become codified norms"
      },
      {
        "tweet_id": 1389186670000545807,
        "annotation": "Early pedagogy: Tasshin's thread on 'Art of the Reply' (May 2021) establishes reply-game as teachable skill"
      },
      {
        "tweet_id": 1450685539825319938,
        "annotation": "Visa's proto-version (Oct 2021) showing norms emerging organically across multiple accounts"
      },
      {
        "tweet_id": 1459068390669176832,
        "annotation": "The Artifact: MasterTimBlais's canonical 'IN THIS HOUSE WE' tweet becomes the definitive boundary object"
      },
      {
        "tweet_id": 1470505499716108303,
        "annotation": "Application: Grin_io integrates norms into 'ingroup network state' vision, linking social tech to physical spaces"
      },
      {
        "tweet_id": 1472956318105452547,
        "annotation": "The Critique: Yatharth's warning about goodharting and corruption through explicit codification (only dialectical moment)"
      },
      {
        "tweet_id": 1605471492354953217,
        "annotation": "Pattern Language: Christine frames norms as architectural patterns that make Twitter 'feel alive' (2022)"
      },
      {
        "tweet_id": 1727016854928183557,
        "annotation": "Welcoming Ritual: Rich Decibels uses norms to onboard newcomers, showing they function as identity markers"
      },
      {
        "tweet_id": 1769008060142325889,
        "annotation": "Theoretical Synthesis: Visa elevates 'reply game' to universal principle ('second note changes first')"
      },
      {
        "tweet_id": 1961451396139823496,
        "annotation": "Persistence Check: 2025 request for 'tpot norms' confirms the artifact remains canonical reference 4 years later"
      }
    ]
  }
}