{
  "seed_tweet_id": 1668996273116966914,
  "thread_text": "1354128627470725120 [2021-01-26] @QiaochuYuan 💜 216 🔁 3 💬 1\nstanding offer to follows that i'll RT many to most tweets i see on the TL that are \n\n1) questions\n2) requests for help\n3) offers to help\n↓\n1474067529727369222 [2021-12-23] @RichDecibels 💜 10\n@QiaochuYuan challenge for QC: every time you help someone you have to ask for help\n\nto make it easier you are allowed to make very tiny asks, to get warmed up\n↓\n1474067944208420878 [2021-12-23] @QiaochuYuan 💜 5\n@RichDecibels 😬😬😬\n↓\n1474212570810699801 [2021-12-24] @strangestloop 💜 5 [(SEED) type=semantic_search]\n@QiaochuYuan @RichDecibels qc could you please do this challenge at least once for me 🥺\n↓\n1474228240982044672 [2021-12-24] @QiaochuYuan 💜 2\n@strangestloop @RichDecibels um today i asked the guy at guitar center if i could return a capo without a receipt does that count\n↓\n1474228856395649030 [2021-12-24] @strangestloop 💜 2\n@QiaochuYuan @RichDecibels you certainly took advantage of the 'very tiny' clause 😤\ni'll allow it 🤗\n↓\n1474229064357400578 [2021-12-24] @QiaochuYuan \n@strangestloop @RichDecibels 🙏\n\n===\n\n1399651598628843523 [2021-06-01] @visakanv 💜 66 💬 1 [(SEED) type=semantic_search]\nlet's play a game\n\n1. reply to this tweet with \"somebody tell me to &lt;do thing you want to do but haven't been doing&gt;\"\n\n2. be the somebody for somebody else in the replies\n\n3. do the thing and report back\n├── 1399651893811445762 [2021-06-01] @visakanv 💜 17\n│   somebody tell me to finish translating my book's annotated edits from paper to google docs\n│   ↓\n│   1399948065822416896 [2021-06-02] @rickbenger 💜 1\n│   @visakanv \"when you can't create, you can work\" -- do the thing! 💪❤️\n├── 1399654130751209472 [2021-06-01] @sharanvkaur 💜 15\n│   @visakanv somebody tell me to go lift\n│   ↓\n│   1399765856503025666 [2021-06-01] @sharanvkaur 💜 17\n│   @visakanv update: I procrastinated for a couple of hours but then I did the thing!! I picked thing up and put thing down many times 🥳\n├── 1399691092958748673 [2021-06-01] @imperialauditor 💜 2\n│   @visakanv somebody tell me what to write a blogpost about\n│   ├── 1399691499500044290 [2021-06-01] @visakanv 💜 8\n│   │   @imperialauditor that's not the prompt! but as always you should write a blogpost about whatever you find most exciting, most compelling, most annoying, whatever really gets your goat\n│   └── 1399691533482397699 [2021-06-01] @tasshinfogleman 💜 2\n│       @imperialauditor @visakanv the thing that scares you the most to write about\n│       ↓\n│       1399692564857430020 [2021-06-01] @imperialauditor 💜 1\n│       @tasshinfogleman @visakanv Okay!😬\n└── 1399947172104318978 [2021-06-02] @rickbenger 💜 1\n    @visakanv Somebody tell me to record that first YouTube interactive story jam session thingy\n\n===\n\n1399947507594039298 [2021-06-02] @rickbenger 💜 5 [(SEED) type=quote_of_semantic_search]\nWholesome accountability tweet 💓 https://t.co/bcLsTChRJo\n  [Quoting @visakanv: let's play a game  1. reply to this tweet with \"somebody tell me to &lt;do thing you want to do but haven't been doing&gt;\"  2. be the somebody for somebody else in the replies  3. do the thing and report back]\n\n===\n\n1491271279693168643 [2022-02-09] @Malcolm_Ocean 💜 40 🔁 3 💬 1 [(SEED) type=semantic_search]\nan open challenge for ppl who are lurking and curious-but-nervous to engage more\n\ndecide to remove the entire decision of whether to engage—just engage with everything for 1d-1w\n\n(you don't have to accept the challenge, but if it feels like a good challenge for you, reply below!) https://t.co/BUfpglvTry\n  [Quoting Tweet 1491156905955590144 (missing)]\n↓\n1491304872884707328 [2022-02-09] @rslantonie 💜 1\n@Malcolm_Ocean welp, gotta complete this challenge somehow https://t.co/kOCo6PqSNL\n  [Quoting @rslantonie: screw it, 1000 tweets by the end of february]\n↓\n1491318361791557632 [2022-02-09] @Malcolm_Ocean 💜 1\n@russlramos yesssssssss do it :D\n\n===\n\n1502691344480882690 [2022-03-12] @IaimforGOAT 💜 1 [(SEED) type=semantic_search]\nChallenge 1: Write 1000 tweets.\n\nChallenge 2: Don't be a coward; post them too!\n↓\n1502748039370317825 [2022-03-12] @IaimforGOAT \nOh, for the record https://t.co/bnTDeO2Z4G\nImages:\n  - [Image #0] The image displays a simple graphic featuring a black silhouette of a flea accompanied by the text \"1,263 Tweets\" in blue font. The flea is positioned above the text, centered on a white background.\n↓\n1502748777966456835 [2022-03-12] @IaimforGOAT \nhmm I think this is wrong. It counts other things too like retweets... But not sure how to get the real number so yeah ...\n\n===\n\n1521933789311778817 [2022-05-04] @__drewface 💜 126 🔁 7 💬 3 [(SEED) type=semantic_search]\n30 day \"ask for what you want\" challenge:\n\nsimply ask for one thing from the TL every day for the next 30 days\n\ntogether we will be unstoppable\n├── 1521933856970100739 [2022-05-04] @__drewface 💜 11\n│   p.s. this is what i want\n│   \n│   https://t.co/Jej86bki41\n│     [Quoting @__drewface: Putting out the bat call for all NYC co-living organizers.  I want to document your community and put you in touch with all the other organizers I know (if you want)!  I'm trying to get a pulse on the entirety of coliving in NYC, help me out if you know anyone 🗽❤️]\n├── 1521934954095157249 [2022-05-04] @__drewface 💜 17\n│   me, when you like this tweet but then I go to your profile and you haven't asked for anything: 🤬🤬🤬\n│   \n│   I SEE YOU\n└── 1522028609761861632 [2022-05-05] @Prigoose 💜 1\n    @__drewface i want to take a solo vacay in or near nyc. i.e. i wanna be by myself for a weekend and relax and read\n\n===\n\n1521938155326382084 [2022-05-04] @strangestloop 💜 3 [(SEED) type=quote_of_semantic_search]\nWhat are some things you'd ask for? https://t.co/YZp2hwgCzt\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n\n===\n\n1522232489636413445 [2022-05-05] @__drewface 💜 14 🔁 1 [(SEED) type=quote_of_semantic_search]\nI want to help 10 coliving houses build private booking systems for their vacancies + travel plans, so they can be filled with friends + nomads more often!\n\nLet me help you manage coliving logistics for free! \n\n2/30 https://t.co/5ZhopHPSAP https://t.co/lpePHLGK2Q\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n\n===\n\n1522669718146015240 [2022-05-06] @__drewface 💜 3 [(SEED) type=quote_of_semantic_search]\nToday I want to land the PERFECT customer for Qrono.\n\nThe ideal customer looks like: a rental management startup that Needs a booking platform for managing time, doesn't want to waste time maintaining one themselves, and wants a direct feedback loop with our product team\n\n3/30 https://t.co/5ZhopHPSAP\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n\n===\n\n1523817387090493442 [2022-05-10] @natural_hazard 💜 24 🔁 2 [(SEED) type=quote_of_semantic_search]\n1. I want a 2br in Brooklyn for under $3000 that's got decent space for hosting dinners/parties and is close to subways\n\n@Antibodhi and I want to up the amount of dope events in NYC https://t.co/SdcPVli67h\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n├── 1523818140609785860 [2022-05-10] @__drewface 💜 2\n│   @natural_hazard @Antibodhi consider the mckibbin lofts!\n│   ↓\n│   1523818199841710080 [2022-05-10] @__drewface 💜 2\n│   @natural_hazard @Antibodhi i can put you in touch w/ the building manager\n│   ↓\n│   1523818369593614336 [2022-05-10] @natural_hazard 💜 3\n│   @__drewface @Antibodhi 🤩😍🤩\n└── 1524057389942640645 [2022-05-10] @natural_hazard 💜 6 🔁 1\n    2. I want to develop my literal voice, both speaking and musically\n    \n    main domains imma be observing this in are normal convos and freestyle rap. I often don't quite like how my voice sounds, and i notice times when I'm DOING some constrictive bullshit with my throat that feels bad\n    ↓\n    1524057804079874049 [2022-05-10] @natural_hazard 💜 5\n    i'm interested in any tips or resources anyone has for this\n    \n    \"Freeing the Natural Voice\" by Linklater seems lit\n    \n    i'm gonna be listening to a lot of rappers with a specific high for the energetic qualities of their voices, mess around with what seems right to inhabit\n\n===\n\n1523829822312566788 [2022-05-10] @__drewface 💜 22 🔁 1 [(SEED) type=quote_of_semantic_search]\nI want someone to host a salon at our place later this month (or multiple people!)\n\nI want to be hosting more, I want our community to feel like a hub of social activity https://t.co/5ZhopHPSAP\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n\n===\n\n1525503843684995080 [2022-05-14] @the_wilderless 💜 19 [(SEED) type=quote_of_semantic_search]\nAsk for what I want, day one:\n\nFirst off, I just want all of us to have what we need.\nThe intangibles that get a lot of chatter here, of course: love, care, support, etc\nBut also the tangibles that are a bit outré to mention: cash, insurance, retirement accounts, medical care,, https://t.co/Pda4ixK3Nd\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n↓\n1525808804549607424 [2022-05-15] @the_wilderless 💜 10\nDay 2: \n\nI’d love it if more folks caught onto imaginal work and incorporated it into their meditation and spiritual practice. \n\nAnd their like, way of engaging with life day to day. That’d be great too.\n↓\n1526116754463784963 [2022-05-16] @the_wilderless 💜 2 🔁 1\nDay 3:\n\nI want to see the cutest, most heartwarming videos of baby mammals you can find. (Primates excluded)\n↓\n1526795957085646848 [2022-05-18] @the_wilderless 💜 3\nDay 4\n\nI’d love some more tattoos; A 3/4 sleeve on my left arm would be great.\n↓\n1527985777183010816 [2022-05-21] @the_wilderless \nLost track of this, so I’ll fire off a couple days worth:\n↓\n1527985779674333190 [2022-05-21] @the_wilderless \nDay 5\n\nI want to make evocative objects\n↓\n1527986624163880961 [2022-05-21] @the_wilderless \nDay 6\n\nI’d love it if everyone scoured their local secondhand bookshops for copies of “The Exegesis of Philip K Dick” and sent them to me (if the copy is cheap, I’ll pay for these )\n↓\n1527990784611467267 [2022-05-21] @the_wilderless 💜 3\nDay 7\n\nI’d love you to tell me what books/works you know of that are in the same vein as:\n\nThe Red Book (Jung)\nThe Exegesis (PKD)\nBook of Disquiet (Pessoa)\nBlake’s “prophetic” works\nVon Bingen’s stuff\nRealms of the Unreal (Darger)\n\nAnd other visionary imaginal work\n↓\n1528397144104869888 [2022-05-22] @the_wilderless \n8/ tell me your favorite historical anecdote\n↓\n1529152220939407363 [2022-05-24] @the_wilderless 💜 4\n9/ tell me a cool nature fact\n↓\n1529164558564196354 [2022-05-24] @profoundish 💜 4 💬 1\n@the_wilderless Yesterday I heard a science guy on a not-specifically-sciencey podcast say that we oscillate between having slightly more non-genetically-human cells in our bodies than our own, until we have a good poop and then have slightly more genetically-human cells for a little bit.\n\n===\n\n1527332707151142914 [2022-05-19] @__drewface 💜 36 🔁 2 [(SEED) type=quote_of_semantic_search]\ni want to find the next 100 people who believe we can and should create a socio-cultural Golden Age, starting in NYC\n\nif you know them, put me in touch please, I'm organizing a team...\n\nhttps://t.co/dGtHqVwjyH https://t.co/Y8pM8olwC8\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\nImages:\n  - [Image #0] The image depicts a serene nighttime scene in a park, where a crowd has gathered on the grass beneath a canopy of trees adorned with string lights. The atmosphere is relaxed, with people seated or reclining on blankets and bean bag chairs, surrounded by the soft glow of the lights.\n  - [Image #1] The image depicts a serene nighttime scene in a park, where a large crowd has gathered on the grass beneath a canopy of trees adorned with string lights. The atmosphere is relaxed, with people seated or reclining on blankets and bean bags, surrounded by the soft glow of the lights. In the background, a stage is visible, suggesting that some form of entertainment or performance may be taking place.\n    \n    **Key Features:**\n    \n    * A large crowd gathered on the grass\n    * Trees with string lights creating a warm ambiance\n    * People seated or reclining on blankets and bean bags\n    * A stage visible in the background, indicating potential entertainment or performance\n    \n    **Overall Impression:**\n    \n    The image conveys a sense of community and relaxation, as people come together to enjoy each other's company in a peaceful outdoor setting.\n↓\n1527335177445601281 [2022-05-19] @__drewface 💜 6\nand by a \"team\", i mean a scene, really. a positive-sum + fundamentally collaborative social environment, with no formal expectations or roles\n\nthe teams form later, from within the scene...\n↓\n1527344827896979458 [2022-05-19] @zencephalon 💜 1\n@__drewface I'm in for it! Also applied for Maximum New York\n\n===\n\n1553877062242521088 [2022-07-31] @IaimforGOAT 💜 1 [(SEED) type=quote_of_semantic_search]\nThis month alone I've done 355\n\nuhhh I guess as soon as you get the gears going this isn't as hard as I thought \n\nhttps://t.co/koe3iCTxJB\n  [Quoting @IaimforGOAT: Challenge 1: Write 1000 tweets.  Challenge 2: Don't be a coward; post them too!]\n\n===\n\n1556457545719488514 [2022-08-08] @strangestloop 💜 2 [(SEED) type=semantic_search]\nif you can't explain your idea in one tweet\n\n===\n\n1573417627544072197 [2022-09-23] @IaimforGOAT  [(SEED) type=quote_of_semantic_search]\noh kinda forgot about this\n\nhttps://t.co/koe3iCU5z9\n\nit wasn't has hard as I thought it would be... (I have some on the drafts tho)\n\nNext is 10k. \n\nHow long will it take? 🤔 https://t.co/HyRdGjSew9\n  [Quoting @IaimforGOAT: Challenge 1: Write 1000 tweets.  Challenge 2: Don't be a coward; post them too!]\n\n===\n\n1589280618344747008 [2022-11-06] @tasshinfogleman 💜 5 [(SEED) type=semantic_search]\ni am daring you to tweet one (1) thing that you want, to share it with the world so that it might be so\n\n===\n\n1590089915995672577 [2022-11-08] @Malcolm_Ocean 💜 11 [(SEED) type=quote_of_semantic_search]\nif you're not having fun on twitter try an experiment where for every tweet that shows up on your timeline you either reply to it or unfollow whoever tweeted it\n\n(you can try this even if you're already having fun too) https://t.co/L7rU0weHwg\n  [Quoting @Malcolm_Ocean: an open challenge for ppl who are lurking and curious-but-nervous to engage more  decide to remove the entire decision of whether to engage—just engage with everything for 1d-1w  (you don't have to accept the challenge, but if it feels like a good challenge for you, reply below!) https://t.co/BUfpglvTry]\n├── 1590092447039643648 [2022-11-08] @s0ulDirect0r 💜 1\n│   @Malcolm_Ocean exactly my kind of game\n└── 1591382251140710401 [2022-11-12] @ulyssepence 💜 1\n    @Malcolm_Ocean I think I’m gonna do this 👍. Thanks for the suggestion.\n    \n    But what about the ~70%+ of my TL that’s not from people I follow 😭\n    ↓\n    1593823105650040833 [2022-11-19] @Malcolm_Ocean 💜 1\n    @benpence use the dot menu &amp; tell twitter you want to see less of that shit\n    ↓\n    1598137573805002753 [2022-12-01] @ulyssepence 💜 2\n    @Malcolm_Ocean I just wanted to report back that this is absolutely true! I really never expected it to work\n    ↓\n    1598140775350824962 [2022-12-01] @Malcolm_Ocean \n    @benpence yeah it doesn't work perfectly but it does work somewhat\n\n===\n\n1599516403081834497 [2022-12-04] @Malcolm_Ocean 💜 10\nwriting canonical resources is hard and confusing\n\nthread of me thinking out loud about repeating, remixing, and the differences between:\n- twitter threads (dated, can't edit)\n- blog posts (dated, can edit)\n- pages/canon (not dated, can edit)\n\n===\n\n1599516420198387712 [2022-12-04] @Malcolm_Ocean \nalthough actually... maybe that's just not true. I've had lots of fresh ideas in the course of editing old posts\n\nand sometimes those ideas are so fresh they then make it hard to publish the thing because what felt almost-done now feels woefully inadequate\n↓\n1599516421649682432 [2022-12-04] @Malcolm_Ocean 💜 1\nwhich is an argument in favor of just publishing things now\n\neg I started trying to edit this thread into a blog post and ended up flipping inside out and rethinking the whole frame.\nhttps://t.co/MxMdZp6s8J\n  [Quoting @Malcolm_Ocean: coercion = \"the exploitation of the scarcity of another, to force the other to behave in a way that you want\"  (working draft, edited from some chats)  (this is in the context of other-coercion; self-coercion needs a slightly different definition) 🧵 https://t.co/TCc1WEnwzR]\n↓\n1599516423717810176 [2022-12-04] @Malcolm_Ocean 💜 1\nbut part of what makes things difficult I think IS actually the aim of creating a CANONICAL resource\n\nthat was easy to write as a thread, since it was overtly a draft, but with my blog posts I feel they want to be more DONE before I publish them\nhttps://t.co/EUvFYcEAa7\n  [Quoting @m_ashcroft: I’m noticing a desire in myself to write comprehensive, ‘canonical’ essays on Alexander Technique, which each time I notice I choose not to do.  I’m happy to repeat myself and rewrite things over and over as I get better at communicating this stuff, perfectionism be damned.]\n↓\n1599516425982738432 [2022-12-04] @Malcolm_Ocean 💜 6 🔁 1\npart of the magic of being unable to edit twitter threads is that they HAVE to always only be a snapshot of how you were seeing it at the time. they can't be \"kept up to date with the latest insights\"\n↓\n1599516427316494336 [2022-12-04] @Malcolm_Ocean \nbut weirdly it feels more easy to publish a page on the complice site that I could edit later, than a blog post that I could edit later.\n\nI think that's partially because many of my reads come from the post being sent as a newsletter....\n↓\n1599516428771610624 [2022-12-04] @Malcolm_Ocean \n...but also... a blog post FEELS like a final thing, but because it DOES have a date on it, it becomes complex to edit it because I neither want to imply that: 1. I stand behind all confusions remaining post-edits\n2. I already had shit figured out years ago\n↓\n1599516430625828864 [2022-12-04] @Malcolm_Ocean 💜 1\nsomehow there's a sweet spot where something can be written as a snapshot of my learning at a point in time, and also its potency and clarity stands the test of time and it becomes \"canon\"\n\nI feel like I really achieved this here:\nhttps://t.co/MyrnAMacBb\n↓\n1599516432127373312 [2022-12-04] @Malcolm_Ocean \nthat post now contains one [EDIT] parenthetical, but otherwise remains essentially the same except for maybe a few links added to pieces I hadn't yet written\n\nyears later I reflected about the nature of unintegrated understandings:\nhttps://t.co/bD5JeI8epP\n  [Quoting @Malcolm_Ocean: at the time I wrote this, I hadn't gotten the insight as deep into my bones as I now have, &amp; I still have much further to go  but the insight is still legit &amp; the articulation is good &amp; your integration will be yours anyway no matter how well I had it integrated when I wrote it https://t.co/3Pzq3t9oHW]\n↓\n1599516434014486529 [2022-12-04] @Malcolm_Ocean 💜 1\nwhat even is a tweet?\nwhat is an utterance?\nwhat is a thread?\nwhat is a post?\nwhat is a book?\nwhat is an essay?\nwhat is a conversation?\nwhat is a public collection of notes?\nhttps://t.co/gk21mKYPqC\n  [Quoting @Malcolm_Ocean: tweets are like utterances]\n↓\n1599516435708985344 [2022-12-04] @Malcolm_Ocean 💜 4\nwe are still just barely understanding the nature of the mediums we are participating in\n\nand I think that's beautiful\nhttps://t.co/mYCCECAofW\n  [Quoting @tasshinfogleman: they don't tell you when you sign up for the internet that you're learning to notice, harmonize with, and participate constructively in a self-organizing, emergent collective consciousness at the very edge of humanity's shared capabilities]\n↓\n1680039548024225793 [2023-07-15] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\nI've found this prompt (which is best interpreted, in the context of the examples @visakanv gives, as \"write one page about the topic without stopping or much editing\") to be a helpful way to sidestep the perfectionist/canonist energy\n\nreason y not perfect\nhttps://t.co/ynnPXzWWuH\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1599829237292486657 [2022-12-05] @AskYatharth 💜 6 🔁 2\n100 moments of love, joy, play, connection.\n↓\n1599835349106450432 [2022-12-05] @AskYatharth 💜 3\n1. i made a happy purr this morning. i was upset, and someone just reflected i was upset, and i knew they got it. they’re kind of a durable-feeling presence in my life, so it feels like the thing will be held more if it wants to be https://t.co/a9xNIDBVu7\n  [Quoting @AskYatharth: do humans purr?]\n↓\n1599835350599622656 [2022-12-05] @AskYatharth 💜 4\n2. i got a voice memo from a messy man i love, and our energy felt so flirtatious and spacious \n\ni felt exactly at the right distance to love him https://t.co/g94b4fXpve\n  [Quoting @AskYatharth: “my boundaries are the closest distance    where I can love you &amp; me simultaneously”  some distances are too close to love both you and me https://t.co/sCDenpoExv]\n↓\n1599835353317543936 [2022-12-05] @AskYatharth 💜 2 [(SEED) type=semantic_search]\n*yatharth make a tweet without finding a relevant QT challenge*\n↓\n1599835354923929600 [2022-12-05] @AskYatharth 💜 3\n3. my best friend called me about a work challenge, and i felt very safe in navigating it with him\n↓\n1624950665100554240 [2023-02-13] @AskYatharth 💜 4\n4. hearing the echo of “do you know that’s just a part of you?” from a loved one\n\n===\n\n1668987664140304388 [2023-06-14] @visakanv 💜 1396 🔁 208 💬 3\nhere's a 10-minute attempt to summarize my 300 page book @introspectVV into ~500 words. didn't precisely meet the brief of \"in one breath\" but i'll try again multiple times https://t.co/vdOSJt2DHf\nImages:\n  - [Image #0] The image is a text document titled \"VISA, EXPLAIN INTROSPECT RIGHT FUCKING NOW, IN ONE BREATH, STANDING ON ONE FOOT.\" The title is in bold, black font at the top of the page.\n    \n    Below the title, there are eight bullet points with accompanying text. The first seven bullet points have a single sentence or phrase, while the last one has two sentences. The text is written in a casual, conversational style and appears to be a personal reflection or advice on how to approach introspection.\n    \n    The background of the image is white, providing a clean and simple contrast to the black text. Overall, the image presents a thought-provoking and introspective message, encouraging the reader to confront their problems and emotions head-on. \n    \n    Here is the full text of the image:\n    \n    * Your (worst) problems are likely not what you think they are.\n    * If you're stuck, there's likely a good reason for it. There's also likely an additional good reason why you're avoiding the first reason. (It's typically some form of fear, which is trying to protect you. The ultimate fear is often a fear of death/loss, and/or social death. For many, the latter is often more frightening than the former.)\n    * Self-love isn't just bubble baths and spa days, it's about confronting the \"monster\" within yourself that you have ostracized for being shameful, cringe, dangerous, gross, grotesque - and embracing that part of yourself. (Notice how common it is for people to feel that they \"have\" to ostracize a part of themselves in order to avoid being ostracized by others in turn.)\n    * Most attempts at such confrontation go badly because of inadequate preparation, guidance, encouragement. There's a good reason why you locked up a part of yourself away!\n    * The inward journey towards confronting that \"monster\" requires reliving your worst experiences. This is painful and scary and you have to set aside time and space to do it. You can choose not to do it (most people put it off), but if so, then the confrontation will likely happen someday when most inconvenient, in ways that create a worse mess. I wish that wasn't true lol but it often is\n    * Beating yourself up about any of this sustains the status quo. You have to give yourself space to make mistakes and learn from them. Some artists and musicians are absolute masters at this and everyone should listen to them more (Victor Wooten and Kenny Werner are my fav got\n↓\n1668994712806490112 [2023-06-14] @visakanv 💜 591 🔁 81\nsince I did one, I might as well do the other, so here's my latest overview of @FANswitchboard – this one clocking in at 750 words, which is basically a blogpost lol https://t.co/uOV42Psu9k\nImages:\n  - [Image #0] The image is a long text passage discussing the concept of being a \"Friendly Ambitious Nerd.\" The passage is divided into six bullet points, each exploring a different aspect of this idea.\n    \n    The text is presented on a plain white background with black font and reads:\n    \n    \"VISA, EXPLAIN FRIENDLY AMBITIOUS NERD RIGHT FUCKING NOW, IN ONE BREATH, STANDING ON ONE FOOT.\n    \n    * Throughout history there have been “exceptional” people who seemed to have the near-mystical ability to “walk through the walls” of culture. They somehow were able to “just do stuff” that nobody else around them seemed able to. This is often mythologized, pedestalized as esoteric superhuman genius, which in my view is a way for “regular” people to abdicate their own creativity, their own power, which they don’t want to actualize because they don’t want to be responsible for it.\n    * A common feature I’ve noticed in a lot of these exceptional people is that, on top of being well-read, they were willing and able to articulate themselves, their desires, their goals. These goals tend to be emergent from them within themselves– a felt sense that there’s some possibility hiding in plain sight that everyone else around them is missing- but also, 1. they tend to go on to corroborate and verify the possibility of these goals being manifest (NERD), and 2. they cultivate the courage necessary to commit themselves to those goals (AMBITION) and follow through for decades. And 3, they cultivate the relationships with other people that they need in order to have a supportive social environment (FRIEND).\n    * I just think it’s so fucking crazy that there have been thousands of uncommonly successful people throughout history and we have so much information about how they did what they did, and yet we hardly seem to devote much in terms of time and resources to reverse-engineering them so that we can birth more “exceptional” “geniuses” into the world and have them solve our biggest problems for us. But I’ve come to understand why that is. It’s because being “exceptional” is scary. Greatness is by definition deviance, and deviance makes people uncomfortable. Most people don’t actually want their children to be smarter than them. They might say they want it, until the smart child starts making smart observations about their parents. The good news is we don’t need to care about “most people” in order\n↓\n1668995273845030912 [2023-06-14] @visakanv 💜 90 🔁 4\nboth of these were inspired by a conversation with @__drewface, where he asked me \"Visa, can you challenge me right now?\" and I ended up pointing out that some of his stuff could be more accessible. Then I had to look in the mirror and admit that the same is true for me too\n↓\n1668996273116966914 [2023-06-14] @visakanv 💜 331 🔁 106 💬 38 [(SEED) type=root]\nin the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot\n├── 1669121134673920000 [2023-06-14] @QiaochuYuan 💜 14\n│   @visakanv won’t be able to do this properly until post-vc energy infusion so bookmarking\n│   ├── 1669170122777563137 [2023-06-15] @visakanv 💜 22\n│   │   @QiaochuYuan help me ask everyone at VC to do it too hehehe\n│   │   ├── 1669206591667675137 [2023-06-15] @QiaochuYuan 💜 5\n│   │   │   @visakanv 🙏\n│   │   └── 1726680148030931350 [2023-11-20] @strangestloop 💜 1\n│   │       @visakanv @QiaochuYuan @gptbrooke @vibecamp_ this ought to go in the newsletter hehe\n│   └── 1699216607589863502 [2023-09-06] @strangestloop 💜 3\n│       @QiaochuYuan @visakanv 👀\n├── 1669320786014773251 [2023-06-15] @imperialauditor 💜 6\n│   @visakanv this was a really fun challenge\n│   \n│   I don’t feel like I have “a thing” but I decided to do it anyway\n│   \n│   also noticed lots of inspiration from you 🥰\n│   \n│   https://t.co/q1VzbqdzPN\n│     [Quoting @imperialauditor: imp talking points https://t.co/QW4hgOowuR https://t.co/Ielql4nqD6]\n├── 1669365785632858112 [2023-06-15] @forthrighter 💜 7 💬 1\n│   @visakanv this tweet is a green flag generator; going through the QTs of this and adding follows left &amp; right\n├── 1669417084743237659 [2023-06-15] @Malcolm_Ocean 💜 6\n│   @visakanv BOOM:\n│   \n│   this is like the 7th intro I've written to NNTD (most of them also published) but I think it goes deeper in some directions than the others!\n│   \n│   more emphasis on trust-physics &amp; trust-logic &amp; self-evidentness\n│   https://t.co/zQRo54QOZV\n│     [Quoting @Malcolm_Ocean: Malcolm, explain the Non-Naive Trust Dance right fucking now, in one breath, standing on one foot https://t.co/ynnPXzWWuH https://t.co/aGYcUJNS4l]\n├── 1669477224708202496 [2023-06-15] @Malcolm_Ocean 💜 6\n│   @visakanv here's my third. this one's fun since it's a relatively new lens on stuff (although it's the stuff I've been staring at for 11 years, that NNTD is my main contribution to so far)\n│   \n│   https://t.co/ZrWqviC4ZS\n│     [Quoting @Malcolm_Ocean: Malcolm, explain the evolution of consciousness right the fuck meow, in one breath, standing on one foot  (reply below if you see your work (or play!) as being within this field, whether research or application!) https://t.co/ynnPXzWWuH https://t.co/cbieK8ApHC]\n├── 1810606605869908401 [2024-07-09] @Malcolm_Ocean 💜 2\n│   @visakanv Visa this ^ is in my top 10 of coolest things you've come up with. I think it could become WAY bigger, like a whole new art form / medium... maybe just needs a catchier name?\n│   \n│   \"one-breath one-pager\"?\n│   https://t.co/UsP7qLxWMO\n│     [Quoting @Malcolm_Ocean: @visakanv found a next size above tweet—a 1-page bullet outline written in one sitting  having these constraints visibly as part of the frame of the writing makes it clear it should be held to a lower standard, not compared to some hypothetical perfection https://t.co/nNcpNzpI48]\n└── 1820578859286401426 [2024-08-05] @Malcolm_Ocean 💜 6\n    @visakanv Bam, a year later I have a 4th 1-page screenshot.\n    \n    More to come! (I've added a \"write 100 onepagers\" to my \"do 100 [do 100 things] thing\")\n    https://t.co/FFf2SnfLzb\n      [Quoting @Malcolm_Ocean: Malcolm, explain bootstrapping meta-trust right fckn now, in one breath, standing on one foot]\n    ↓\n    1820580265531740446 [2024-08-05] @Malcolm_Ocean \n    @visakanv idk if this is actually particularly more accessible (aside from being shorter than the mini ebook it's based on) but we'll see\n    \n    maybe that's what I need to write 100 for 😛\n\n===\n\n1669050642902441989 [2023-06-14] @yashkaf 💜 700 🔁 57 💬 1 [(SEED) type=quote_of_root]\none page first draft summary of my book about dating other people https://t.co/OLuUg1dMoM https://t.co/1OPNTG238c\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image displays a text document with a title and 8 bullet points. The title is \"Jacob, explain dating to me right now, standing on one foot\" in black text at the top of the page.\n    \n    The 8 bullet points are written in black text and describe various aspects of dating, including the importance of understanding the other person's perspective, the need to be strategic and not fatalistic, and the dangers of conceiving of dating as a reflection of one's own status. The text is written in a conversational style, with the author using rhetorical questions and personal anecdotes to make their points.\n    \n    The background of the image is white, providing a clean and simple contrast to the black text. Overall, the image appears to be a draft or summary of a longer piece of writing about dating, possibly a book or article.\n├── 1669067449545916416 [2023-06-14] @visakanv 💜 11\n│   @yashkaf hell yea\n├── 1669144534121590785 [2023-06-15] @eshear 💜 5\n│   @yashkaf Love the idea of this book, already have ppl in mind I'd gift it to\n│   ↓\n│   1669145480998146049 [2023-06-15] @yashkaf 💜 20\n│   @eshear I heard that author's advances are a powerful way to motivate writers to actually write the thing\n└── 1669196173217865728 [2023-06-15] @AaronBergman18 💜 3\n    @yashkaf https://t.co/KnfDdYANyT\n    Images:\n      - [Image #0] The image shows a screenshot of a social media post's engagement metrics. The text reads \"295 Likes\" and \"246 Bookmarks\" in black font, with three icons below: a red heart, a blue bookmark, and an upward-pointing arrow in a box.\n\n===\n\n1669080205917556737 [2023-06-14] @uberstuber 💜 40 🔁 3 [(SEED) type=quote_of_root]\nJames, explain your thing right fxkn now, in one breath, standing on one foot, https://t.co/PbzFrue2CR https://t.co/vd2fiewAVG\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a black square with white text, featuring a message about personal growth and self-improvement.\n    \n    * The title of the image is \"if you're smart and stuck in your head all the time\" in large white font at the top.\n    \t+ The text is centered and takes up two lines.\n    \t+ The font is bold and sans-serif.\n    * The main body of the text is written in smaller white font below the title.\n    \t+ It is a passage that discusses the importance of stepping out of one's comfort zone and trying new things.\n    \t+ The text is left-aligned and takes up most of the image.\n    \t+ The passage is divided into 11 sentences, each with its own unique message.\n    \t+ Some key points include:\n    \t\t- The need to learn to be and act in unfamiliar ways\n    \t\t- The value of building emotional fluidity and developing somatic awareness\n    \t\t- The importance of rebuilding trust in one's unconscious mind\n    \t\t- The potential for personal growth and increased joy through this process\n    * The background of the image is solid black.\n    \t+ There are no other visual elements or graphics on the image.\n    \n    Overall, the image presents a thought-provoking message about the importance of challenging oneself and embracing new experiences in order to achieve personal growth and fulfillment.\n↓\n1669199716922560513 [2023-06-15] @_brentbaum 💜 1\n@uberstuber yesss\n\n===\n\n1669101657357950980 [2023-06-14] @Rusty_Swarf 💜 32 🔁 6 💬 1 [(SEED) type=quote_of_root]\nhttps://t.co/cNHovajOmj https://t.co/gkgAKsIn0I\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669115152552296449 [2023-06-14] @SarahAMcManus 💜 24 🔁 2 💬 1 [(SEED) type=quote_of_root]\n\"Sarah, explain the Goal-Crafting Intensive / Beyond Goals reframe right fckn now, in one breath, standing on one foot\" https://t.co/okPCBJ77nC https://t.co/w29tgsz0Ox\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image shows a woman standing on one leg in a mirror selfie, with her other foot resting on her inner thigh. She is wearing a red t-shirt with a blue design and grey patterned leggings, holding a phone in one hand while gesturing with the other.\n├── 1669115375043346432 [2023-06-14] @visakanv 💜 4\n│   @SarahAMcManus ok you win!! 🏆\n├── 1669115436535824384 [2023-06-14] @abhayance 💜 1\n│   @SarahAMcManus you absolute legend\n└── 1669116510726676480 [2023-06-14] @SarahAMcManus 💜 3\n    Transcript! \n    \n    \"We are refactoring the Goal-Crafting Intensive workshops into a Beyond Goals framework, which takes into account the act of grasping onto a goal can be a counterproductive tension...\"\n    \n    1/2\n    ↓\n    1669116560328507393 [2023-06-14] @SarahAMcManus 💜 3\n    \"and yet focusing on that creates powerful opportunities for aligned action and untangling internal conflict\"\n    \n    2/2\n    ↓\n    1669116831553196032 [2023-06-14] @SarahAMcManus 💜 1\n    More on the workshops!\n    https://t.co/kovr6ByjSZ\n      [Quoting @Malcolm_Ocean: just realized I hadn't actually tweeted yet to announce that we're running more Goal-Crafting Intensives in July  5h online workshop where you can look at any area of your life or the whole thing, with coaching and time to make real progress  check it: https://t.co/8IGLINnbj0]\n\n===\n\n1669228260474105856 [2023-06-15] @kcorazo 💜 2 [(SEED) type=quote_of_root]\nKahlil, explain your next book...\n\nI don't know yet what it wants to be, but my work in the following months will be to find out. My updated bio outlines the plan! https://t.co/J7FdkDOWJM https://t.co/LeHwGbg5vs\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669317947737686016 [2023-06-15] @the_wilderless 💜 45 [(SEED) type=quote_of_root]\nHere’s the five minutes I felt like putting into Explaining My Thing today https://t.co/VGNGtXLA4J https://t.co/L5yo5f17En\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a screenshot of a note-taking app with a dark background and white text. The title \"explain your thing\" is displayed at the top, followed by a list of bullet points that appear to be a philosophical or spiritual discussion.\n    \n    Here is the text transcribed from the image:\n    \n    **explain your thing**\n    \n    * For as long as you are a human being in a human body in a human family in a human culture in a human society with a human history of human lineages and human expressions of human ideas, in a living tapestry on a living planet in a physical universe—you are living inside the contingent energy-imagination-artifacts of a thousand different beings at a thousand different levels of being\n    * Every layer of this is lossy—the carryover of fidelity from Reality is fairly low\n    * You can use the outer topsoil layers of this lossy layer-heap as your starting point,\n    * Or you can see how many layers down you can get before picking up psychofauna and programming that’ll be tricky to un-knot from later\n    * The latter is tricky, but seems to save time & egregore-capture in the long run\n    * Some of the most useful tools in navigating down closer to the core and unblocking underlying layers are\n    \t+ Direct somatic experience:\n    \t\t- \"It is the human body that can ground responsible thinking about religion across all clime and time.\" - Jeffrey Kripal\n    \t+ a deft hand with Mythopoetic Currents\n    \t\t- \"At the end of the day, Religion is about subjects caught in and freed from their own stories\" -Kripal again (he phrases a lot of these things well, sue me)\n    * A good rule of thumb here:\n    \t+ Being stuck in the reality-settings that other people put you in is never the move,\n    \t+ But to the degree that you’re able to navigate reality-settings and and choose which to participate in, that’s between you and your soul\n↓\n1669325937354108929 [2023-06-15] @the_wilderless 💜 6\nlol just re-read it;; doing a second draft would definitely involve trying to use fewer weird terms and simplifying it more, but what can ya do\n↓\n1669326694862266372 [2023-06-15] @the_wilderless 💜 5\noh right it has gpt built in, i can just make it give me a simplified summary.\n\nI give this summary like, 6.5/10. Solid enough. https://t.co/g6bML5sGII\nImages:\n  - [Image #0] The image presents a list of bullet points on a black background, with white text that appears to be a passage or article about navigating the complexities of human existence.\n    \n    * The first bullet point reads: \"As a human, you exist within a complex web of connections and influences from various sources. This web is imperfect and can be difficult to navigate.\"\n    \t+ The text is written in a simple, sans-serif font.\n    \t+ The sentence is 29 words long.\n    * The second bullet point states: \"You can either start from the surface or delve deeper to untangle the complexities.\"\n    \t+ The text is also written in the same font as the first bullet point.\n    \t+ The sentence is 15 words long.\n    * The third bullet point says: \"Going deeper can be challenging but may save time and prevent being caught in others' influences.\"\n    \t+ The text is again written in the same font.\n    \t+ The sentence is 16 words long.\n    * The fourth bullet point reads: \"Useful tools for this journey include\"\n    \t+ This bullet point is followed by three sub-bullet points.\n    \t+ The text is written in the same font as the previous bullet points.\n    * The first sub-bullet point under the fourth bullet point states: \"direct bodily experiences,\"\n    \t+ The text is written in the same font as the previous bullet points.\n    \t+ The sentence is 3 words long.\n    * The second sub-bullet point reads: \"skillful use of mythopoetic currents, and\"\n    \t+ The text is written in the same font as the previous bullet points.\n    \t+ The sentence is 5 words long.\n    * The third sub-bullet point says: \"understanding religion's role in our stories.\"\n    \t+ The text is written in the same font as the previous bullet points.\n    \t+ The sentence is 6 words long.\n    * The fifth bullet point reads: \"Avoid being trapped in others' reality-settings, but choose which ones to engage with based on your personal journey.\"\n    \t+ The text is written in the same font as the previous bullet points.\n    \t+ The sentence is 19 words long.\n    \n    The image presents a passage or article that discusses the complexities of human existence and provides guidance on how to navigate them. The text is written in a simple, sans-serif font on a black background, making it easy to read. The passage suggests that individuals can either start from the surface or delve deeper to understand the complexities, and that going deeper can be challenging but may save time and prevent being caught in others\n\n===\n\n1669320053928476673 [2023-06-15] @imperialauditor 💜 21 [(SEED) type=quote_of_root]\nimp talking points https://t.co/QW4hgOowuR https://t.co/Ielql4nqD6\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a text-based image that appears to be a list of talking points or key concepts related to a particular topic or theme. The text is presented in a clear and concise manner, with each point or concept listed in a bullet-point format.\n    \n    Here is a transcription of the text in the image:\n    \n    Imp, explain your account right fckn now, in one breath, standing on one foot\n    \n    here's some random things this account may or may not be about\n    \n    - **pseudonymity** is interesting because it lets you understand how people would interact with you unencumbered by all the baggage of what you've done irl so far - and gives you a way to answer \"would people actually like and care about me without all these class and status signifiers\"?\n    \n    - dealing with **uncertainty** - for most things in life we really have much less info than we'd like, and the question is how to act nonetheless\n    \n    - **selection effects** - the uncertainty problem is made far worse by everything you see being only the kind of stuff a person like you would seek out (your filter bubble) or what someone is incentivized to show to you (news worthy outliers)\n    \n    - **yes requires the possibility of no** - be aware of cases where you only get to see and say certain things but not their opposite\n    \n    - related is the economics problem of what is **seen and not seen** -it's easy to only focus on what has happened vs what would have happened otherwise\n    \n    - **copenhagen ethics** - actually doing something results in it being seen, so you'll get a lot more criticism than if you hadn't done anything at all\n    \n    - **the legibility issue** - the problem you're actually trying to solve involves many more constraints than the ones you can articulate out loud - there's also the ones you can only articulate to yourself, the ones you don't wanna admit to yourself, and the ones you haven't considered at all. this is why the rationalist approach of \"i would simply define my goals and take concrete steps to achieve them\" fails.\n    \n    - **communication is a lot harder than you think** - the illusion of transparency means that you're seeing through several layers of glass darkly and it's very important to keep this in mind, it feels embarrassing to recheck and reconfirm things more than you \"need to\", but it can save your ass, which is more important\n    \n    - **develop taste and discernment** - this can only be done with lots of practice. it also really helps to have a support system and relative lack\n↓\n1724145277303488644 [2023-11-13] @imperialauditor 💜 4\nI think this is actually The Answer - what separates plain old frustration and angry and sorrow and worry and hurt and pain - from the twisted constricting knotted ball of being tense about being tense or upset about being upset that spirals in on itself https://t.co/50uulZSstX\n  [Quoting @imperialauditor: suffering is when you don’t endorse your feelings https://t.co/lpKYFVuA0o]\n\n===\n\n1669342752008699906 [2023-06-15] @justavagrant_ 💜 8 [(SEED) type=quote_of_root]\nHere’s 1 thing - Johnson, explain practicing courageous conversations right fckn now, in 1 breath, standing on one foot https://t.co/nQ0nfhmJP3 https://t.co/9UnvF0ESUM\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669346033409859586 [2023-06-15] @justavagrant_ 💜 7 [(SEED) type=quote_of_root]\nThing 2 - Johnson, explain taking back your power right fckn now in one breath standing on one foot https://t.co/nQ0nfhmJP3 https://t.co/0bWUuBfqpq\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669357106770903043 [2023-06-15] @forthrighter 💜 10 🔁 2 [(SEED) type=quote_of_root]\nI have a draft of this that I keep.  It's not ready.  It's inadequate, but it contains main true things I will keep working on https://t.co/S77YcLa5JZ https://t.co/2KwU1LArBn\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669416806203703308 [2023-06-15] @Malcolm_Ocean 💜 22 💬 1 [(SEED) type=quote_of_root]\nMalcolm, explain the Non-Naive Trust Dance right fucking now, in one breath, standing on one foot https://t.co/ynnPXzWWuH https://t.co/aGYcUJNS4l\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669417036361941014 [2023-06-15] @alcentian_one 💜 7 [(SEED) type=quote_of_root]\ntook a stab at this on the road towards vibecamp https://t.co/nEN217JStN https://t.co/wNifSIhTzm\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1669417047216799745 [2023-06-15] @alcentian_one 💜 3\ncame out to about 500 words https://t.co/Q9uljK2NWU\nImages:\n  - [Image #0] The image is a screenshot of a text document on a mobile device, detailing the potential of frisbees to bring people together and create positive change. The text is transcribed as follows:\n    \n    \"experience of others and permanently expanding their awareness to include aspects of life not experienced first-hand\n    still, we are contained by our physical body and composed of a unique amalgamations of relationships and stories. how do we break out of old norms and produce that which we have not produced before? (namely, a healthy; happy, harmonious society?)\n    i propose we use a frisbee!\n    why?\n    frisbees are cheap, durable, multi-functional, light-wieght, and they bring people together in physical space through the realm of embodied play. moreover, they can function as canvases and containers of infinity - meaning can be imbued and passed with the disk.\n    most importantly, to throw a frisbee with a stranger or friend is FREE and POSITIVE-SUM PLAY. it can engage duos, trios, or entire communities in the co-creative, cooperative, and competitive acts of play\n    frisbees have the potential to function as gathering points and records of us - inviting people back into their bodies, into play, and into new relationships\n    these circles of communion and community can build from this foundation, asking questions of local needs, capabilities, and dreams\n    in short, frisbees and all their games can catalyze self-transformation. mutual aid. and solidaritv.\"\n↓\n1669417062534397961 [2023-06-15] @alcentian_one 💜 2\ncould certainly use a re-write but felt good to try tying some ideas together! \n\ngetting closer to articulating the harmonic focus &amp; how frisbees inherently carry revolution 🥏 https://t.co/3wXzvpUXka\nImages:\n  - [Image #0] The image shows a screenshot of a note-taking app, with a list of bullet points discussing the potential of frisbees and their games to catalyze self-transformation, mutual aid, and solidarity. The text is written in white on a black background and includes the following points:\n    \n    * in short, frisbees and all their games can catalyze self-transformation, mutual aid, and solidarity. they create a local center to connect as equals and organize further activity; rooted by an ethos of non-violent anarchy called the Spirit of the Game\n    * every person can choose to be a harmonic being & an organizer of local self-sufficiency.\n    * a team or network of such people can produce exponentially powerful effects\n    * through the play of games and sharing of stories, we can solve our basic needs and extend an infinte circle of kinship, starting in our very own local vicinity\n    * you are integral to this process. who is around you? who are family? what would it look like to treat all with supreme respect & solidarity?\n    * what do you feel missing from this world? what calls you? what does your heart NEED TO BE?\n    * real minds connect & make harmony. start sharing\n    \n    At the bottom of the screen, there is a tab labeled \"cellular function\" and a navigation bar with buttons for back, forward, and menu options.\n\n===\n\n1669419585928347672 [2023-06-15] @DRMacIver 💜 81 🔁 1 [(SEED) type=quote_of_root]\nI didn't have a computer with me and hate writing on my phone, but here's what I'm about in one page. https://t.co/8tP4ZbJ0UN https://t.co/QQydztWYmj\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a photograph of a handwritten note on a piece of paper. The note is written in black ink and appears to be a personal reflection or journal entry.\n    \n    The text reads:\n    \n    \"David, explain what you're about in one page.\n    \n    1. A lot of people think a lot but in a way that makes their life worse.\n    2. Some of them then conclude this is because thinking is bad. This is dumb and wrong. They just did it badly.\n    3. I'm trying to help people before they get to (2) By showing people how to think well.\n    4. Crucially, thinking well is towards some purpose, aware of and fully integrated with your emotions, and heavily collaborative.\n    5. If you do it right, actions, feelings, and thoughts are all mutually supporting.\n    6. My methods tend to focus on taking the basics from different areas and applying them in pretty straightforward ways.\n    7. Right now I'm tackling questions like \"How do you work on big projects?\" and \"How do you make big decisions?\"\n    8. I'm also working on how to build community around this. I'll do ok online and will be working on offline next\"\n    \n    The handwriting is cursive and somewhat messy, suggesting that the author is writing quickly or informally. The text is divided into eight numbered points, each addressing a different aspect of the author's thoughts and ideas.\n    \n    Overall, the image appears to be a personal and introspective note, possibly written as a response to someone named David or as a reflection on the author's own thoughts and experiences.\n├── 1669421660045205504 [2023-06-15] @DRMacIver 💜 35\n│   Bonus shot of where I was when I wrote it. https://t.co/ivSiHqiaVu\n│   Images:\n│     - [Image #0] The image depicts a serene outdoor scene featuring a weathered wooden bench situated on a grassy hillside, overlooking a lush forested valley. The bench, positioned on a patch of dry grass, is surrounded by dense foliage and faces away from the viewer, offering a view of the surrounding landscape.\n└── 1669423151153926157 [2023-06-15] @abhayance 💜 4\n    Transcription:David, explain what you're about in one page.1. A lot of people think a lot but in a way that makes their life worse.2. Some of them then conclude this is because thinking is bad. This is dumb and wrong. They just did it badly.3. I'm trying to help people before they get to (2) by showing people how to think well.4. Crucially, thinking well is towards some purpose, aware of and fully integrated with your emotions, and heavily collaborative.5. If you do it right, actions, feelings, and thoughts are all mutually supporting.6. My methods tend to focus on taking the basics from different areas and applying them in pretty straightforward ways.7. Right now, I'm tackling questions like \"How do you work on big projects?\" and \"How do you make big decisions?\"8. I'm also working on how to build community around this. I've done OK online and will be working on offline next\n\n===\n\n1669466687521824768 [2023-06-15] @abhayance 💜 149 🔁 10 💬 1 [(SEED) type=quote_of_root]\nabhay, explain \"reality is metafiction\" right fckn now, in one breath, standing on one foot https://t.co/YHrMUpVU2I https://t.co/TeYNj1Bgxp\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n├── 1669466866354384896 [2023-06-15] @abhayance 💜 6\n│   more here, featuring many of you 💗 https://t.co/9ygwVNyyBl\n│     [Quoting @abhayance: The simulation hypothesis is a special case of the notion of Reality as Metafiction.Analogously, Reality continually emphasizes its own constructedness to make us aware that it's a metaphorical work viewed from dissociated perspectives of the pure subjectivity of mind-at-large. https://t.co/TJqZjPfKRd]\n│   ↓\n│   1839662367627493743 [2024-09-27] @abhayance 💜 1\n│   got notebook llm to turn this into a conversation https://t.co/EWEbyC3jxY\n│   Images:\n│     - [Image #0] [PIC NOT AVAILABLE]\n├── 1669480872620195847 [2023-06-15] @Malcolm_Ocean 💜 6\n│   @abhayance amazing. your kid might soon be ready for some sesame street metafiction!\n│   \n│   watch: https://t.co/nzb67Y46Do\n│   buy: https://t.co/4Dm0LrWyWA https://t.co/CFBSidMen6\n│   Images:\n│     - [Image #0] The image is a side-by-side comparison of the front and back covers of the children's book \"The Monster at the End of This Book\" starring Lovable, Furry Old Grover.\n│       \n│       The front cover shows a cartoon illustration of Grover, a blue, furry monster with a large smile and wide eyes, holding onto a lamppost on Sesame Street. The title of the book is written in pink and green letters on a white sign above Grover's head. The sign is framed in gold and attached to a brick wall. A speech bubble coming from Grover says, \"Hello, everybody!\"\n│       \n│       The back cover features the same illustration of Grover, but this time he is looking at the back cover with a speech bubble that says, \"This is a very dull page. What is on the next page?\" The title and author information are displayed prominently on the back cover, along with a copyright notice and other text.\n│       \n│       Overall, the image showcases the playful and engaging design of the book's covers, which are sure to capture the attention of young readers.\n│   ├── 1669481069555400705 [2023-06-15] @Malcolm_Ocean 💜 1\n│   │   @abhayance btw @Meaningness the particular \"monster\" theme of this vibes so well with your We Are All Monsters piece:\n│   │   \n│   │   https://t.co/slluf9vLHu\n│   ├── 1669481344211058688 [2023-06-15] @abhayance 💜 1\n│   │   @Malcolm_Ocean oh absolutely 🛒\n│   └── 1669494293743165440 [2023-06-15] @RomeoStevens76 💜 4\n│       @Malcolm_Ocean @abhayance The child who will save us via discovering new cooperation theorems has no idea how this book ends.\n│       ↓\n│       1669498393305948161 [2023-06-16] @Malcolm_Ocean 💜 3\n│       @RomeoStevens76 @abhayance baha I was definitely thinking about that while reading it\n│       \n│       a lot of kids' fiction seems to do weird things to agency and thwarting\n├── 1669579172128104452 [2023-06-16] @RichDecibels 💜 1\n│   @abhayance 🙏\n├── 1671339273784635393 [2023-06-21] @abhayance 💜 2\n│   brother in arms https://t.co/Xgu5ZpXCgA\n│     [Quoting Tweet 1671289857329463297 (missing)]\n└── 1672277209959084034 [2023-06-23] @abhayance 💜 1\n    reality is continuously onboarding you to itself https://t.co/09RvqNVsBy\n      [Quoting @RobertHaisfield: Rob, explain Continuous Onboarding right now, in one breath, standing on one foot.Btw I'm thrilled to be writing a book about it, covering behavioral science / game design principles + case studies so you can see your software apps through my lenses. I'm accepting clients. https://t.co/gwJifdooxO https://t.co/r9tpXWuxXd]\n    ↓\n    1672285621212303362 [2023-06-23] @RobertHaisfield 💜 1\n    @abhayance I sneak in by naming a bunch of concepts for how it works in software, then you start noticing it all around you\n\n===\n\n1669476714563399681 [2023-06-15] @Malcolm_Ocean 💜 25 🔁 1 [(SEED) type=quote_of_root]\nMalcolm, explain the evolution of consciousness right the fuck meow, in one breath, standing on one foot\n\n(reply below if you see your work (or play!) as being within this field, whether research or application!) https://t.co/ynnPXzWWuH https://t.co/cbieK8ApHC\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image presents a thought-provoking discussion on the evolution of consciousness, sparked by a tweet that challenges the reader to explain the concept in a concise and creative manner. The text is organized into a series of bullet points, each exploring a distinct aspect of the topic.\n    \n    *   The first bullet point introduces the idea of a field of study focused on the evolution of consciousness, highlighting the diversity of perspectives and approaches within this field.\n        *   The text notes that some individuals are aware of the larger field, while others are still exploring specific aspects of it.\n        *   It emphasizes that the study of evolution encompasses not only biological evolution but also cultural/memetic evolution, pre-biological physical evolution, and thinking as an evolutionary process.\n    *   The second bullet point delves into the concept of evolution as a tautology, suggesting that the process tends to favor entities that are better suited to their environment.\n        *   The text quotes Tom Atlee's Co-Intelligence Institute, stating that \"we are evolution\" and that consciousness is a significant facet of this process.\n        *   Statistics:\n            *   Across many domains of society, life, and spirituality, we are in the process of birthing ourselves as conscious evolution.\n    *   The third bullet point discusses the field's reliance on various sources, including cogsci, history, religious texts, philosophy, and wisdom traditions like Buddhism and Christian mysticism.\n        *   The text highlights the importance of first-person research in understanding consciousness, as opposed to solely relying on third-person research.\n        *   Statistics: None\n    *   The fourth bullet point focuses on the author's particular research, known as the \"Non-Naive Trust Dance,\" which explores inter/co-seeming and the process by which things seem one way to one person and differently to another.\n        *   The text notes that this research aims to understand what gets in the way of shared understanding.\n        *   Statistics: None\n    *   The final bullet point provides a rough sketch of the evolution of consciousness, tracing its development from a state of un-self-consciousness to the emergence of dualism and the ego.\n        *   The text describes how the superego became aware of itself and started identifying with itself, leading to a new kind of evolution among superegos/memeplexes.\n        *   Statistics:\n            *   At some point in the past, our ancestors were not conscious of their own consciousness.\n            *   They lived as much in flow with the dao as cats and lizards.\n            *   Then\n├── 1669559055029878784 [2023-06-16] @aleksil79 💜 2\n│   @Malcolm_Ocean yeah, tracks\n│   this feels kind of local to the particular knot which may or may not be sufficient to approach a solution (or at least set up an approach) but it's not easy to make it fully general *and* comprehensible\n│   ↓\n│   1669564666480041984 [2023-06-16] @Malcolm_Ocean 💜 2\n│   @aleksil79 what do you mean?\n│   \n│   also I'm glad you in particular saw this—I was thinking of you when I wrote it as one of the other scholars out there I'm tracking in this nascent field\n│   ↓\n│   1669594535381311489 [2023-06-16] @aleksil79 💜 2\n│   @Malcolm_Ocean the pattern of the evolution of consciousness is really general and our predicament is a particular manifestation of that\n│   \n│   I'm not sure how feasible that is to deal with absent that more general understanding, especially with different-enough-to-matter intelligences coming online\n├── 1678121351876608000 [2023-07-09] @AskYatharth 💜 2\n│   @Malcolm_Ocean what’s the link to the snake/apple ritual thing?\n│   ↓\n│   1680022026763763714 [2023-07-15] @Malcolm_Ocean 💜 1\n│   @AskYatharth https://t.co/P4UIPPlAMz\n├── 1784840263682449860 [2024-04-29] @Malcolm_Ocean 💜 1\n│   if you like this format and want to see the one for my Non-Naive Trust Dance, you're in luck:\n│   https://t.co/zQRo54RmPt\n│     [Quoting @Malcolm_Ocean: Malcolm, explain the Non-Naive Trust Dance right fucking now, in one breath, standing on one foot https://t.co/ynnPXzWWuH https://t.co/aGYcUJNS4l]\n└── 1832073670388502828 [2024-09-06] @michaelgarfield \n    @Malcolm_Ocean There were definitely lies before self-awareness, they just weren't self-aware.\n\n===\n\n1669500725016276993 [2023-06-16] @visakanv 💜 12 [(SEED) type=quote_of_root]\nI wanna do a nice thread of QTs when I can, but in the meantime check out the quotes on this tweet!! https://t.co/9glw48FXU8\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669503651591716867 [2023-06-16] @michelleakin 💜 5 [(SEED) type=quote_of_root]\ni decided to get high and try to do this, but it was a mistake. i shall try, try again. https://t.co/DXX5XF6B4s\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1669561997221056512 [2023-06-16] @zrkrlc 💜 8 [(SEED) type=quote_of_root]\nblackbelt in one breath, right fkin now https://t.co/3gq6LtSYsA https://t.co/eWGt5xTdse\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image presents a text-based slide titled \"Explain Blackbelt in one breath\" in white text against a black background. The content is organized into eight bullet points, each exploring the concept of \"scenius,\" a term coined by writer and musician Grant McKenzie. The text delves into the idea that scenius refers to the communal aspect of creativity, where talented individuals come together to challenge and inspire one another, leading to innovative breakthroughs.\n    \n    Here is a detailed breakdown of the image:\n    \n    * **Title**: \"Explain Blackbelt in one breath\"\n    \t+ Font: White\n    \t+ Background: Black\n    * **Bullet Points**:\n    \t+ Eight bullet points discussing the concept of scenius\n    \t+ Topics include:\n    \t\t- The value of attending a historical gathering (Edinburgh's Poker Club in the 1760s)\n    \t\t- The challenges of recreating the magic of such gatherings\n    \t\t- The transformative power of people-places\n    \t\t- The role of aesthetic consensus-formation in invention\n    \t\t- The importance of high standards and local disagreement\n    \t\t- The need for globally exclusive, locally discursive organizing principles\n    \t\t- The process of building scenius and its relation to fractaline gradient\n    \t\t- The creation of a game that reifies exclusion processes as ends to themselves\n    \n    In summary, the image presents a thought-provoking discussion on the concept of scenius, highlighting its significance in fostering creativity and innovation through communal gatherings and aesthetic consensus-formation.\n↓\n1669562790200348674 [2023-06-16] @zrkrlc \n(sleep deprived, didn't have the energy to make it shorter or to correct mistakes 😇)\n↓\n1669564182294036480 [2023-06-16] @zrkrlc \nalso doing this made me update towards explanation being Just Too Fkin Hard (But Necessary)\n↓\n1669567797201113088 [2023-06-16] @zrkrlc \nthe deep breaths version can be found here https://t.co/YlSTrv0Dwo\n  [Quoting @zrkrlc: just published a LessWrong post on what i've been losing sleep over these past couple of weeks:  https://t.co/ezit1RyDcr]\n\n===\n\n1669717104025800707 [2023-06-16] @pachabelcanon 💜 3 [(SEED) type=quote_of_root]\nhttps://t.co/0uwK1zp1bc https://t.co/NFwaLfZPRo\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1670529598331953153 [2023-06-18] @RobertHaisfield 💜 39 🔁 1 💬 1 [(SEED) type=quote_of_root]\nRob, explain Continuous Onboarding right now, in one breath, standing on one foot.Btw I'm thrilled to be writing a book about it, covering behavioral science / game design principles + case studies so you can see your software apps through my lenses. I'm accepting clients. https://t.co/gwJifdooxO https://t.co/r9tpXWuxXd\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a text-based image that discusses the concept of \"Continuous Onboarding\" in the context of software applications. \n    \n    The text is written in a conversational tone and is divided into six paragraphs, each addressing a different aspect of Continuous Onboarding.\n    \n    * The first paragraph introduces the concept by referencing horizontal products like Notion, Airtable, Excel, and Roam, which require learning and expansion of use cases over time.\n    * The second paragraph expands on the idea, explaining that Continuous Onboarding applies to most apps that aren't simple and require ongoing learning and feature additions.\n    * The third paragraph highlights the importance of user goals changing over time and how apps should adapt to these changes by continuously teaching users how to use the app better.\n    * The fourth paragraph defines Continuous Onboarding as an onboarding process that never stops, allowing users to accomplish their goals and feel a sense of accomplishment.\n    * The fifth paragraph notes that some apps have a more expansive range of potential use cases than others and emphasizes the importance of thinking about Goal Resonance, or how a user discovers that the app helps them accomplish a goal.\n    * The sixth paragraph discusses the limitations of \"Explainer content\" (documentation, app tours, videos, etc.) and suggests that learnable design is a more effective approach, as it communicates how the app works through feedback loops and makes the impact of the user's actions more clear and immediate.\n    \n    Overall, the image presents a detailed explanation of Continuous Onboarding, its benefits, and its implementation in software applications.\n↓\n1670530204404699138 [2023-06-18] @RobertHaisfield 💜 1\nFollow my journey here, where I'll share Continuous Onboarding musings, early drafts, and helpful links that inform my writing or cover similar themes to the book. https://t.co/wBewC2aZxX\n  [Quoting @RobertHaisfield: I've dreamed of writing a book my whole life, but until now, I've never felt I had \"enough\" to teach.Now I do. I've honed my perspective on years of research and practice.So I'm writing a book about Continuous Onboarding. Join me for the journey 😄https://t.co/eahc78xdwx]\n↓\n1670532414094061568 [2023-06-18] @RobertHaisfield 💜 3\nContinuous onboarding is explicitly designing an app to facilitate the user's growth from beginner to power user, recognizing that's not all going to happen in one day.Users feel heard and capable, so they stick around for longer.https://t.co/o9IKFi90sB\n  [Quoting @RobertHaisfield: 47. Epistemic rationality: has mental models and beliefs that are accurate reflections of reality. Instrumental rationality: is able to effectively accomplish their goals. In onboarding, I want to increase the user's epistemic rationality to enable instrumental rationality.]\n\n===\n\n1670891410034139136 [2023-06-19] @hargup13 💜 6 [(SEED) type=quote_of_root]\nhttps://t.co/6Xp72vmmHi https://t.co/X7wvH33IH9\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n\n1671121970186924033 [2023-06-20] @michelleakin 💜 34 🔁 2 [(SEED) type=quote_of_root]\n“Michelle, explain what you’re about right fckn now, in one breath, standing on one foot\" https://t.co/DXX5XF6B4s https://t.co/HUY7fEu0FI\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a white page with black text, titled \"All the Things I am About\" and featuring six bullet points that outline the author's philosophy on various aspects of life.\n    \n    *   The first bullet point discusses the importance of being oneself, expressing oneself, and knowing oneself. It emphasizes that many people want to have something in order to be something, but ultimately, it is the actions that inform results.\n        *   The concept of \"Be Do Have\" is introduced, suggesting that people should focus on being happy first, which informs their actions.\n        *   The importance of self-awareness and self-expression is highlighted.\n    *   The second bullet point talks about true partnerships, stating that they are rare because they require both parties to be intentional, honest, self-ownership-focused, and willing to grow.\n        *   Partnerships are described as the optimal relationship dynamic for inspired creation.\n        *   The importance of having 2-5 deep, connected partnerships in one's life is emphasized.\n    *   The third bullet point discusses the role of art in communicating what goes on inside of us and allowing others to see that they are not alone.\n        *   Art is described as the only real method for communicating inner thoughts and feelings.\n        *   The importance of sharing nuances of one's own problems and finding partners/inspiring others along the way is highlighted.\n    *   The fourth bullet point compares being famous to having a disease, stating that some people flock to you, dote on you, and proclaim they want nothing to do with you.\n        *   The idea that being famous can be a double-edged sword is explored.\n        *   The importance of being aware of how others perceive you is emphasized.\n    *   The fifth bullet point discusses the usefulness of comedy in poking fun at the human condition, generating awareness, and eliciting joy.\n        *   Comedy is described as the main reason the author is on social media.\n        *   The importance of comedy in bringing people together is highlighted.\n    *   The sixth bullet point emphasizes the importance of distinguishing oneself from one's \"stuff\" and being curious about oneself.\n        *   The idea that internal mechanisms are designed to keep one safe, but can also be based in fear and irrationality, is explored.\n        *   The importance of finding others who challenge one's view and being curious about oneself is emphasized.\n    \n    Overall, the image presents a collection of philosophical thoughts on various aspects of life, including self-awareness, relationships, art, fame, comedy, and personal growth.\n↓\n1671123609807364097 [2023-06-20] @michelleakin 💜 7\nontology, art, partnership, fame, comedy, coaching\n\ni supposed i could do a one sheet for each!\n\nthis was cool to help me figure out the different categories\n↓\n1671124164487311362 [2023-06-20] @michelleakin 💜 5\nalso i think it’s interesting that i didnt have a major point about “creativity”\n\ni used to bill myself as a coach for creatives\n\nim kind of off it as a topic. “creation” yes, but “creativity” has seemingly melded i to everything else for me\n\n===\n\n1671190801173426184 [2023-06-20] @zencephalon 💜 62 🔁 3 💬 2 [(SEED) type=quote_of_root]\nzen, explain “U” right fckn now, in one breath, standing on one foot https://t.co/4gerw88CVj https://t.co/kK6YJYtwke\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image depicts a man taking a selfie in a mirror, showcasing his yoga pose. The man is dressed in a green t-shirt and black pants, with one leg bent at the knee and foot resting on the inside of his other leg, while the other foot is bare on the ground.\n    \n    *   The man has long dark hair and is holding a phone in both hands to capture the selfie.\n    *   He is standing in front of a mirror, which reflects the room behind him.\n    *   The room features white walls, a gray carpet, and a window with a curtain on the left side.\n    *   On the wall behind the man, there are two shelves displaying various items, including a figurine, a bottle, and a plant.\n    *   The overall atmosphere of the image suggests that the man is practicing yoga or meditation in a peaceful environment.\n├── 1671191404226412547 [2023-06-20] @visakanv 💜 3\n│   @zencephalon love that\n├── 1671197520775507969 [2023-06-20] @michelleakin 💜 2\n│   @zencephalon omg I thought about doing this… I’m so glad that you did, I didn’t have the energy lol\n│   \n│   nice work!\n│   ↓\n│   1671197813491871747 [2023-06-20] @zencephalon 💜 4\n│   @MichelleAkin Honestly thought I could say a lot more in a single breath lol\n│   ↓\n│   1671197942382723072 [2023-06-20] @michelleakin 💜 2\n│   @zencephalon best laid plans 😆\n└── 1671329574800482304 [2023-06-21] @Malcolm_Ocean 💜 3\n    @zencephalon Holy shit this is actually great damn.\n    \n    U came up with this?\n    ↓\n    1671337321172545537 [2023-06-21] @zencephalon 💜 4\n    @Malcolm_Ocean I got semantic satiation on “you” while on acid and kept reading it as “yo-U” and then my brain broke and I couldn’t unsee U\n\n===\n\n1671878839528722434 [2023-06-22] @tasshinfogleman 💜 9 [(SEED) type=quote_of_root]\n@m_ashcroft would love to see you do this if you haven't already for *reasons* https://t.co/NyQFMKajwN\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1671919499736498187 [2023-06-22] @m_ashcroft 💜 8\n@tasshinfogleman i have reasons but they're terrible so i should just do it but ughhh\n├── 1671934473129332736 [2023-06-22] @RobertHaisfield 💜 3\n│   @m_ashcroft @tasshinfogleman Isn't your whole thing just articulating and rearticulating AT until you get something that resonates? This is just one more iteration.\n│   ↓\n│   1671934767221162027 [2023-06-22] @m_ashcroft 💜 6\n│   @RobertHaisfield @tasshinfogleman it is, but there are also some emotional tangles in the thing you’re pointing at\n│   ↓\n│   1671993015232270336 [2023-06-22] @RobertHaisfield 💜 1\n│   @m_ashcroft @tasshinfogleman Like what?\n└── 1671936758093877248 [2023-06-22] @visakanv 💜 3\n    @m_ashcroft @tasshinfogleman &gt; should\n    \n    no no only do it if u want to\n    ↓\n    1671940241563721728 [2023-06-22] @m_ashcroft 💜 2\n    @visakanv @tasshinfogleman i want to want to\n\n===\n\n1672766929759526912 [2023-06-25] @alcentian_one 💜 7 [(SEED) type=quote_of_root]\n🧶 tossing ideas for cultivating intimacy, scenius, and magic @ future gatherings \n\n1. intro event where everyone makes basic, physical outline of “their thing”\n\nbecomes handle of conversation &amp; connection, but more excitingly!! \n\n&gt;&gt;&gt;\n\nhttps://t.co/0IRVEkjst5 https://t.co/ctN4mugC4Y\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image shows a hand holding a piece of paper with handwritten notes, resting on a brown leather surface atop a white cushion. The paper contains a diagram and text related to \"the Algentian Obsidian-Forest system,\" including phrases such as \"Tree of Self,\" \"One disk revolution,\" \"Ultimate game,\" and \"Harmonize.\"\n↓\n1672766935069597699 [2023-06-25] @alcentian_one \n2. multiday challenge to co-create / weave a mosaic of us, using the “thing” of each attendee \n\nimagine  all the ways we can make this an epic, collaborative discovery game. \n\ncould frame some beautiful organic magic, and produce a collective record of hearts at the end\n↓\n1672766972071669761 [2023-06-25] @alcentian_one \nimagine something like this - the voyager golden record we sent to outer space, to communicate the essence of life on earth\n\nwhat would it look like to create one artifact that communicates the essence of life at vibecamp?\n\nhow could this artifact organize &amp; catalyze new efforts? https://t.co/yYR7wyUYl2\nImages:\n  - [Image #0] The image is a photograph of a computer screen displaying a search result for the Voyager Golden Record. The screen shows two gold records side by side, with the left record featuring various diagrams and symbols etched onto its surface, while the right record has a label that reads \"THE SOUNDS OF EARTH\" in the center. \n    \n    The text on the image is transcribed as follows:\n    \n    * \"THE SOUNDS OF EARTH\" (on the label of the right record)\n    \n    This description is concise and focused on the key elements of the image.\n↓\n1672766980447674369 [2023-06-25] @alcentian_one \nphysical gathering give us the opportunity to collectively make a physical artifact, and this is an opportunity we should not ignore\n\nhowever, that doesn’t exclude digital cooperation as well!\n↓\n1672766984755331073 [2023-06-25] @alcentian_one \n3. now, this ^^ event could be done in the moment just raw-dog - or it could be a more cumulative process, one that begins before / continues after the event\n\ni believe both will be valuable with different groups and scales!\n\nhowever, i want to extend an open offer 🦦🥏\n↓\n1672766990954496000 [2023-06-25] @alcentian_one 💜 2\nif you want to help facilitate intimacy &amp; scenius for the next vibecamp (or her babies!)\n\nim looking for a team of DMs\n- to weave a mythopoetic narrative realm \n- that unites the disparate stories of our individual lives into an evolving, magical tapestry…\n↓\n1672766998894264320 [2023-06-25] @alcentian_one 💜 1\nthe rest lies in our future discussions so if u curious hmu!! \n\nlets regenerate the world w the magic of us 💥🪨\n\n===\n\n1681335685058379777 [2023-07-18] @adam_kranz 💜 4\nThis clicked a big thing into place.\n\nGallformers has been hugely successful for me despite having no yearning for a long term goal because at any given moment I'm just solidifying all the little details and connections I'm making with other naturalists https://t.co/HVWxFbrG9C\n  [Quoting @visakanv: on solving for distribution:  people often think “first do work, then talk about it”. but the problem with that is that nobody might be interested in what you’re talking about   the more elegant solution is: have lots of conversations, then do work that fits in mid-conversation]\n↓\n1681335686505418756 [2023-07-18] @adam_kranz 💜 2\nWhereas the Semiotics writing I'm doing on substack is something that I do really *want* to spread but is based on no conversations so far. I am starting from a place of trying to pitch the conversations I'd like to have. Much harder\n↓\n1681363542992203783 [2023-07-18] @adam_kranz \nInteresting to juxtapose this insight with Visa's request for us to summarize our whole deal, or at least my reaction to that request. Striking how strong my impulse is to answer on the subject I am most self-conscious about making briefly explicable\n↓\n1681363706150633472 [2023-07-18] @adam_kranz  [(SEED) type=quote_of_root]\nLike it didn't even occur to me when I read this to talk about galls. But that's my big achievement and the thing I can talk most effortlessly about\n\nhttps://t.co/tpsbrLAvcP\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1681364604041953280 [2023-07-18] @adam_kranz \nI bet this isn't just me. Feels like a more general pattern: the things we talk about so much we don't need to promote them are too obvious to us to form part of our conscious identity (this is also why it's so hard to write eg dating profiles and bios)\n↓\n1681374729683255296 [2023-07-18] @adam_kranz \nA more honest \"summarize your deal\" for me would just be \"wasps are cool and beautiful, here are the different types of wasp I care about, here's what you should do about it\"\n\n===\n\n1692773832908513518 [2023-08-19] @adam_kranz 💜 1 [(SEED) type=quote_of_root]\nI've been put on the spot about semiotics like this 3 times since this challenge and whiffed it 2/3 times. Would that have gone better if I just did the challenge when it was issued? https://t.co/Q1RCVFZVwl\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1692775202009256162 [2023-08-19] @visakanv 💜 1\n@adam_kranz 2/3 is a good ratio. Whiff it 67/100 times and use the 33 non-whiffs to build a better answer\n↓\n1692775492372308379 [2023-08-19] @adam_kranz 💜 1\n@visakanv the 1 time it went well definitely put some wind in my sails\n\n===\n\n1695434722933961033 [2023-08-26] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\n@visakanv did you make your compilation thread yet?\n\n(if not free alpha for someone else who does it) https://t.co/ynnPXzWWuH\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1695496077515124796 [2023-08-26] @visakanv 💜 1\n@Malcolm_Ocean ha still haven't yet\n↓\n1695529595296989670 [2023-08-26] @Malcolm_Ocean \n@visakanv but for some reason you figure it should be you who does it, not someone else? (based on you not publicly proposing someone do it)\n\ndo you think that's actually realistic and you'll get to it randomly some months from now, or more wishful thinking?\n\n===\n\n1699161205695566088 [2023-09-05] @lemonaut1 💜 6\nThere's something really effective about asking the tpot kind of person (don't have better label) to explain what they are deeply passionate about seeing in the worldGreen flag generator 🇳🇬 https://t.co/DcHLMrcOY1\n  [Quoting @forthrighter: @visakanv this tweet is a green flag generator; going through the QTs of this and adding follows left &amp; right]\n↓\n1699161398616695059 [2023-09-05] @lemonaut1 💜 2 [(SEED) type=quote_of_root]\nSee the comments and QTs of this tweet (dunno if visa has properly threaded this yet)https://t.co/VJGXPhUrGF\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1699162351188988160 [2023-09-05] @forthrighter 💜 2\n@lemonaut1 abstracting out what Visa was doing there, which works for all sorts of people, not just the tpot-esque:\n\n\"Present a charitable question/challenge that encourages each person to shine in the way they prefer\"\n\nyah people love to do that and it's good for spawning useful discourse\n↓\n1699162662503108807 [2023-09-05] @forthrighter 💜 2\n@lemonaut1 the cursed evil twin of Visa's prompt would be smth like, \"What's wrong with your life and who is to blame?\"\n\n- no way to shine\n- focus on negative griping\n- set up to generate soul-sapping discourse\n\n(please nobody ask this)\n\n===\n\n1699170862258106422 [2023-09-05] @neats29 💜 5\nI want to follow some fun new accounts (new to me), I’m scared of asking for suggestions because then I might feel obligated to follow but also I need to spice up my timeline. is there a list somewhere? or you can secretly tell me. looking for wholesome, playful and insightful.\n↓\n1699171413536464925 [2023-09-05] @forthrighter 💜 1 [(SEED) type=quote_of_root]\n@neats29 different thread we were discussing recently \"green flag generator threads\".  Take a look at the QTs on this one as an example of what I mean\n\nhttps://t.co/h7PfNg5NAi\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n├── 1699171812926468255 [2023-09-05] @forthrighter 💜 1\n│   @neats29 asking people to advertise about \"their thing\" or giving them an imaginative prompt and actively soliciting them to take it to wherever they want has been (imo) a great technique for account discovery\n│   \n│   \"Let your freak flag fly and see who turns up at the pole to salute\"\n│   ↓\n│   1699171875048378410 [2023-09-05] @forthrighter 💜 1\n│   @neats29 we just gotta create the right woodworks for them to come out of, so to speak\n│   ↓\n│   1699172080439156913 [2023-09-05] @forthrighter 💜 1\n│   @neats29 bonus: you get a wide selection of weird, spicy, and innovative accounts and you get to anonymously browse, no obligation to follow MY faves\n└── 1699172618069324207 [2023-09-05] @neats29 💜 3\n    @forthrighter Oh yeah that’s a great one, I’ve been meaning to do a QT to that myself, have a roam document somewhere\n    ↓\n    1699181306083418260 [2023-09-05] @michelleakin 💜 2\n    @neats29 @forthrighter DOOO IIIIIIT\n    ↓\n    1699188649458364786 [2023-09-05] @neats29 💜 2\n    @MichelleAkin @forthrighter have you done it??\n    ↓\n    1699190378836996193 [2023-09-05] @michelleakin 💜 3\n    @neats29 @forthrighter yes’m ☺️ https://t.co/hCzJnInqKk\n      [Quoting @michelleakin: “Michelle, explain what you’re about right fckn now, in one breath, standing on one foot\" https://t.co/DXX5XF6B4s https://t.co/HUY7fEu0FI]\n    ↓\n    1699193258776187251 [2023-09-05] @neats29 💜 2\n    @MichelleAkin @forthrighter sweet! had a quick look through it but gonna read it properly first thing in the morning, exciting!\n    ↓\n    1699195103720460507 [2023-09-05] @michelleakin 💜 1\n    @neats29 @forthrighter weeeeeeee!\n\n===\n\n1699201199462117773 [2023-09-05] @danallison 💜 4 [(SEED) type=quote_of_root]\n“Dan, explain what makes approval voting so special right fckn now, in one breath, standing on one foot” https://t.co/T3Hl67mt0c https://t.co/TwFoe37Hpu\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image is a text-based graphic that discusses the concept of \"Making Wise Tradeoffs\" in the context of voting systems, specifically approval voting. \n    \n    The text explains that the word \"decide\" has etymological roots that mean \"to cut off\" or \"to kill the alternative,\" implying that decisions inherently involve tradeoffs. It highlights an objection to approval voting, which is that it does not capture the order of each voter's preferences like rank-choice voting does. However, the text argues that this apparent flaw is actually a strength because it solves the \"tyranny of the majority\" problem by allowing voters to add information about which tradeoffs they are willing to make.\n    \n    The text also draws a comparison to the Monty Hall problem, where relevant information is added via implicit omission rather than explicit inclusion. The background of the image is white, and the text is presented in black font.\n    \n    **Text Transcription:**\n    \n    **Making Wise Tradeoffs**\n    \n    The word \"decide\" has etymological roots that mean something like \"to cut off\" or \"to kill the alternative.\" By their nature, decisions inherently involve tradeoffs. You can't have your cake and eat it too. By choosing one option, you lose the other.\n    \n    By necessity, **making wise decisions means making wise tradeoffs.**\n    \n    One common objection to approval voting is that it does not capture the order of each voter's preferences the same way that a method like rank-choice voting does. With approval voting, a voter's first choice receives the same weight as their second choice, which initially feels wrong.\n    \n    At first glance, this seems like a flaw of approval voting. But if you look closer, you will see that it is actually approval voting's greatest strength because it solves the \"tyranny of the majority\" problem. How can this be? The answer follows from the necessity of tradeoffs.\n    \n    The counterintuitive insight is this: **by omitting information about the weightings of their preferences, voters are actually adding information about which tradeoffs they are willing to make.**\n    \n    The counterintuitiveness of this fact is similar to that of the **Monty Hall problem**. In both cases, relevant information is added via implicit omission rather than explicit inclusion.\n↓\n1699204164402966910 [2023-09-05] @lemonaut1 💜 1\n@danallison This is great yet I dont understand how omitting weightings of preferences results in a higher fidelity encoding of your preferences\n↓\n1699208319276351826 [2023-09-05] @danallison 💜 2\n@lemonaut1 It can be easier to think of it as negation. Instead of maximizing satisfaction, approval voting minimizes dissatisfaction. You’re (potentially) less likely to get your first choice but more likely to get a choice you’re satisfied with. Images from the same blog post: https://t.co/gZpMvAXhWy\nImages:\n  - [Image #0] The image is a text passage that discusses the concept of approval voting and its application to a hypothetical scenario. The passage is divided into several paragraphs, each addressing a different aspect of the topic.\n    \n    *   The first paragraph introduces the scenario, describing a group of three people deciding where to eat for lunch. Two members are carnivores who always eat meat, and one is a vegan who never eats meat.\n        *   The three restaurants being considered are:\n            1.  A BBQ place with no vegan options (the carnivores' first choice)\n            2.  A vegan diner with no meat options (the vegan's first choice)\n            3.  A sandwich shop with both meat and vegan options (everyone's second choice)\n    *   The second paragraph explains that the common sense decision would be to go to the restaurant that has options for everyone: the sandwich shop. This is because approval voting converges on this outcome.\n    *   The third paragraph notes that most other voting methods, including rank-choice voting, surprisingly converge on the BBQ place because the carnivores are a majority, creating a rivalrous dynamic between these sub-groups. This failure mode is often referred to as the \"tyranny of the majority.\"\n    *   The fourth paragraph states that approval voting avoids this pitfall by optimizing for overall group satisfaction rather than majority rule.\n    \n    In summary, the image presents a clear and concise explanation of how approval voting can lead to a more satisfactory outcome for a group, as opposed to other voting methods that may result in the \"tyranny of the majority.\"\n↓\n1699211783687623064 [2023-09-06] @danallison 💜 2\n@lemonaut1 An analogy might be luggage on an airplane. People with heavy luggage (strong preferences) decrease the total number of passengers who can board. When you limit how much luggage a person can bring, you increase the total number of passengers who can board.\n↓\n1699214233425371366 [2023-09-06] @danallison 💜 2\n@lemonaut1 Putting a limit on how much luggage a person can bring forces people to be honest about what’s most important to them. In that sense they are adding information about their true preferences.\n↓\n1699332641441603737 [2023-09-06] @lemonaut1 💜 1\n@danallison I'm enjoying this explanation. It does sound similar to quadratic voting to me (something I got excited about several years ago and haven't heard about since)\n\n===\n\n1729961912371188090 [2023-11-29] @strangestloop 💜 1 [(SEED) type=semantic_search]\n@univrsw3th4rt soon hehe\nhttps://t.co/1wlmJvhNC1\n  [Quoting @strangestloop: @univrsw3th4rt @cosmos_raj your @threadapalooza challenge will be to tweet only 100 times in one day]\n↓\n1730000555974476213 [2023-11-29] @univrsw3th4rt \n@strangestloop omg i must have missed the original reply bc i had no idea threadapalooza was a thing til the other day\n\n===\n\n1730340741061251486 [2023-11-30] @univrsw3th4rt 💜 1003 🔁 16 💬 1\ni *love* when i find a lurker who follows all the tpot major characters. like oh ur not just ur average lurker…ur an advanced lurker…a sleeper agent who could step into poasterdom with the right tweet prompt at any moment…i’m rooting for u guys so hard\n↓\n1730341322861506955 [2023-11-30] @univrsw3th4rt 💜 159\ni also love to *tweet* about lurkers and lurking bc sometimes it brings them out of their lurkerdom even just for a shy little handwave like hey! that’s me! it’s a real lesson in meeting ppl where they’re at and also appreciating their part in the community\n↓\n1730342163538386950 [2023-11-30] @univrsw3th4rt 💜 78\nif u don’t believe me, consider that the above tweets described me until march of this year https://t.co/usyIeaFYkb\n  [Quoting @univrsw3th4rt: hi everyone &lt;3 i am:• longtime lurker • starting fresh • excited to meet new friends!feel free to introduce urself~]\n↓\n1730344484909584761 [2023-11-30] @univrsw3th4rt 💜 54 💬 1 [(SEED) type=semantic_search]\nnow that i’ve got u all right where i want u…i challenge you to tweet 100 times in the next week (or take the univrsw3th4rt advanced track and tweet 100 times in the day) https://t.co/w0ngB2bI8G\nImages:\n  - [Image #0] The image is a screenshot of Patrick Star from the animated TV show \"SpongeBob SquarePants.\" The character is depicted with a sly and mischievous grin, his hands clasped together in front of him, and a confident expression on his face.\n├── 1730344834194436386 [2023-11-30] @univrsw3th4rt 💜 24\n│   *in the next day\n│   ↓\n│   1730415352243212504 [2023-12-01] @univrsw3th4rt 💜 19\n│   https://t.co/EiBXHxel8E\n│     [Quoting @univrsw3th4rt: u tweeting once a month vs me tweeting 100 times a day https://t.co/TKanhDgHSC https://t.co/z26pMNMlX0]\n│   ↓\n│   1730803648756617489 [2023-12-02] @easoncxz \n│   @univrsw3th4rt Did Twitter write this tweet? 😂\n├── 1730356417301778464 [2023-11-30] @hrosspet 💜 2\n│   @univrsw3th4rt write another chapter to my new book or wrote 100 tweets...? 🤔\n│   ↓\n│   1730655107337879839 [2023-12-01] @univrsw3th4rt \n│   @hrosspet BOTH!!!! https://t.co/OpeVAik947\n│   Images:\n│     - [Image #0] The image is a still of a young girl with a displeased expression. She has dark hair and is wearing a white shirt, sitting in front of a table with potted plants behind her to the left.\n├── 1730376171324674074 [2023-12-01] @_ceee_ 💜 1\n│   @univrsw3th4rt I already did 130 tweets in the last 7 days so I'm entering the advanced track tomorrow\n│   ↓\n│   1730654645544968490 [2023-12-01] @univrsw3th4rt 💜 1\n│   @Ceeeeeres LET’S GOOOOOOOO\n└── 1730401225987010735 [2023-12-01] @rslantonie 💜 2\n    @univrsw3th4rt tfw threadapalooza starts tomorrow https://t.co/YuXr15lNGd\n    Images:\n      - [Image #0] The image depicts SpongeBob SquarePants standing in front of a bathroom counter, looking surprised and concerned. The scene is set in a bathroom with green walls and a blue door, featuring various soap dispensers on the counter behind him.\n    ↓\n    1730654609897615844 [2023-12-01] @univrsw3th4rt \n    @russlramos omg good point!!!!!\n\n===\n\n1730632854386716723 [2023-12-01] @strangestloop 💜 9 [(SEED) type=semantic_search]\nWhat would be The [your handle] Challenge?\n↓\n1730633812214731254 [2023-12-01] @__drewface 💜 3\n@strangestloop host a standing dinner party every week for 1 year\n\n===\n\n1730794062905782605 [2023-12-02] @_ceee_ 💜 3 [(SEED) type=quote_of_semantic_search]\nI COMPLETED THE 100 TWEET CHALLENGE. im going to go play baldurs gate all night now, that was quite the experience https://t.co/BvYtVNe2Ix\n  [Quoting @univrsw3th4rt: now that i’ve got u all right where i want u…i challenge you to tweet 100 times in the next week (or take the univrsw3th4rt advanced track and tweet 100 times in the day) https://t.co/w0ngB2bI8G]\n├── 1730795100564058448 [2023-12-02] @_ceee_ 💜 1\n│   INFINITE ENGAGEMENT RATE LFG https://t.co/pAMB1ZqGIN\n│   Images:\n│     - [Image #0] The image is a screenshot of a conversation between the user and ChatGPT, displaying Twitter analytics.\n│       \n│       The image shows a dark gray background with white text. At the top left, a blue circle with a white \"i\" is labeled \"You\". Below this, a gray box contains a green spreadsheet icon and the text \"tweet_activity_metrics_Ceeeeeres_202... Spreadsheet\" followed by \"show me some assorted analytics about this\".\n│       \n│       Below this, a purple circle with \"ChatGPT\" is displayed. The response from ChatGPT is: \"Here are some assorted analytics from the provided Twitter data:\" followed by a list of bullet points:\n│       * Total Tweets: 99\n│       * Total Impressions: 1,832\n│       * Total Engagements: 202\n│       * Average Engagement Rate: The calculation resulted in an infinite value, indicating a possible issue with the data or its interpretation.\n│       * Total Retweets: 1\n│       * Total Replies: 53\n│       * Total Likes: 95\n│       * Total User Profile Clicks: 9\n│       * Total URL Clicks: 0\n│       * Total Hashtag Clicks: 0\n│   ↓\n│   1730796446998491275 [2023-12-02] @_ceee_ 💜 1\n│   chatgpt making charts is so fun https://t.co/yZi3DXQR4h\n│   Images:\n│     - [Image #0] The image shows a line graph titled \"Cumulative Tweets and Likes Over Time by Minute (Mountain Time)\".\n│       \n│       To reproduce the graph, start by creating a white background with a grid pattern. The x-axis is labeled \"Minute\" and ranges from 12-01 10 to 12-01 21, with increments of one minute. The y-axis is labeled \"Cumulative Count\" and ranges from 0 to 100.\n│       \n│       Plot two lines on the graph: a blue line representing \"Cumulative Tweets\" and a red line representing \"Cumulative Likes\". The blue line starts at around 0 at 12-01 10, remains steady until 12-01 11:30, then increases to around 10 by 12-01 12. It continues to rise in a step-like pattern, reaching 95 by 12-01 20:30.\n│       \n│       The red line begins at 0 at 12-01 10:30, jumps to 5 by 12-01 11, and then follows a similar step-like pattern as the blue line, reaching 90 by 12-01 19. \n│       \n│       Both lines are mostly parallel, with the red line generally above the blue line until 12-01 20, when the blue line surpasses it. \n│       \n│       The legend in the top-left corner indicates that blue represents \"Cumulative Tweets\" and red represents \"Cumulative Likes\".\n└── 1730798817925038150 [2023-12-02] @univrsw3th4rt 💜 1\n    @Ceeeeeres LFGGGGGGG HOW WAS IT https://t.co/YhQXQVZ5IU\n    Images:\n      - [Image #0] The image shows a deer speaking into a microphone. The microphone is being held up to the deer's mouth, and it has a pink circle with a white number 3 on it.\n    ↓\n    1730799754853167135 [2023-12-02] @_ceee_ \n    @univrsw3th4rt I got to post things that I had been thinking of posting for a while, I posted a fun little voice tweet, made a funny ding, drank tons of coffee, and the last 30 or so got pretty abstract.8/10 fun experience but its not going to happen again\n\n===\n\n1737936137258193306 [2023-12-21] @univrsw3th4rt 💜 10 [(SEED) type=quote_of_semantic_search]\nwell? who’s got updates https://t.co/L893QQQNFy https://t.co/h6KbqBZiit\n  [Quoting @univrsw3th4rt: now that i’ve got u all right where i want u…i challenge you to tweet 100 times in the next week (or take the univrsw3th4rt advanced track and tweet 100 times in the day) https://t.co/w0ngB2bI8G]\nImages:\n  - [Image #0] The image shows a woman sitting on a couch, wearing a teal strapless top and a black hair bonnet with pink flowers. The background features a living room with a staircase, fireplace, and television.\n↓\n1737940310146355264 [2023-12-21] @univrsw3th4rt 💜 1\nif only u guys knew the lengths i had to go to to find this gif\n\n===\n\n1748045150977155323 [2024-01-18] @__drewface 💜 19\n2022 Andrew was awesome + inspiring + adventurous, no notes\n\n2023 Andrew was struggling and needed help, but did a lot to make the best of a hard year, that guy is awesome, I wouldn't be here without him\n\n2024 Andrew remains to be met, but, guys, the omens are good.\n↓\n1748046195090481158 [2024-01-18] @__drewface 💜 3 [(SEED) type=quote_of_semantic_search]\narchetypal 2022 andrew tweet:\n\nhttps://t.co/d38nfXSgQ2\n  [Quoting @__drewface: 30 day \"ask for what you want\" challenge:  simply ask for one thing from the TL every day for the next 30 days  together we will be unstoppable]\n↓\n1748046314447786001 [2024-01-18] @__drewface 💜 3\nanother classic 2022 tweet, i was out here building the social commons:\n\nhttps://t.co/xRZSepJSbW\n  [Quoting @__drewface: If you're in NYC and would like to randomly be invited to things on a Saturday night, please let me know!  I'll start: I would like to randomly be invited to things on a Saturday night, especially if they're small, simple, easy, quiet.]\n↓\n1748046525471850989 [2024-01-18] @__drewface 💜 2\nmore 2022: literally at one point was like \"i'll always be friendly and helpful\", that was very sweet haha\n\nhttps://t.co/9EOZXy0mcQ\n  [Quoting @__drewface: consider me a 'default friend'  feeling lonely? want to go on a walk or grab coffee with someone? need a co-working partner? want to play board games? need to rant? need a couch to crash on?  i can't promise much, but I can promise to be friendly and helpful 😊]\n↓\n1748046889541414937 [2024-01-18] @__drewface 💜 4\narchetypal 2023 tweet:\n\nmore angsty, more existential, more spiritual\nhttps://t.co/pS7BsFZ8yk\n  [Quoting @__drewface: man... if i could just leave people with one lasting impression it's like...  if there's only one damn thing to do on this Earth before you die it is to make a Home for your friends.  we have all this fucking wealth and most of us are totally without Home. im gonna cry. https://t.co/v2DijGxMHs]\n↓\n1748047388156018929 [2024-01-18] @__drewface 💜 4\ni was a bit preachier in 2023, more externalizing, less internalizing, less *offering* and *gifting* like in 2022:\n\nhttps://t.co/IiIVLrtIHs\n  [Quoting @__drewface: okay but imagine if you wrote down:  1) everything you want in life 2) how other people can help you get it 3) why they want to help you get it  some crazy stuff might happen, idk 🤷‍♂️]\n↓\n1748048058179305635 [2024-01-18] @__drewface 💜 4\nin 2023, i was also beginning to grapple with some of the problems of a growing audience, and I think I let that get to me:\n\nhttps://t.co/cbdEb2uBAK\n  [Quoting @__drewface: as i do more work in public, i'm experiencing increasingly deranged interactions w/ strangers  people expecting things from me, making up slights that I caused, implying I look down on them when I don't know them (??)  I want to talk about this publicly, because it seems like everyone who does public work will face this sooner or later -- but I imagine there's a good reason other ppl who do public work don't really talk about it? why?  one reason I don't want to is because it feels like complaining, but that's a rather self-centered reason not to talk. Perhaps it invites more bad behavior? But that feels unfounded.]\n↓\n1748048638343802941 [2024-01-18] @__drewface 💜 2\nat the same time, 2023 was the year we launched Fractal University, which has consistently been one of my favorite things ever\n\nI was clearly keeping my head down, trying to power through, trying to do what was right, even if things didn't feel right 🥲\n\nhttps://t.co/VIbSnsyvCU\n  [Quoting @__drewface: I’m excited to announce a new community experiment: \"Fractal University\".  An in-person school community dedicated to completing (and teaching!) the best online courses in the world and publishing our notes.  Our first semester starts on September 5, and you can apply now. (1/7) https://t.co/YY2WXdHi9S]\n↓\n1748049116909699368 [2024-01-18] @__drewface 💜 4\n2023 was the year we gave our first conference talk, in front of 1000 people, and they liked it!!\n\nyou can see even in this celebration post that I was battling the negative in my life, trying to keep my focus on what was good, in spite of fear + doubt\n\nhttps://t.co/vMq7pNupFN\n  [Quoting @__drewface: i was extremely nervous to read the youtube live stream comments on our network state conference talk. live stream comments can be brutal  but look... 🥹 https://t.co/viV12s8Ovu]\n↓\n1748049597195325879 [2024-01-18] @__drewface 💜 4\nPartially all that existential angsty-ness is also because 2023 is the year we got \"cancelled\"\n\nIt transformed my life from a fun adventure that didn't need justification into a \"serious\" \"project\" that needed to be defended against attacks.\n\nhttps://t.co/hUSAaH0VDb\n  [Quoting @__drewface: ok but how is a story of 22 friends living in a building together going so viral? you couldn't wait for us to get to 3 digits?  i don't want to disregard our own project, but... 22? there were 15,000 kids in my class at ASU! 22 is basically just an avg midwestern family]\n↓\n1748050710782968205 [2024-01-18] @__drewface 💜 4\nMore of a window into the pain + frustration I was feeling there, in August 2023 (when we got smeared for the second time), I felt the need to publish an itemized list of 21 ways to design a community toward liberalism and away from cultiness\n\nhttps://t.co/hCf31L6kJD\n↓\n1748052348771991962 [2024-01-18] @__drewface 💜 3\n2023 was also the year I recovered my relationship to coding, because of @liamdanielduffy's friendship.\n\nIn 2021-22 I burnt out starting a startup that would eventually fail. I never wanted to code again.\n\nBut I had fun coding again, when it was with him.\n\nhttps://t.co/ezXMLacwi9\n  [Quoting @__drewface: playing around with a Zen Mode for Bluesky:  - 1 post at a time - just the text - you can drag the posts around your workspace to connect ideas (soon) - you can like and reply, but you see no social context, just the raw text (soon) https://t.co/YkwTnIAIDl]\n\n===\n\n1750451126359503267 [2024-01-25] @nosilverv 💜 191 🔁 10 💬 2 [(SEED) type=quote_of_root]\nTook me long enough but there's only two things I've always been trying to say. (2) is a subset of (1), really, but I don't yet know how to say precisely how. https://t.co/6RDD6jR042\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image presents a text passage discussing the relationship between hyperreality and people's understanding of language. The passage is divided into two main points, numbered 1 and 2, which are presented in black text on a white background.\n    \n    1 - There's a shared interest in having people live in hyperreality. This is what your 10k hours at school made you an expert in. This is why people, generally, can't think nor do things: their concepts don't dereference: they're all signifiers pointing to further signifiers. This is also why people's skills EXPLODE once they unlearn how to not see. This is also also why you get gas stove discourse, palestine flag emojis, etc.: floating signifiers make it so that anything can be shoved inside them and thus allow both capital AND political identity to circulate FAST.\n    \n    2 - People have a folk theory of language. This theory is mistaken in many ways and these mistakes get arbitraged/weaponised against them.\n    \n    The passage appears to be a screenshot of a social media post or a note, given its informal tone and the presence of a tweet context at the top.\n├── 1750451128808907072 [2024-01-25] @nosilverv 💜 21\n│   I bet you guys are shocked by my brevity, lol!\n│   ↓\n│   1751885080790761552 [2024-01-29] @nosilverv 💜 14\n│   Another way of saying 2:\n│   \n│   \"Mistakes are generative not just subtractive (pieta bc of Greek statues lost color)\n│   Mistaking language for camera is omnipresent\n│   This mistake allows it to be used like engine\"\n│   ↓\n│   1752074308564762878 [2024-01-29] @nosilverv 💜 6\n│   read this and above. this is why in the glossary i talk about rectification of names\n│   \n│   https://t.co/nDaoz2YLqM\n│     [Quoting Tweet 1752073724411445615 (missing)]\n│   ↓\n│   1752274300730503426 [2024-01-30] @nosilverv 💜 5\n│   Another way of saying 3: \n│   \n│   https://t.co/TTLutCsG0s\n│     [Quoting @nosilverv: All my project is naming and calling out dark magicians bs, trying to make it opaque instead of transparent https://t.co/dZG1kHXZTV https://t.co/7Pn7TuKXYV]\n├── 1750452419782422753 [2024-01-25] @JustAnkurBagchi 💜 3\n│   @nosilverv What is the folk theory of language?\n│   ↓\n│   1750454466178920606 [2024-01-25] @nosilverv 💜 24 💬 1\n│   It's a theory of what language is and how it works. It is composed by many sub-theses. Namely:\n│   \n│   Nominalist Realism \n│   There are no empty signifiers i.e. for every name there must correspond an object i.e. for every name there must correspond a being \n│   \n│   Language, as such, doesn’t exist\n│   Transparency of language. Therefore what is talked about is not language but the things in themselves.\n│   \n│   Ambiguity doesn’t exist.\n│   For every name there must correspond ONE object \n│   \n│   Knowing name = knowing thing\n│   \n│   Knowing = knowing about\n│   \n│   Dereferencing doesn’t exist (i.e. it’s trivial/automatic)\n│   \n│   Everything that can be expressed can be done\n│   \n│   Language is \"natural\", like mountains, it just happens.\n│    \n│   Language shows (doesn’t hide)\n│   \n│   Language coordinates (doesn’t sabotage)\n│   \n│   Language is given (not created)\n│   ↓\n│   1750467759417495963 [2024-01-25] @JustAnkurBagchi 💜 1\n│   @nosilverv Ahh, thank you. What do you see as the biggest error in this theory?\n│   ↓\n│   1750476399998111774 [2024-01-25] @nosilverv 💜 6\n│   @JustAnkurBagchi Hmmm probably making language itself transparent is upstream of all others\n├── 1750467568496771327 [2024-01-25] @alex_with_ease 💜 2\n│   @nosilverv You probably already know it, but this sounds like the simulacra stuff @AbstractFairy is talking about\n│   \n│   https://t.co/Nun5OL5tpE\n│     [Quoting Tweet 1742588496676548861 (missing)]\n├── 1750470301253792222 [2024-01-25] @jd_pressman 💜 7\n│   @nosilverv This is an interesting take but I'm pretty sure schools are daycare with a thin pretext and the hyperreality aspect is just simulacra becoming very cheap and displacing materialism. Path of least resistance, no conspiracy necessary.\n│   https://t.co/M239mfO9YF\n│     [Quoting @jd_pressman: I think people tend to overthink American decline. It shouldn't be mysterious why a colonial empire of materialist geniuses that's run out of land and had its materialism displaced by low cost entertainment is in decline. AGI is merely the final unlock in the simulacra tech tree. https://t.co/HstVAGC2tl]\n├── 1750475071557079169 [2024-01-25] @theobromananda 💜 1\n│   @nosilverv Folk theories of everything (psychology, the world, society, science, religion) are a bane\n├── 1750510612835369113 [2024-01-25] @tasshinfogleman 💜 7\n│   @nosilverv there's enough material there for an entire podcast conversation, etc\n│   ↓\n│   1750549867439460692 [2024-01-25] @nosilverv 💜 4\n│   @tasshinfogleman Literally one or two theses looool\n│   ↓\n│   1750549988570984778 [2024-01-25] @nosilverv 💜 3\n│   @tasshinfogleman I would love to have my brain picked on these\n├── 1750536882147008656 [2024-01-25] @cosmictealatte \n│   @nosilverv https://t.co/L1OIbrKvB2 https://t.co/hODgpujwCO\n│   Images:\n│     - [Image #0] The image shows a screenshot of a ChatGPT conversation on a mobile device, discussing Lacan's theory and hyperreality. The text is transcribed as follows:\n│       \n│       1. Hyperreality and the Symbolic Order: Lacan's theory of the symbolic order aligns with the concept of hyperreality. The symbolic order is a network of language and social conventions that governs how we perceive and interact with the world. In this context, hyperreality refers to an inability to distinguish between reality and a simulation of reality, often perpetuated by media and technology. The tweet suggests that education (10k hours at school) immerses individuals deeply into this symbolic order, to the point where they struggle to engage with the 'real' outside of these constructs.\n│       \n│       2. Signifiers and Dereferencing: Lacan emphasized the importance of signifiers in the construction of meaning. A signifier is a word or symbol that represents something, but in Lacanian theory, the connection between signifier (word/symbol) and signified (the thing it represents) is not... \n│       \n│       The screenshot shows a partial conversation, with the text cut off at the bottom, indicating that there is more content available.\n├── 1750563553398948340 [2024-01-25] @RichDecibels 💜 12\n│   @nosilverv tapping the sign\n│   \n│   https://t.co/jVFN7FY8LZ\n│     [Quoting @RichDecibels: mfs really be out here thinking they know a thing because they know the word for the thing]\n│   ↓\n│   1750567590903034317 [2024-01-25] @nosilverv 💜 3\n│   @RichDecibels good sign\n├── 1750586209158435046 [2024-01-25] @hrosspet 💜 1\n│   @nosilverv this is the core of a book I'm writingfixing this problem is imo what spiritual path is all about..\n│   ↓\n│   1750587418577879536 [2024-01-25] @hrosspet 💜 1\n│   @nosilverv \"the world doesn't make sense\"\"life is meaningless\"\"I don't know what I want\"\"I know what I want, but whenever I get it it's not what I expected it to be\"\"I feel so lonely, disconnected\"...all downstream of this\n└── 1751528232262709672 [2024-01-28] @nosilverv 💜 2\n    same thing, different stab: https://t.co/EhIgTv1oMz\n      [Quoting @nosilverv: Imo this is all correct but it understates the point: as shown in Luria’s White Bears induction into the elite is done through a point deer make horse honest signal via sacrifice of actual cognition (\"street smarts\") for artificial cognition (\"book smarts\"). This is what school trains you in:]\n\n===\n\n1805619399388172418 [2024-06-25] @yoltartar 💜 79 🔁 3 💬 1\nsome people use their spiritual tools just to git gud at following society's cursed mandates: fitter, happier, more productive...\n\nbut the project i want to see more of is like the opposite of that: rewilding\n🧵 https://t.co/ugi7f52dT4\nImages:\n  - [Image #0] The image depicts a purple vacuum cleaner situated in a lush green environment, surrounded by low-growing plants and weeds. The vacuum is positioned centrally, with its body facing the camera and its handle pointing to the right. The device features a large, round opening at the top, accompanied by a smaller circular opening on the front. A black hose is attached to the left side of the vacuum, while the handle on the right appears to be made of a textured black material. The vacuum's purple body exhibits signs of wear, with visible scratches and fading. The surrounding foliage is dense, with small, round leaves covering the ground around the vacuum. In the background, a stone wall is visible, constructed from large rocks and boulders.\n↓\n1805619402483667312 [2024-06-25] @yoltartar 💜 34 🔁 2\n\"I do not think that any civilization can be called complete until it has progressed from sophistication to unsophistication, and made a conscious return to simplicity of thinking and living.\"\n—Lin Yutang\n\nnot retvrn, but a purposeful embrace of what's simple, natural, and whole\n↓\n1805619406921228473 [2024-06-25] @yoltartar 💜 28 🔁 1 💬 1\nmy friend @not_a_hot_girl is rewilding art, music, and dance by figuring out how to deprogram the poisoned teachings of \"be good\" and \"be the best\", dancehole is an emerging ritual to cast out these demons\n\nhow can we unleash the ugly beauties inside us?\nhttps://t.co/tnLd1GhjUM\n  [Quoting @maebichka: i WILL  be an outsider artist.....uninstalling the Photography and Cartoon and Anime and Western Art and Eastern Art and African Art modules from my brain recesses......its all wortj it, i will be  aloneand glorious https://t.co/6J8WfuN674]\n↓\n1805619411794989330 [2024-06-25] @yoltartar 💜 29 🔁 2 💬 1\nmy friend @simon_ohler is rewilding life and work by spreading the wisdom he gathered taking a 5-year sabbatical and studying taoism\n\nhow can our lives take on the nourishing order of a village rather than the extractive order of a city, factory, or mine?\nhttps://t.co/JwHL7ZaI84\n  [Quoting Tweet 1786539917310353815 (missing)]\n↓\n1805619416798732624 [2024-06-25] @yoltartar 💜 33 🔁 1\nmy friend @triciapickren is rewilding healing by teaching and practicing an extremely receptive and yin form of energy work\n\nhow can we let go of our desire to *make* healing happen so that healing can have the space and safety to happen on its own?\nhttps://t.co/h0X7tmTkhw\n  [Quoting Tweet 1784773074983784488 (missing)]\n↓\n1805619421685113014 [2024-06-25] @yoltartar 💜 25 🔁 1\nmy friend @gospelofchange is rewilding collaboration by teaching Liberating Structures and rewilding Amsterdam by planting seeds\n\ncan we release the delusion of top-down control and tap into the wisdom in every single one of us?\n\nwe can't afford not to\nhttps://t.co/qSZ3XzPeHN\n  [Quoting Tweet 1772323746612711490 (missing)]\n↓\n1805619427079037221 [2024-06-25] @yoltartar 💜 25\nand ofc my gf @innerpathing and i are pursuing this in our life together, building a home that's nourishing and integrated with the natural world around us\n\ni hope someday we can share our nest with others who need this kind of healing\nhttps://t.co/qdiNOJ0j2r\n  [Quoting Tweet 1790486092858511649 (missing)]\n↓\n1805619431915028782 [2024-06-25] @yoltartar 💜 30\ni want to pay attention to more of this, who else is on the path of rewilding?\n↓\n1805628817693679984 [2024-06-25] @Rusty_Swarf 💜 2 [(SEED) type=semantic_search]\n@yoltartar \"Explain what you're rewilding, right fkin now, in one breath, standing on one foot, 1-page screenshot challenge!\"\n\n===\n\n1809479665075339271 [2024-07-06] @lemonaut1 \nfor some rzn it guided me to make this playlist, with the album at the start, and then select songs from this minimalist electronic album afterwards called Remixselection One. and then it looks like I added a couple snazzy Saint Dymphna shoegaze songs afterwards. https://t.co/KF2KEVQDxr\n  [Quoting @lemonaut1: ScHoolboy Q's Blue Lips album sounds almost AI-generated. https://t.co/XGzqtRFuu8]\n↓\n1809479666388070494 [2024-07-06] @lemonaut1 \ni don't know why the Blue Lips album makes me feel this liminal way, it just does. that's part of what makes it so awe-inspiring; it's salient because of just how jarringly non-salient it is for being well-formed music. it sounds so adjacently popular and yet... i don't know.\n↓\n1809480264843948517 [2024-07-06] @lemonaut1 💜 1\ni feel like playlists are currency of the modern era but we haven't figured out the right UI for them at all. so nobody knows how to use them yet\n↓\n1809480287409303914 [2024-07-06] @lemonaut1 \ncuration is key\n↓\n1820544393478132011 [2024-08-05] @lemonaut1 💜 1\nyour mental health is dependent upon curation. your personality is dependent upon curation. your joy, hopes &amp; dreams, and the fiber of your self-expression, is dependent upon curation: https://t.co/srn6O9KiRD\n  [Quoting Tweet 1815899903995818295 (missing)]\n↓\n1820544985244266607 [2024-08-05] @lemonaut1 \ncuration is the miraculous dopamine-giving path from consumption -&gt; creation (there *is* an escape from the black hole of TikTok!)https://t.co/mVoPJRLeQ6\n  [Quoting @DefenderOfBasic: curation is the gateway drug from consumption into creation]\n↓\n1820546185607925828 [2024-08-05] @lemonaut1 \nbut it's not yet easy enough. inertia-wise, we are trapped in cycles of consumption. we need more platforms that make curation exceptionally easy. playlists are one example, but lists of any sort are immensely valuablehttps://t.co/6q3iwPFLwI\n  [Quoting @lemonaut1: TBH i dream of making the Universal Playlist Platformwould support:✴︎YouTube videos (no more 'ThisVideoHasBeenRemoved' bs), ✴︎Spotify/Apple/Soundcloud/Tidal/whatever platform songs alongside each other✴︎even blogs/posts and stuff i guess, w TTSall in the same playlist]\n↓\n1820546656699601068 [2024-08-05] @lemonaut1 💜 1 [(SEED) type=quote_of_root]\nlists like this 'list of manifestos' are incredibly f'ing potent, it's a curation of people's curations *about themselves*https://t.co/bhIODBiPgA\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n├── 1820546781798949264 [2024-08-05] @lemonaut1 \n│   There is another one over at https://t.co/tFvKyHFaAn\n└── 1820547814725923253 [2024-08-05] @lemonaut1 💜 1\n    visa is of particular note for his curation game. in my world, he's one of the curation superheroes in the pantheon. but what makes him so good at what he does?https://t.co/K4zd9IOOYp\n      [Quoting @lemonaut1: visa's aesthetic curation game is on-point! he always notices the right things and i hope to be more like him in this regard. such a high s/n ratio https://t.co/CifeCqjJA6]\n    ↓\n    1820548108239167490 [2024-08-05] @lemonaut1 💜 1\n    I asked this question out loud because something kept metaphysically striking me about visakan's work, and I was a but frustratintrigued about what it was. he answered thishttps://t.co/ALxbGHclbj\n      [Quoting @visakanv: @lemonaut1 oh in my case it’s largely just a lot of practice asking “what’s interesting about this” about everything]\n    ├── 1820548756724650011 [2024-08-05] @lemonaut1 \n    │   curating your feed with output from curators is an awesome thing you can do, to 'endorse' their judgments as worth Paying Attention To, and let their passion/creativity/curiosity/???/⚡ come into your awareness, and affect you.\n    ├── 1820548986203459799 [2024-08-05] @visakanv 💜 1\n    │   @lemonaut1 flattered that you appreciate it so thoughtfully; from inside myself funnily enough i'm typically frustrated with how my work falls short of the visions i have in my mind\n    └── 1820553056444092632 [2024-08-05] @lemonaut1 \n        a curator asking 'what's interesting about this' &gt;&gt;&gt; a cold algorithm optimizing 4 engagement metrics i would personally hate to see what would happen if the latter reached its endgame (perfect engagement optimization 😨)I would LOVE 2 see what wld happen if the former did 🙏\n        ↓\n        1820553304726028440 [2024-08-05] @lemonaut1 💜 1\n        A perfectly curated feed, full of transformative, 'interesting' content. Thoughtfulnessmaxxing. Stuff that makes me go 'huh'. Reframes my perspective. The stuff the most inspiring movies are made of, the ones that inject you with intertia, and you leave changed.\n        ↓\n        1820553498196615339 [2024-08-05] @lemonaut1 💜 2\n        Of movies, I prob got this feeling the most strongly from EEAAO, compelling me to write this blog:https://t.co/F5WxxxvEZz\n        ↓\n        1820554118676795735 [2024-08-05] @lemonaut1 💜 1\n        Other than that, LimitlessLucyCrazy Rich Asiansare all movies that in recent memory that moved me, in an psychoemotional way. There was inertia there, and I was impelled to write notes. I wish there was an integration process for pieces of transformative content.\n\n===\n\n1810602348504658200 [2024-07-09] @Malcolm_Ocean 💜 1\nstill a so much alpha in asking people \"what's the tweet-sized version of X?\" where X is some remark the person has made/implied but not explained/unpacked\n\n\"tweet-sized version\" makes it SO clear that it doesn't need to be an adequate answer, merely an answer at all https://t.co/d5seshGRGd\n  [Quoting @Malcolm_Ocean: @FunHavar I've read TBOI, and enjoyed it. if I squint I can see some parallels.  what's your tweet-sized version of how TBOI is about surrender &amp; faith?]\n↓\n1810602349683171650 [2024-07-09] @Malcolm_Ocean \na mere \"saying of the obvious as it seems to me\", not anything that is supposed to convince you\nhttps://t.co/BdyrRowK5p\n  [Quoting @Malcolm_Ocean: different things are obvious to different people]\n↓\n1810602350765391959 [2024-07-09] @Malcolm_Ocean \nnor an attempt at a canon introduction to something!\nhttps://t.co/9hJJfkz6tV\n  [Quoting @Malcolm_Ocean: writing canonical resources is hard and confusing  thread of me thinking out loud about repeating, remixing, and the differences between: - twitter threads (dated, can't edit) - blog posts (dated, can edit) - pages/canon (not dated, can edit)]\n↓\n1810602351948132711 [2024-07-09] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\n@visakanv found a next size above tweet—a 1-page bullet outline written in one sitting\n\nhaving these constraints visibly as part of the frame of the writing makes it clear it should be held to a lower standard, not compared to some hypothetical perfection\nhttps://t.co/nNcpNzpI48\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n↓\n1810602353365758391 [2024-07-09] @Malcolm_Ocean \nbtw—I'm looking for people to co-write with in this style, whether one-pager sized or more like a 2h exam. but whatever you have at the end is what you publish! learn more &amp; sign up here:\nhttps://t.co/7WvKUKPy2b\n  [Quoting @Malcolm_Ocean: WRITING IT LIVE challenge Let's write for each other and publish it. Here's the game:  Bring a few blurbs of ideas you could write up (max 1 tweet or graphic in length). Based on those (and maybe pre-existing familiarity with your work) I'll tell you what I want to read about. Then you for me.  Then we each write it up with the other person as audience, as best we can in the time allotted. If you book a 30min block, this might be a bullet-point \"explain it in one breath standing on one foot\" summary—these can be great! Or maybe something longer.  Before we end the call, whatever each of us has written either gets: 1. published to blog/stack/newsletter/etc 2. emailed to a few people either of us choose (this option costs the writer $30)  Interested? Reply below and I'll DM you a scheduling link.]\n\n===\n\n1820578386802327588 [2024-08-05] @Malcolm_Ocean 💜 73 🔁 7 💬 2 [(SEED) type=quote_of_root]\nMalcolm, explain bootstrapping meta-trust right fckn now, in one breath, standing on one foot\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\nImages:\n  - [Image #0] The image presents a detailed outline on \"bootstrapping meta-trust (in one breath standing on one foot)\" in a clear and structured format. The title, displayed prominently at the top, is followed by a brief introduction that sets the stage for the discussion.\n    \n    The main content is organized into seven bullet points, each with sub-bullets that provide further elaboration. The first point defines \"full meta-trust\" and its significance in facilitating open communication and collaboration. The subsequent points delve into the challenges of establishing trust, the importance of respecting others' distrust, and the need to manage one's own distrust.\n    \n    The outline also explores the concept of \"trust-dancing\" and its role in building trust within a group. It highlights the difficulties of adding new members to a group while maintaining the existing trust dynamics. Additionally, the outline touches on the idea of \"increasing trust within a group\" and the need for humility and creativity in the process.\n    \n    Throughout the outline, quotes from notable figures such as Prentis Hemphill and M. Aurelius are incorporated to add depth and context to the discussion. The text is presented in a clean and readable format, with a white background that provides a neutral backdrop for the content.\n    \n    Overall, the image effectively conveys complex ideas related to bootstrapping meta-trust in a concise and organized manner, making it an informative and engaging visual aid.\n↓\n1820578389780312240 [2024-08-05] @Malcolm_Ocean 💜 5\nthis was written during a tiny Writing It Live! sprint with @HunterGlenn—he picked it out of 6 potential topics I offered!\n\nto learn more and book a time with me to do something similar (could be 1-3h instead of 30mins), go here:\nhttps://t.co/7WvKUKPy2b\n  [Quoting @Malcolm_Ocean: WRITING IT LIVE challenge Let's write for each other and publish it. Here's the game:  Bring a few blurbs of ideas you could write up (max 1 tweet or graphic in length). Based on those (and maybe pre-existing familiarity with your work) I'll tell you what I want to read about. Then you for me.  Then we each write it up with the other person as audience, as best we can in the time allotted. If you book a 30min block, this might be a bullet-point \"explain it in one breath standing on one foot\" summary—these can be great! Or maybe something longer.  Before we end the call, whatever each of us has written either gets: 1. published to blog/stack/newsletter/etc 2. emailed to a few people either of us choose (this option costs the writer $30)  Interested? Reply below and I'll DM you a scheduling link.]\n↓\n1820578391202144429 [2024-08-05] @Malcolm_Ocean 💜 6\nthis is a much denser pith of a 21k word doc I wrote in 2021-2022! which is available as a mini ebook here. this manual is basically my theory of change for scaling collaborative culture\n\nhttps://t.co/pbx9xYkoCQ\n\n===\n\n1820681553170612300 [2024-08-06] @__drewface 💜 13 [(SEED) type=quote_of_root]\nI'd like to revisit this. My answer is substantially new. https://t.co/eVvmehpjpa\n  [Quoting @visakanv: in the interest of scenius-building I now issue an open challenge to all my mutuals to QT this tweet with \"&lt;name&gt;, explain &lt;your thing&gt; right fckn now, in one breath, standing on one foot\" in a 1-page screenshot]\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand represents a recurring **Social Technology Meme** that evolves from simple engagement mechanics into a distributed identity-exploration ritual. Anchored by Visakanv's 2023 'explain your thing' challenge (inspired by a conversation with Drew), it spawns multiple variants: Qiaochu's 'ask for help' challenge (2021), Visa's 'somebody tell me to do X' game (2021), Malcolm's 'engage with everything' prompt (2022), Drew's '30-day ask' challenge (2022), and Univrsw3th4rt's '100 tweets' challenge (2023). The boundary object is the *constraint itself*—forcing brevity/vulnerability creates a permission structure for self-revelation. Unlike static social rituals, this evolves: early versions focus on overcoming participation friction, later versions (2023-2024) explicitly frame as 'scenius-building' and generate durable artifacts (one-pagers become a mini-genre). The strand is dialectical in structure—each iteration tests different constraints (time, format, audience) and the community refines what works. High cohesion among a core group (Visa, Malcolm, Drew, Yatharth, Michelle) who repeatedly participate and remix the format.",
    "rating": 7,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1354128627470725120,
        "annotation": "Pre-history: Qiaochu's 2021 standing offer to RT questions/asks, establishing the 'asking publicly' norm"
      },
      {
        "tweet_id": 1399651598628843523,
        "annotation": "Early catalyst: Visa's 'somebody tell me to do X' game (2021), the first constraint-based participation prompt"
      },
      {
        "tweet_id": 1491271279693168643,
        "annotation": "Malcolm's 'engage with everything' challenge (2022), testing radical participation constraints"
      },
      {
        "tweet_id": 1521933789311778817,
        "annotation": "Drew's '30-day ask for what you want' challenge, extending the format to serial commitment"
      },
      {
        "tweet_id": 1668996273116966914,
        "annotation": "The Artifact: Visa's 'explain your thing in one breath' challenge (2023), the canonical boundary object"
      },
      {
        "tweet_id": 1669050642902441989,
        "annotation": "High-quality execution: Yashkaf's dating book summary, demonstrating the format's knowledge-compression power"
      },
      {
        "tweet_id": 1669466687521824768,
        "annotation": "Semantic depth: Abhay's 'reality is metafiction' one-pager, showing the format handles complex philosophy"
      },
      {
        "tweet_id": 1730344484909584761,
        "annotation": "Univrsw3th4rt's '100 tweets in a day' challenge (2023), the most extreme constraint variant"
      },
      {
        "tweet_id": 1810602351948132711,
        "annotation": "Malcolm's meta-reflection: identifying the 'one-pager' as a new medium/art form, canonizing the evolution"
      },
      {
        "tweet_id": 1820578386802327588,
        "annotation": "2024 refinement: Malcolm's 'bootstrapping meta-trust' one-pager, showing the format's durability and continued use"
      }
    ]
  }
}