{
  "seed_tweet_id": 1690904441967575040,
  "thread_text": "1387040918469971976 [2021-04-27] @strangestloop 💜 31 🔁 3 💬 1\n✂️ twitter scissors thread ✂️\n↓\n1387041025462525952 [2021-04-27] @strangestloop 💜 3\n1. changes at basecamp\nhttps://t.co/q3JVGiqirG\n↓\n1394426195299688453 [2021-05-17] @strangestloop 💜 7\n2. men are werewolves\n  [Quoting @Aella_Girl: Men are werewolves As an escort, I'd have dinner with an intelligent, perceptive man - ceo or something - and I'd think, no way he's a werewolf. When we end up in bed, he'll remain himself, conscious, alert. But no; they transformed every time into an unrecognizable sex creature.]\n↓\n1394429859640889347 [2021-05-17] @strangestloop 💜 4\n3. apple fires agm\n  [Quoting @antoniogm: I have thus far maintained my silence on the Apple situation as I've sought to settle things amicably with the company that I admired, and at which I hoped to build the future of ads privacy.  As they however are not maintaining their silence on the matter, neither will I.]\n↓\n1441440721832189952 [2021-09-24] @strangestloop 💜 2\n4. dating with kids after spouse passes away discourse\n  [Quoting Tweet 1440865488502808581 (missing)]\n↓\n1665145567729577984 [2023-06-03] @strangestloop 💜 3\n5. tanning sneak peek\nhttps://t.co/DiLLob3Qd1\n  [Quoting @ImBillRay: I dont think you can be worse with women than one of my buddies https://t.co/GWhxzcZJmv]\n↓\n1666534600376557569 [2023-06-07] @strangestloop 💜 3\n6. life after college\nhttps://t.co/PFjQAC6BV3\n  [Quoting Tweet 1665957962844897280 (missing)]\n↓\n1678470073122430980 [2023-07-10] @strangestloop 💜 4\n7. jonah hill texts\nhttps://t.co/xlfWdsf8DN\n  [Quoting @_celia_bedelia_: This is from  Sarah Brady - Jonah Hill’s ex - this is manipulative, abusive bullshit.   SHE IS A SURFER AND SHOULDN’T…post pictures of herself in a bathing suit? WTF.   What a tiny little man. https://t.co/WhU0k9tHK0]\n↓\n1681032686889050113 [2023-07-17] @strangestloop 💜 4\n8. pandemic mid 20s skip\nhttps://t.co/eLSSSlHY4l\n  [Quoting @jzux: everyone i know in their late 20s is having an existential crisis because we skipped our mid 20s in the pandemic. relationships fast-tracked, careers faltered, we lost those core identity-building years and now we feel like 23-year-old brains in bodies approaching 30]\n↓\n1693314302390710562 [2023-08-20] @strangestloop 💜 5 [(SEED) type=quote_of_root]\n9. blue pill or red pill\nhttps://t.co/XzWPqHSEBL\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1822669275951227161 [2024-08-11] @strangestloop 💜 4\n10. boyfriend compliment\nhttps://t.co/cOhWjCrFL1\n  [Quoting @Rothmus: In no scenario whatsoever is this a compliment. https://t.co/13anFOtPoU]\n↓\n1829195598777778380 [2024-08-29] @strangestloop 💜 2\n11. partner crush\nhttps://t.co/5qQNbG1toQ\n  [Quoting @Actualwebutante: you partner realizes they have a crush on someone else, do you want them to tell you?]\n↓\n1923177697867420033 [2025-05-16] @strangestloop 💜 4\n12. hotel scarf\nhttps://t.co/FeIRUYVy0Q\n  [Quoting @_brentbaum: i learned something about agency when, on my second date with my now-girlfriend, i mentioned feeling cold and she about-faced into the nearest hotel, said she left a scarf in a room last week, and handed me the nicest one out of the hotel’s lost &amp; found drawer]\n\n===\n\n1690904441967575040 [2023-08-14] @lisatomic5 💜 2741 🔁 2284 💬 31 [(SEED) type=root]\nPoll question from my 12yo:\n\nEveryone responding to this poll chooses between a blue pill or red pill.\n\n- if &gt; 50% of ppl choose blue pill, everyone lives\n- if not, red pills live and blue pills die\n\nWhich do you choose?\n├── 1690905006973595649 [2023-08-14] @danielbrottman 💜 17\n│   @lisatomic5 team blue 1000 times out of 1000\n├── 1690913768337797120 [2023-08-14] @lkbm 💜 402 🔁 7\n│   @lisatomic5 It sounds wasteful to keep 23% of the population in prison, but it looks like 23% of the surveyed population should be in prison.\n│   ↓\n│   1690914277262241792 [2023-08-14] @lisatomic5 💜 422 🔁 2\n│   @lkbm if you had a belief that most people would choose red, it would be a rational choice!\n│   ↓\n│   1690928827080294400 [2023-08-14] @mimi10v3 💜 8\n│   @lisatomic5 @lkbm yeah but otoh this is tpot ... uwu\n├── 1690915181952708608 [2023-08-14] @eshear 💜 98\n│   @lisatomic5 Good poll\n├── 1690938209528877056 [2023-08-14] @metaversehodl 💜 301 🔁 18\n│   @lisatomic5 https://t.co/qoYpGnOEpT\n│   Images:\n│     - [Image #0] The image is a humorous meme that combines elements of the Prisoner's Dilemma and the concept of life satisfaction, referencing the classic \"red pill\" and \"blue pill\" analogy from the movie \"The Matrix.\" The meme features a normal distribution curve with three cartoon characters, each representing a different point on the curve.\n│       \n│       *   The normal distribution curve is labeled \"LIFE SATISFACTION\" and has an x-axis marked with IQ scores ranging from 55 to 145.\n│           *   The curve is centered around an IQ score of 100, with the majority of the population falling within one standard deviation (IQ scores 85-115).\n│           *   The curve is divided into three sections: 0.1%, 2%, and 14% on the left side, and 14% on the right side.\n│       *   Three cartoon characters are placed at different points on the curve, each with a caption.\n│           *   The character on the left has an IQ score of 55 and is labeled \"BLUE PILL SINCE IT'S BEST FOR EVERYONE.\"\n│               *   This character represents individuals with lower cognitive abilities who may not be aware of the implications of their choices.\n│           *   The character in the middle has an IQ score around 100 and is labeled \"NO!!! THIS IS CLASSIC PRISONER'S DILEMMA. RED PILL IS THE RATIONAL CHOICE.\"\n│               *   This character represents the average person who is aware of the Prisoner's Dilemma and has made a rational decision to choose the red pill.\n│           *   The character on the right has an IQ score of 145 and is labeled \"BLUE PILL. I WANT TO DIE.\"\n│               *   This character represents highly intelligent individuals who may have a deeper understanding of the implications of their choices and are willing to make a sacrifice for the greater good.\n│       \n│       The meme uses humor to highlight the complexities of decision-making and the trade-offs involved in choosing between the red pill and the blue pill. By referencing the Prisoner's Dilemma, the meme suggests that the rational choice may not always be the most desirable outcome. Overall, the image is a thought-provoking commentary on the human condition, encouraging viewers to consider the implications of their choices and the potential consequences of their decisions.\n├── 1690944715548725248 [2023-08-14] @IsaacKing314 💜 491 🔁 12\n│   @lisatomic5 Wow, I did not expect these results. Both pills are stable equilibria; if everyone picks the same pill, everyone lives, regardless of which pill it is. But picking blue involves personal risk while picking red doesn't, so I figured red would be the Schelling point.\n│   ↓\n│   1691015095306829824 [2023-08-14] @nosilverv 💜 147\n│   @IsaacKing314 @lisatomic5 Isn’t it the opposite? I just picked blue bc I want everyone to live lol but reasoning I’d reason “if a single person doesn’t pick red then at least a person dies so the only way to save everyone is to pick blue”\n├── 1690966725683200000 [2023-08-14] @LightningShade0 💜 249 🔁 1\n│   @lisatomic5 Someone likes their prisoner's dilemmas. :P\n│   ↓\n│   1690985150660886528 [2023-08-14] @lisatomic5 💜 342 🔁 5\n│   @LightningShade0 I started them young 🥲\n├── 1690967781343363072 [2023-08-14] @slimepriestess 💜 44\n│   @lisatomic5 @Aella_Girl team supercoordination stays winning\n│   ↓\n│   1691021446770761728 [2023-08-14] @NoncanonicalEae 💜 3\n│   @slimepriestess @lisatomic5 @Aella_Girl winning what? no one lost. but you could have, and we could not have. why do you hold yourself hostage\n│   ↓\n│   1691023706535915520 [2023-08-14] @NoncanonicalEae 💜 1\n│   @slimepriestess @lisatomic5 @Aella_Girl The blue voters are the ones testing the moral sense of the others, and they're also the ones who think they're having their moral sense tested. When in reality, no one at all has to put themselves in danger.\n├── 1690985112886722560 [2023-08-14] @aleksil79 💜 4\n│   @lisatomic5 where's the \"everyone lives and red pills go to purgatory\" option\n├── 1690987276904677376 [2023-08-14] @goblinodds 💜 471 🔁 6\n│   @lisatomic5 wait if everyone chooses red then everyone lives, right??\n│   ├── 1690989523868766208 [2023-08-14] @goblinodds 💜 242 🔁 2\n│   │   @lisatomic5 actually insane (but probably good?) that people are so aggressively willing to risk their own lives to help other people that they don't notice that \"defection\" isn't a thing that can happen here\n│   │   ↓\n│   │   1690989811409272832 [2023-08-14] @goblinodds 💜 55\n│   │   @lisatomic5 i should switch my answer from red to blue though on the grounds that i would rather remove dumb people who think that they're saving their own skin at someone else's expense from the gene pool than dumb people who think they're saving other people's skin at their own expense\n│   │   ↓\n│   │   1691024635792695296 [2023-08-14] @goblinodds 💜 71\n│   │   @lisatomic5 wait i'm a dummy the reds live regardless huh\n│   │   ↓\n│   │   1691161976053862400 [2023-08-14] @ultimape 💜 18 🔁 2 💬 1\n│   │   @goblinodds @lisatomic5 Choosing red is only optimal if we assume that we are not in a diverse series of iterative games where altruistic behavior may save both our asses in the future.\n│   │   \n│   │   Keneysian Beauty Contest mashed up with multiplayer ultimatum game. So cool.\n│   │   https://t.co/3K32ypoyjG\n│   │     [Quoting @ultimape: @vgr @ExGenesis It's a big one! But seems less well known unless you come from economics backgroundhttps://t.co/Y0C5bHwBqTI think it has analogs with the Keynesian beauty contest but haven't found any solid examples. https://t.co/BvVL2ZBQcMhttps://t.co/0TFHkn9IHK]\n│   │   ├── 1691162478653186048 [2023-08-14] @ultimape 💜 12\n│   │   │   @goblinodds @lisatomic5 The modern world has tricked us into being shelfish actors because it makes us easier to extinguish IMHO.https://t.co/C4B96e6USK\n│   │   │     [Quoting @ultimape: @CaminaDr @Doggomuffin1 @ConceptualJames I see this all the time in animal behavioral studies. We compare kids and chimp behavior together while neglecting that the children are playing a larger iterative game, and the chimps know they will just get put back in their cages to do another trial the next day.]\n│   │   │   ├── 1691162605455388673 [2023-08-14] @ultimape 💜 3\n│   │   │   │   @goblinodds @lisatomic5 The 'correct' move is not to play.https://t.co/hW6fbvaXMD\n│   │   │   │     [Quoting @ultimape: @suspendedreason @qorprate I saw studies on this using gorillas and children from a daycare. They assumed that the children were playing a one-shot game and so concluded the gorilla was special. Makes me laugh.https://t.co/RFfkLg8z6t]\n│   │   │   │   ├── 1691162783050539008 [2023-08-14] @ultimape 💜 2\n│   │   │   │   │   @goblinodds @lisatomic5 It's a trap. We're all prisoners.https://t.co/NmfiEip9Cy\n│   │   │   │   │     [Quoting @ultimape: @xlr8harder @eigenrobot @acidshill I see this shit all the time, people using game theory arguments to convince others that a game is an iterated prisoner's dilemma. when it's really actually a publics goods game.I'm convinced that knowing game theory is a trap.]\n│   │   │   │   │   ↓\n│   │   │   │   │   1691163472891875328 [2023-08-14] @ultimape 💜 2\n│   │   │   │   │   @goblinodds @lisatomic5 People confused bayes optimal decisions and maximizing utility with there being \"one true good answer\" when really the answer is often a shifting mix of Schelling points and chaos when looking at it from a metagame.https://t.co/XTI9tJe7Ed\n│   │   │   │   │     [Quoting @ultimape: \"The solution concept is a modification of Markov Perfect Bayesian Equilibrium\"https://t.co/F5K4Fvs6bT https://t.co/DSc25obhwX]\n│   │   │   │   │   ↓\n│   │   │   │   │   1691163829827207168 [2023-08-14] @ultimape 💜 1\n│   │   │   │   │   @goblinodds @lisatomic5 Maybe the best we can do is minimize losses.https://t.co/4gtX2SdyLw\n│   │   │   │   │     [Quoting @ultimape: Game theory is fun. Liv Boeree points out how that part of the challenge of playing multiplayer games is adapting your play style to the opponent to play for \"loss minimization\". She's good. https://t.co/JElrhOyfLO]\n│   │   │   │   └── 1691164075211001856 [2023-08-14] @goblinodds 💜 2\n│   │   │   │       @ultimape @lisatomic5 never take strange pills or boxes\n│   │   │   │       ↓\n│   │   │   │       1691165243890647040 [2023-08-14] @ultimape 💜 1\n│   │   │   │       @goblinodds @lisatomic5 start putting cats in boxes and funny things happen https://t.co/oUfQokBB9B\n│   │   │   │         [Quoting @ultimape: \"He began by putting cats in a puzzle box and placing food outside of the box so that the cat wanted to escape. [...] Thorndike learned that the cats attempted to escape the box without the reward of food.\" https://t.co/IciI4epIId]\n│   │   │   │       ↓\n│   │   │   │       1691166161549905920 [2023-08-14] @ultimape 💜 2\n│   │   │   │       @goblinodds @lisatomic5 If you don't take any pill, there is no chance of dying.So the choice really is \"do I take the blue pill to save people who took the blue pill from the red, do I take red as I am going along with the herd and want to live, or do I take none and let them decide their own fate\"\n│   │   │   └── 1691163800127586304 [2023-08-14] @goblinodds 💜 12\n│   │   │       @ultimape @lisatomic5 this is interesting bc i feel SO the opposite\n│   │   │       \n│   │   │       the dominant strain of culture imo encourages self-sacrifice for its own sake\n│   │   │       ↓\n│   │   │       1691164440052285442 [2023-08-14] @ultimape 💜 3\n│   │   │       @goblinodds @lisatomic5 yes! it's as spectrum for sure. The higher up the status hierarchy you go, the more this works out in your favor.It's only dominant in the context of how resources are spread thinly.https://t.co/e5xie5iQtq\n│   │   │         [Quoting @ultimape: @stahura @ZPostFacto @sama Larger philosophical issue w/ these stances is that in signaling a desire to have another lower their guard, it can make them easier to victimize due to information asymmetry among a mixed-motive-imperfect-information game.It works well for peers, but advantages those w/ power.]\n│   │   │       ↓\n│   │   │       1691164753278664704 [2023-08-14] @ultimape 💜 2\n│   │   │       @goblinodds @lisatomic5 The people at rand got really mad when the plebs didn't play the game \"right\".https://t.co/1SNyZT0f5G\n│   │   │         [Quoting @ultimape: @CaminaDr @Doggomuffin1 @ConceptualJames What's funny is how people at Rand created all these fancy game theoretic models and when they went to test on real people, it didn't fit their models. Actual real world testing didn't invalidate it😂]\n│   │   └── 1691427166897012736 [2023-08-15] @12josdic 💜 5\n│   │       @ultimape @goblinodds @lisatomic5 Choosing blue isn't altruistic, though - everybody has the opportunity to choose red, and remove themselves from risk entirely. Blue is an altruism illusion, it's self-sacrifice for the sake of self-sacrifice.\n│   │       ↓\n│   │       1691490234926608402 [2023-08-15] @ultimape 💜 3\n│   │       @12josdic @goblinodds @lisatomic5 True, but on a swarm/population level it's nice to have a gradient of player types that can respond to unforeseen circumstances as we collectively encounter new games.\n│   │       ├── 1691490518356701201 [2023-08-15] @ultimape 💜 1\n│   │       │   @12josdic @goblinodds @lisatomic5 It's fun to explore the role of the amygdala in social behaviors. Shows up a lot in autism research.https://t.co/g19FQdDZqJAlso worth noting that modeling why there are shifts in responses is often missing in exploring these kinds of games.https://t.co/34UhtYdhSN\n│   │       │     [Quoting @ultimape: \"Players were seen shifting between altruist and selfish play basedon the actions of othershttps://t.co/dRAqMVKaz7 https://t.co/vCHFB1ShA4]\n│   │       └── 1691491158638178312 [2023-08-15] @12josdic 💜 2 🔁 1\n│   │           @ultimape @goblinodds @lisatomic5 For the record, I think I agree that blue is the correct choice - but only because I know that in reality not everybody is a perfect rational economic game theory agent, and I don't think that people deserve to die for making silly mistakes in games.\n│   │           ↓\n│   │           1691492143561420802 [2023-08-15] @ultimape 💜 3\n│   │           @12josdic @goblinodds @lisatomic5 I linked to something in tweet earlier, it mentions an economic game that economists typically fail at as they try to model it. They all vote to go to zero. It's like a neurosis among subgroups.https://t.co/0TFHkn9IHK\n│   │             [Quoting @ultimape: Whoa, the collectivist model of the market failure is a near perfect extension of Yanis' \"investment game\" he describes here: https://t.co/HQ4djv3OMBAmazing what pops out when I start thinking about selling stickers on the open market and how tech companies are chasing fads.]\n│   │           ↓\n│   │           1692999889100128418 [2023-08-19] @ultimape \n│   │           @12josdic @goblinodds @lisatomic5 Once someone chooses blue, it *becomes* altruistic to choose blue.https://t.co/rzJ1ooGbA6\n│   │             [Quoting @ultimape: Ergrodicity, Evolution, and Cooperation... All in the same paper? Cooperating as hedging against risk. Playing games against the noise floor.https://t.co/5cUsCdsbPk(also fascinating: that this was h/t @rorysutherland)https://t.co/nnZU9fsB9Y]\n│   ├── 1691109659493507073 [2023-08-14] @qwweryo 💜 62\n│   │   @goblinodds @lisatomic5 Yeah but if you know that 10%+ will think about this incorrectly and choose Blue then you're risking those people by choosing RedShouldn't we just easily acausally coordinate 50%+ to pick Blue?\n│   └── 1691147580598816768 [2023-08-14] @tr_babb 💜 3\n│       @goblinodds @lisatomic5 also true for blue? but there is more margin for error because you don't have to get 100.0% for everyone to live\n├── 1691022785919795201 [2023-08-14] @RokoMijic 💜 596 🔁 55\n│   @lisatomic5 I don't understand why anyone would vote blue in this poll \n│   \n│   Can someone who voted blue please give their logic?\n│   ├── 1691023221003259904 [2023-08-14] @Squee451 💜 108\n│   │   @RokoMijic @lisatomic5 We want everyone to live we also don't defect first round in the prisoner dilemma.\n│   │   ↓\n│   │   1691023926594347008 [2023-08-14] @RokoMijic 💜 96 🔁 2\n│   │   @Squee451 @lisatomic5 this isn't a prisoner's dilemma\n│   │   \n│   │   this is a game with a unique Nash Equilibrium where everyone gets the maximum reward (everyone picks red)\n│   ├── 1691024948595224576 [2023-08-14] @damitatweets 💜 192\n│   │   @RokoMijic @lisatomic5 I don't want anyone to die?\n│   │   ↓\n│   │   1691026009225560064 [2023-08-14] @RokoMijic 💜 128\n│   │   @damitatweets @lisatomic5 It is only possible to die in this scenario if you pick blue\n│   │   \n│   │   Red is always safe\n│   ├── 1691032407087140864 [2023-08-14] @tomchapin 💜 72\n│   │   @RokoMijic @lisatomic5 The key is to understand not what is the “correct” answer, but the answer that will MOST LIKELY be chosen by the other people that you don’t have control over.\n│   │   \n│   │   The poll utterly proves this.\n│   │   \n│   │   Sorry, but blue is the best choice to vote for.\n│   ├── 1691034844858568704 [2023-08-14] @JustAnkurBagchi 💜 120 🔁 1\n│   │   @RokoMijic @lisatomic5 Outside of a vacuum, red represents the values of intolerance and fascism.\n│   ├── 1691053357064962048 [2023-08-14] @short_straw 💜 376 🔁 10\n│   │   @RokoMijic @lisatomic5 This poll shows what you see.\n│   │   \n│   │   You see (correctly but narrowly) if you choose red, you live.\n│   │   \n│   │   The majority sees (correctly but widely) if they choose blue together, nobody dies.\n│   │   \n│   │   Red sees \"I live\" and Blue sees \"Nobody dies.\"\n│   ├── 1691066806868295682 [2023-08-14] @strangestloop 💜 12\n│   │   @RokoMijic @lisatomic5 i have theory of mind\n│   ├── 1691074962717659136 [2023-08-14] @yashkaf 💜 757 🔁 12\n│   │   @RokoMijic @lisatomic5 because humans judge each other on ethics and loyalty and are transparent to each other and so the meta-game results are actually flipped: blue pushers live in high trust groups of other blues and reds die mad and alone\n│   │   \n│   │   all my homies push the blue button fr fr\n│   │   ↓\n│   │   1691081373094666240 [2023-08-14] @RokoMijic 💜 178 🔁 6\n│   │   @yashkaf @lisatomic5 yes there is some truth to this, but in this case the instinct is misfiring. There's no reason for anyone to press blue and risk themselves, and the blue community is risking itself unnecessarily\n│   │   ├── 1691083696206458881 [2023-08-14] @yashkaf 💜 394 🔁 7\n│   │   │   @RokoMijic @lisatomic5 costly signaling of loyalty and altruism is basically the main driver of social psychology along with horniness\n│   │   │   \n│   │   │   red-red is a good Nash eq for this isolated game but the meta game is that no one wants to be friends with clever dudes who \"well ackshuyally\" about Nash equilibria\n│   │   │   ↓\n│   │   │   1691084032887369730 [2023-08-14] @yashkaf 💜 133 🔁 3\n│   │   │   @RokoMijic @lisatomic5 the instinct for \"I want people in my tribe who don't selfishly endanger the lives of their tribesmates\" is very much firing as intended\n│   │   ├── 1691107367143014400 [2023-08-14] @aleksil79 💜 5\n│   │   │   @RokoMijic @yashkaf @lisatomic5 part of my intuition could be translated as, \"at least half of us will cooperate, saving any poor souls who weren't sharp enough to spot the safe equilibrium\"\n│   │   │   you want the default-altruistic heuristic because the default-selfish one leads to terrible equilibria\n│   │   │   ↓\n│   │   │   1691107808236679168 [2023-08-14] @aleksil79 💜 1\n│   │   │   @RokoMijic @yashkaf @lisatomic5 Humans are *not* smart enough to reason thru all the subtler implications and those implications bite the default-selfish world in the ass, hard.\n│   │   └── 1691126361589723138 [2023-08-14] @qwweryo 💜 5\n│   │       @RokoMijic @yashkaf @lisatomic5 Protect the people that will make mistakes https://t.co/0Ul4zstqNx\n│   │         [Quoting @qwweryo: @goblinodds @lisatomic5 Yeah but if you know that 10%+ will think about this incorrectly and choose Blue then you're risking those people by choosing RedShouldn't we just easily acausally coordinate 50%+ to pick Blue?]\n│   ├── 1691077919609647104 [2023-08-14] @PstafarianPrice 💜 111\n│   │   @RokoMijic @lisatomic5 This explains so much.\n│   ├── 1691079432973570048 [2023-08-14] @diegocaleiro 💜 55\n│   │   @RokoMijic @lisatomic5 I didn't even consider red.  Red is insane you could end up killing a bunch of people.\n│   ├── 1691111866880126977 [2023-08-14] @BecomingCritter 💜 1022 🔁 22\n│   │   @RokoMijic @lisatomic5 I always vote blue, i didn’t even read the question\n│   ├── 1691145925492940800 [2023-08-14] @generic_void 💜 52\n│   │   @RokoMijic @lisatomic5 Altruism as irrationality and martyrdom. I think I have some PDFs of econ papers on this if you want them\n│   ├── 1691223179576971264 [2023-08-14] @0xdoug 💜 29\n│   │   @RokoMijic @lisatomic5 I have family and friends who I care about, and would assume some of them would pick blue\n│   ├── 1691227988866871296 [2023-08-14] @HbdNrx 💜 3\n│   │   @RokoMijic @lisatomic5 It's all fun and games in a Twitter poll, but I think if this *actually* happened nearly everyone would pick red.\n│   ├── 1691244652899471360 [2023-08-15] @broodsugar 💜 26\n│   │   @RokoMijic @lisatomic5 Being willing to take risk for the well-being of others is a good thing.\n│   │   \n│   │   Imagine living in a world where everyone picks red, content to see blue die because it minimised personal risk.\n│   ├── 1691250522743840768 [2023-08-15] @RokoMijic 💜 2\n│   │   @lisatomic5 https://t.co/uOPBtApsZo\n│   │     [Quoting @RokoMijic: ok, one final poll.  There is a room-sized blender that kills everyone who steps into it.   But, if 50% or more of the people answering this poll step into the blender, there will be too much resistance and it will fail to start and everyone who steps in will be fine.   Obviously, if you don't step into the blender nothing bad can happen.  Do you step into the blender?]\n│   ├── 1691250565345599488 [2023-08-15] @minordissent 💜 11 🔁 1\n│   │   @RokoMijic @lisatomic5 the interesting distinction between this poll &amp; the blender is in this one it’s saying “if you choose red, you are responsible for the death of everyone who chooses blue”. Most would rather die than live with the guilt of knowing they killed all the altruists by being selfish.\n│   └── 1691258797074104320 [2023-08-15] @danallison 💜 2 🔁 1\n│       @RokoMijic @lisatomic5 If I vote blue, at most 1 person could die as a result of my decision (me). If I vote red, potentially many people will die as a result.\n├── 1691059181099372545 [2023-08-14] @easoncxz 💜 3\n│   @lisatomic5 To the \"Schelling point is Red\" bros: yeah, that's Smart and Correct, but do you really want to live in a society where kindness is conditioned on smartness, i.e. if someone isn't smart, then they aren't kind? 😒\n├── 1691083666607210497 [2023-08-14] @CovfefeAnon 💜 380 🔁 1\n│   @lisatomic5 It's cruel to vote Blue in this example because you risk getting Blue over 50% and depriving the people who voted for death their wish.\n│   \n│   (the test \"works\" for its implied purpose if there are some number of non-voters who will also not get the Red vote protection)\n├── 1691091208863371264 [2023-08-14] @chercher_ai 💜 11\n│   @lisatomic5 simply don't vote and you're safe, since only people who vote are at risk to begin with\n├── 1691092078397186050 [2023-08-14] @loopholekid 💜 11\n│   @lisatomic5 seeing problems like this and going \"what is the most rational choice\" instead of \"which outcome is most likely (assuming that most people aren't acting rationally)\" feels like a potentially catastrophic disregard of human behaviour\n│   ↓\n│   1691093523620306944 [2023-08-14] @loopholekid 💜 3\n│   @lisatomic5 most folks don't use game theoretic frameworks to make decisions and gaming these scenarios out as if they do is a faulty strat\n├── 1691094719781302272 [2023-08-14] @AndrewCurran_ 💜 388 🔁 21\n│   With perfect coordination, the answer is obvious; everyone pushes the red button at the same time. We don't live in that world. Many people, certainly billions, would instinctively choose blue, believing it to be the moral choice. Thus, if you choose red, billions die. The tension lies in knowing that red is the optimal choice with coordination and that it carries no personal risk. But it *does* carry a risk: that your choice of red will result in the deaths of billions of people.  One of the reasons I would choose blue is that the world where we killed all of the 'blues' for making a suboptimal choice would be a much worse world to live in than this one. TL;DR - In the end the question is simple: 'Am I my brother's keeper?' And for me, the answer is easy. Yes I am.\n│   Images:\n│     - [Image #0] The image is a meme that presents a graph with a bell curve, illustrating the distribution of IQ scores. The graph is accompanied by three cartoon characters and features a red and blue color scheme.\n│       \n│       *   The graph is a bell curve, which is a graphical representation of a normal distribution.\n│           *   The x-axis represents IQ scores, ranging from 55 to 145.\n│           *   The y-axis represents the percentage of people with corresponding IQ scores.\n│           *   The graph is divided into two sections: the left side is colored blue, while the right side is colored red.\n│           *   The percentages for each section of the graph are as follows:\n│               *   0.1%: IQ score of 55 (left) and 145 (right)\n│               *   2%: IQ score of 70 (left) and 130 (right)\n│               *   14%: IQ score of 85 (left) and 115 (right)\n│               *   34%: IQ score of 100 (left and right)\n│       *   Three cartoon characters are placed around the graph.\n│           *   The character on the left has an IQ score of 55 and is depicted with a simple, primitive appearance.\n│           *   The character in the middle has an IQ score of 100 and is shown with a mix of emotions, including happiness and sadness.\n│           *   The character on the right has an IQ score of 145 and is illustrated wearing a hooded cloak, giving off a mysterious and intelligent vibe.\n│       *   The background of the image is white, providing a clean and neutral backdrop for the graph and cartoon characters.\n│       \n│       In summary, the image is a humorous take on the concept of IQ scores, using a bell curve graph to illustrate the distribution of intelligence among the population. The accompanying cartoon characters add a lighthearted touch, poking fun at the idea that IQ scores can be used to categorize individuals into different groups.\n├── 1691119839006556160 [2023-08-14] @alicemazzy 💜 213\n│   @lisatomic5 your 12yo is a top decile poster\n├── 1691148092790157328 [2023-08-14] @sympatheticopp 💜 28\n│   @lisatomic5 so you're the little lady who started this big war....\n├── 1691149780053798931 [2023-08-14] @nic__carter 💜 143 🔁 3\n│   @lisatomic5 couldnt smash red fast enough\n├── 1691166685146025987 [2023-08-14] @goblinodds 💜 41 🔁 2\n│   @lisatomic5 this is the best thing since @browserdotsys waged war on the crows\n├── 1691177506663989248 [2023-08-14] @aashiq 💜 18\n│   @lisatomic5 Voted red, even though I thought people would vote blue. In a large poll, I’m highly unlikely to be the difference-maker, and I had enough uncertainty about the votes so I went red to be safe. If red had been ahead, blue would be a meaningless suicide.\n├── 1691179565291360256 [2023-08-14] @imperialauditor 💜 2\n│   @lisatomic5 my congratulations to 12yo yet again\n├── 1691198827246891011 [2023-08-14] @gnostrils 💜 5\n│   @lisatomic5 @Aella_Girl\n├── 1691205063618842624 [2023-08-14] @PerryALPHA 💜 351 🔁 10\n│   @lisatomic5 Pick red. Either no one perishes or the virtue signallers perish. Win win\n├── 1691207402950119424 [2023-08-14] @hargup13 💜 1\n│   @lisatomic5 I voted blue instinctively. You would rather save everyone, than letting some people die.\n├── 1691210718735986688 [2023-08-14] @mechanical_monk 💜 19 🔁 1\n│   @lisatomic5 i wish i had a fraction of the poasting power of your 12yo\n├── 1691216437321318400 [2023-08-14] @easoncxz  [(SEED) type=quote_of_semantic_search]\n│   @lisatomic5 Let me take just another stab at the Red-pill bros, come on now: https://t.co/Ww0LFlAItZ\n│     [Quoting @easoncxz: Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose? | What's your best-approximate gender?]\n├── 1691241415496404993 [2023-08-15] @PerryALPHA 💜 159 🔁 9\n│   @lisatomic5 Red is the correct answer and this poll is a good illustration if you want to convince people that Ayn Rand is right: when everybody acts in their own rational self-interest, everybody wins\n├── 1691263602475536386 [2023-08-15] @generic_void 💜 47\n│   @lisatomic5 The arguments over this are actually incredibly interesting\n├── 1691286697194164224 [2023-08-15] @tomchapin 💜 164 🔁 3\n│   Red: 100% of people have to pick it, for 100% of people to live. Any less than 100% of people picking it results in a LOT of death. Even if 99% of people pick it, a ton of people end up dying.\n│   \n│   Blue: Only 50% of people have to pick it, for 100% of people to live.\n│   \n│   If you have zero control over what other people pick, and if you are trying to minimize the odds of ANYONE dying, then blue is the right choice.\n├── 1691329427911655424 [2023-08-15] @positive_loop 💜 10 🔁 1\n│   @lisatomic5 https://t.co/Ovtbty9tQf\n│   Images:\n│     - [Image #0] The image is a meme that uses a bell curve graph to illustrate the concept of risk aversion and the importance of making a rational decision. The graph is labeled with percentages and IQ scores, and features three cartoon characters.\n│       \n│       *   The graph is a bell curve, with the majority of the population falling within the middle range (around 100 IQ).\n│       *   The x-axis is labeled with IQ scores ranging from 55 to 145.\n│       *   The y-axis is not explicitly labeled, but it appears to represent the percentage of the population.\n│       *   The graph is divided into sections, with the following percentages:\n│           *   0.1%: extreme left and right tails\n│           *   2%: slightly less extreme left and right tails\n│           *   14%: moderate left and right tails\n│           *   34%: majority of the population on either side of the mean\n│           *   68%: total percentage of the population within one standard deviation of the mean\n│       *   Three cartoon characters are featured:\n│           *   A crying character at the top, labeled \"NOOO BUT YOU DON'T UNDERSTAND IF EVERYONE CHOOSES RED THERE'S NO RISK\"\n│           *   A character on the left, labeled \"JUST CHOOSE BLUE\"\n│           *   A character on the right, also labeled \"JUST CHOOSE BLUE\"\n│       *   The background of the image is white.\n│       \n│       Overall, the meme is poking fun at the idea that people tend to follow the crowd and make irrational decisions, rather than thinking critically and making informed choices. The use of a bell curve graph and IQ scores adds a layer of complexity and humor to the meme.\n└── 1691329912462770176 [2023-08-15] @Aristos_Revenge 💜 240 🔁 1\n    @lisatomic5 Everyone talking about tribes and cooperation as if I can't just hang with my red homies\n\n===\n\n1691034037480308736 [2023-08-14] @panchromaticity 💜 653 🔁 17 [(SEED) type=quote_of_root]\nI don't understand the replies\n\nwhy would I ever vote red\n\n\"If everyone votes red, nobody dies\" okay sure, now make everyone vote red. Go ahead, do it. I'll wait. https://t.co/grhpLkmYeB\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n├── 1691042061494153216 [2023-08-14] @panchromaticity 💜 200\n│   I would simply not vote for a large fraction of the population to die\n│   ↓\n│   1691042476562513920 [2023-08-14] @panchromaticity 💜 167\n│   we don't need to speculate here, we can just look at the results (spoilers) and see that blue is in fact the correct option\n│   ├── 1691045093564973056 [2023-08-14] @panchromaticity 💜 236\n│   │   \"but if more than 50% of people vote red—\"\n│   │   \n│   │   okay but they don't, you're wrong, update your model of the voters accordingly\n│   │   \n│   │   I would simply choose to win\n│   └── 1691160742651625473 [2023-08-14] @imperialauditor 💜 1\n│       @panchromaticity I'm honestly really impressed and confused that blue won\n│       \n│       (but also check other polls where a slight wording change dramatically changes the results) - this is not something I would trust my life to\n└── 1691160194330365953 [2023-08-14] @imperialauditor \n    @panchromaticity \"Come with me if you want to live\" \n    there. done.\n\n===\n\n1691049756888354817 [2023-08-14] @__drewface 💜 50 [(SEED) type=quote_of_root]\nBy looking at the poll results, the revealed-to-be correct answer was blue.\n\nBut many in the replies seem convinced they were right to pick red.\n\nImo, we ought to accept that the majority WILL pick blue, trusting their instincts. https://t.co/OaVunw9eni https://t.co/710Mkuwjgk\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\nImages:\n  - [Image #0] The image is a screenshot of a Twitter conversation. \n    \n    To reproduce the image, create a black background with white text and include the following elements:\n    * A tweet from the user \"@0a0505\" (\"RP\") with the text \"The fact that the majority picked blue... Society man..\" and 5 likes, 446 views.\n    * A reply from the user \"Roko - e/bas\" (\"@RokoMijic\") with the text \"I don't understand why anyone would vote blue in this poll\" and \"Can someone who voted blue please give their logic?\" and 16 likes, 1,019 views.\n    The tweets should be arranged in a vertical layout, with the original tweet at the top and the reply below it, both with a small profile picture to the left of the username.\n  - [Image #1] The image shows a Twitter conversation between two users. \n    \n    To recreate the image, start with a black background and add the following elements:\n    * A tweet at the top from the user \"RP\" (@0a0505) with the text \"The fact that the majority picked blue... Society man..\" \n    * A reply tweet from the user \"Roko - e/bas\" (@RokoMijic) with the text \"I don't understand why anyone would vote blue in this poll\" and \"Can someone who voted blue please give their logic?\" \n    * Include the usernames, profile pictures, and timestamps for both users.\n    * Add the engagement metrics, such as the number of likes, retweets, and replies, for each tweet. \n    The top tweet has 5 likes, 446 retweets, and the reply tweet has 16 likes, 1,019 retweets, and 18 replies.\n├── 1691132793907290112 [2023-08-14] @RomeoStevens76 💜 3\n│   @__drewface We need red voters otherwise where would ai acceleration companies get employees?\n│   ↓\n│   1691261712366993408 [2023-08-15] @zrkrlc 💜 1\n│   @RomeoStevens76 @__drewface oof\n├── 1691151973368594433 [2023-08-14] @__drewface 💜 5\n│   See also:\n│   \n│   I suspect this has something to do with wanting to protect against catastrophic outcomes...\n│   \n│   But even in a repeated game, Blue will get enough votes that it's worth saving them. The majority  recognize this intuitively and vote blue w/o thought\n│   \n│   https://t.co/dN8tVylqrb\n│     [Quoting Tweet 1690976997105647616 (missing)]\n│   ↓\n│   1691152236942876672 [2023-08-14] @__drewface 💜 7\n│   Someone popular should just post the same poll like 20 times in a row to simulate the repeated game so we can see. No need to theorize about it.\n│   ↓\n│   1691159458737520640 [2023-08-14] @__drewface 💜 7 🔁 1\n│   Doubling down on red is dogmatic resistance to doing real science.\n│   \n│   \"64% of people are just irrational and wrong\"\n│   \n│   That's... not how being wrong works. We don't make choices based on theory. Theory is meant to *predict* our choices. If theory is wrong, then it's wrong.\n│   ↓\n│   1691162078105538561 [2023-08-14] @__drewface 💜 6\n│   This is a good theory:\n│   \n│   The poll is a litmus test for % of people who are confident \n│   \n│   https://t.co/H8gawEiwiX\n│     [Quoting Tweet 1691159090414915584 (missing)]\n│   ↓\n│   1691162726045728768 [2023-08-14] @__drewface 💜 2\n│   Confident x altruistic.\n│   \n│   The goal of a good society is to increase the number of blue voters until its 99%+\n├── 1691153174948716544 [2023-08-14] @sensefulronin 💜 2\n│   @__drewface Mass scale prisoner’s dilemma.\n│   We all just need to coordinate on one color.\n│   ↓\n│   1691153558123499520 [2023-08-14] @__drewface 💜 5\n│   @sensefulronin Only 51% need to coordinate on blue, actually.\n│   \n│   Whereas the equilibrium is for 100% to coordinate on red.\n│   \n│   But I think ppl intuit the improbability of perfect coordination, and then slam blue. Therefore, it's easier to just choose blue and have faith\n│   ↓\n│   1691154137700814848 [2023-08-14] @sensefulronin 💜 1\n│   @__drewface You’re also trying to aim for a half + 1 result, which I also find to be insane.\n│   \n│   Is this democracy? 🦋\n│   ↓\n│   1691156205320728576 [2023-08-14] @__drewface 💜 2\n│   @sensefulronin This is god-fearin', good ol' fashioned, 'merican democracy\n│   ↓\n│   1691158843638587392 [2023-08-14] @sensefulronin 💜 1\n│   @__drewface Blue God sounds more fun than Godless Red Game Theory, I’ll give you that.\n│   ↓\n│   1691159808320184320 [2023-08-14] @__drewface 💜 1\n│   @sensefulronin I like it over here, at least\n├── 1691153978757627905 [2023-08-14] @yashkaf 💜 11\n│   @__drewface their take is basically \"in my imaginary world where human altruism doesn't exist and everyone is maximally selfish it would be bad and selfish to pick blue\" which is darkly funny\n│   ↓\n│   1691157249593335809 [2023-08-14] @__drewface 💜 5\n│   @yashkaf Your aesthetic addiction to being Kind may have saved humanity for today, but I'll FORCE YOU TO SACRIFICE PEOPLE ONE DAY. YOU CAN'T KEEP GETT--\n│   \n│   *anon is dragged off stage left*\n└── 1691188779120492544 [2023-08-14] @eshear 💜 3\n    @__drewface And even if it’s not the majority, obviously it will be a substantial minority, making red-pickers predictable mass murderers if their choice ever matters.\n\n===\n\n1691075753209909251 [2023-08-14] @abhayance 💜 2 [(SEED) type=quote_of_root]\namazing case study in the power of framing - take the poll first and then read my next reply where I suggest a reframe that would render the rationalist inference trivially accessible https://t.co/JiWnNdA6jf\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691075869270544384 [2023-08-14] @abhayance 💜 2\n- if you take the red pill, you will live- if you take the blue pill, you might die\n├── 1691077979525234688 [2023-08-14] @abhayance 💜 1\n│   BTW I chose blue because I predicted like 40-50% would too and would prefer they don’t die (and hoped another 10% would feel the same way)\n└── 1863434273950142815 [2024-12-02] @abhayance \n    backlinks https://t.co/nRu9AqoRh5\n      [Quoting Tweet 1861766901178712460 (missing)]\n\n===\n\n1691079769155145730 [2023-08-14] @peakexperiments 💜 7 [(SEED) type=quote_of_root]\nI *think* blue is the better move here but it's funny to me to see blues express anger at reds. Like are you the better man or not? Reds expressing exasperation at blues makes more sense to me, \"bro wtf are you doing???\" https://t.co/WdoXUbHBsq\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691094203915509761 [2023-08-14] @peakexperiments 💜 1\nHonestly though, if I'm going by this standard, speaking only for myself I must vote red. https://t.co/Gn1t5BPYRd\n  [Quoting Tweet 1598496449456898048 (missing)]\n↓\n1691135007799103495 [2023-08-14] @peakexperiments \nhttps://t.co/OqMmG6NMkI\n  [Quoting Tweet 1691108374920704001 (missing)]\n\n===\n\n1691087467347075072 [2023-08-14] @aleksil79 💜 9 🔁 1 [(SEED) type=quote_of_root]\nbehold, a scissor poll\n\nthis 12yo will make the world tremble https://t.co/ga5VTWXov3\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691089665552523264 [2023-08-14] @chercher_ai 💜 18 [(SEED) type=quote_of_root]\nBlue, because life is neither a game nor a theory https://t.co/FaBfEEYHWQ\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691090606443962368 [2023-08-14] @chercher_ai 💜 5\nBut really this is just a marketing problem. Give each side a billion dollar ad budget, I'm sure they'll reach a satisfactory conclusion for everybody\n↓\n1691091544424759296 [2023-08-14] @chercher_ai 💜 4\nbut also\nhttps://t.co/7CW3tIJk3I\n  [Quoting @chercher_ai: @lisatomic5 simply don't vote and you're safe, since only people who vote are at risk to begin with]\n\n===\n\n1691110012901580800 [2023-08-14] @strangestloop 💜 88 🔁 3 💬 2 [(SEED) type=semantic_search]\nPoll question:\n\nEveryone responding to this poll chooses between a blue pill or red pill.\n\n- if you choose blue pill you signal compassion\n- if you choose red pill you signal intelligence\n\nWhich do you choose?\n├── 1691124640494637066 [2023-08-14] @aleksil79 💜 4\n│   @strangestloop wait, the red pill is for people who need to *signal* intelligence?\n├── 1691268478827737090 [2023-08-15] @strangestloop  [(SEED) type=quote_of_root]\n│   https://t.co/XzWPqHSEBL\n│     [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n└── 1691274790861209600 [2023-08-15] @pachabelcanon \n    @strangestloop in some sense i value my intelligence more than kindness but i'd take the bluepill\n\n===\n\n1691111038287327233 [2023-08-14] @eshear 💜 43 💬 1 [(SEED) type=quote_of_root]\nA really good poll, worth pondering, There are two equilibria. One is safer against minority mistakes/defection, one is safer against the majority turning on you. https://t.co/TFSan7wJdh\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691131773336555520 [2023-08-14] @eshear 💜 11\nThe poll is a test: are you more concerned about the Revolution, or are you more concerned about marginal individual suffering?\n\n===\n\n1691114728784031744 [2023-08-14] @uberstuber 💜 10\n“you must vote blue to save the blues” https://t.co/NmqldoByrQ\nImages:\n  - [Image #0] The image depicts a painting of a man standing among a group of older men, with the caption \"you must vote blue to save the blues\" and a link to the image.\n    \n    The painting is titled \"The County Election\" by Norman Rockwell. It features a young man standing in the center, wearing a blue plaid shirt and a brown jacket, surrounded by older men seated at a table. The man is looking up, while the older men are gazing at him with various expressions. The background of the painting is dark, with a white wall visible on the left side.\n    \n    **Key Elements:**\n    \n    *   A young man standing in the center\n    *   Older men seated at a table surrounding him\n    *   Dark background with a white wall on the left side\n    \n    **Relevant Details:**\n    \n    *   The young man is wearing a blue plaid shirt and a brown jacket.\n    *   The older men are dressed in formal attire, including suits and ties.\n    *   The atmosphere appears to be one of seriousness and contemplation.\n    \n    **Overall Impression:**\n    \n    The image conveys a sense of importance and gravity, as if the young man's presence is significant to the older men gathered around him. The caption suggests that the image is being used to promote a political message, specifically encouraging viewers to vote for Democratic candidates (represented by the color blue).\n↓\n1691114955821690880 [2023-08-14] @uberstuber 💜 1 [(SEED) type=quote_of_root]\nhttps://t.co/hnBszj2Pcj\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691115101380919296 [2023-08-14] @uberstuber  [(SEED) type=quote_of_semantic_search]\nhttps://t.co/1AIcFLd9E6\n  [Quoting @strangestloop: Poll question:  Everyone responding to this poll chooses between a blue pill or red pill.  - if you choose blue pill you signal compassion - if you choose red pill you signal intelligence  Which do you choose?]\n\n===\n\n1691116232995635200 [2023-08-14] @slimepriestess 💜 28 🔁 2 [(SEED) type=semantic_search]\nEveryone responding to this poll chooses between a blue pill or red pill.\n\n- choose blue pill to live, if &gt; 50% of ppl choose blue pill, everyone lives\n- choose red pill to die immediately, if &gt; 50% of ppl choose red pill, everyone dies\n\nwHiCh Do YoU cHoOsE?\n\n===\n\n1691118266775916544 [2023-08-14] @mechanical_monk 💜 28 🔁 1 💬 1 [(SEED) type=semantic_search]\npoll question\n\neveryone responding to this poll chooses between a blue pill or red pill\n\n- if &lt;50 % of ppl choose blue pill, blue dies\n- red always lives\n\nwhich do you choose?\n\nAND\n\nhave you seen the results of lisa's original poll that this one is based on?\n↓\n1691483474643791872 [2023-08-15] @mechanical_monk 💜 6\n47.5 % of you are dead\n\ngood job team\n↓\n1691483719066955786 [2023-08-15] @mechanical_monk 💜 7\nwhat i don't understand about the results is that among those who *have* seen lisa's poll, my poll gets way more red\n\nsurely my followers are not so different from lisa's\n\nhave ppl changed from blue to red??\n\nif you voted blue in lisa's poll and THEN red in mine, pls comment why\n↓\n1691663793980428647 [2023-08-16] @strangestloop 💜 3\n@mechanical_monk less confidence in replication once more people digested the meta\n\n===\n\n1691127427156824065 [2023-08-14] @bashu_thanks 💜 185 🔁 4 [(SEED) type=quote_of_semantic_search]\nListen: In this world there are kind idiots, selfish idiots, kind smart people and selfish smart people\n\nwhat the pill poll truly reveals is: \"would you rather risk death to keep kind idiots alive? or have guaranteed survival alongside selfish idiots\" https://t.co/sbZneuoRIc\n  [Quoting @strangestloop: Poll question:  Everyone responding to this poll chooses between a blue pill or red pill.  - if you choose blue pill you signal compassion - if you choose red pill you signal intelligence  Which do you choose?]\n├── 1691151061954801664 [2023-08-14] @bashu_thanks 💜 36\n│   \"selfish\" is a really loaded word here. to expand on it:\n│   \n│   two types of 'selfish'\n│   \n│   Type 1 will pick Red because they simply don't give a shit about anybody else ever\n│   \n│   Type 2 will pick Red, bc they do care, but they value their survival over that of kind idiots\n│   ↓\n│   1691151303949352972 [2023-08-14] @bashu_thanks 💜 34 🔁 1\n│   It is not a moral failure to value your own survival over that of kind idiots\n│   ↓\n│   1691187418441846784 [2023-08-14] @bashu_thanks 💜 5\n│   note the three options here https://t.co/XojwzFzaPt\n│     [Quoting @eigenrobot: suppose the population subjected this poll is 95% people who have taken exactly one game theory course and 5% who are nice normal people who lead mostly-blameless lives  you vote]\n└── 1691189052190736384 [2023-08-14] @goblinodds 💜 41\n    @bashu_thanks or: the selfish people are gonna survive regardless, do you want to risk ceding the world entirely to them in a gamble to save kind people?\n    ↓\n    1691189309003411457 [2023-08-14] @bashu_thanks 💜 11\n    @goblinodds god dammit odds\n    ↓\n    1691191448912191490 [2023-08-14] @bashu_thanks 💜 7\n    @goblinodds you're right\n    ↓\n    1691193408407375873 [2023-08-14] @goblinodds 💜 6\n    @bashu_thanks 🙃🙃🙃🙃\n    ↓\n    1691193591903764480 [2023-08-14] @bashu_thanks 💜 6\n    @goblinodds \"right but not happy about it\" is the vibe i'm getting\n    ↓\n    1691194619986612226 [2023-08-14] @goblinodds 💜 15\n    @bashu_thanks yeah this whole thing has me v much torn between \"i'd rather die a good idiot than live a smart asshole\" and \"it's evil to expect people to risk their lives to save others from their freely chosen bad decisions\" but today i'm leaning very much towards the latter\n\n===\n\n1691147789810700288 [2023-08-14] @tr_babb  [(SEED) type=quote_of_root]\nThis is the same game-theoretic decision as \"living in society\" https://t.co/7fwedfHyng\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691160129318633472 [2023-08-14] @yashkaf 💜 2027 🔁 133 [(SEED) type=quote_of_root]\nhttps://t.co/JQkjO3xWks https://t.co/JEvNukQPYy\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\nImages:\n  - [Image #0] The image is a meme that presents a bell curve graph with a caption and three characters. The graph is labeled \"IQ score\" on the x-axis, ranging from 55 to 145, and has no label on the y-axis.\n    \n    *   The caption above the graph reads: \"noooo you have to pick red altruism is a mental disease it's definitely all of humanity that is incapable of trust and cooperation and not my misanthropic red-picking ass\"\n    *   The graph is a blue bell curve, with the following percentages marked:\n        *   0.1% at the left and right extremes\n        *   2% at the second points from the extremes\n        *   14% at the third points from the extremes\n        *   34% at the fourth points from the extremes\n        *   68% at the center\n    *   Three characters are placed around the graph:\n        *   A crying character with glasses and brown hair is positioned above the center of the graph, with the text \"blue is the super-rational equilibrium under humanity's group-evolved altruism instinct\" to their right.\n        *   A character with a hoodie is placed to the right of the graph, with the text \"pik blue ppl are nice i like them\" above a character to the left of the graph.\n    *   The background of the image is white.\n    \n    The meme appears to be making a humorous commentary on the concept of altruism and its relation to intelligence, using a bell curve graph to illustrate the idea.\n├── 1691165110738272256 [2023-08-14] @yashkaf 💜 209 🔁 5\n│   https://t.co/bh3YufHoXO https://t.co/wSjrNpR7M8\n│     [Quoting Tweet 1691160612024553472 (missing)]\n│   Images:\n│     - [Image #0] The image is a meme that humorously illustrates the concept of game theory. To recreate this meme, follow these steps:\n│       \n│       1. **Background**: Start with a plain white background.\n│       2. **Main Elements**: Draw two large, clear containers (like jars or tumblers) with black lids. \n│       3. **Characters Inside the Containers**: Inside each container, depict two characters in a confrontational or argumentative posture, drawn in a simple black line style. \n│       4. **Character on Top**: On top of one of the containers, draw a character wearing a party hat, holding a cup, and looking down at the two characters inside the container with a smug or confident expression.\n│       5. **Text**: Place the text \"they don't know game theory\" next to the character on top, above the container. \n│       6. **Action**: Illustrate liquid (presumably from the cup held by the character on top) pouring into one container, causing the characters inside to react.\n│       \n│       By following these steps, you can recreate the meme, which humorously suggests that understanding game theory gives one an advantage or upper hand in interactions or conflicts, as depicted by the character on top who is \"outsmarting\" those inside the container.\n│   ↓\n│   1691170350040489984 [2023-08-14] @yashkaf 💜 207 🔁 6\n│   the right answer to each poll is to go with the majority: blue in a red world is suicide, red in a blue world is endangering everyone else\n│   \n│   if you think that different framings of this are \"the same game\" you need to have some decoupling knocked out of you\n│   https://t.co/EHUm6aMYwM\n│     [Quoting @RokoMijic: ok, one final poll.  There is a room-sized blender that kills everyone who steps into it.   But, if 50% or more of the people answering this poll step into the blender, there will be too much resistance and it will fail to start and everyone who steps in will be fine.   Obviously, if you don't step into the blender nothing bad can happen.  Do you step into the blender?]\n│   ↓\n│   1691184646141202432 [2023-08-14] @yashkaf 💜 145 🔁 7\n│   chimps live in a red world. it's certainly a stable equilibrium!\n│   \n│   but all of *human* civilization is pretty much about collectively crafting contexts where a blue-majority is possible, and this includes ostracizing \"red no matter the context\" assholes\n│   https://t.co/ptsAftcZSe\n│     [Quoting Tweet 1690305655532302336 (missing)]\n│   ↓\n│   1691188345508884481 [2023-08-14] @yashkaf 💜 131 🔁 1\n│   it's neither here nor there but I did study graduate level game theory under a Nobel laureate in the field\n│   \n│   modeling coalition games with messaging errors and incomplete information gets a lot more interesting than rehashing prisoner's dilemma 101\n│   https://t.co/OvyYNwhZmf\n│     [Quoting Tweet 1691186987254812673 (missing)]\n│   ↓\n│   1691230866578845696 [2023-08-14] @yashkaf 💜 77 🔁 1\n│   a great exercise is to try and get the correct majority answer in each configuration of this poll people have come up with today\n│   \n│   it's requires good meta-rationality: using rationality to determine how much to rely on rationalist calculation and how much on intuition in each case https://t.co/Aun40Q6AUu\n│   Images:\n│     - [Image #0] The image shows a screenshot of four different polls with varying vote counts and results. \n│       \n│       To recreate the image, create four horizontal bar charts with dark blue backgrounds and white text. The charts should display the following information:\n│       \n│       * Chart 1: \n│         - Blue (64.7%, selected)\n│         - Red (35.3%)\n│         - 51,681 votes, 2 hours left\n│       * Chart 2: \n│         - Yes - step into blender (21.5%)\n│         - No! (78.5%, selected)\n│         - 7,161 votes, 14 hours left\n│       * Chart 3: \n│         - Red pill (82.3%, selected)\n│         - Blue pill (17.7%)\n│         - 345 votes, 19 hours left\n│       * Chart 4: \n│         - red (35.1%)\n│         - blue (64.9%, selected)\n│         - 2,436 votes, 18 hours left\n│       \n│       The charts should be stacked vertically, with a thin white border separating them.\n│   ↓\n│   1691485251988582400 [2023-08-15] @yashkaf 💜 59\n│   everyone will not just\n│   https://t.co/sbksz2xAzp\n│     [Quoting @panchromaticity: @NathanpmYoung not universally applicable, but it feels relevant here https://t.co/MuxumGwHyW]\n└── 1691181559406055425 [2023-08-14] @bashu_thanks 💜 4\n    @yashkaf I really think presenting this as just one axis (intelligence) is missing out on the other axis (selfishness, which is not necessarily negative) https://t.co/WfBTNPkxTH\n      [Quoting @bashu_thanks: Listen: In this world there are kind idiots, selfish idiots, kind smart people and selfish smart people  what the pill poll truly reveals is: \"would you rather risk death to keep kind idiots alive? or have guaranteed survival alongside selfish idiots\" https://t.co/sbZneuoRIc]\n\n===\n\n1691161771325661184 [2023-08-14] @imperialauditor 💜 13\nthis poll series is an amazing scissor and has very interesting implications \n\nI can't decide whether if more horrified or impressed by the original results https://t.co/pEEdk04AIU\n  [Quoting @eshear: A really good poll, worth pondering, There are two equilibria. One is safer against minority mistakes/defection, one is safer against the majority turning on you. https://t.co/TFSan7wJdh]\n↓\n1691161773678764032 [2023-08-14] @imperialauditor 💜 3\nhttps://t.co/khEUqvfqJ7\n  [Quoting Tweet 1691053189506945024 (missing)]\n↓\n1691161996782145536 [2023-08-14] @imperialauditor 💜 4\nhttps://t.co/RTeWMPQOhm\n  [Quoting @imperialauditor: @maybegray @quotidiania yeah I'm confused by anyone who picks blue - it seems like a very top-down high modernist mindset -  everyone individually deciding they want to be sure to live gets you an ideal outcome so why would you struggle to coordinate another?]\n↓\n1691162544549892096 [2023-08-14] @imperialauditor 💜 5\nI get very different results if I think about what is the snap judgement pick vs what is picked after people have time to think about the flows between stable and unstable equilibria\n↓\n1691162718311477248 [2023-08-14] @imperialauditor 💜 1\nhas anyone done the 2x2 with political leaning yet?\n↓\n1691163494786256897 [2023-08-14] @imperialauditor 💜 5\nwith my zvi/hanson hat on I'd say the problem with red is that it doesn't let you signal compassion in the properly costly way\nhttps://t.co/31oBwzkxgN\n  [Quoting Tweet 1691162845986328582 (missing)]\n↓\n1691164363581722628 [2023-08-14] @imperialauditor 💜 2\nforced to choose blue here because the wording makes @eshear 's second equilibrium (\"worry about the majority turning on you\") much more salient \nhttps://t.co/j02QrVSR39\n  [Quoting Tweet 1691130878972383238 (missing)]\n↓\n1691172770955116545 [2023-08-14] @imperialauditor 💜 1\nhttps://t.co/62KPybdle6\n  [Quoting @lillybilly299: Everyone else is having a take so I'm gonna have one too: this is not a compassion vs rationality problem, it's a coordination problem. Blue is the correct choice cus it only requires 50% (not 100%) of people to coordinate for everyone to live]\n↓\n1691175828447522816 [2023-08-14] @imperialauditor \nhttps://t.co/FsNoNP7JiO\n  [Quoting @imperialauditor: @goblinodds @markjaquith @lisatomic5 yeah I think this is a great illustration of @literalbanana 's point that surveys are hugely affected by the exact wording https://t.co/OQjSjvkhON]\n↓\n1691197767769600000 [2023-08-14] @imperialauditor 💜 2\nhttps://t.co/AumMXmttpO\n  [Quoting Tweet 1691168969799962624 (missing)]\n↓\n1691206161570103296 [2023-08-14] @imperialauditor 💜 3 [(SEED) type=quote_of_semantic_search]\nmy new theory: we’ve replicated behav econ status quo bias results\n\nframe as “everyone is going to die unless we do something” then blue makes sense\n\nframe as “do you wanna put yourself in harm’s way but it’s optional” then red makes sense\nhttps://t.co/Jc8SSLyr9a\n  [Quoting @mechanical_monk: poll question  everyone responding to this poll chooses between a blue pill or red pill  - if &lt;50 % of ppl choose blue pill, blue dies - red always lives  which do you choose?  AND  have you seen the results of lisa's original poll that this one is based on?]\n↓\n1691314866655506432 [2023-08-15] @imperialauditor 💜 4\nframing effects rule everything around me\nhttps://t.co/U6lBu7Yh58\n  [Quoting Tweet 1691108374920704001 (missing)]\n\n===\n\n1691191618919976960 [2023-08-14] @AaronBergman18 💜 1 [(SEED) type=quote_of_root]\nWe must find the equilibrium point\n\n- if &gt; 80% of ppl choose blue pill, everyone lives\n- if not, red pills live and blue pills die\n\nPoll below https://t.co/08Vkr2WccK\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691191621428170753 [2023-08-14] @AaronBergman18  [(SEED) type=semantic_search]\nReiterating in case of QT\n\n- if &gt; 80% of ppl choose blue pill, everyone lives\n- if not, red pills live and blue pills die\n\n===\n\n1691197429750587392 [2023-08-14] @easoncxz 💜 3 [(SEED) type=quote_of_root]\nI mean c'mon y'all \"Rationalist\" thinkbois all trying to say vote Red -- why have I still not seen a graph with \"proportion of deaths\" as Y axis and \"vote outcome\" as X axis? 🥱 https://t.co/uFluce3DAF\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691199808500092928 [2023-08-14] @danallison 💜 5 [(SEED) type=quote_of_root]\nPersonally speaking, I would rather die than live with the knowledge that I killed a bunch of people just to ensure my own safety. https://t.co/RMu6DmMQQ1\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691268687658115073 [2023-08-15] @danallison 💜 1\nhow I see it https://t.co/IG0FODxNro\n  [Quoting @danallison: @RokoMijic @lisatomic5 If I vote blue, at most 1 person could die as a result of my decision (me). If I vote red, potentially many people will die as a result.]\n↓\n1691596647497888026 [2023-08-15] @danallison 💜 1\nOk I think I figured it out the crux.Choose blue = risk your own life for the safety of othersChoose red = risk others’ lives for your own safetyBut it seems like many people believe that choosing the selfish path isn’t selfish if the option is equally available to everyone\n↓\n1691648322338222158 [2023-08-16] @danallison 💜 2\nAlright I’m done talking about this. This  whole thing got me so worked up, way more than I would have expected. Definitely a learning experience but I might need to take a break from Twitter for a while.\n↓\n1693328488860926177 [2023-08-20] @danallison 💜 3\nNoting this here for future reference. Interesting twist on game theory dynamics by introducing the concept of split and merge on top of cooperate and defect. From @drmichaellevin https://t.co/FllIwnevh7\n\n===\n\n1691204627675693056 [2023-08-14] @_ceee_  [(SEED) type=quote_of_root]\nif it was worded another way, red would easily win. People don't really use all the logic that \"but red is objectively better\" people think they do:\"- If you choose red, you survive- If you choose blue, you survive if &gt;50% of the people choose blue\" https://t.co/YOA0qc2eJV\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691216278466207745 [2023-08-14] @easoncxz  [(SEED) type=semantic_search]\nEveryone responding to this poll chooses between a blue pill or red pill.\n\n- if &gt; 50% of ppl choose blue pill, everyone lives\n- if not, red pills live and blue pills die\n\nWhich do you choose? | What's your best-approximate gender?\n\n===\n\n1691229774608261121 [2023-08-14] @powerfultakes 💜 13 🔁 3 [(SEED) type=semantic_search]\nEveryone in this poll is offered a blue pill or a red pill.  \n\nWhichever group is bigger gets to live, while those who picked the less popular choice get fed into a blender.  \n\nWhich do you choose?\n\n===\n\n1691266928734875649 [2023-08-15] @VivaLaPanda 💜 15 [(SEED) type=quote_of_root]\nRedcells seething as bluechads simply have confidence in the divine goodness of man https://t.co/ytDWGKy4s1\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691287411496812544 [2023-08-15] @tnorthcutt 💜 3 [(SEED) type=quote_of_root]\nI would simply Do The Right Thing https://t.co/WDuwJYNYLo\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691305557032845312 [2023-08-15] @Malcolm_Ocean 💜 57 🔁 1 [(SEED) type=quote_of_root]\nI would not be stoked to be left in a world with only the people who chose red\n\nhttps://t.co/geBMHQI7HW\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n├── 1691314092299186176 [2023-08-15] @visakanv 💜 7\n│   @Malcolm_Ocean same\n└── 1691548349567021056 [2023-08-15] @Malcolm_Ocean 💜 1\n    https://t.co/Rci74XaIUF\n      [Quoting @Malcolm_Ocean: @Apothegmata To be clear, I ALSO would not want to be stuck in a world with only the people who choose blue in the original poll—then I'd be missing lots of lovely people who paid close attention to the payoff matrix and hoped everybody else they cared about would too. https://t.co/KWTk659wne]\n\n===\n\n1691424852794613761 [2023-08-15] @xsphi 💜 342 🔁 25 💬 1 [(SEED) type=semantic_search]\nif majority red, everyone dies\n\nif majority blue, only the blue pillers die\n\nyou vote\n├── 1691495743595634689 [2023-08-15] @eshear 💜 41\n│   @xsphi Wtg team good job, close to perfectly optimal https://t.co/bXgME7ezkW\n│   Images:\n│     - [Image #0] The image is a screenshot of a tweet featuring a poll. The tweet, posted by the user \"tess took the blue pill\" (@xsphi), presents a poll with two options: \"red\" and \"blue.\" The poll's question is \"if majority red, everyone dies / if majority blue, only the blue pillers die / you vote.\" \n│       \n│       To recreate this image, follow these steps:\n│       \n│       * Create a white background.\n│       * At the top left, include a circular profile picture of a cartoon character with black hair, blue eyes, and a black shirt, giving a peace sign with their hand.\n│       * Next to the profile picture, display the username \"tess took the blue pill\" and the handle \"@xsphi\" in black text, followed by \"4h\" in gray text, indicating the post's age.\n│       * Below the username, show the poll's question in black text: \"if majority red, everyone dies / if majority blue, only the blue pillers die / you vote.\"\n│       * Present two gray boxes with rounded corners, labeled \"red\" and \"blue,\" representing the poll options. The \"blue\" option should have a checkmark.\n│       * Display the current vote count and percentages: 47% for \"red\" and 53% for \"blue.\"\n│       * At the bottom, show the total number of votes (158) and the time remaining for the poll (19 hours 19 minutes).\n│       * Include engagement metrics: 4 comments, 2 retweets, 32 likes, and 904 views.\n│       * Ensure the overall design matches the original image, with a clean and simple layout.\n│       \n│       The resulting image should be a faithful reproduction of the original tweet, capturing its content and design.\n│   ↓\n│   1691519727120617473 [2023-08-15] @PrinceVogel 💜 20\n│   @eshear @xsphi We can win this thing and bring the system down https://t.co/vedAQm8IIO\n│   Images:\n│     - [Image #0] The image shows a screenshot of a poll on a social media platform, likely Twitter, with a dark blue background and white text. The poll is titled \"if majority red, everyone dies\" and \"if majority blue, only the blue pillers die.\" \n│       \n│       To recreate this image, start by setting the background to dark blue. Then, add the title in white text at the top, followed by the poll options. The poll has two options: \"red\" and \"blue,\" with a checkbox next to each. The \"red\" option is currently selected, indicated by a checkmark.\n│       \n│       Below the poll options, display the current vote count and percentage for each option. The image shows 49% for \"red\" and 51% for \"blue.\" Include the total number of votes (355) and the time remaining for the poll (17 hours 43 minutes).\n│       \n│       At the bottom of the image, provide the timestamp (8:21 AM, 15 Aug 23), the number of views (2,212), and the engagement metrics (4 Reposts, 6 Quotes, 69 Likes, 7 Bookmarks).\n│   ↓\n│   1691523950809907200 [2023-08-15] @pepijndevos 💜 4\n│   @PrinceVogel @eshear @xsphi Go back go back https://t.co/PZ23pvHFUY\n│   Images:\n│     - [Image #0] The image is a screenshot of a Twitter poll. The text is as follows:\n│       \n│       \"tess took the blue pill\n│       @xsphi\n│       if majority red, everyone dies\n│       if majority blue, only the blue pillers die\n│       you vote\n│       red - 52%\n│       blue - 48%\n│       432 votes · 17 hours 26 minutes left\n│       14:21 · 15 Aug 23 · 3,011 Views\"\n│       \n│       To recreate this image, you would need to create a Twitter poll with the given text and options, and display the current vote count and time remaining. The poll has two options: \"red\" and \"blue\", with \"red\" currently leading at 52% and \"blue\" at 48%. The poll has received 432 votes and has 17 hours and 26 minutes remaining.\n│   ↓\n│   1691524287901949952 [2023-08-15] @PrinceVogel 💜 6\n│   @pepijndevos @eshear @xsphi I just want us to nail 50% and unlock the secret ending\n│   ↓\n│   1691524977244139520 [2023-08-15] @pepijndevos 💜 2\n│   @PrinceVogel @eshear @xsphi I know a way https://t.co/iSGVmgU287\n│     [Quoting @pepijndevos: Perfectly balanced, as all things should be https://t.co/ZuwULjfIIn]\n├── 1691574008435605645 [2023-08-15] @PrinceVogel 💜 15\n│   @xsphi We're so close. True 50/50. No one has to die, my friends https://t.co/70FkZgF5Ax\n│   Images:\n│     - [Image #0] To recreate the image, start by creating a dark background. \n│       #### Text\n│       * At the top, include the author's name \"tess took the blue pill\" and their Twitter handle \"@xsphi\".\n│       * Write the main text: \n│         * \"if majority red, everyone dies\"\n│         * \"if majority blue, only the blue pillers die\"\n│         * \"you vote\"\n│       * Below the main text, display the voting results with two colored options: \n│         * \"red\" with 52% and a checkmark\n│         * \"blue\" with 48%\n│       * Include the total number of votes and time left: \"1,832 votes • 14 hours 7 minutes left\"\n│       * Add the timestamp: \"8:21 AM • 15 Aug 23\" and \"12.3K Views\"\n│       #### Statistics\n│       * Below the timestamp, display the engagement statistics: \n│         * \"13 Reposts\"\n│         * \"15 Quotes\"\n│         * \"203 Likes\"\n│         * \"20 Bookmarks\"\n│       #### Icons\n│       * At the bottom, include the Twitter interaction icons: \n│         * A speech bubble\n│         * A curved arrow for reposting\n│         * A heart for liking\n│         * A flag for bookmarking\n│         * A share icon\n└── 1691611739178025128 [2023-08-16] @PrinceVogel 💜 2\n    @xsphi Very close my friends keep it up https://t.co/m2T4lWAOH3\n    Images:\n      - [Image #0] The image is a screenshot of a tweet by \"tess took the blue pill\" (@xsphi). To recreate this image, start with a dark blue background. \n        \n        The tweet is structured as follows:\n        * The username \"tess took the blue pill\" is displayed, accompanied by the handle \"@xsphi\".\n        * The main text reads: \n          \"if majority red, everyone dies\n          if majority blue, only the blue pillers die\n          you vote\"\n        * Below the text, there are two voting options:\n          \"red\" with a checkmark, showing 51%\n          \"blue\" without a checkmark, showing 49%\n        * The poll details are displayed: \n          \"2,589 votes · 11 hours 37 minutes left\"\n        * The tweet's timestamp is shown: \n          \"8:21 AM · 15 Aug 23 · 18K Views\"\n        * The engagement metrics are listed: \n          \"18 Reposts 17 Quotes 259 Likes 26 Bookmarks\"\n        \n        To recreate this image, include all the mentioned elements, with the same text, percentages, and engagement numbers.\n\n===\n\n1691499622865211392 [2023-08-15] @Malcolm_Ocean 💜 18 🔁 1 [(SEED) type=semantic_search]\nEveryone responding to this poll chooses between a green pill or yellow pill.\n\n🟢 If you pick green, you live no matter what.\n🟡 If you pick yellow, you die unless 50% of other people pick yellow.\n\nWhich do you choose?\n\n===\n\n1691499810556428288 [2023-08-15] @_ceee_  [(SEED) type=quote_of_root]\nI love all the discourse that this caused because Blue won and everyone survived, but people are still having a meltdown about it https://t.co/YOA0qc2eJV\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691548590420758528 [2023-08-15] @Malcolm_Ocean 💜 35 🔁 3 [(SEED) type=quote_of_root]\nseems to me that blue is a great choice in the original poll as framed even though there are many variants (in wording or outcome) in which red is a better choice.\n\nhad fun playing with some alternate framings. my thought process in thread\nhttps://t.co/geBMHQI7HW\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n├── 1691548592119353344 [2023-08-15] @Malcolm_Ocean 💜 12\n│   this tweet highlighted for me the way in which this *isn't* a collective action problem\n│   \n│   at least not the way a classic stag hunt is, where there's a huge gain from cooperating but if even one person doesn't then cooperators suffer while defectors do okay\n│   https://t.co/FXzkIDF51f\n│     [Quoting Tweet 1691213297662464001 (missing)]\n│   ↓\n│   1691548596015898625 [2023-08-15] @Malcolm_Ocean 💜 19\n│   I think the impetus to choose blue comes from pattern-matching from other situations / thought experiments, in which literally anybody MUST blue\n│   \n│   original phrasing:\n│   - if &gt; 50% of ppl choose blue pill, everyone lives\n│   - if not, red pills live and blue pills die\n│   ↓\n│   1691548597089656832 [2023-08-15] @Malcolm_Ocean 💜 23\n│   on some reflection, it seems very likely to me that this is caused in large part by the phrases \"everyone lives\" and \"blue pills die\". maybe also by the ordering.\n│   \n│   it's rare for a thought experiment to have an option labeled \"everyone lives\" but there's another way all can live\n│   ↓\n│   1691548598213677057 [2023-08-15] @Malcolm_Ocean 💜 17\n│   ooooh also by the framing of \"red pills\" and \"blue pills\". there's a kind of identity thing. you see the \"everyone lives\" option. you want to pick it, because of course everyone living is good. but then you see \"oh no, but if enough people are selfish assholes, I'll die\"\n│   ↓\n│   1691548599425876421 [2023-08-15] @Malcolm_Ocean 💜 30 [(SEED) type=quote_of_semantic_search]\n│   this poll is probably a BRILLIANT way to study framing effects.\n│   \n│   this version (exact same outcomes!)\n│   - highlights the individual payoffs better\n│   - points out that people choosing blue/yellow are risking their own lives\n│   - makes red/green the \"simple\" option\n│   https://t.co/MQ3GfskXgH\n│     [Quoting @Malcolm_Ocean: Everyone responding to this poll chooses between a green pill or yellow pill.  🟢 If you pick green, you live no matter what. 🟡 If you pick yellow, you die unless 50% of other people pick yellow.  Which do you choose?]\n│   ↓\n│   1691548601703378946 [2023-08-15] @Malcolm_Ocean 💜 18 🔁 1\n│   and here's an even more over-the-top attempt—still getting a lot of pact folks. it seems plausible to me that there's a way to frame this that could get 100% of non-suicidal people picking the \"I just live\" option\n│   \n│   https://t.co/CJkzbuL37X\n│     [Quoting @Malcolm_Ocean: Everyone responding to this poll chooses between a brown pill or purple pill  Nobody has to die, but if you want to try, you can pick brown 🟤, in which case you get to die, unless &gt;50% of people want to die, in which case too bad you don't get to 🤷‍♀️  Which do you choose?]\n│   ↓\n│   1691548603045535744 [2023-08-15] @Malcolm_Ocean 💜 13\n│   here's a way to frame it so the prosocial/nonviolent option feels like the one that was originally labeled \"red pill\" and looked very violent\n│   \n│   https://t.co/wR15htFpah\n│     [Quoting @Malcolm_Ocean: Everyone responding to this poll chooses between building a bomb and living a peaceful life.  If &gt;50% of people build a bomb, nobody's bombs will go off.  Otherwise, everybody who built a bomb dies when their bomb explodes.  Which do you choose?]\n│   ↓\n│   1691548604597411841 [2023-08-15] @Malcolm_Ocean 💜 11\n│   This one got WAY longer than expected 😂\n│   \n│   I legit don't know what lizardman's constant is going to be on it, but in an important sense if the stakes were real (not thought experiment) this one (same structure!) should drive \"blue pill\" to zero.\n│   https://t.co/vqTful6Wem\n│     [Quoting @Malcolm_Ocean: If you don't want to read about a stupid risky convoluted harebrained scheme, press the \"nah\" option below &amp; keep scrolling.  Seriously, no pressure. It wasn't my idea. I'm not going to be doing it. I expect most people will nope out of it, before or after reading about it.  To…]\n│   ↓\n│   1691548607176986624 [2023-08-15] @Malcolm_Ocean 💜 13\n│   I think in most real situations that look at all like this, either the choice is so obvious that it doesn't look like a choice, or it is an actual tragedy of the commons ish where a minimum number of people must take some risk or loss in order for things to work out for everyone\n│   ↓\n│   1691548608233910272 [2023-08-15] @Malcolm_Ocean 💜 14\n│   and thus people happily vote blue if it seems like there's a good chance for others to vote blue, because the \"everybody lives\" option seems simple and good, whereas the other one is messy and bad\n│   \n│   https://t.co/IUuy0WGUOh\n│     [Quoting Tweet 1691512657667362817 (missing)]\n│   ↓\n│   1691548609571946496 [2023-08-15] @Malcolm_Ocean 💜 19\n│   but once the requirement is much above 50% I feel like people voting blue would actually probably start being kind of afraid, and that fear is an ACCURATE sign to look harder at the situation and see if there's a better solution\n│   \n│   https://t.co/4dzKmfzljJ\n│     [Quoting @exgenesis: this is the important bit of the pill discourse https://t.co/oLizfm81PN]\n│   ↓\n│   1691548611249631233 [2023-08-15] @Malcolm_Ocean 💜 14\n│   all of the new poll numbers are of course absurdly suspect now, since the power of the framing effects goes away in a context where people have been discussing the choices in question, have already made several, and are primed to think about framing effects\n│   ↓\n│   1691548613170622464 [2023-08-15] @Malcolm_Ocean 💜 16\n│   I seriously think that psychologists studying framing effects could get a good paper out of variations on this one\n│   \n│   plus maybe studying the extent to which people can see both:\n│   - that the structure is technically the same\n│   - that framing matters since it affects odds of mistakes\n│   ↓\n│   1691548614290448384 [2023-08-15] @Malcolm_Ocean 💜 12\n│   contra Roko, coordination is not just usually but *necessarily* achieved by shared meaning-making, specifically by framing choices\n│   \n│   leadership in practice involves achieving stag-hunt-like results by creating a shared meaning-interface with the world where cooperating is obvious\n│   ↓\n│   1691548615397830656 [2023-08-15] @Malcolm_Ocean 💜 14\n│   also, while I'm saying the obvious: even more so than most thought experiments, this is a STUPID scenario as exactly framed. \n│   \n│   most people who aren't decoupling so hard assume they are being given a choice that isn't stupid, which suggests there might be a reason to coordinate\n│   ↓\n│   1691548616563757058 [2023-08-15] @Malcolm_Ocean 💜 15\n│   put another way, if you're assuming relevance (which linguists note is necessary to have collaborative conversations at all) then literally the only reason to even ASK this question IS for the purpose of running a coordination fire drill! and we passed! and this was a speech act\n│   ↓\n│   1691548617604059137 [2023-08-15] @Malcolm_Ocean 💜 12\n│   some would counter with: the actual reason here is for running a virtue-signalling trap, that will make people naively trust others around here\n│   \n│   but like, I think in the grand scheme of things people are already naively trusting for many other reasons and this doesn't matter.\n│   ↓\n│   1691548618698735666 [2023-08-15] @Malcolm_Ocean 💜 11\n│   anyway, thank you for coming to my TED talk, this was a wild ride today and I am gonna go. offline. now.\n│   ↓\n│   1691813536727490616 [2023-08-16] @Malcolm_Ocean 💜 6 [(SEED) type=quote_of_semantic_search]\n│   New experiment. My guess is that many people who answered blue in the original implicitly may have been adding some noise like this one explicitly adds.\n│   \n│   (a different way to frame this scenario below is that 1% of people get the opposite color they pick)\n│   https://t.co/kvKNmhgvHI\n│     [Quoting @Malcolm_Ocean: Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt;50% of ppl choose blue pill, everyone lives - if not, 99% of red pills live and 99% of blue pills die (randomly)  Which do you choose?]\n│   ├── 1691822006574907883 [2023-08-16] @aleksil79 💜 5\n│   │   @Malcolm_Ocean hard to tease out the memory from under layers of Discourse but I *think* there was a nonverbal flash of \"blue\"-&gt;\"theres no reason to-\"-&gt;\"it's nonobvious\"-&gt;\"*sigh* blue\" before pushing the button\n│   │   ├── 1691825665132163450 [2023-08-16] @Malcolm_Ocean 💜 3\n│   │   │   @aleksil79 Haha amazing. \n│   │   │   \n│   │   │   Huh, for some reason it makes me think that it would be cool to do a version where you somehow show people different versions of the poll, and in at least some of the versions you let people know that others are going to be shown different versions 😵‍💫\n│   │   │   ↓\n│   │   │   1691837341915066583 [2023-08-16] @aleksil79 💜 3\n│   │   │   @Malcolm_Ocean augh, there are more variations than there are naive populations on the planet, even if you managed to prevent the ideas from leaking\n│   │   │   ↓\n│   │   │   1691845307066200265 [2023-08-16] @Malcolm_Ocean 💜 2\n│   │   │   @aleksil79 .....fuck, true.\n│   │   │   \n│   │   │   maybe we'll have to just play it all out in reality\n│   │   │   ↓\n│   │   │   1691845591498731751 [2023-08-16] @aleksil79 💜 2\n│   │   │   @Malcolm_Ocean as is tradition\n│   │   │   ↓\n│   │   │   1691854776047206854 [2023-08-16] @Malcolm_Ocean 💜 2\n│   │   │   @aleksil79 hahaha\n│   │   └── 1691842602868654358 [2023-08-16] @slimepriestess 💜 2\n│   │       @aleksil79 @Malcolm_Ocean I picked blue pretty quickly, then spent a while thinking about it, thought \"wait i got played\" went back through it, argued with people most of yesterday, and finally settled on \"no, blue was actually the right call\"\n│   └── 1691861784859210172 [2023-08-16] @Malcolm_Ocean 💜 1\n│       ^ so far the above one is the only experiment of mine that changes what the buttons actually do as opposed to just changing the framing\n│       \n│       here's an alternative wordy one, emphasizing defaults and how convoluted options are often bad\n│       https://t.co/Ek1hsroXPQ\n│         [Quoting @Malcolm_Ocean: If you don't feel like reading a long thought experiment, or you're tired of the recent poll discourse, or whatever, just hit the \"nah\" option and move along.  If you want to stare at game theory and think about framing effects, keep reading.  Okay, so I did a long rambly post…]\n│       ↓\n│       1691862161252069813 [2023-08-16] @Malcolm_Ocean 💜 2\n│       I tried this one, and the converse (in thread), as a different way to explore defaults, but it's very hard to tell what they imply, especially given the actual lack of stakes and lizardman's constant and unclarity about what twitter counts as a \"view\"\n│       \n│       https://t.co/TjcuR1EGt5\n│         [Quoting @Malcolm_Ocean: if the ratio of people who vote on this poll to the number of views it has is &lt;50%, everybody who voted dies  Which do you choose?]\n│       ↓\n│       1691862543969513752 [2023-08-16] @Malcolm_Ocean 💜 3\n│       this is by FAR my favorite reframe on the whole thing\n│       \n│       I claim that this one is actually in some very real sense isomorphic to the original, and that this evokes why people vote blue\n│       \n│       we (sometimes) identify with the whole, and the whole wants to live!\n│       https://t.co/lYJ8hWsy4o\n│         [Quoting @Malcolm_Ocean: You are an organism, composed of multiple parts. Each of these parts chooses one of two options that we'll label \"red\" &amp; \"blue\".  If at least 50% of your parts choose \"blue\", you live. Otherwise, the parts who choose \"red\" survive but split off from the whole, which is gone.]\n└── 1691864292499353685 [2023-08-16] @chercher_ai 💜 1\n    @Malcolm_Ocean If the text of the OP were a national poll to be taken one year from today, and I gave you a billion dollars in campaign funding, which color would you choose to campaign for and how would you spend the money?\n\n===\n\n1691607606987526194 [2023-08-16] @IaimforGOAT  [(SEED) type=quote_of_root]\nThe Discourse around this was so hilarious to assist. https://t.co/9FuKDgr8Ns\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1691616953616802076 [2023-08-16] @sanjehorah 💜 5 [(SEED) type=quote_of_semantic_search]\ni chose blue for this but red for lisa's version....... https://t.co/tRXNT8o7ea\n  [Quoting @xsphi: if majority red, everyone dies  if majority blue, only the blue pillers die  you vote]\n\n===\n\n1691811702638100653 [2023-08-16] @Malcolm_Ocean 💜 11 [(SEED) type=semantic_search]\nEveryone responding to this poll chooses between a blue pill or red pill.\n\n- if &gt;50% of ppl choose blue pill, everyone lives\n- if not, 99% of red pills live and 99% of blue pills die (randomly)\n\nWhich do you choose?\n↓\n1691841841862430908 [2023-08-16] @slimepriestess 💜 4\n@Malcolm_Ocean this is the least lizardman constant inflating version of this i have seen so far\n↓\n1691842899841892592 [2023-08-16] @aleksil79 💜 3\n@slimepriestess @Malcolm_Ocean quite informative if smudging the map with the tiniest amount of noise sharpens the result like that\n↓\n1691853303020224751 [2023-08-16] @Malcolm_Ocean 💜 4\n@aleksil79 @slimepriestess yep! and unlike our pristine thought experiments, reality always has some noise in it!\n\nwhich means... https://t.co/7uHpJElAx4\nImages:\n  - [Image #0] The image is a still from a movie or TV show, depicting two young adults standing together in a dimly lit indoor setting. The man in the foreground wears a dark green shirt with white stripes, while the woman behind him has long hair and a red jacket.\n↓\n1691855239299694794 [2023-08-16] @aleksil79 💜 3\n@Malcolm_Ocean @slimepriestess 🌏👨‍🚀💐👨‍🚀\n\n===\n\n1691836486969147780 [2023-08-16] @xsphi 💜 36 [(SEED) type=quote_of_semantic_search]\nI hope y'all are happy with what you've done https://t.co/ogLQ99k1eV\n  [Quoting @xsphi: if majority red, everyone dies  if majority blue, only the blue pillers die  you vote]\n\n===\n\n1691844812306051509 [2023-08-16] @mykola 💜 56 🔁 3 [(SEED) type=quote_of_root]\nThe discussion under this fascinating poll explains so much.\n\n“I would choose blue because I don’t want to be responsible for anyone’s death” does not even OCCUR to so many of these people.\n\nJust thousands of people breathlessly justifying red for personal safety. https://t.co/0n9v4RKbCG\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1691858118932680822 [2023-08-16] @mykola 💜 26\nSeriously read the ocean of blue checks discussing this in terms of like \"Wow all those blue pill people will die and that will free up so much housing\" and like.\n\nI don't want to be on a planet with y'all. Go away.\n\n===\n\n1692000716359950652 [2023-08-17] @Malcolm_Ocean 💜 10 [(SEED) type=semantic_search]\nFor completions' sake... everyone responding to this poll chooses between a blue pill or red pill.\n\n- if &gt;50% of ppl choose blue, 99% of people live (at random, regardless of choice)\n- if not, 100% of red pills live and 99% of blue pills die (randomly)\n\nWhich do you choose?\n↓\n1692039242849952011 [2023-08-17] @Malcolm_Ocean 💜 2\nman there are so many variations on framing. I want to reroll the above one with same payoffs but start with\n\n- if everyone picks red, everyone lives\n\nthen\n\n- if 50%-99.999% pick red, all red-pickers live, 99% of blue-pickers die\n- if &lt;50% pick red, 99% of everybody lives\n\n===\n\n1692000900946997484 [2023-08-17] @yashkaf 💜 112\nI grew up standard teenage libertarian but have spent the last decade plus absorbing critiques of liberalism from smart thinkers on both the left and the right. I agreed with many of them\n\nbut I feel like this red pill shit snapped me all the way back to Bryan Caplan\n↓\n1692001874910544092 [2023-08-17] @yashkaf 💜 59 🔁 1\nwhatever virtues and values a *leader* of an anti-liberal political movement may have, the average *follower* of such a movement is going to be driven by a simple 𝗵𝗮𝘁𝗿𝗲𝗱 𝗼𝗳 𝘁𝗼𝗹𝗲𝗿𝗮𝗻𝗰𝗲, which is what moves the \"red pill in any scenario and fuck the blues\" responder\n↓\n1692002584616145374 [2023-08-17] @yashkaf 💜 76 🔁 1\npeople know that everyone will not just. the liberal's response is \"shit, guess we'll have to deal with it\". the anti-liberal's is \"awesome, we get to be cruel to them\"\n\nand that's just so repulsive to me\n↓\n1692003077400694912 [2023-08-17] @yashkaf 💜 43\nand again, it's not that everyone who supports an anti-liberal movement is driven by this. certainly not the thoughtful people who write essays and opine on podcasts\n\nbut if they win they're not really going to stop the cruel mob from being cruel and a mob, as has always happened\n↓\n1692003569442898112 [2023-08-17] @yashkaf 💜 31 [(SEED) type=quote_of_root]\nheh\n\nthank god for the 64%\nhttps://t.co/JQkjO3xWks https://t.co/CC5AcYZcCY\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\nImages:\n  - [Image #0] The image shows a screenshot of a social media trending topic. The text on the image reads: \"Politics • Trending\" on the top left, followed by \"64% of Americans\" in large font, and \"31.4K posts\" below it, all on a dark blue background.\n\n===\n\n1692037830019514488 [2023-08-17] @Malcolm_Ocean 💜 4\ntrembling hand for more-than-2-players might imply converging on blender depending on how much you value your friends' lives and don't want them to slip into the blender\n\n(loving people is part of the reality (or at least hypergame) that these boxes don't track!) https://t.co/ft7UID19Lt\n  [Quoting Tweet 1691858958384877748 (missing)]\n\n===\n\n1692037831613403313 [2023-08-17] @Malcolm_Ocean 💜 3\nsuppose you play this with 10 ppl &amp; a 1% trembling hand rate\n\nif everyone tries to play red, there's a 9.1% chance that one of you gets blenderized (0.91% chance it's you). ~0.44% that 2+ of you get blenderized\n\nif 100% selfish, unilateral move to blue still sucks (~99% you die) https://t.co/vVZ9CLHU9w\nImages:\n  - [Image #0] The image shows a spreadsheet table with three columns and 11 rows. The table is transcribed as follows:\n    \n    | n mistakes | odds of n mistakes |  |\n    | --- | --- | --- |\n    | 0 | 90.4382% | =BINOM.DIST(A2,10,0.01,FALSE) |\n    | 1 | 9.1352% |  |\n    | 2 | 0.4152% |  |\n    | 3 | 0.0112% |  |\n    | 4 | 0.0002% |  |\n    | 5 | 0.0000% |  |\n    | 6 | 0.0000% |  |\n    | 7 | 0.0000% | 0.000% |\n    | 8 | 0.0000% |  |\n    | 9 | 0.0000% |  |\n    | 10 | 0.0000% |  |\n    \n    The table appears to be calculating the probability of a certain number of mistakes occurring, with the formula \"=BINOM.DIST(A2,10,0.01,FALSE)\" used to calculate the probability of 0 mistakes.\n↓\n1692037833307881650 [2023-08-17] @Malcolm_Ocean 💜 3\nbut unless you value your friends' lives more than your own, then no reason to switch\n\n...unless you factor not just the lives but living with the guilt of having chosen selfishly and survived, which is something most non-psychopaths would have\n\nmight not outweigh, but it's a lot\n↓\n1692037834595500062 [2023-08-17] @Malcolm_Ocean 💜 3\nanyway, so depending on how to weight that, which is impossible to numericize and will vary dramatically by person, and so on...\n\n...the red option is still probably a trembling hand equilibrium, assuming zero communication\n↓\n1692037836571091208 [2023-08-17] @Malcolm_Ocean 💜 3\nbut now I'm pretty sure \"everyone chooses blue\" is ALSO an equilibrium, and a better one (tho unfortunately it's hard to draw those little toy payoff matrices when there are 10 dimensions)\n\n...hours later, I come up for air to realize I accepted that challenge HARD.\n↓\n1692037837934285063 [2023-08-17] @Malcolm_Ocean 💜 3\nwell 10 was a bit too hard but I managed to get 5 going\n\nI valued \"own life\" at 100 and \"each friends' life\" at 1, mostly so it was easy to see where the numbers went\n\nand there's now an equilibrium at 100% blue. it's small because small n. https://t.co/TyWWhKwxkf\nImages:\n  - [Image #0] The image presents a table titled \"Payoffs in a world where error is 1%,\" which appears to be a payoff matrix for a game theory scenario. The table is divided into three sections, each representing different conditions: \"(you might slip),\" \"(you have steady hands),\" and \"(you slip).\" \n    \n    To reproduce this table, one would need to create a grid with the following structure:\n    \n    *   The leftmost column lists \"Others' choices\" with values ranging from 4 to 0, indicating the number of others choosing red or blue.\n    *   The top row has three main sections: \"Your choice (you might slip),\" \"Your choice (you have steady hands),\" and \"Your choice (you slip).\" Each of these sections is further divided into two sub-columns labeled \"red (you hope)\" and \"blue (you hope)\" for the first two sections, and \"red...? blue!\" and \"blue...? red!\" for the third section.\n    *   The cells within the table contain percentages and numbers. The percentages represent the probability of a particular outcome, while the numbers seem to represent payoffs or scores associated with those outcomes.\n    \n    The table is filled with specific values, such as percentages and payoffs, which are color-coded. For example, under \"(you might slip),\" when \"Others' choices\" are \"4 red 0 blue,\" choosing \"red\" yields a 99% chance of a payoff of 103, while choosing \"blue\" gives a 0.1% chance of a payoff of 0 and a 0% chance of a payoff of 5.\n    \n    To accurately reproduce the table, one would need to fill in the exact percentages and payoffs as shown in the original image, ensuring that the color-coding is consistent with the original. The color scheme used includes red, blue, green, and beige, which correspond to different outcomes or probabilities.\n    \n    The context provided by the tweet suggests that the table is being used to analyze a game or decision-making scenario where the probability of error is 1%. The user valued \"own life\" at 100 and \"each friends' life\" at 1, indicating a significant personal stake in the outcome. The tweet also mentions achieving an equilibrium at 100% blue, suggesting that the analysis led to a stable state where all players choose blue.\n↓\n1692037839909683543 [2023-08-17] @Malcolm_Ocean 💜 3\nI did another one with the error rate set to 10%, and interestingly this makes the one where half of the other people pick red/blue switch in valence\n\nthis is partially a function of the ratio between own &amp; friends' lives https://t.co/gcUYkL6H3q\nImages:\n  - [Image #0] The image presents a table titled \"Payoffs in a world where error is 10%,\" which appears to be a payoff matrix for a game or decision-making scenario. The table is divided into three sections, each representing different conditions: \"(you might slip),\" \"(you have steady hands),\" and \"(you slip).\" \n    \n    To reproduce this table, one would need to create a 3x8 grid with the following elements:\n    \n    *   The leftmost column lists the \"Others' choices\" with varying combinations of red and blue, ranging from 4 red 0 blue to 0 red 4 blue.\n    *   The top row of each section contains the \"Your choice\" options: \"red (you hope)\" and \"blue (you hope)\" for the first section, \"red\" and \"blue\" for the second, and \"red...? blue!\" and \"blue...? red!\" for the third.\n    *   Each cell within the grid contains a percentage value and two numerical values, likely representing payoffs or outcomes based on the combination of \"Others' choices\" and \"Your choice.\"\n    *   The percentages and numerical values are color-coded, with red, blue, and green used to highlight specific outcomes or probabilities.\n    \n    The table seems to illustrate how different choices and error rates affect payoffs in a game or decision-making context. The exact meaning and application of the table would depend on the specific context or game being analyzed.\n↓\n1692037841855943132 [2023-08-17] @Malcolm_Ocean 💜 4\nanyway, I have spent way too long on this\n\nit was kinda nice to brush up on binomial theorem and game theory though, both of which I studied but hadn't formally worked with in years\n\nif you want to try to extend my sheet, it's here:\nhttps://t.co/6KVTs7FvGa\n↓\n1692037843525202321 [2023-08-17] @Malcolm_Ocean 💜 4\nbut anyway, the case is honestly a lot messier at 5\n\nbut again, with an all-red strategy 🔴\n- with 10 people there's a ~10% chance of someone dying\n- with 100 people it's more likely than not that 1-2 die\n- by 1000, it becomes vanishingly unlikely that all live https://t.co/P1bK73Q4dd\nImages:\n  - [Image #0] The image is a table showing the odds of n mistakes when 100 people play a game with a 1% chance of tremoring hand. The table has two columns: \"n mistakes\" and \"odds of n mistakes.\" \n    \n    To reproduce the table, create a spreadsheet with the following data:\n    \n    | n mistakes | odds of n mistakes |\n    | --- | --- |\n    | 0 | 36.6032% |\n    | 1 | 36.9730% |\n    | 2 | 18.4865% |\n    | 3 | 6.0999% |\n    | 4 | 1.4942% |\n    | 5 | 0.2898% |\n    | 6 | 0.0463% |\n    | 7 | 0.0063% |\n    | 8 | 0.0007% |\n    | 9 | 0.0001% |\n    | 10 | 0.0000% |\n    | 11 | 0.0000% |\n    | 12 | 0.0000% |\n    | 13 | 0.0000% |\n    | 14 | 0.0000% |\n    | 15 | 0.0000% |\n    | 16 | 0.0000% |\n    | 17 | 0.0000% |\n    | 18 | 0.0000% |\n    | 19 | 0.0000% |\n    | 20 | 0.0000% |\n    \n    The formula used to calculate the odds is =BINOM.DIST(A2,100,0.01,0), where A2 is the cell containing the value of n mistakes. The title of the table is \"100 people play the game, with 1% chance of tremoring hand.\"\n↓\n1692037846041842035 [2023-08-17] @Malcolm_Ocean 💜 3\nANYWAY\n\ngoing back to feelings, imagine how you'd feel in the scenario where you all pick red and you get lucky and nobody slips, and you all survive (90% likely)\n\nlike WHEW OKAY WE GOT LUCKY\n\neven if it feels like yall made the right choice, it's still a crazy risk to take\n↓\n1692037847358865905 [2023-08-17] @Malcolm_Ocean 💜 4\nthen imagine how you'd feel in the scenario where you all pick blue and you all survive (99.9999%+ likely)\n\nit'd be like \"nice! we did it! of course! we know how to handle this!\"\n\neverybody knew that if everyone else made the right choice, it would *definitely* work out fine\n↓\n1692037850139668769 [2023-08-17] @Malcolm_Ocean 💜 3 [(SEED) type=quote_of_semantic_search]\nlike once there's a tiny bit of noise, obviously converging on blue is the thing to do\nhttps://t.co/kvKNmhgvHI\n  [Quoting @Malcolm_Ocean: Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt;50% of ppl choose blue pill, everyone lives - if not, 99% of red pills live and 99% of blue pills die (randomly)  Which do you choose?]\n↓\n1692381146091340261 [2023-08-18] @Malcolm_Ocean 💜 2\nhere's another great analysis, which does the math at the limit as N increases, and points out some of the same things I did but more clearly, plus other things\n\nhttps://t.co/Jvs3yVYSbV\n  [Quoting Tweet 1692296658430701698 (missing)]\n\n===\n\n1798422482845901020 [2024-06-05] @VividVoid_ 💜 312 🔁 2\nWhat are the great load-bearing TPOT posts? Like the early ideas that defined the scene and its norms?\n↓\n1798468975090958694 [2024-06-05] @SurrealistShip 💜 13 [(SEED) type=quote_of_root]\n@VividVoid_ An iconic poll with the usual cast all commenting on it. https://t.co/S8KfjAjL7s\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n\n===\n\n1813973282968031273 [2024-07-18] @aleksil79 💜 2\nseeing more well thought takes from both sides of the \"is it ok to cancel back\" disagreement it def has the pill poll smell https://t.co/ELg3hoS37B\n  [Quoting @aleksil79: @eshear @nosilverv wait is this somehow isomorphic to the pill poll?]\n↓\n1813973285241303278 [2024-07-18] @aleksil79 💜 2 [(SEED) type=quote_of_root]\nheres the pill poll for context\n\nhttps://t.co/gEiykKyCMG\n  [Quoting @lisatomic5: Poll question from my 12yo:  Everyone responding to this poll chooses between a blue pill or red pill.  - if &gt; 50% of ppl choose blue pill, everyone lives - if not, red pills live and blue pills die  Which do you choose?]\n↓\n1813976682111647955 [2024-07-18] @aleksil79 💜 2\nfor the pill poll i eventually figured that much of the disagreement boiled down to unspoken background assumptions eg about which analogies apply and divergent hidden implications. weird to see the same happen for a real scenario\n\n===\n\n1859296003813409192 [2024-11-20] @monistowl 💜 75 🔁 13 [(SEED) type=semantic_search]\nreposting a great poll (all credit to @lisatomic5):Everyone responding to this poll chooses between a blue pill or red pill.- if &gt; 50% of ppl choose blue pill, everyone lives- if not, red pills live and blue pills dieWhich do you choose?\n↓\n1859339960987308185 [2024-11-20] @monistowl 💜 14 🔁 1\nhttps://t.co/5ICUTCwtnG\n  [Quoting @monistowl: @hamzaiandafirst 🟥 Hai9TtLWJep3kHdsaAhcSzoyEBX2EHt1skpd2Z3pump🟦 FZykVHfbhTTQhC7ThzySRrNaFcVc8KGMUG1EWH9Gpump]\n↓\n1859342668469301559 [2024-11-20] @monistowl 💜 14\nexcited to see the consequences\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand represents a recurring **Dialectical Exploration** of game theory, coordination, and moral intuition, anchored by Lisa's 12-year-old's \"Blue Pill / Red Pill\" poll from August 2023. The boundary object is the poll itself—a deceptively simple coordination problem that serves as a Rorschach test for rationality vs. altruism. The discourse evolves from initial visceral responses (\"Blue = compassion, Red = intelligence\") through sophisticated game-theoretic analysis (Nash equilibria, trembling hand, framing effects) to meta-level insights about how humans actually coordinate in practice. Unlike a static debate, the strand produces genuine knowledge artifacts: Malcolm Ocean's extensive framing experiments, Yash's \"costly signaling\" theory, and the discovery that tiny amounts of noise make Blue objectively superior. The arc is constructive rather than purely dialectical—participants refine rather than destroy each other's positions, ultimately converging on \"context-dependent rationality\" as the synthesis.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1690904441967575040,
        "annotation": "The Catalyst: Lisa's 12yo posts the original poll that ignites 3+ days of discourse"
      },
      {
        "tweet_id": 1690944715548725248,
        "annotation": "Early Confusion: Isaac King notes the unexpected Blue victory, establishing the puzzle"
      },
      {
        "tweet_id": 1691022785919795201,
        "annotation": "The Red Case: Roko asks \"Why would anyone vote blue?\" sparking the rationalist argument"
      },
      {
        "tweet_id": 1691074962717659136,
        "annotation": "The Blue Case: Yash introduces \"meta-game\" and costly signaling theory"
      },
      {
        "tweet_id": 1691083696206458881,
        "annotation": "Synthesis Begins: \"Red-red is Nash equilibrium but no one wants to be friends with Nash bros\""
      },
      {
        "tweet_id": 1691160129318633472,
        "annotation": "Yash's Meme: The IQ curve meme that becomes the strand's most viral artifact"
      },
      {
        "tweet_id": 1691548599425876421,
        "annotation": "Malcolm's Experiments: Beginning of systematic framing effect studies"
      },
      {
        "tweet_id": 1691813536727490616,
        "annotation": "Noise Discovery: Malcolm shows 1% error rate makes Blue objectively superior"
      },
      {
        "tweet_id": 1692003569442898112,
        "annotation": "Political Synthesis: Yash connects the poll to broader liberalism vs. anti-liberalism"
      },
      {
        "tweet_id": 1859296003813409192,
        "annotation": "Replication (2024): The poll returns 15 months later, proving its memetic durability"
      }
    ]
  }
}