{
  "seed_tweet_id": 1742494880625016921,
  "thread_text": "2332251318 [2009-06-25] @technoshaman 💜 1 [(SEED) type=semantic_search]\n#SkypeCafé #Alia Form communities of change agents on the same domain of change, as to continually improve our practice together.\n\n===\n\n17605701792 [2010-07-02] @technoshaman  [(SEED) type=semantic_search]\nIs it easier to think about the sentient web than enabling *sentient* networks of change agent communities? #junto #elanmap\n\n===\n\n27372572794 [2010-10-14] @technoshaman 💜 1 🔁 1 [(SEED) type=semantic_search]\nEmrgng initiatives reconstitute our capacity 4 shared ownership, collab. & stewardship Map the patterns connecting them http://bit.ly/boiNzP\n\n===\n\n375184032767557632 [2013-09-04] @technoshaman  [(SEED) type=semantic_search]\nCreating Collective Change http://t.co/dlY1A7LXz3\n\n===\n\n1333198845514186752 [2020-11-29] @visakanv 💜 84 🔁 2\njust piggybacking off a thought I’ve heard a few times: I intend to make a substantial dent in the loneliness problem, and I intend to not make too much money from it - and I think these two are intertwined https://t.co/lIWgteNQFd\n↓\n1333199165589864449 [2020-11-30] @visakanv 💜 51 💬 1 [(SEED) type=semantic_search]\nnapkin sketch: teach 1% of people to be A+ community managers and leaders who create and hold space for other people to have meaningful relationships\n\ncreate and support media that educates people on how to build nourishing relationships with the people around them\n↓\n1333199455349219328 [2020-11-30] @visakanv 💜 49 🔁 1\nThe problem is that people are always trying to monetise things, pursue profits, and growth, and these things are just not quite right for community and kinship. It tends to corrupt the whole endeavor. The golden geese keep getting choked to death\n↓\n1333199907012820995 [2020-11-30] @visakanv 💜 51 🔁 1 💬 1\nSo what we need are thousands of people who want to play really long, 50-100 year long games with the intent of building human networks - without trying to aggressively monetise them. This is a whole different system of values https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1333200766169845762 [2020-11-30] @visakanv 💜 27 🔁 2\nwe need to invest in scenes and cultural institutions without trying to aggressively profit from them. They will create a ton of wealth but we need patience and temperance to give these things room to breathe https://t.co/Zz187Ewhn2\n  [Quoting @visakanv: what are some examples of cultural institutions that come to mind? famous bookstores, comedy clubs, etc with important histories]\n↓\n1333202052063789056 [2020-11-30] @visakanv 💜 27\nI suppose my naive-innocent-clueless question is where are the VCs that invest on a 100 year horizon? Do they exist? If the incentives don’t line up, can we make them?\n\n===\n\n1333199309408509953 [2020-11-30] @m_ashcroft 💜 11 [(SEED) type=quote_of_semantic_search]\nAnd my axe https://t.co/65OPX5E2Cs\n  [Quoting @visakanv: napkin sketch: teach 1% of people to be A+ community managers and leaders who create and hold space for other people to have meaningful relationships  create and support media that educates people on how to build nourishing relationships with the people around them]\n↓\n1333272725826125827 [2020-11-30] @uberstuber 💜 1\n@m_ashcroft and @tasshinfogleman's monasteries\n\nhttps://t.co/C8hjDjeoA6\n\n===\n\n1338963127682150400 [2020-12-15] @RhysLindmark 💜 3 [(SEED) type=semantic_search]\n1/ @threadapalooza of Sociotechnical Diagrams.\n\nThese images answer the question: how does tech change society? And how does society change tech?\n↓\n1338963131889020930 [2020-12-15] @RhysLindmark \n2/ We can start with the original tech &lt;&gt; society loop:\n\nMarx's Base and Superstructure. This is the core reinforcing loop of capitalism.\n\nBase : Tech ::\nSuperstructure : Society https://t.co/VRwCy74PmK\nImages:\n  - [Image #0] The image is a diagram illustrating the concept of Marx's Base and Superstructure, a fundamental idea in Marxist theory. The diagram consists of two main sections: \"Superstructure\" and \"Base,\" which are connected by arrows to demonstrate their interrelationship.\n    \n    *   **Superstructure**\n        *   Everything not directly related to production\n        *   Includes:\n            *   Art\n            *   Family\n            *   Culture\n            *   Religion\n            *   Philosophy\n            *   Ideology\n            *   Law\n            *   Media\n            *   Politics\n            *   Science\n            *   Education\n    *   **Base**\n        *   Means of Production:\n            *   Tools\n            *   Machines\n            *   Factories\n            *   Land\n            *   Raw materials\n        *   Relations of Production:\n            *   Lumpen-Proletariat\n            *   Proletariat\n            *   Labour Aristocracy\n            *   Petty-Bourgeoisie\n            *   Bourgeoisie\n            *   Private property\n            *   Capital\n            *   Commodities\n            *   etc.\n    *   **Relationship between Superstructure and Base**\n        *   The Superstructure maintains (and shapes) the Base.\n        *   The Base shapes (and maintains) the Superstructure.\n        *   This relationship moves in a spiral pattern, with the Base being generally dominant.\n    \n    In summary, the diagram illustrates the complex interplay between the Superstructure and the Base, highlighting how they influence and shape each other. The Superstructure encompasses various aspects of society that are not directly related to production, while the Base comprises the means and relations of production. The arrows connecting the two sections demonstrate their reciprocal relationship, with the Base being the dominant force. Overall, the diagram provides a visual representation of Marx's Base and Superstructure, offering insights into the dynamics of societal structures and their impact on one another.\n↓\n1338963137513598976 [2020-12-15] @RhysLindmark \n3/ Staying at the abstract level, we can formally define the concept of a paradigm:\n\nA paradigm is the feedback loop between epistemology, ontology, and ethics.\n\nWe're changing how we understand the world, as the underlying world itself changes, as our goals change. https://t.co/ix7MxCEBm0\nImages:\n  - [Image #0] The image is a hand-drawn diagram on a blackboard, illustrating the interconnectedness of three concepts: Epistemology, Ontology, and Ethics.\n    \n    *   **Epistemology**\n        *   Written in white chalk at the top left of the image.\n        *   A green glowing symbol is drawn below it, accompanied by a dashed line that connects to the center of the image.\n    *   **Ontology**\n        *   Positioned in the center of the image, with the word \"ONTOLOGY\" written above it in white chalk.\n        *   A yellow glowing cube is drawn below the label, representing the concept of Ontology.\n        *   Dashed lines connect the cube to the Epistemology and Ethics sections.\n    *   **Ethics**\n        *   Located at the top right of the image, with the word \"ETHICS\" written in white chalk.\n        *   Two red glowing question marks are drawn below it, connected to the Ontology section by arrows.\n    *   **Background and Additional Elements**\n        *   The background of the image features a blackboard with small white dots, resembling a starry night sky.\n        *   In the bottom-right corner, a white rectangle contains the text \"RHYS\" in black letters.\n    \n    The diagram illustrates the relationships between Epistemology, Ontology, and Ethics, suggesting that they are interconnected and influence one another. The use of different colors and symbols adds visual interest and helps to distinguish between the three concepts.\n↓\n1338963143754731525 [2020-12-15] @RhysLindmark \n4/ As a specific example, we can see this paradigm change from the Industrial Age to the Information Age. https://t.co/VpUSHlGfBH\nImages:\n  - [Image #0] The image is a hand-drawn illustration that compares three different ideologies: Broadcast, Factoryism, and Liberalism. The image is divided into three sections, each representing one of the ideologies.\n    \n    *   **Broadcast**\n        *   The left section is labeled \"BROADCAST\" and features a blue cone with a flag on top, containing the number 10.\n        *   The cone is surrounded by a glow effect, symbolizing the broadcasting of information or messages.\n        *   The number 10 inside the cone may represent a specific message or signal being broadcasted.\n    *   **Factoryism**\n        *   The middle section is labeled \"FACTORYISM\" and depicts a yellow figure with a star on its head, surrounded by three smaller cones labeled \"3\".\n        *   The figure has its arms outstretched, and the cones are positioned below it, suggesting a hierarchical structure.\n        *   The word \"ATOMS\" is written below the figure, implying a connection to the concept of atoms or individual components.\n    *   **Liberalism**\n        *   The right section is labeled \"LIBERALISM\" and shows a red figure with outstretched arms and legs, surrounded by arrows pointing in different directions.\n        *   The figure is accompanied by the text \"GOOD FOR SELF?\" in red, suggesting a focus on individualism and self-interest.\n        *   The overall design of this section conveys a sense of freedom and decentralization.\n    \n    In summary, the image presents a visual comparison of three ideologies, each represented by a unique symbol and color scheme. The Broadcast section emphasizes the dissemination of information, while the Factoryism section highlights a hierarchical structure and the importance of individual components. The Liberalism section focuses on individualism and self-interest, with a sense of freedom and decentralization. Overall, the image provides a thought-provoking visual representation of these complex ideologies.\n↓\n1338963147877707779 [2020-12-15] @RhysLindmark \n5/ Getting more specific, we can view societal evolution from @JoHenrich's perspective of cultural evolution.\n\nCultural evolution can be understood as biology co-evolving with our culture.\n\nWe need culture-bio fit. Marriage norms (culture) are anchored to our pair-bonding bio. https://t.co/CyE3EyzJhk\nImages:\n  - [Image #0] The image is a simple digital illustration that depicts the concept of culture and biology being interconnected. \n    \n    * The main focus of the image is a white-outlined puzzle piece graphic with two interlocking pieces, one labeled \"CULTURE\" and the other labeled \"BIOLOGY\".\n    \t+ The top piece is teal-colored and has the word \"CULTURE\" written in white handwritten-style text.\n    \t+ The bottom piece is yellow-green colored and has the word \"BIOLOGY\" written in white handwritten-style text.\n    * The background of the image is dark blue with small white dots scattered throughout, resembling a starry night sky.\n    * In the bottom-right corner, there is a small white rectangle with the name \"RHYS\" written in black handwritten-style text.\n    \n    The image effectively conveys the idea that culture and biology are closely linked and interdependent, much like the two interlocking puzzle pieces.\n↓\n1338963152051052544 [2020-12-15] @RhysLindmark \n6/ If we zoom in, bio can be seen as genetics, ontogeny, and psych, while culture can be seen as norms and institutions. https://t.co/IeC0q2FKJG\nImages:\n  - [Image #0] The image is a simple stick figure drawing with text and arrows, set against a black background with white dots.\n    \n    *   The stick figure is drawn in white and has a smiling face. It is positioned centrally in the image.\n        *   The figure is labeled \"INNER BIOLOGICAL\" on the left side of its head.\n        *   An arrow points to the right from the figure's head, with the words \"GENETICS → ONTOGENY → PSYCHOLOGY\" written above it.\n        *   Another arrow points to the right from the first arrow, with the words \"NORMS → INSTITUTIONS\" written above it.\n        *   The label \"OUTER SOCIAL\" is written to the right of the second arrow.\n    *   The background of the image is black with small white dots scattered throughout.\n        *   In the bottom-right corner, there is a small white rectangle with the word \"RHYS\" written inside it.\n    \n    The image appears to be illustrating the relationship between biological and social factors, with the stick figure representing an individual and the arrows indicating the progression from inner biological processes to outer social influences.\n↓\n1338963156421537793 [2020-12-15] @RhysLindmark \n7/ These different layers move at different speeds. e.g. Institutions and genetics are slow. https://t.co/GYQ3ZI8npU\nImages:\n  - [Image #0] The image is a simple, hand-drawn diagram illustrating the concept of different layers moving at varying speeds. The diagram consists of five curved lines, each representing a distinct layer, labeled from top to bottom as \"Institutions\", \"Norms\", \"Psychology\", \"Ontogeny\", and \"Genetics\". \n    \n    *   The lines are drawn in white on a black background with small white dots, resembling a starry night sky.\n    *   Each line has an arrow pointing to the right, indicating movement or progression.\n    *   The lines are not parallel, with the top line being the longest and the bottom line being the shortest, suggesting that the layers move at different speeds.\n    *   The labels are written in a handwritten-style font, adding a personal touch to the diagram.\n    *   In the bottom-right corner, there is a small white rectangle with the text \"RHYS\" inside, likely indicating the creator or author of the diagram.\n    \n    Overall, the diagram effectively conveys the idea that different aspects of human society and biology operate on different timescales, with institutions and genetics being the slowest and fastest, respectively.\n↓\n1338963160137670661 [2020-12-15] @RhysLindmark \n8/ This should remind you of @stewartbrand's Pace Layers https://t.co/3esB2rv7Hm\nImages:\n  - [Image #0] The image is a diagram illustrating \"Pace Layering,\" a concept developed by Stewart Brand. The diagram consists of six curved layers, each representing a different aspect of society, stacked on top of one another.\n    \n    To reproduce this diagram, start by drawing a large rectangle with a double border. Inside the rectangle, draw six curved lines, each one larger than the last, to represent the different layers. Label each layer in order from top to bottom: \"FASHION,\" \"COMMERCE,\" \"INFRASTRUCTURE,\" \"GOVERNANCE,\" \"CULTURE,\" and \"NATURE.\"\n    \n    The top layer, \"FASHION,\" should be depicted with wavy lines and arrows indicating movement. Draw arrows pointing from the top layer to the ones below it, suggesting the flow of influence from one layer to the next. The arrows should be directed downward, indicating that the top layers influence the bottom ones.\n    \n    At the bottom of the rectangle, include the source information: \"Source: Brand, S., 1999, The Clock of the Long Now, p. 37.\" The background of the diagram should be white, with black lines and text.\n    \n    The resulting diagram will illustrate the concept of Pace Layering, showing how different aspects of society interact and influence one another.\n↓\n1338963163329531906 [2020-12-15] @RhysLindmark \n9/ Henrich's book mostly focuses on WEIRD psychology. He writes: \"The cultural evolution of psychology is the dark matter that flows behind the scenes throughout history.\"\n\nWEIRD psych co-evolved with voluntary orgs from 1000-2000 in Europe. Old kin institutions were outcompeted. https://t.co/mL6s6HFB0A\nImages:\n  - [Image #0] The image is a flowchart illustrating the relationship between Western Christianity and various societal and psychological factors. The chart is divided into several sections, each representing a different aspect of this relationship.\n    \n    *   **Western Christianity competes with other religions**\n        *   This section serves as the starting point of the flowchart.\n        *   It highlights the competitive nature of Western Christianity with other religious beliefs.\n    *   **Marriage and Family Program**\n        *   Monogamous marriage only\n        *   No arranged marriage\n        *   No kin marriage (affines, etc.)\n        *   Neolocal residence\n        *   Inheritance by testament\n        *   Individual ownership\n        *   No adoption\n        *   This section outlines the characteristics of the marriage and family program associated with Western Christianity.\n    *   **Social consequences**\n        *   Dissolution of intensive kinship\n        *   Weaker ties to extended kin\n        *   Weaker ties to lands\n        *   Relational and residential mobility\n        *   Greater dependence on Church\n        *   Need for safety nets\n        *   This section describes the social implications of adopting the marriage and family program.\n    *   **Psychological consequences, self-focus**\n        *   Individualism, self-focus\n        *   Analytical thinking\n        *   Guilt > Shame\n        *   Normative conformity\n        *   Intentional morality\n        *   Zero-sum thinking & status-seeking\n        *   Impatience and risk-seeking\n        *   This section details the psychological effects of the marriage and family program on individuals.\n    *   **Impersonal markets and urbanization**\n        *   Greater mobile division of labor\n        *   Greater dependence on formal institutions and contracts\n        *   First religiously affiliated and then secular social safety nets\n        *   This section discusses the impact of the marriage and family program on economic and social structures.\n    *   **Competition among voluntary associations**\n        *   Competition among cities, towns, guilds, monasteries, universities, and businesses\n        *   Favors institutions built to engage and reinforce WEIRD psychology\n        *   This section explains how competition among various voluntary associations influences the development of WEIRD (Western, Educated, Industrialized, Rich, and Democratic) psychology.\n    *   **Psychological consequences**\n        *   Impersonal prosociality\n        *   Interpersonal prosociality\n        *   Impartial rules and principles\n        *   Patience (delay discounting)\n        *   Time\n↓\n1338963166454312960 [2020-12-15] @RhysLindmark 💜 1\n10/ I don't mind Henrich's causal loop diagram above. But I prefer a loopy :) https://t.co/iYM1tmEr4R\nImages:\n  - [Image #0] The diagram shows a causal loop between six concepts, drawn as red circles, with arrows indicating positive and negative influences. To reproduce the diagram, start by drawing six red circles with the following labels, clockwise from the bottom left: \"Ape Instincts\", \"Kin-Based Clans\", \"Kin-Based Psychology\", \"WEIRD Psychology\", \"Impersonal Institutions\", and \"The Church\". \n    \n    * \"Ape Instincts\" has a positive influence on \"Kin-Based Clans\".\n    * \"Kin-Based Clans\" has a positive influence on \"Kin-Based Psychology\" and \"Ape Instincts\", but a negative influence on \"The Church\".\n    * \"Kin-Based Psychology\" has a positive influence on \"Kin-Based Clans\".\n    * \"The Church\" has a positive influence on \"Impersonal Institutions\".\n    * \"Impersonal Institutions\" has a positive influence on \"WEIRD Psychology\".\n    * \"WEIRD Psychology\" has a positive influence on \"Impersonal Institutions\".\n    \n    The diagram illustrates a complex interplay between these concepts, with both positive and negative feedback loops.\n↓\n1338963170040438786 [2020-12-15] @RhysLindmark \n11/ One way to think of the above is that:\n\nHenrich's explanation accounts for global differences from 1000-2000.\n\nWhile @jaredmdiamond's GGS accounts for diff from 10000 BCE-1000 CE.\n\nEast-West orientation + lucky domesticable plants/animals allowed Eurasia to win. https://t.co/1zJHVGu4hP\nImages:\n  - [Image #0] The diagram is a simple line drawing of a world map, highlighting three continents: the Americas, Africa, and Eurasia. To reproduce it, draw a basic world map and label the three continents, then add double-headed arrows spanning the vertical extent of the Americas and Africa, and a double-headed arrow spanning the horizontal extent of Eurasia.\n\n===\n\n1437660721676967945 [2021-09-14] @technoshaman 💜 4 🔁 2 [(SEED) type=semantic_search]\nDo you consider yourself a change agent or a r.evolutionary agent? Click the pic to find out the difference. I will be co-leading w/@luksha and @luminous2707 this program  https://t.co/X0Z0YdK2GZ , designed to grow your influence on system change. If you have questions, pls ask. https://t.co/CbCZjXVoOC\n\n===\n\n1464240020169109504 [2021-11-26] @RichDecibels 💜 31 🔁 6 [(SEED) type=semantic_search]\nI’m thinking about leadership &amp; contribution within networks, DAOs, voluntary communities etc\n\nI’ll explain an idea with this chart, please lemme know if this matches your experience https://t.co/nv5YmTcNjI\nImages:\n  - [Image #0] The image presents a simple, hand-drawn graph with two axes and scattered data points. The graph is set against a white background.\n    \n    *   **Y-axis:**\n        *   Labeled as \"CONTEXT\" at the top.\n        *   Oriented vertically.\n        *   Arrowhead at the top.\n    *   **X-axis:**\n        *   Labeled as \"CAPACITY\" on the right side.\n        *   Oriented horizontally.\n        *   Arrowhead at the right end.\n    *   **Data Points:**\n        *   17 data points are scattered across the graph.\n        *   The data points are not labeled or differentiated in any way.\n        *   They appear to be randomly distributed, with no clear pattern or trend.\n    \n    The graph's simplicity and lack of additional information suggest that it may be a preliminary or conceptual representation rather than a detailed, data-driven visualization.\n↓\n1464240022060732417 [2021-11-26] @RichDecibels 💜 5\nI want to try mapping this in some groups: survey the participants and ask them to rank themselves compared to the all other members\n\njust two questions:\n↓\n1464240023369306121 [2021-11-26] @RichDecibels 💜 4\n1. how much context do you have?\n\nhigh context = you’re aware of past &amp; present activities, debates, opportunities; you’re known &amp; trusted by many members\n↓\n1464240024841502726 [2021-11-26] @RichDecibels 💜 5\n2. How much spare capacity do you have to contribute?\n\n(time, energy, space, enthusiasm, willingness to volunteer for more responsibilities)\n↓\n1464240187437899785 [2021-11-26] @RichDecibels 💜 7\nif we mapped this, I guess it would look like the graph \n\nthere’s possibility for polarisation: high context members get resentful because they’re overloaded; feel like other people don't contribute enough\n\nbut newer members have less context so they don’t know how to contribute\n↓\n1464240290785542162 [2021-11-26] @RichDecibels 💜 7\nthere’s also the possibility for partnership: new members have spare capacity so they make great contributors, old members have lots of context so they make great advisors &amp; cheerleaders\n↓\n1464240627906920453 [2021-11-26] @RichDecibels 💜 7 🔁 1\ngeneral rules of human groups:\n\n1. conflict increases as trust decreases\n2. conflict tends to form along pre-existing lines of polarisation\n↓\n1464240912293314574 [2021-11-26] @RichDecibels 💜 6\none of the ways to manage polarity is to be aware of it, and get in front of it before trust breaks down\n\ni.e. break the taboos that prevent us talking about these uncomfortable issues, make it a shared challenge rather than a personal failure, frame it as an opportunity\n↓\n1464244371889528832 [2021-11-26] @RichDecibels 💜 4\nhere's a live example of conflict forming around the battle lines of context inequity in a DAO: \n\nhttps://t.co/FzX2wgEMVZ\n\n@bax1337 has less context, so he's reasonably quite suspicious of the DAO insiders asking: are you malicious or incompetent?\n  [Quoting Tweet 1462801325515804678 (missing)]\n↓\n1464244373550518273 [2021-11-26] @RichDecibels 💜 2\nhere's a response from one of the DAO insiders: https://t.co/e6we6vXRWX\n\n@liminal_warmth thinks @bax1337 is taking an uncharitable view, and there's no grounds for claims of unethical behaviour\n  [Quoting Tweet 1463939305194196992 (missing)]\n↓\n1464244375278477318 [2021-11-26] @RichDecibels 💜 3\nnote how @bax1337 concludes his thread, asking the insiders to share more context\nhttps://t.co/WL4Cr6tTG0\n\nI don't want this thread to be about that specific conflict: I feel for everyone involved, but I don't have a dog in that fight\n  [Quoting Tweet 1463171002200961035 (missing)]\n\n===\n\n1480951054300852232 [2022-01-11] @RichDecibels 💜 19 🔁 1 [(SEED) type=semantic_search]\nPSA: this account now posts about 1 LinkedIn leadership/orgdev take for every 1000 deranged insight shitpost riddles https://t.co/pquWQ2rb5z\n  [Quoting @RichDecibels: I don't know who needs to hear this but your maturity as a leader is measured by the degree to which you help others activate their own agency]\n↓\n1480951292541509634 [2022-01-11] @RichDecibels 💜 8\nTHIS MACHINE CONSUMES NORMIES\n\n===\n\n1498869866148732929 [2022-03-02] @tasshinfogleman 💜 2 [(SEED) type=semantic_search]\ncommunities go better if everyone has some sense of agency over some aspect, part, or portion of the community / project, even if it’s tiny https://t.co/bwyb1cv7I3\n  [Quoting Tweet 1491105826438000640 (missing)]\n\n===\n\n1667304291571232769 [2023-06-09] @__drewface 💜 35 🔁 1\nI live in a community focused on improving our life circumstances one day at a time, the best we can. It's hard and fun and so much better than complaining into the void.\n\n...but this shouldn't be impressive, it should be basic.\n\na functioning community should be table stakes\n↓\n1667304932767047686 [2023-06-09] @__drewface 💜 12\nthere are systematic ways to create and change culture, so it fits the needs of your community.\n\nWe can write these ways down (many have before!), share our ideas, build up a library of \"social technologies\"\n\nWe can research the best ideas of history.\n↓\n1667408545321742336 [2023-06-10] @sanjehorah  [(SEED) type=semantic_search]\n@__drewface do you have any links/resources for building communities and creating/changing culture?\n\n===\n\n1715645819792093283 [2023-10-21] @exgenesis 💜 10 [(SEED) type=semantic_search]\nbuilding community is a power move and not just a cute QOL change:you don’t need a concrete project to start, community, well-being, energy are ends in themselves30 high agency ppl WILL mutually reinforce now if there’s 10x or 100x potential energy around, it WILL get deployed\n\n===\n\n1742218155181932776 [2024-01-02] @visakanv 💜 26\n@vinveliveera I need a name for visa/malcolm/richdecibels twitter that isn’t tpot and isn’t FAN, what do I do? Specifically I want it to be a Twitter handle. Something riffing on Feral?  Cc @Malcolm_Ocean @RichDecibels @p_millerd @__drewface\n↓\n1742224563302268978 [2024-01-02] @RichDecibels 💜 3\n@visakanv @VinveliVEERA @Malcolm_Ocean @p_millerd @__drewface something about agency?\n↓\n1742235072575467713 [2024-01-02] @RichDecibels 💜 2 [(SEED) type=semantic_search]\n@visakanv @VinveliVEERA @Malcolm_Ocean @p_millerd @__drewface fwiw my mission is to create social contexts that work like an agency pump, operating on recursive/fractal scales, reciprocating between individual and collective ...\n\ndomino twitter?\n\n===\n\n1742306642413142075 [2024-01-02] @RichDecibels 💜 93 🔁 3\nhad some extremely good thoughts today for the first time in 6 weeks\n↓\n1742497228407652396 [2024-01-03] @RichDecibels 💜 5 [(SEED) type=quote_of_root]\nreceipts: https://t.co/TVfFzblv0L\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1742494880625016921 [2024-01-03] @RichDecibels 💜 1059 🔁 148 💬 20 [(SEED) type=root]\nI drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change\n\ncome with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT\nImages:\n  - [Image #0] The image is a graph titled \"Hosting Capacity as a Measure of Agency\" that illustrates the relationship between group size and duration of commitment in various hosting settings.\n    \n    *   The x-axis represents the \"Duration of commitment,\" ranging from 15 minutes to 3 years.\n        *   The axis is divided into sections, each representing a different time frame: 15 minutes, 1 hour, 3 hours, 1 day, 3 days, 1 week, 1 month, 3 months, 1 year, and 3 years.\n    *   The y-axis represents the \"Group size,\" ranging from 5 to 500.\n        *   The axis is divided into sections, each representing a different group size: 5, 15, 50, 150, and 500.\n    *   The graph features a series of curved lines, each representing a different type of hosting setting.\n        *   The lines are labeled with various hosting settings, such as \"conversation,\" \"boardgame,\" \"dinner party,\" \"workshop,\" \"course,\" \"peer pod,\" \"roadtrip,\" \"camp,\" \"retreat,\" \"festival,\" \"coliving residency,\" \"coliving house,\" \"coliving neighbourhood,\" and \"congregation host.\"\n        *   Each line indicates the maximum group size for a given duration of commitment in that particular hosting setting.\n    *   The graph shows that as the duration of commitment increases, the maximum group size also tends to increase.\n        *   For example, a conversation can be held with a small group of 5 people for a short duration of 15 minutes, while a coliving neighbourhood can accommodate a much larger group of up to 500 people for a longer duration of 3 years.\n    \n    In summary, the graph provides a visual representation of how different hosting settings can accommodate varying group sizes and durations of commitment. It suggests that as the duration of commitment increases, the maximum group size that can be accommodated also tends to increase.\n├── 1742494945615700271 [2024-01-03] @RichDecibels 💜 98 🔁 2 💬 1\n│   you can use this map to self-evaluate your level of agency: where are you currently? what group experiences do you feel comfortable to host? what feels very doable? what would feel like a tolerable stretch? what would be overwhelming even to attempt?\n│   ↓\n│   1742495067695116459 [2024-01-03] @RichDecibels 💜 81 [(SEED) type=semantic_search]\n│   up and to the right = more agency, more capacity for collaborative leadership\n│   \n│   this comes with more responsibility, more ability to mobilise resources, more commitment, more risk, more impact\n│   ↓\n│   1742495235341512949 [2024-01-03] @RichDecibels 💜 83 🔁 1\n│   the steps are roughly continuous: if you’re comfortable running a 1hr workshop for 15 ppl,  a natural next step could be to attempt a 3hr workshop, or design for 50 ppl\n│   \n│   if you’re comfortable hosting a 1-day workshop, next time you could try running a 3-day retreat\n│   ↓\n│   1742495319965745427 [2024-01-03] @RichDecibels 💜 87 🔁 1\n│   a healthy developmental context includes peers, mentors &amp; apprentices\n│   \n│   if you want to stretch to the next level: who do you know who is already competent at that level? are they willing to support your learning process?\n│   ↓\n│   1742495448361775293 [2024-01-03] @RichDecibels 💜 139 🔁 4\n│   never host alone\n│   \n│   the more responsibility you have, the more urgent it is to share it. abuse &amp; corruption stem from excessive power disparity. community burnout stems from too much weight on too few shoulders\n│   ├── 1742495539105603584 [2024-01-03] @RichDecibels 💜 101 🔁 5\n│   │   development happens spontaneously in the right social context\n│   │   \n│   │   the vertical axis starts at 5 people, it does not start at 1, because individualistic self-development is a scam\n│   │   \n│   │   oh you’re going to use your self, to improve your self? good luck with that\n│   │   \n│   │   https://t.co/rx74eCYZk9\n│   │     [Quoting @RichDecibels: un-self-ing development:  I'm not interested in \"self improvement\" as if an individual is a bounded system that contains various habits, beliefs, skills &amp; behaviour patterns that can be upgraded like a phone downloading a new version from the app store]\n│   │   ├── 1742495609817325630 [2024-01-03] @RichDecibels 💜 142 🔁 12\n│   │   │   you can estimate the quality of someone’s opinions about large scale social systems by evaluating their experience as a small scale organiser\n│   │   │   \n│   │   │   if you can’t create harmonious relationships in a collective of 15 ppl, why should I trust your opinion about policing or governance?\n│   │   │   ↓\n│   │   │   1742495745800839479 [2024-01-03] @RichDecibels 💜 103 🔁 6 💬 2\n│   │   │   skipping the micro scale is a mega problem\n│   │   │   \n│   │   │   if you can organise a 20,000 person conference but you don’t know how to design for small-scale conviviality, the vibes will be off. your event will massively fail to deliver on its potential\n│   │   │   ↓\n│   │   │   1742495826314666082 [2024-01-03] @RichDecibels 💜 74 🔁 3\n│   │   │   if you have micro-scale sensitivity then you will attend to the little details that support people to have an excellent experience, maximising meaningful connections\n│   │   │   ↓\n│   │   │   1742495973492830689 [2024-01-03] @RichDecibels 💜 54 🔁 1\n│   │   │   it’s easy to mistake the large &amp; serious challenges facing humanity with infinitely severe, apocalyptic challenges\n│   │   │   ↓\n│   │   │   1742496028580872305 [2024-01-03] @RichDecibels 💜 82 🔁 8\n│   │   │   we need rational hope: neither utopian “good vibes only”, nor apocalyptic “the world is ending”\n│   │   │   \n│   │   │   the world is not ending, but the stakes are very high; we need all hands on deck\n│   │   │   ↓\n│   │   │   1742496108905939328 [2024-01-03] @RichDecibels 💜 114 🔁 10\n│   │   │   apocalyptic thinking stems from psychological pain\n│   │   │   \n│   │   │   the consequence of this pain is epistemic confusion: fear causes you to mistake probabilities for certainties\n│   │   │   \n│   │   │   the cure for this pain is good company\n│   │   │   ↓\n│   │   │   1742496224123461952 [2024-01-03] @RichDecibels 💜 120 🔁 10 💬 1\n│   │   │   courage comes from encouragement\n│   │   │   \n│   │   │   if you’re not getting enough encouragement from peers &amp; mentors, you will feel desperately alone, powerless, paralysed in the face of tectonic social changes\n│   │   │   ↓\n│   │   │   1742496415589306495 [2024-01-03] @RichDecibels 💜 182 🔁 11\n│   │   │   the cure for loneliness is hospitality\n│   │   │   \n│   │   │   someone with charisma, resources &amp; generosity can host a good party, make introductions, and lubricate the formation of social networks\n│   │   │   \n│   │   │   the best place to meet the love of your life is at your friend’s dinner party\n│   │   │   ↓\n│   │   │   1742496533981839465 [2024-01-03] @RichDecibels 💜 88 🔁 6\n│   │   │   to have a good life you need a place &amp; people to belong to, and you need to contribute to their wellbeing\n│   │   │   \n│   │   │   accountant, gardener, artist... it doesn’t matter. what matters is you make a significant contribution to something you’re proud to be part of\n│   │   │   \n│   │   │   https://t.co/teS3JAqRbq\n│   │   │     [Quoting @RichDecibels: belonging &amp; meaningful work are two sides of the same coin]\n│   │   │   ↓\n│   │   │   1742496635899220139 [2024-01-03] @RichDecibels 💜 56 🔁 2 💬 1 [(SEED) type=semantic_search]\n│   │   │   the Microsolidarity Network is a fractal agency pump, reciprocating between individual &amp; collective transformation\n│   │   │   \n│   │   │   we’re learning together: how do you create a social context? what levers can we pull on? what can be engineered, and what needs to be left up to emergence?\n│   │   │   ↓\n│   │   │   1742496753570496814 [2024-01-03] @RichDecibels 💜 68\n│   │   │   my mission for the Microsolidarity Network is to find/recruit/train/encourage/introduce/support/inspire 150×150’s\n│   │   │   \n│   │   │   I mean, 150 people who each have the capacity and willingness to make a long term commitment to host a community of at least 150 people\n│   │   │   ├── 1742496904234115560 [2024-01-03] @RichDecibels 💜 54 🔁 1\n│   │   │   │   “host a community” can mean many things: an online meditation group that meets once a week, a co-living community where everyone lives in the same neighbourhood, an annual festival where people make life-changing friendships...\n│   │   │   │   \n│   │   │   │   https://t.co/eneJHvpLfB\n│   │   │   │     [Quoting @RichDecibels: here's an inside look at The Neighborhood in SF  https://t.co/VOiX5PIFVI]\n│   │   │   │   ↓\n│   │   │   │   1742497027957637243 [2024-01-03] @RichDecibels 💜 54 🔁 1\n│   │   │   │   each step up the ladder of scale creates a developmental container for the previous: your personal development proceeds more smoothly when you have a crew; it’s easier to find a crew when you’re in a congregation; congregations learn from each other in a network...\n│   │   │   │   ↓\n│   │   │   │   1742522497927459123 [2024-01-03] @RichDecibels 💜 57 🔁 1\n│   │   │   │   a counterintuitive way to support your development is to find apprentices\n│   │   │   │   \n│   │   │   │   e.g. after running a few cohorts thru the Microsolidarity course, it no longer felt challenging to us so we trained our replacements, forcing me to make my implicit knowledge explicit\n│   │   │   │   ↓\n│   │   │   │   1742635942278558175 [2024-01-03] @RichDecibels 💜 19 🔁 2\n│   │   │   │   I made a blog post for sharing:\n│   │   │   │   \n│   │   │   │   https://t.co/LrFbiP6JhS\n│   │   │   │   ├── 1743004510107349409 [2024-01-04] @forthrighter 💜 1\n│   │   │   │   │   @RichDecibels I have hosted small groups, can do. Being asked to put together a full day for dozens in the not too distant future and the thread gives me a roadmap of ideas to help with that.\n│   │   │   │   │   \n│   │   │   │   │   My most likely failure mode is to attempt to host alone. Maybe I shouldn’t do that\n│   │   │   │   │   \n│   │   │   │   │   Thanks\n│   │   │   │   │   ↓\n│   │   │   │   │   1743004842443088148 [2024-01-04] @forthrighter 💜 1\n│   │   │   │   │   @RichDecibels Going to a big conference in Feb (thousands) as a volunteer to learn some too. One of my organizing principles internally for communities is “never ever be too good to do the dishes”\n│   │   │   │   │   \n│   │   │   │   │   Is it weird that I’m excited about sweeping floors and setting up tables\n│   │   │   │   └── 1743174789798203441 [2024-01-05] @RichDecibels 💜 11\n│   │   │   │       post your hosting map!\n│   │   │   │       \n│   │   │   │       https://t.co/rtfKloDcuG\n│   │   │   │         [Quoting @Malcolm_Ocean: the main things I've (co-)hosted!  post yours 🚀 https://t.co/vlck8r4ott]\n│   │   │   │       ↓\n│   │   │   │       1743191963870879938 [2024-01-05] @RichDecibels 💜 10\n│   │   │   │       post your hosting map!\n│   │   │   │       \n│   │   │   │       https://t.co/Wq0aXGcifq\n│   │   │   │         [Quoting @justavagrant_: the main things I've (co-)hosted! https://t.co/mxRRS2dOhl]\n│   │   │   │       ↓\n│   │   │   │       1745440554446442910 [2024-01-11] @RichDecibels 💜 12\n│   │   │   │       temporary community is how you build permanent community\n│   │   │   │       \n│   │   │   │       https://t.co/xR0NXj4hZg\n│   │   │   │         [Quoting @gptbrooke: I’m obviously biased but MULTI-DAY EVENTS ARE SO IMPORTANT  I’m at a thing and walking in I was like oh hi person I met at foresight, other person I met at future forum, person I met at zuzalu, and person I got to know at manifest]\n│   │   │   └── 1742524055004262697 [2024-01-03] @visakanv 💜 3\n│   │   │       @RichDecibels lfg https://t.co/SpTE9OFnsS\n│   │   │       Images:\n│   │   │         - [Image #0] The image shows a still from the movie \"The Lord of the Rings\" featuring a man with long brown hair and a serious expression, with the caption \"You have my sword\" at the bottom. The man is likely Boromir, a character from the film.\n│   │   │       ↓\n│   │   │       1742524370260558326 [2024-01-03] @RichDecibels 💜 2\n│   │   │       @visakanv 🙇‍♂️\n│   │   └── 1742506908001435851 [2024-01-03] @mechanical_monk 💜 1\n│   │       @RichDecibels everyone starts at 1 tho; you have to get to 5 *somehow*\n│   │       ↓\n│   │       1742507758748910010 [2024-01-03] @RichDecibels 💜 2\n│   │       @mechanical_monk yes, by stumbling into an unusually welcoming 50 and finding your 5 there\n│   └── 1743549428844175583 [2024-01-06] @pepijndevos 💜 4\n│       @RichDecibels @rickbenger 🤔🥺 pepicamp is definitely the up-rightest thing I've done ever. It somehow doesn't feel like a super big responsibility though, and I have @alineblooms as a co-host, although I guess we haven't really formalised what that even means haha\n│       ↓\n│       1743549769853669625 [2024-01-06] @RichDecibels 💜 4\n│       @pepijndevos @rickbenger @alineblooms maybe the tpot scene as a whole is doing some of the heavy lifting for you\n│       ↓\n│       1743553580332704220 [2024-01-06] @pepijndevos 💜 4 💬 1\n│       @RichDecibels @rickbenger @alineblooms There is also a third axis to your plot, something like intensity or load. Like, picking a campsite is a whole different thing from personally giving a multi day workshop. Pepicamp feels more like an extended picnic. Maybe a giant underestimation, we'll see.\n│       ↓\n│       1743554891425980471 [2024-01-06] @RichDecibels 💜 3\n│       @pepijndevos @rickbenger @alineblooms I don't think you're underestimating fwiw\n│       ↓\n│       1743555580638179448 [2024-01-06] @pepijndevos 💜 3\n│       @RichDecibels @rickbenger @alineblooms Thanks for the support in this learning process 🙏😘\n├── 1742500752310866296 [2024-01-03] @michelleakin 💜 13\n│   @RichDecibels im the step before retreat, in terms of what i have done. and im very aware that moving further requires more than just me. but eventually i will ☺️\n│   \n│   thanks for this, it helped me parse between “I don’t want to go further” and “I have yet to go further”\n│   ↓\n│   1742504947814481968 [2024-01-03] @RichDecibels 💜 6\n│   @MichelleAkin you have many willing aides waiting to help\n│   ↓\n│   1742531361196457994 [2024-01-03] @michelleakin 💜 1\n│   @RichDecibels This is very true!\n├── 1742502163279130950 [2024-01-03] @justavagrant_ 💜 4\n│   @RichDecibels I love this. Something I might add is a dimension around… time/effort? I’ve gotten quite good at creating the bottom left corner in very short time and without too much efforting\n│   ↓\n│   1742505217663422605 [2024-01-03] @RichDecibels 💜 2\n│   @justavagrant_ ya there's many missing dimensions. not sure yet how to extend it\n├── 1742531699408245160 [2024-01-03] @alex_with_ease 💜 3\n│   @RichDecibels Interesting to note the difference in placement between \"could improvise without too much effort\" and \"would be the next major project\". I have the intuition that raising the former is at least as important as the latter, at least for me.\n├── 1742531952467472634 [2024-01-03] @alex_with_ease 💜 6\n│   @RichDecibels Love how excited I feel reading this, feeling inspired to be one of the 150\n│   ↓\n│   1742552559062061176 [2024-01-03] @RichDecibels 💜 2\n│   @alex_with_ease 🔥\n├── 1742550420298301654 [2024-01-03] @patcon_ 💜 2\n│   @RichDecibels This is super helpful &amp; thoughtful! Wondering about things hugging higher up the y-axis. As in, ppl who coord 300M people to engage for 30 mins. i.e., electoral democracy. And for ppl working their way up that axis: is that neutral, harmful, or just a non-overlapping magisteria?\n│   ↓\n│   1742551101054791890 [2024-01-03] @patcon_ 💜 1\n│   @RichDecibels As in, ppl learning about those big, shallow, short things simply have little to offer those learning about the other?\n├── 1742554367742316597 [2024-01-03] @patcon_ 💜 3\n│   @RichDecibels I like the idea of choosing to get to a certain scale (whether size or duration), and then just locking those variables and moving out of the plane, into another dimension. For example, dialing in on distribution of power or diversifying leadership, or becoming more invisible :)\n├── 1742576072137310641 [2024-01-03] @michelleakin 💜 12\n│   @RichDecibels Just gonna https://t.co/dIuTvNqs0Y\n│     [Quoting @michelleakin: I should be working, @RichDecibels stop inspiring me (don’t stop) https://t.co/0deywloM46]\n│   ↓\n│   1742590109818527800 [2024-01-03] @RichDecibels 💜 2\n│   @MichelleAkin 🙏😂\n├── 1743037580327956661 [2024-01-04] @christineist 💜 6\n│   @RichDecibels amazing thread rich, was just thinking I want to attend a microsolidarity get together this year!\n│   ↓\n│   1743173766568444385 [2024-01-05] @RichDecibels 💜 3\n│   @christineist nothing locked in yet but expect something in PNW mid year and a lot of online stuff throughout\n├── 1743086477301657871 [2024-01-05] @Malcolm_Ocean 💜 4\n│   @RichDecibels poast hoasting maps!\n│   \n│   @RichDecibels @gptbrooke @jasoncbenn @Prigoose @__drewface @TylerAlterman @danielgolliher @conaw @utotranslucence @this_is_silvia @myceliummage \n│   (https://t.co/Y4dJ01I4JK is a free online old-photoshop clone that works well)\n│   https://t.co/f1UvI9YSc8\n│     [Quoting @Malcolm_Ocean: the main things I've (co-)hosted!  post yours 🚀 https://t.co/vlck8r4ott]\n├── 1743545591659999261 [2024-01-06] @neno_is_ooo 💜 2\n│   @RichDecibels also lots of people that I know in ‘leadership’ positions that have very poor temporal agency as they maximize y but unable to keep sustained commitment over time - these people are often at the root of burning out communities\n│   ↓\n│   1743546422492901712 [2024-01-06] @RichDecibels 💜 1\n│   @ogSamovar another good reason to recruit your replacements\n├── 1743547391267979547 [2024-01-06] @neno_is_ooo 💜 1\n│   @RichDecibels Also know lots of people that are oddly and specifically vertically good at the extremes (eg good at festival/coliving and unable to have deep/interesting 1-1 convos)\n│   ↓\n│   1743547738631913753 [2024-01-06] @RichDecibels \n│   @ogSamovar they'll do well with complementary collaborators\n│   ↓\n│   1743556514625794304 [2024-01-06] @neno_is_ooo 💜 1\n│   @RichDecibels not always unfortunately :/ since they’re not really good at 1-1 relationships in general. Often they do ‘ok’ (not ‘well’) with hired subordinates but not peer collaborators\n├── 1743954163296297436 [2024-01-07] @neno_is_ooo 💜 3\n│   @RichDecibels Also adjacently relevant, here’s another powerful tool I got from @ShiverTweet years ago that brought lots of clarity and pace in otherwise ambiguous community/large scale projects where many loosely coupled people contribute differently at diff time &amp; rates https://t.co/muRK5tqsUI\n│   Images:\n│     - [Image #0] The image is a graph titled \"Clarity of future state\" on the y-axis and \"Focus and determination\" on the x-axis, both ranging from low to high. To reproduce this diagram, follow these steps:\n│       \n│       * Create a square graph with two axes.\n│       * Label the y-axis \"Clarity of future state\" and the x-axis \"Focus and determination\".\n│       * Divide the graph into four quadrants using curved lines.\n│       * Label the quadrants as follows:\n│       \t+ Lower left: \"Drifting\" in blue\n│       \t+ Upper left: \"Dreaming\" in purple\n│       \t+ Lower right: \"Delivering\" in orange\n│       \t+ Upper right: \"Driving\" in green\n│       * Ensure the colors and labels are correctly placed in their respective quadrants.\n│       \n│       The graph is used to illustrate different states of progress or productivity, with \"Drifting\" representing low clarity and focus, \"Dreaming\" representing high clarity but low focus, \"Delivering\" representing high focus but low clarity, and \"Driving\" representing both high clarity and focus.\n│   ↓\n│   1743954370041962919 [2024-01-07] @neno_is_ooo 💜 1\n│   @RichDecibels @ShiverTweet You can interchange the y axis with ‘knowledge about the system’\n├── 1822353521058140253 [2024-08-10] @Malcolm_Ocean 💜 2\n│   @RichDecibels oops I accidentally put America on your chart\n│   \n│   (may also be of interest to anyone looking to plot something that's outside your scale)\n│   https://t.co/lDBmC6tJIc\n│     [Quoting @Malcolm_Ocean: like if America were on this chart...  https://t.co/KKul5ofZNh https://t.co/NgIHWwUPyS]\n│   ↓\n│   1822355602560938281 [2024-08-10] @RichDecibels \n│   @Malcolm_Ocean beast mode\n└── 1904047507602075802 [2025-03-24] @tasshinfogleman 💜 5\n    @RichDecibels genuine, open question: what's between a coliving neighborhood (500 people x 3y) and a network state (10-100,000+ people x 5-25+y) https://t.co/x7kDKLaZeW\n      [Quoting @RichDecibels: guy who has never hosted a dinner party: I should start a network state]\n    ↓\n    1904049495186256074 [2025-03-24] @tasshinfogleman 💜 1\n    @RichDecibels (asked a guy who's only hosted retreats)\n\n===\n\n1742500854802907205 [2024-01-03] @michelleakin 💜 3 [(SEED) type=quote_of_root]\n“the thread is long and full of bangers” ☠️ https://t.co/685uSEUqPf\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1742532614215303314 [2024-01-03] @abhayance 💜 5 [(SEED) type=quote_of_root]\nthis thread is 🔥 https://t.co/Po4qg3nAGx https://t.co/uewPhtnSeo\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1742533932510331390 [2024-01-03] @michelleakin 💜 1\n@abhayance “the thread is long and full of bangers…” was accurate advertising!!!\n↓\n1742539219296264629 [2024-01-03] @abhayance 💜 1\n@MichelleAkin here’s to good company, encouragement, and hospitality 💗\n↓\n1742540496507936819 [2024-01-03] @michelleakin 💜 1\n@abhayance https://t.co/tTmdCnahSS\nImages:\n  - [Image #0] The image depicts a young woman standing in front of a lush green backdrop, giving a thumbs-down gesture.\n    \n    The woman has long blonde hair and is wearing a dark blue shirt. She is facing the camera with a frown on her face, her right arm bent at the elbow and her thumb pointed downwards. Her left hand is clenched into a fist, positioned in front of her chest. The background is a dense thicket of greenery, with large leaves and plants visible behind the woman.\n\n===\n\n1742602108925333640 [2024-01-03] @alcentian_one  [(SEED) type=semantic_search]\nstarting a thread for community / local organizing / microsolidarity 🧶 https://t.co/FuzGIybqdI\n  [Quoting @RichDecibels: thinking about this community map  this part of twitter is interesting coz ppl realised they could move right, from temporary to permanent online relationships  then the swarm of camps proved we can do temporary local community  now the big Q: how to land in the bottom right? https://t.co/RNN2S4WEHr]\n\n===\n\n1742621652586836197 [2024-01-03] @grin_io 💜 16 [(SEED) type=quote_of_root]\nthe style of event that's common \"around here\" (eg vibecamp, the *camps, ethdenver, burning man) is popular specifically because it is collaborative (attendees are also contributors), which caters to people who want to level up their agency https://t.co/z5ikma3yUy\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n↓\n1742630972779098255 [2024-01-03] @RichDecibels 💜 2\n@grin_io I wonder if it would be useful to make the \"agency pump\" more explicit, eg encouraging people to think about where they are on this chart and what kind of initiatives would be fun to stretch into their ideal place\n\n===\n\n1742737462516961459 [2024-01-04] @danallison 💜 2 [(SEED) type=quote_of_root]\nOne of the motivating factors for me to build @DecisiveTeam_ and democracy improv is my continual frustration with the obstacles I encounter when trying to grow along these dimensions. … https://t.co/67DZqbCq4F\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n↓\n1742737517059702972 [2024-01-04] @danallison \nDue to narcolepsy and other energy-constraining health conditions, my capacity to play a leadership role is limited. This is really frustrating because the universe seems to keep tasking me with a bunch of shit that requires leadership capacity.\n↓\n1742737520985612787 [2024-01-04] @danallison \nThe idea behind @DecisiveTeam_ and democracy improv is to sidestep the leadership bottleneck using leaderless group decision-making methods.In woo terms, the idea is to summon the group’s egregore and assign it a leadership role. https://t.co/uEPdkkIsNi\n  [Quoting @danallison: It’s kinda funny how we think of voting as a civic duty, almost like it’s a chore, when it’s actually got serious occult vibes, like a giant Ouija board. Voting is a magical act. https://t.co/SdcIFbC63c]\n↓\n1742737523762168125 [2024-01-04] @danallison 💜 1\nThis idea is still unproven, so my main focus right now is on small scale low stakes use cases, like games and creative experiments. Eventually the goal is to scale up to higher stakes domains where the leadership bottleneck is especially pronounced.\n\n===\n\n1742791214934683660 [2024-01-04] @forthrighter 💜 4 [(SEED) type=quote_of_root]\nHe promised many bangers. He delivered. https://t.co/GJSs8DkaH0\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1743008082081333327 [2024-01-04] @RichDecibels 💜 124 🔁 1 [(SEED) type=quote_of_root]\nngl it feels real good to put a lot of effort into something and have 100,000 people see it https://t.co/TVfFzblv0L\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n├── 1743083375965913375 [2024-01-05] @michelleakin 💜 2\n│   @RichDecibels well deserved.\n│   ↓\n│   1743174668465439006 [2024-01-05] @RichDecibels 💜 1\n│   @MichelleAkin grazie\n└── 1743124357424246933 [2024-01-05] @Malcolm_Ocean 💜 1\n    @RichDecibels 💪👑\n\n===\n\n1743078860714065945 [2024-01-05] @Malcolm_Ocean 💜 4 [(SEED) type=quote_of_root]\neven further off the top right of the chart is \"found a country or city\" https://t.co/KKul5ofZNh\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1743080673613869124 [2024-01-05] @Malcolm_Ocean 💜 20 🔁 4 💬 2 [(SEED) type=quote_of_root]\nthe main things I've (co-)hosted!\n\npost yours 🚀 https://t.co/vlck8r4ott\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\nImages:\n  - [Image #0] The image presents a graph titled \"Hosting Capacity as a Measure of Agency,\" which illustrates the relationship between group size and duration of commitment. The graph features a semi-circular shape, with the x-axis representing the duration of commitment and the y-axis representing the group size.\n    \n    **Key Features:**\n    \n    *   The x-axis is labeled \"Duration of commitment\" and ranges from 15 minutes to 3 years.\n    *   The y-axis is labeled \"Group size\" and ranges from 5 to 500.\n    *   The graph includes various colored dots, each representing a different type of gathering or event, such as:\n        *   Conversation\n        *   Dinner party\n        *   Boardgame\n        *   Workshop\n        *   Party w\n        *   Course\n        *   Peer pod\n        *   Roadtrip\n        *   Camp\n        *   Focus day\n        *   Retreat\n        *   Coherence retreat\n        *   Festival\n        *   Coliving residency\n        *   Coliving neighbourhood\n        *   Congregation host\n        *   Coliving house\n        *   EMS co-living\n    \n    **Color-Coded Categories:**\n    \n    *   Green: beyond goals intensive, conversation café\n    *   Purple: workshop, course, party w\n    *   Pink: peer pod, focus day\n    *   Blue: roadtrip, retreat, coherence retreat\n    *   Yellow: EMS co-living\n    \n    **Visual Representation:**\n    \n    The graph provides a visual representation of how different types of gatherings or events are distributed across the spectrum of group size and duration of commitment. The semi-circular shape of the graph suggests that there is a natural limit to the number of people that can be effectively hosted for a given duration.\n    \n    **Insights:**\n    \n    *   The graph highlights the diversity of hosting capacities across different types of gatherings or events.\n    *   It suggests that some events, such as conversations and dinner parties, are typically small and short-lived, while others, such as festivals and coliving neighborhoods, can be much larger and longer-term.\n    *   The graph also implies that there may be a trade-off between group size and duration of commitment, with larger groups often requiring longer commitments.\n    \n    Overall, the graph offers a unique perspective on the complex relationships between group size, duration of commitment, and hosting capacity.\n↓\n1743174586521342302 [2024-01-05] @RichDecibels 💜 3\n@Malcolm_Ocean 😍😍\n\nis there a spot on the map that you wanna hike to in the next few years?\n↓\n1743180137292874224 [2024-01-05] @Malcolm_Ocean 💜 2\n@RichDecibels more rightwards than upwards (pretty keen on getting coliving stuff of some kind going)\n\nbut also in the z-dimension, of increased synergy/​flow/​intimacy/​epicness among a group of 20-for-a-week or 5-for-a-day\n\nI have lots more skill to gain there\n↓\n1743180968121282763 [2024-01-05] @RichDecibels 💜 3 🔁 1\n@Malcolm_Ocean *slaps roof of imagination* we can fit so many Z-axes in this bad boy\n\n===\n\n1743529282092114427 [2024-01-06] @rickbenger 💜 5 [(SEED) type=quote_of_root]\n🧨 thread.\n\nIf you're into community stuff, what's your sweet-spot on the chart? \n\nSweet-spot is personal. A place of rational hope, of joy as well as a stretch, of flowering and tending the soil.\n\nBigger ain't better! A phenom dinner party host &gt; a burnt-out festival organizer. https://t.co/D0N8vKqsi8\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1743544377534799999 [2024-01-06] @rickbenger 💜 5 [(SEED) type=quote_of_semantic_search]\nthe vital thing that @micro_solid gets — structure and scale are *ultimately in service of the micro*. \n\nthe greatest successes of a community are its 1-1 or 1-a few relations. You meet your husband, your bestie, your crack squad of collaborators. https://t.co/1pKwwsxuSQ\n  [Quoting @RichDecibels: the Microsolidarity Network is a fractal agency pump, reciprocating between individual &amp; collective transformation  we’re learning together: how do you create a social context? what levers can we pull on? what can be engineered, and what needs to be left up to emergence?]\n↓\n1743546551258042833 [2024-01-06] @rickbenger 💜 2\n@micro_solid if you are building social contexts, there's some paradox to hold, here. \n\na healthy context (150+ plus) is healthy when members form deeper bonds at smaller scales,  often participating less in the context over time. \n\nyet, a healthy context needs a concentration...\n↓\n1743547459047977037 [2024-01-06] @rickbenger 💜 1\n@micro_solid of resources, attention, effort, clout, to establish itself and exist. \n\nand if modern life is hostile to community-stuff, it's the congregation scale (~150) that is most fragile to the hostility. Often these places and groups exist solely...\n↓\n1743550224839131398 [2024-01-06] @rickbenger 💜 2\n@micro_solid from the 'irrational' devotion of heart, sweat and $ of a few organizers.\n\nThere's outsized potential impact for the flow of wise social capital, here. To people and organizations who honor the micro, grok the life-death cycles of community, and don't slap a TM on the emergent.\n\n===\n\n1743553890916683831 [2024-01-06] @rickbenger 💜 5 [(SEED) type=quote_of_root]\nwhat's the most informative z-axis for this chart? https://t.co/D0N8vKqsi8\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n├── 1743554062916735002 [2024-01-06] @rickbenger 💜 1\n│   https://t.co/MUeYpELY3j\n│     [Quoting @pepijndevos: @RichDecibels @rickbenger @alineblooms There is also a third axis to your plot, something like intensity or load. Like, picking a campsite is a whole different thing from personally giving a multi day workshop. Pepicamp feels more like an extended picnic. Maybe a giant underestimation, we'll see.]\n└── 1743555367059988973 [2024-01-06] @RichDecibels 💜 8\n    @rickbenger not sure how to represent it but periodicity/intermittency / permanence is painfully missing. eg 1hr meeting once, vs every week for a year is a different beast. a cohouse of 10 permanent residents or a community centre with capacity for 10 but 1000 occasional visitors...\n    ↓\n    1743556273109418214 [2024-01-06] @rickbenger 💜 3\n    @RichDecibels ya that's one avenue. \n    \n    i think the way you've got it is awesome for helping people think \"where do I start\"/what's iteration 1 look like.\n    ↓\n    1743556617512054787 [2024-01-06] @rickbenger 💜 1\n    @RichDecibels which is great for emphasising concretes/experiences/seasons.\n\n===\n\n1743555207852589493 [2024-01-06] @pepijndevos 💜 5 [(SEED) type=quote_of_root]\nWhere will pepicamp land on the vertical axis? Either way it's going to be a big leap up from picnics and boardgames. https://t.co/SlMchGbWja https://t.co/gqblsUelAZ\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1766279604799771088 [2024-03-09] @Malcolm_Ocean 💜 12\nAmerica is arguably the largest scale intentional community\n↓\n1766279606351605884 [2024-03-09] @Malcolm_Ocean 💜 20 🔁 4 💬 1 [(SEED) type=quote_of_root]\nlike if America were on this chart...\n\nhttps://t.co/KKul5ofZNh https://t.co/NgIHWwUPyS\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\nImages:\n  - [Image #0] The image is a graph titled \"Hosting Capacity as a Measure of Agency\" with an American flag in the top-right corner. The graph features a gray-scale color scheme and is divided into two axes: \"Group size\" on the y-axis and \"Duration of commitment\" on the x-axis.\n    \n    *   The y-axis ranges from 5 to 500M, with increments of 5, 15, 50, 150, 500, 1.5M, 5M, 15M, 50M, 150M, and 500M.\n    *   The x-axis spans from 15 minutes to 300 years, with labels at 15 minutes, 1 hour, 3 hours, 1 day, 3 days, 1 week, 1 month, 3 months, 1 year, 3 years, 10 years, 30 years, 100 years, and 300 years.\n    *   The graph contains various gray-shaded regions, each representing different types of events or activities, including:\n        *   Conversation\n        *   Dinner party\n        *   Boardgame\n        *   Peer pod\n        *   Roadtrip\n        *   Workshop\n        *   Course\n        *   Camp\n        *   Retreat\n        *   Festival\n        *   Coliving residency\n        *   Congregation host\n        *   Coliving neighborhood\n        *   Coliving house\n    \n    The graph illustrates the relationship between group size and duration of commitment for various activities, with larger groups typically requiring longer commitments. The image suggests that as the duration of commitment increases, the potential hosting capacity also grows, allowing for larger and more complex events or communities to be hosted.\n├── 1766280613395365894 [2024-03-09] @danielbrottman 💜 2\n│   @Malcolm_Ocean zoom out to 200k years for all modern humanity. a somewhat similar thought i had once, upon doing some circling for the first time, is realizing that the whole world is the biggest circle, and we're just trying to figure out how to manage it well\n│   ├── 1766601343081332976 [2024-03-09] @Malcolm_Ocean 💜 1\n│   │   @danielbrottman mood\n│   │   \n│   │   tho unlike a circle it doesn't actually have a set of shared agreements for when you step into it, so there's a need for a different kind of groundless negotiation\n│   │   ↓\n│   │   1766601440728912336 [2024-03-09] @Malcolm_Ocean 💜 1\n│   │   @danielbrottman which is kinda what a bunch of my work is about\n│   │   \n│   │   https://t.co/ha0LSWS3v3\n│   │     [Quoting @Malcolm_Ocean: In what language do we negotiate? In what language do we negotiate what language to conduct our negotiation in?]\n│   │   ↓\n│   │   1766601743805141155 [2024-03-09] @Malcolm_Ocean 💜 1\n│   │   @danielbrottman ah I actually tweeted this\n│   │   https://t.co/JfVUZRLyVt\n│   │     [Quoting @Malcolm_Ocean: we agree to behave in thus and such a way, for the duration of the container (circling, whatever)  what is our agreement for how we behave when the bell goes off and the container ends?]\n│   │   ↓\n│   │   1766602088459420095 [2024-03-09] @Malcolm_Ocean 💜 1\n│   │   @danielbrottman a good piece on all of this if you or others are interested\n│   │   \n│   │   (I know I've seen you around a bunch Daniel, maybe you've already read this)\n│   │   https://t.co/qXw4qUt0r7\n│   │   ↓\n│   │   1766606392704516116 [2024-03-09] @danielbrottman 💜 1\n│   │   @Malcolm_Ocean thank you! :)\n│   └── 1766602174258126872 [2024-03-09] @Malcolm_Ocean 💜 1\n│       @danielbrottman I'm curious how that thought has unfolded for you since!\n│       ↓\n│       1766606867705340011 [2024-03-09] @danielbrottman \n│       @Malcolm_Ocean not in any specific ways i can point to but i appreciate the curiosity 🙏\n├── 1766341736761082215 [2024-03-09] @__drewface 💜 2\n│   @Malcolm_Ocean We can expand the circle, too!\n└── 1766603041023676768 [2024-03-09] @Malcolm_Ocean 💜 1\n    yeah! \"arguably\" in both cases!\n    \n    but re USA specifically... its origin story parallels \"intentional communities\" more than many countries, as a coming together of a bunch of people united by purpose. that elides lots of stuff but attitudinally feels right\n    https://t.co/LJGXWCeF34\n      [Quoting Tweet 1766288139751219436 (missing)]\n\n===\n\n1766341602870439953 [2024-03-09] @__drewface  [(SEED) type=quote_of_root]\nRT @Malcolm_Ocean: like if America were on this chart...\n\nhttps://t.co/KKul5ofZNh https://t.co/NgIHWwUPyS\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1766613778307613096 [2024-03-09] @Prigoose  [(SEED) type=quote_of_root]\nRT @Malcolm_Ocean: like if America were on this chart...https://t.co/KKul5ofZNh https://t.co/NgIHWwUPyS\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1802971123136835720 [2024-06-18] @justavagrant_ 💜 12 🔁 2 [(SEED) type=quote_of_root]\nI drew some diagrams to express a map of ways to cultivate more closeness/connection/intimacy in a relationship or group (crew), inspired by @RichDecibels! Hopefully useful if you're like \"I got a group of not close acquaintances but I want more\"Essay link below https://t.co/qsgAUS8Sz1 https://t.co/3vxI9BiHUy\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\nImages:\n  - [Image #0] The image shows a hand-drawn graph on a piece of paper, illustrating the relationship between intimacy and duration. The graph features a y-axis labeled \"Intimacy\" and an x-axis labeled \"Duration,\" with various activities plotted along the axes.\n    \n    The y-axis ranges from \"Chat\" at the bottom to unspecified higher levels of intimacy towards the top, while the x-axis is marked with time intervals from \"15min\" to \"3yr.\" The graph includes several data points, each representing a different activity, such as:\n    \n    * \"Gathering\" \n    * \"Day Trip\"\n    * \"Weekend Trip\"\n    * \"Crewing\"\n    * \"Coliving\"\n    * \"International Trip\"\n    * \"Changing\"\n    \n    These activities are positioned according to their corresponding levels of intimacy and duration. The graph appears to be a rough, handwritten diagram, likely created for personal or illustrative purposes rather than formal presentation.\n├── 1802971126085357863 [2024-06-18] @justavagrant_ 💜 1\n│   https://t.co/G13KqVAunm\n└── 1803995723547185355 [2024-06-21] @justavagrant_ \n    Todo: this but dotted with activities you can do, eg reading a book together, chatting, troika, case clinic, board games, AR/circling, etc\n    ↓\n    1803995866732359833 [2024-06-21] @justavagrant_ \n    Maybe the X axis is structured-ness and Y axis is intimacy\n\n===\n\n1823174076921212954 [2024-08-13] @tasshinfogleman 💜 36 🔁 3 💬 1\nabout a billion times a month i send @mary_bajorek tweets that are related to our Empowerment work together at the Service Guild. going to share and curate some of those tweets in this thread!\n\n===\n\n1823179070735110441 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/RPuMhHykK6\n  [Quoting Tweet 1572858051165835266 (missing)]\n↓\n1823179153723564403 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/kVQiNnvCil\n  [Quoting Tweet 1740795952770715767 (missing)]\n↓\n1823179204088795570 [2024-08-13] @tasshinfogleman \nhttps://t.co/vTFiiSymIL\n  [Quoting Tweet 1741524510640406832 (missing)]\n↓\n1823179257498993092 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/xJOc2IH35S\n  [Quoting @relic_radiation: external validation gets a bad rap but I think there’s something really natural about wanting to meaningfully contribute to the flow of powers in the world, in a way that’s valued  like, imo “external validation” isn’t bad, it’s just weirdly miscalibrated from internal nowadays]\n↓\n1823179320350957740 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/MZfXoUR9Ex\n  [Quoting Tweet 1741533729040867801 (missing)]\n↓\n1823179364617383938 [2024-08-13] @tasshinfogleman \nhttps://t.co/7ulh0cP2sT\n  [Quoting Tweet 1741851003618533622 (missing)]\n↓\n1823179462336196692 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/W5YynxPemc\n  [Quoting Tweet 1741923740085010814 (missing)]\n↓\n1823179495240597916 [2024-08-13] @tasshinfogleman \nhttps://t.co/tcGGZAJCt0\n  [Quoting Tweet 1741929956446548049 (missing)]\n↓\n1823179639813967941 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/je4cWmTnhz\n  [Quoting @gptbrooke: 2024 goals  0. Build a gathering with the potential to culturally outcompete Burning Man  1. Turn said gathering into a globe-spanning community for the weirdos and outliers   2. Build rails to help people flourish socially and professionally   3. Troll]\n↓\n1823179730193170859 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/MUAqDIAChS\n  [Quoting @the_wilderless: “There is a meta-network of people putting a careers worth of time and effort into the capacities needed for regenerative social transformation and solutions in all areas of life.  Almost all of them are living with financial insecurity.” https://t.co/HmO6ZLzSge]\n↓\n1823179794940322030 [2024-08-13] @tasshinfogleman  [(SEED) type=quote_of_root]\nhttps://t.co/41N8Ocgm39\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n↓\n1823179891107385809 [2024-08-13] @tasshinfogleman \nhttps://t.co/NJjfD4AI5X\n  [Quoting Tweet 1742613115345199335 (missing)]\n↓\n1823180017934983258 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/ZtTIFuPejh\n  [Quoting @__drewface: if you can show someone, even a stranger, that you are on their team, then you can win their heart.  by teaming, even for a brief moment, we experience unity, and I believe this unity saves lives, redeems our humanity, gives us hope, shows us the way forward, etc...]\n↓\n1823180061387927647 [2024-08-13] @tasshinfogleman \nhttps://t.co/psuo7C3m15\n  [Quoting @visakanv: if you're a field medic and you're surrounded by people who are in various degrees of incapacitation, one of the best choices you can make, is to help another field medic  this is very obvious to gamers, idk how obvious it is to everyone else]\n↓\n1823180140181856443 [2024-08-13] @tasshinfogleman \nhttps://t.co/JTph7tu6ur\n  [Quoting Tweet 1746031103465402733 (missing)]\n↓\n1823180188546457937 [2024-08-13] @tasshinfogleman \nhttps://t.co/tJB7MIAWh2\n  [Quoting @TylerAlterman: Being part of a magical supportive crew is sooooo rare. I probably should've built my whole life around the few I've experienced. Instead we let ourselves get picked off by grass-is-greener-style opportunities, petty squabbles, or default endings (eg \"school is over now\")Loyalty to your crew isn't strongly enough in the cultural waters]\n↓\n1823180240363151398 [2024-08-13] @tasshinfogleman 💜 1\nhttps://t.co/l0aTAglAhe\n  [Quoting @blisstweeting: I need to say that this meme format turned out to be a perfect one for nudging my friends about the things that would be beneficial for them but which they are reluctant to commit to https://t.co/zcCntE2gLK]\n↓\n1823180484731429094 [2024-08-13] @tasshinfogleman \nhttps://t.co/u3zTXGKwPb\n  [Quoting @visakanv: I always think about how \"get a job!!\" would've been met by \"what the fuck is a job?\" by hunter-gatherers https://t.co/HM4eg2XuVK]\n↓\n1823180601169494293 [2024-08-13] @tasshinfogleman 💜 2\nhttps://t.co/S0iqrnGdFN\n  [Quoting Tweet 1748135277627871255 (missing)]\n↓\n1823180696342413555 [2024-08-13] @tasshinfogleman \nhttps://t.co/wkA7CbFNUi\n  [Quoting @strangestloop: a large part of the increase in my well-being has come from seeing the qualities in myself that other people see in me]\n↓\n1823180736481923098 [2024-08-13] @tasshinfogleman \nhttps://t.co/TNuC5E9SKc\n  [Quoting Tweet 1750639515130003671 (missing)]\n\n===\n\n1904114702143406303 [2025-03-24] @tasshinfogleman 💜 27 🔁 1 [(SEED) type=quote_of_root]\nthis image is a skilltree in disguise btw https://t.co/udbfmUF6lp\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n\n===\n\n1923825089449177284 [2025-05-17] @meansinfinity 💜 1528 🔁 88 💬 1\nI just published my first essay!\n\nIt's about some of the invisible forces that make or break group flow.\n\nIf you're ever wanted to host a gathering, a residency, a coliving experiment, or even a twitter camp, check it out :) https://t.co/YV5yGzc5Vc\nImages:\n  - [Image #0] The image is a screenshot of an article titled \"How to Foster Coherence in Co-Created Spaces\" by Ananta, published on May 17, 2025.\n    \n    Here is a detailed description of the image:\n    \n    *   **Title and Author Information**\n        *   The title \"How to Foster Coherence in Co-Created Spaces\" is prominently displayed at the top of the image.\n        *   Below the title, the author's name \"ANANTA\" and publication date \"MAY 17, 2025\" are shown.\n        *   A circular profile picture of the author is visible next to their name.\n    *   **Article Content**\n        *   The article begins with a paragraph that reads: \"You've probably felt it. That electric buzz at the start of a co-created gathering. The people are inspiring. The conversations are alive. The air is thick with possibility. And then...it unravels. The kitchen's a mess. No one's sure what's happening when. The spark fades into confusion, frustration, and strain.\"\n    *   **Interaction Buttons**\n        *   Below the article content, there are three interaction buttons: a heart, a speech bubble, and a share button.\n        *   The heart button has a count of \"1\" next to it, indicating that one person has liked the article.\n    *   **Background**\n        *   The background of the image is white, providing a clean and simple backdrop for the article content.\n    \n    In summary, the image shows a screenshot of an article discussing the challenges of maintaining coherence in co-created spaces, with a focus on the initial excitement and subsequent challenges that can arise during such gatherings.\n↓\n1924129664571933160 [2025-05-18] @br___ian 💜 5 [(SEED) type=semantic_search]\n@meansinfinity oh cool you included a diagram of every social thing i have ever tried to organize https://t.co/VXJLjW4mDD\nImages:\n  - [Image #0] The image is a simple diagram featuring a central node connected to eight other nodes, arranged in a radial pattern. The central node is teal, while the surrounding nodes are colored in various shades of pink, blue, and brown.\n    \n    **Key Features:**\n    \n    *   **Central Node:** Teal in color\n    *   **Surrounding Nodes:** Eight nodes, colored in shades of pink, blue, and brown\n    *   **Connections:** Black lines connect the central node to each of the surrounding nodes\n    *   **Background:** White background with a thick black border\n    *   **Text:** \"@meansinfinity\" written in small black text at the bottom right corner of the image\n    \n    **Visual Representation:**\n    \n    The diagram is presented on a white background, surrounded by a thick black border. The overall design is clean and minimalist, with a focus on showcasing the connections between the nodes.\n    \n    **Reproduction Instructions:**\n    \n    To recreate this diagram, follow these steps:\n    \n    1.  Start with a white background and a thick black border.\n    2.  Create a central node in teal.\n    3.  Arrange eight surrounding nodes in a radial pattern around the central node.\n    4.  Color the surrounding nodes in shades of pink, blue, and brown.\n    5.  Connect the central node to each of the surrounding nodes using black lines.\n    6.  Add the text \"@meansinfinity\" in small black text at the bottom right corner of the image.\n    \n    By following these steps, you can accurately reproduce the diagram depicted in the image.\n↓\n1924134415279743338 [2025-05-18] @meansinfinity 💜 1\n@br___ian hahaha\n\n===\n\n1942258740499280188 [2025-07-07] @exgenesis 💜 23\ndoes anyone have that @RichDecibels chart with the events at increasing size and duration?\n↓\n1942260183125655617 [2025-07-07] @tasshinfogleman 💜 13 [(SEED) type=quote_of_root]\n@exgenesis @RichDecibels https://t.co/41N8Ocgm39\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\n├── 1942261058044882975 [2025-07-07] @exgenesis 💜 9\n│   @tasshinfogleman @RichDecibels THANK U\n│   ↓\n│   1942267145439617241 [2025-07-07] @tasshinfogleman 💜 4\n│   @exgenesis @RichDecibels U know I got that that thang on me (the relevant tweet)\n└── 1942261383074312522 [2025-07-07] @astridwilde1 💜 3\n    @tasshinfogleman @exgenesis @RichDecibels incredible chart, @RichDecibels! i have not yet hosted something larger than a festival, will do better 🫡\n    ↓\n    1942283865902424560 [2025-07-07] @RichDecibels 💜 2\n    @astridwilde1 @tasshinfogleman @exgenesis I believe in you\n\n===\n\n1942262762656153873 [2025-07-07] @exgenesis 💜 97 🔁 3 [(SEED) type=quote_of_root]\n!!! made it !!! https://t.co/nlhv9H6g7Y https://t.co/7INy0BA7aT\n  [Quoting @RichDecibels: I drew this diagram to illustrate a lot of related insights about agency, hosting, community-building, collaborative leadership &amp; social change  come with me now, the thread is long and full of bangers… https://t.co/hX3lV9xylT]\nImages:\n  - [Image #0] The image presents a graph titled \"Hosting Capacity as a Measure of Agency,\" which illustrates the relationship between group size and duration of commitment for various social activities. The graph features a white background with black text and a gray-scale graph.\n    \n    *   **Title**: \"Hosting Capacity as a Measure of Agency\"\n    *   **Graph**:\n        *   **Axes**:\n            *   **Y-axis**: \"Group size\" (ranging from 5 to 500)\n            *   **X-axis**: \"Duration of commitment\" (ranging from 15 minutes to 3 years)\n        *   **Graph sections**: The graph is divided into sections, each representing a different type of social activity, such as:\n            *   Conversation\n            *   Board game\n            *   Dinner party\n            *   Workshop\n            *   Peer pod\n            *   Course\n            *   Road trip\n            *   Retreat\n            *   Xiq week camp\n            *   Festival\n            *   Portal campus\n            *   Coliving residency\n            *   Coliving neighborhood\n            *   Congregation host\n            *   Coliving house\n        *   **Data points**: Each section contains a data point, represented by a photo or text, indicating the corresponding group size and duration of commitment.\n    *   **Key findings**:\n        *   The graph shows that as the group size increases, the duration of commitment also tends to increase.\n        *   The graph highlights the diversity of social activities, ranging from short-term conversations to long-term coliving arrangements.\n    \n    In summary, the graph provides a visual representation of the relationship between group size and duration of commitment for various social activities, offering insights into the complexities of hosting capacity and agency.\n├── 1942262844151463953 [2025-07-07] @exgenesis 💜 7\n│   making it *\n├── 1942264365258006618 [2025-07-07] @astridwilde1 💜 14\n│   @exgenesis 🌞 time to expand the right hand of the chart, gotta be forming city states *at least*\n│   ↓\n│   1942264465237381344 [2025-07-07] @exgenesis 💜 10\n│   @astridwilde1 city state is *table stakes*\n├── 1942268781813768448 [2025-07-07] @tasshinfogleman 💜 3\n│   @exgenesis lfggggg!!!\n└── 1942293207246610547 [2025-07-07] @PsyGenLab 💜 1\n    @exgenesis xiq empiree\n\n===\n",
  "rating": {
    "reasoning_summary": "This strand chronicles the evolution from abstract \"change agent\" discourse (2009-2013) to Rich Decibels' 2024 \"Agency Map\" becoming a boundary object for community organizers. The map (group size × duration) provides a developmental framework for hosting capacity, sparking dialectical refinement (missing z-axes, periodicity debates) and practical application (people plotting their own trajectories, validating years later with \"made it\" posts). The arc shows high cohesion around a core network (Rich, Visa, Malcolm, Tasshin) building shared vocabulary for scaling social contexts, culminating in real-world execution (Portal campus, coliving experiments) that validates the original 2020 aspiration of \"100-year games\" without aggressive monetization.",
    "rating": 8,
    "evolution": "high",
    "cohesion": "high",
    "utility": "high",
    "essential_tweets": [
      {
        "tweet_id": 1333199165589864449,
        "annotation": "The aspiration: Visa's 2020 vision for teaching 1% to be A+ community managers, establishing the \"100-year game\" frame during COVID systems-change moment"
      },
      {
        "tweet_id": 1333199907012820995,
        "annotation": "The core value proposition: Building human networks on 50-100 year timescales without aggressive monetization, setting philosophical foundation"
      },
      {
        "tweet_id": 1464240020169109504,
        "annotation": "Pre-context: Rich's 2021 Context vs Capacity chart, the precursor framework exploring leadership dynamics in voluntary communities"
      },
      {
        "tweet_id": 1742494880625016921,
        "annotation": "The Artifact: Rich's viral Agency Map thread (Jan 2024) - the boundary object that crystallizes years of implicit knowledge into actionable framework"
      },
      {
        "tweet_id": 1742495609817325630,
        "annotation": "Key insight: \"If you can't create harmony in 15 people, why trust your opinion on governance?\" - establishing micro-scale as prerequisite for macro"
      },
      {
        "tweet_id": 1742496635899220139,
        "annotation": "Mission statement: The Microsolidarity Network as \"fractal agency pump\" aiming to train 150 people who can each host 150-person communities"
      },
      {
        "tweet_id": 1743080673613869124,
        "annotation": "Application: Malcolm posts his hosting map, demonstrating how the framework enables self-assessment and peer comparison across the network"
      },
      {
        "tweet_id": 1766279606351605884,
        "annotation": "Conceptual expansion: Malcolm adds America to the chart, testing framework's scalability and sparking debate about intentional vs emergent communities"
      },
      {
        "tweet_id": 1942262762656153873,
        "annotation": "Validation: Exgenesis' \"made it\" post 18 months later, plotting Portal campus on the map - proving the framework's utility for tracking real progress"
      },
      {
        "tweet_id": 1924129664571933160,
        "annotation": "Meta-commentary: The diagram becomes shorthand for organizing struggles, showing cultural adoption as diagnostic/therapeutic tool beyond just aspiration"
      }
    ]
  }
}