{
  "tweet_id": 1047765669415211009,
  "thread_text": "1026293718549057536 [2018-08-06] @visakanv 💜 94 🔁 14\nBeen reflecting on this for some time, this idea that the web destroys people’s ability to focus on something like reading a book. Sometimes I suspect people have it sort of backwards. Focusing on a single self-contained experience to me is sometimes kind of like eating baby food https://t.co/69AqVk4Vwr\n  [Quoting @visakanv: @_jordan_bates 🤔 How do you read books other than one word at a time? I think the difference is that books are discrete linear packages, while the web is continuous &amp; omni-directional. Focus is a function of frame; books are pre-framed; operating in the web necessitates holding your own frame]\n\n===\n\n1026294894627762177 [2018-08-06] @visakanv 💜 119 🔁 8\nSo here’s how I think I think about it: a book is a sort of prosthetic. A book is a frame, put together by an author and her support team, a specific window, a specific lens, a particular way of seeing. The book is FOCUSING *FOR* YOU. Am I making sense? https://t.co/YJEjlgDuQr\nImages:\n  - [Image #0] The image is a black-and-white photograph of a woman framing her eye with her fingers, creating a rectangular shape around it as if looking through a lens. The woman has dark hair and is wearing a ring on her left hand.\n↓\n1026296466187333632 [2018-08-06] @visakanv 💜 63 🔁 1\nAs I get older and my mind-palace gets larger and more comprehensive (with other people’s ideas) I get less &amp; less casually-randomly interested in books written by other people. I am currently most intrigued by the books that exist only in my imagination; that’s my primary focus https://t.co/dvM0erUUhp\nImages:\n  - [Image #0] The image depicts a hand reaching for a book on a shelf, with the arm and hand in the foreground. The hand is positioned in front of a bookshelf, with the fingers extended as if about to grasp a book. The bookshelf is filled with numerous books, each with a unique cover design and color, arranged vertically and standing upright. The overall atmosphere of the image suggests that the person is browsing through the books, perhaps searching for a specific title or author.\n    \n    The image is accompanied by a tweet that reads: \"As I get older and my mind-palace gets larger and more comprehensive (with other people's ideas) I get less & less casually-randomly interested in books written by other people. I am currently most intrigued by the books that exist only in my imagination; that's my primary focus https://t.co/dvM0erUUhp\".\n↓\n1026297256834560000 [2018-08-06] @visakanv 💜 27 🔁 1\nThis will change, of course. Once I have published some work I will be fascinated by the world’s response to it, and all the ways in which the two interface. I digress. There’s still something about contemporary guilt re: “muh attention span” that strikes me as odd and misplaced\n↓\n1026298204122271745 [2018-08-06] @visakanv 💜 57 🔁 6\nThe Qn I have is: what is attention *for*? I agree that there are all sorts of things that exist in the world entirely to hijack your attention with lurid BS. But IMO the way to deal with that isn’t to develop the ability to focus on arbitrary things, but to find your curiosity https://t.co/Z2oskYL3oz\nImages:\n  - [Image #0] The image depicts a still from a movie or TV show, featuring a woman sitting in front of a table with three lit candles. The subtitle at the bottom of the image reads, \"So tell me what you want what you really really want.\"\n↓\n1026298754079453184 [2018-08-06] @visakanv 💜 64 🔁 3\nIf you don’t know what you want but you find yourself beating yourself up over your supposedly limited attention span, I think this may actually be a sort of capitalistic self-flagellation; whipping yourself in shame for not paying attention to The Teacher, The Boss\n↓\n1026299302505635840 [2018-08-06] @visakanv 💜 48 🔁 4\nBut the reason The Teacher and The Boss have to bark “Focus! Pay attention!” is because they know in their heart of hearts that they’re not interesting. There is SOME utility to learning from general-arbitrary-pain but life is gonna throw you some specific-to-you pain *anyway* https://t.co/dADe95NWcX\nImages:\n  - [Image #0] The image is a still from the movie \"The Boondock Saints,\" featuring a man with long blonde hair and a monocle over one eye, gazing intensely at the camera with a serious expression. The text \"CONSTANT VIGILANCE!\" is superimposed over the image in white letters.\n↓\n1026300015742840833 [2018-08-06] @visakanv 💜 29 🔁 2\nThis perspective that I’m presenting here is not comprehensive, it doesn’t apply in all scenarios. But I feel like it’s underrepresented. Not enough people stop to ask wtf we’re really beating ourselves up for. The energy you free up with that can be spent cultivating taste https://t.co/3onNJIw36r\nImages:\n  - [Image #0] The image depicts a meme featuring a still from the movie \"Eternal Sunshine of the Spotless Mind\" with the caption \"STOP SLAPPING YOURSELF!\" in bold white text outlined in black at the bottom. The scene shows a man, Joel, being comforted by a woman, Clementine, as he appears distressed.\n↓\n1026300803789668352 [2018-08-06] @visakanv 💜 15\nEarlier on I made a little digression here. Some people would see this as a weakness. But I think it’s interesting. It came out of me by itself when I was “focused” on something else. Which suggests to me that it’s likelier-than-average to be interesting https://t.co/t7ATltv1jo\n  [Quoting @visakanv: This will change, of course. Once I have published some work I will be fascinated by the world’s response to it, and all the ways in which the two interface. I digress. There’s still something about contemporary guilt re: “muh attention span” that strikes me as odd and misplaced]\n↓\n1026301560668581889 [2018-08-06] @visakanv 💜 81 🔁 3\nYou know how some people say “oh I’m so random haha I like a bit of everything”? It’s 99% bullshit. I was sort of like that. Except I wrote everything down. After about 500,000 words you realize you repeat yourself and run out of things to say. Random is a comforting illusion https://t.co/hFxYlEsc8F\nImages:\n  - [Image #0] The image is a meme that shows a still from the TV show \"The O.C.\" with the text \"YOU GUYS ARE SO RANDOM!\" superimposed over it. The image depicts two characters, one wearing a light blue shirt and the other wearing a white shirt, with their backs to the camera, appearing to be in motion.\n↓\n1026302984894832641 [2018-08-06] @visakanv 💜 34\nI guess this is the point where I’m reminded that maybe I’m not neurotypical and my perspective might not actually be something most people relate to. Lol. Don’t listen to me, listen to yourself. But don’t beat yourself up. But listen to yourself. Idk man it’s your life 😂 bye https://t.co/MzvgnZGH5U\nImages:\n  - [Image #0] The image is a screenshot from a TV show featuring a woman speaking to a man, with subtitles at the bottom of the screen. The woman has long, wavy red hair and is wearing a blue top with a black leather jacket. She appears to be speaking to a man who is out of focus on the left side of the image. \n    \n    The subtitles read: \"I was trying to have fun and then I made everything weird, 'cause I'm weird.\"\n↓\n1062852849837662208 [2018-11-14] @visakanv 💜 28 🔁 1 [(SEED) type=quote_of_root]\nOh this is beautifully put https://t.co/yNetjpWYvG\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1081482511908188160 [2019-01-05] @visakanv 💜 56 🔁 5\nThis is a Big Mood https://t.co/sQPhuC3B6G\n  [Quoting Tweet 1081049819567804416 (missing)]\n↓\n1191422472450502656 [2019-11-04] @visakanv 💜 7\n^ medieval node runners #NodeRunnerConf\n\n===\n\n1047765669415211009 [2018-10-04] @reasonisfun 💜 1549 🔁 279 💬 20 [(SEED) type=root]\n'Self discipline' is a patch for being conflicted about what you want to do.\n\nOften, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.\n\nBut creative productivity only ever works in *spite* of that.\n├── 1047766775935459329 [2018-10-04] @reasonisfun 💜 677 🔁 91 💬 3 [(SEED) type=semantic_search]\n│   \"Discipline is remembering what you want.\"\n│   \n│   When that works, it's not 'discipline'; it's getting less conflicted.\n├── 1212869716928155648 [2020-01-02] @goblinodds 💜 9\n│   @reasonisfun oh dang i just tweeted asking for tips on figuring out \"what you want to do\" but i probably should've just commented here!\n│   \n│   any tips or leads?\n└── 1738773058490700199 [2023-12-24] @franki3stone \n    @reasonisfun Ong this is my whole life 😅\n\n===\n\n1065305185805774848 [2018-11-21] @visakanv 💜 14 🔁 1 [(SEED) type=quote_of_root]\nExtremely underrated tweet https://t.co/nUwNeTP0JU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1087723629360615426 [2019-01-22] @visakanv 💜 159 🔁 18\ni'm still reflecting on the fact that some people call trans people mentally ill simply for being trans\n\nit's becoming clearer and clearer to me that the idea of mental illness is used as a tool of social control\n\n===\n\n1087725259678248960 [2019-01-22] @visakanv 💜 44\nI'm a straight, cisgendered, traditionally masculine-passing guy, so I have it easy on a lot of fronts. but i'm a weirdo in a bunch of other ways. there are several ways in which **the way I am** could be construed as mental illness by a malicious or ignorant observer\n↓\n1087735094910087174 [2019-01-22] @visakanv 💜 33\nand you know... AM I? I feel the way Darwin did sometimes. I think terrible suffering is caused by the extremely distressing and lethal affliction called \"being a human\"  https://t.co/2aKyoEi2le\n  [Quoting @visakanv: \"But I am very poorly today, and very stupid and hate everybody and everything.\" – Charles Darwin, to his friend Charles Lyell https://t.co/3C0G5ffoPL]\n↓\n1087735799205019648 [2019-01-22] @visakanv 💜 17\nWhich isn't to imply something blanket or dumb like \"there's no such thing as mental illness, it's all made up, go home everybody\". Obviously brains can get sick, or malfunction, just like any other part of the body. Probably more so, too, since they're more complex to boot\n↓\n1087736609422770177 [2019-01-22] @visakanv 💜 38\nLike, I most probably have what people call ADHD. Is this a \"sickness\"? You know... my sickness would be Extremely Solved by the usage of an aid called a Personal Assistant. Or better still, Being Born Rich \n\nYou can't evaluate things out of context\n↓\n1087738466207641600 [2019-01-22] @visakanv 💜 27 🔁 1\nthere are circumstances and contexts in which having my mind has been a liability (flashing neon sign: SCHOOL), causing me all sorts of needless pain, frustration, trauma that I'm still recovering from (doing good overall)\n\nand there are contexts when it has been 💯🔥🚀💪🏾🤯\n↓\n1087738931125268482 [2019-01-22] @visakanv 💜 24 🔁 2\nthe fundamental problem here, to me, seems to be rooted in the fact that we have depressingly limited models of health and wellness\n\nand that in turn brings me back to... https://t.co/T7CHKdcyKz\n  [Quoting @visakanv: The public is insufficiently educated on how to be a good public]\n↓\n1087739204270866432 [2019-01-22] @visakanv 💜 59 🔁 3\nmy ex-boss once described my brain as \"it's like you can't walk, but you can fly\"\n\nwould you say that's an illness? 🤔\n↓\n1087739697235845120 [2019-01-22] @visakanv 💜 46 🔁 5\nit's only fair https://t.co/0vYdWWetWW\nImages:\n  - [Image #0] The image is a black-and-white cartoon that depicts a satirical take on the concept of fairness in selection processes. The scene shows a man sitting at a desk, addressing a group of animals gathered before him. \n    \n    *   A man is seated at a desk, facing a diverse group of animals.\n        *   The man is dressed in a suit and appears to be speaking to the animals.\n        *   He is gesturing with his hands as he speaks.\n    *   The animals are varied and include an elephant, a monkey, a penguin, a squirrel, and a donkey.\n        *   Each animal is depicted in a unique pose, with some standing on their hind legs and others sitting or standing on all fours.\n        *   They are all looking at the man, seemingly listening to his words.\n    *   A speech bubble emanates from the man's mouth, containing the text \"FOR A FAIR SELECTION EVERYBODY HAS TO TAKE THE SAME EXAM: PLEASE CLIMB THAT TREE.\"\n        *   The text is written in a bold, black font and is easily readable.\n        *   The speech bubble is directed towards the animals, indicating that the man is addressing them directly.\n    \n    The cartoon highlights the absurdity of applying a one-size-fits-all approach to evaluation, as the animals have different physical abilities and characteristics that make it unfair to expect them all to climb a tree. The image is a commentary on the challenges of creating fair and inclusive assessment methods.\n↓\n1087750801416540162 [2019-01-22] @visakanv 💜 119 🔁 18 💬 1\nvia @brianduffytweet \n\n\"What we call mental illness is coerced contractual agreements\" – Johan Nygren\n\n\"We are all pre-programmed with a form of mental illness from the point we’re registered as citizens\"\n\n\"We needed a story to normalize coercion.\"\n\nhttps://t.co/9m1e9pNxsa https://t.co/1oFFu92HtZ\nImages:\n  - [Image #0] The image is a screenshot of an article titled \"What we call mental illness is coerced contractual agreements\" by Johan Nygren, dated January 30, 2016. \n    \n    The article discusses the concept of mental illness and its relationship to societal expectations and contractual agreements. The main points are:\n    \n    * The author argues that mental illness is not a medical condition, but rather a result of coerced contractual agreements between individuals and the state.\n    * The Diagnostic and Statistical Manual of Mental Disorders (DSM-IV) is criticized for its lack of a clear definition of mental disorder.\n    * The author cites Leon Eisenberg, the \"scientific father\" of ADHD, who admitted that ADHD is a fictitious disease.\n    * Allan Frances, lead editor of DSM-IV, is quoted as saying that there is no definition of a mental disorder.\n    * The author proposes an alternative definition of mental illness as \"a position in a pecking order\" and argues that it is a result of individuals trying to fight or flee from coercion.\n    \n    The article includes a photo of the DSM-IV manual on the left side, with a red cover and gold text. The overall tone of the article is critical of the psychiatric establishment and the way mental illness is defined and treated.\n↓\n1087751991223144448 [2019-01-22] @visakanv 💜 80 🔁 8 💬 1\n\"ADHD is the human brain in conflict with a legal system that tries to coerce it into something it has not accepted or agreed upon. As Leon Eisenberg said, ADHD is a fictitious disease, and it's morally, ethically and scientifically wrong to pretend otherwise.\"\n\n🤔\n↓\n1087754713238368256 [2019-01-22] @visakanv 💜 32 🔁 1 [(SEED) type=quote_of_root]\ntangentially, the above quote brought this very thought-provoking tweet back to mind https://t.co/nUwNeTP0JU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1151069352520585218 [2019-07-16] @visakanv 💜 23 🔁 6\nIf you write me a letter on @LetterWiki – ask me some questions, etc – I'll write you back! https://t.co/alOXbITcPJ\n↓\n1151070073181728768 [2019-07-16] @visakanv 💜 9 🔁 1\ncool thing I didn't realize about it prior was that each letter has a 1,000 word limit – it's good containerization, like an expanded version of twitter's 280 chars. A tweet now is about 30-50 words, so each letter wiki caps out at a max of 20-30 tweets. and you can just do 5-10\n↓\n1151583493425516544 [2019-07-17] @visakanv 💜 4 🔁 1\nfrom my letter to @IonaItalia  https://t.co/Gbhj0FC7CE\n  [Quoting Tweet 1151514581765726209 (missing)]\n↓\n1151583996691636224 [2019-07-17] @visakanv 💜 14 🔁 3\n@IonaItalia and this is from my response to @marktani: \n\nhttps://t.co/daeGNznO6S https://t.co/TH7UKnKQA9\n  [Quoting Tweet 1151290847348101121 (missing)]\nImages:\n  - [Image #0] The image displays a text passage that reads: \n    \n    \"The other thing that I would tell someone in your shoes is to Be Prolific. Make lots of stuff. Whatever it is you're curious about or wanting to do, do lots and lots of it. Do 10x more of it than you were vaguely-kinda-sorta planning to do. That turns idle inclinations into adventures.\n    \n    You already have some sense of who you are and what you're about. I'm here to tell you that you don't have to \"wait\" until you figure more of it out. You have everything need already. So crank the gain, turn up the volume, and go all out. Pour some gasoline on the fire in your heart. It's fine to make some mistakes along the way - when you look back, the only things you'll regret are the things that you didn't do.\n    \n    Best wishes,\" \n    \n    The text is written in black font on a white background, with the words \"Be Prolific\" highlighted in orange.\n↓\n1156819284619718656 [2019-08-01] @visakanv 💜 17 🔁 5\n@IonaItalia @marktani just had a chat with @daynerathbone &amp; @clyderathbone who are the cofounders of @LetterWiki  – I think they're on to something here. Something compelling about this particular format (1k words max, p2p letters, public-facing). Write me! Be an early adopter  https://t.co/alOXbITcPJ\n↓\n1156892226267439104 [2019-08-01] @visakanv 💜 21 🔁 3 [(SEED) type=semantic_search]\n@IonaItalia @marktani @daynerathbone @ClydeRathbone @LetterWiki In reply to @sukarnoaleman, who asked about being prolific\n\nI suspect  people get caught up in self-flagellation about discipline as a distraction from facing incompetence. \"I lack discipline\" is easier to deal with psychologically than \"my work sucks\"\n\nhttps://t.co/A00LrFNqfF https://t.co/USUVCS8OYe\nImages:\n  - [Image #0] The image is a screenshot of a text passage. The text discusses the idea that people often struggle with self-doubt and perfectionism, leading them to feel overwhelmed by their ambitions and hesitant to take action. The passage suggests that individuals should focus on doing what they want, rather than worrying about doing it perfectly, and that embracing imperfection is necessary to be prolific.\n    \n    The text is presented in black font on a white background, with no images or graphics accompanying it. The text is transcribed as follows:\n    \n    \"You also ask 'should I be less ambitious, and do less but better' - and the answer to that is... maybe? You've shared a list of things you want to do - you want to write, you want to study, you want to climb, you want to code - but you also say that you're not really doing them. So 'do less' is an interesting, kinda revealing frame. You probably mean 'should I focus on fewer things' - and I personally don't think that's necessary. You can do whatever you want! You just need to actually do it.\n    \n    Here's what I think, and I hope this isn't too presumptuous - I think you're probably overburdening yourself with expectations, and possibly perfectionism. You probably have some vision of yourself as someone who *could* write a lot, someone who *could* climb a lot, and so on - and so you might be turning each instance of writing or climbing or coding into some sort of dramatic project. And dramatic projects are scary, and it's hard to do scary things. It's scary to finish the website, because then it'll be done and imperfect, rather than undone-but-hypothetically-perfect.\n    \n    What you're really worried about, I'm guessing, is facing up to imperfect, ugly work. And if you want to be prolific, you have to accept, even embrace, that a lot of what you produce or do is going to be ugly and imperfect.\"\n↓\n1156926821440487424 [2019-08-01] @visakanv 💜 8 🔁 2\n@IonaItalia @marktani @daynerathbone @ClydeRathbone @LetterWiki @sukarnoaleman In reply to @sashintweets, who asked about fun, and the nature of knowledge\n\nhttps://t.co/RpHqDSHiFC https://t.co/0gvFOVYtX9\nImages:\n  - [Image #0] The image is a screenshot of a text passage that discusses the complexity of personal motivations and narratives. The text is transcribed as follows:\n    \n    > Why do you do what you do?\n    \n    There are a few different layers to this. I could say \"because I want to\", or \"because I feel like it\", or \"because it's how I am\", all of which are usually quite satisfactory answers for me in my day-to-day life. I can construct more elaborate narratives if that isn't satisfying. I could say that, oh, when I was a child, I was delighted by the universes to be explored in libraries. I could also say that I was always a misfit, and so I always sought out connection. People often projected their assumptions onto me, so I felt compelled to take control of my own narrative.\n    \n    But all of these are just narratives, to be experimented and played with. I don't feel like any of them needs to be The Reason. There can be a concert of reasons, many seasons of reasons. I'm happy to surf the waves.\n↓\n1157016353099767809 [2019-08-01] @visakanv 💜 7 🔁 3\n@IonaItalia @marktani @daynerathbone @ClydeRathbone @LetterWiki @sukarnoaleman @sashintweets in reply to @tim_sandsquid63, who asked about meaning and death:\n\nhttps://t.co/cP58d2M2Fp https://t.co/yshQi2B0e2\nImages:\n  - [Image #0] The image is a text-based document that appears to be a passage from Carl Sagan's book \"Contact.\" The passage is written in black text on a white background, with certain phrases highlighted in orange. \n    \n    The passage discusses the human species and their capacity for both beautiful dreams and horrible nightmares, as well as their feelings of loneliness and disconnection. It also touches on the importance of art and its ability to bring people together.\n    \n    Here is the text transcribed from the image:\n    \n    \"From Contact, by Carl Sagan:\n    \n    'You're an interesting species. An interesting mix. You're capable of such beautiful dreams, and such horrible nightmares. You feel so lost, so cut off, so alone, only you're not. See, in all our searching, the only thing that we've found that makes the emptiness bearable, is each other.'\n    \n    This has real-world applications for me. For me, the first time I really felt that people must care about me - not just people who are obliged to, like my parents, but ordinary people who have nothing to do with me - was when I first stepped into a library, and realized that the **shelves were full of books written by people who wanted to talk to me**.\n    \n    I felt similarly as a teenager when I was discovering music. I've mentioned that I would **give my life for musicians**, and I mean it.\n    \n    Sometimes people ask questions like, 'What is the utility of art? What is the point?' - and there are many ways to answer this question, depending on who's asking, and why. Sometimes I half-joke, quite seriously, that art is about freedom from the shackles of the constraints of narrow utilitarianism. Elsewhere I've said, if nobody cares about me apart from what I am worth economically, then **life is a prison and I might as well kill myself**. But the existence of art is proof that this isn't the case. I have been nourished by art, and so I am compelled, duty-bound, to nourish others in turn.\n    \n    We are all grunts in the trenches of life. We are all facing fearful odds, we are all doomed. But in the midst of this cruel, uncaring universe, we have each other. And that's something worth fighting for.\n    \n    Thanks for writing to me,\n    \n    Visa\"\n    \n    The highlighted phrases are:\n    * \"shelves were full of books written by people who wanted to talk to me\"\n    * \"give my life for musicians\"\n    * \"life is a prison and I might as\n↓\n1157632844258086913 [2019-08-03] @visakanv 💜 26 🔁 3\n@IonaItalia @marktani @daynerathbone @ClydeRathbone @LetterWiki @sukarnoaleman @sashintweets @tim_sandsquid63 In reply to @noididntreadit, about DM etiquette:\n\nif you want to initiate a conversation, it's generally a good practice to propose where the conversation could go. this takes the burden of carrying the conversation off the other person\n\nhttps://t.co/riakWZEZvy https://t.co/LmuRorG1FL\nImages:\n  - [Image #0] The image is a screenshot of a text passage discussing DM etiquette on social media. The text is transcribed as follows:\n    \n    \"You asked about more specifics re: DM etiquette- I think you don't actually need to say 'how are you doing today' to anybody - the act of showing up is itself kind of a 'how's it going' signal in of itself. Sometimes I think 'How are you?' can seem almost a little burdensome, it can sometimes be interpreted as 'this person wants to talk to me, but they don't really know how to talk, and so now it's my responsibility to carry the conversation.'\n    \n    If you're the person initiating, you want to be the one proposing where the conversation could go. For eg, you can go straight to asking some question. 'I saw that you mentioned X! I like X too. Have you seen Y?' is something that generally works. This is something you can do in public replies, and if you do it several times, you can build rapport that way, and then the person will almost always be happy to receive a DM from you. The helpful thing is to keep your questions small, specific and easy to answer.\"\n    \n    The text is presented in black font on a white background, with the phrase \"keep your questions small, specific and easy to answer\" highlighted in orange.\n\n===\n\n1249446926556319750 [2020-04-12] @m_ashcroft 💜 15 🔁 2 💬 1 [(SEED) type=quote_of_root]\nThis is excellent thread from @reasonisfun on resolving inner conflicts and motivation.\n\nI'm 100% here for this. Having to consistently force yourself to do things might be a sign that you should consider whether you actually want to do them or not.\n\nAnd if not - well then what? https://t.co/FS6bGaS1t4\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1249448574406049793 [2020-04-12] @m_ashcroft 💜 2\nAlso the comments on this thread are extremely revealing.\n\n===\n\n1275159780563140608 [2020-06-22] @uberstuber 💜 2 [(SEED) type=quote_of_root]\nGreat thread\n\nhttps://t.co/7uuNUdydfa\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1301627282969239553 [2020-09-03] @m_ashcroft 💜 215 🔁 18 💬 1 [(SEED) type=semantic_search]\nI'm loving the increasing 'non-coercive-productivity' vibe around here recently.\n\nLet's stop forcing ourselves to do things we quite clearly don't want to do. \n\nLet's find playful ways to resolve our internal conflicts and unlock our innate and joyful creative expression.\n↓\n1301649984174075905 [2020-09-03] @m_ashcroft 💜 3\nOkay everyone you all have fun in my mentions, I'm going to bed.\n\n===\n\n1301638787072692225 [2020-09-03] @m_ashcroft 💜 7 [(SEED) type=quote_of_semantic_search]\nWould you rather drive across a bridge that people were forced to build, or one where the builders were freely expressing their innate desire to build the bridge? https://t.co/6pFztSmcbK\n  [Quoting @m_ashcroft: I'm loving the increasing 'non-coercive-productivity' vibe around here recently.  Let's stop forcing ourselves to do things we quite clearly don't want to do.   Let's find playful ways to resolve our internal conflicts and unlock our innate and joyful creative expression.]\n\n===\n\n1301785317314306049 [2020-09-04] @nosilverv 💜 8 [(SEED) type=quote_of_semantic_search]\nwe starting a new thing, get in while it's warm. if you want to understand how groups make things read interaction ritual chains) https://t.co/0KPznepjqp\n  [Quoting @m_ashcroft: I'm loving the increasing 'non-coercive-productivity' vibe around here recently.  Let's stop forcing ourselves to do things we quite clearly don't want to do.   Let's find playful ways to resolve our internal conflicts and unlock our innate and joyful creative expression.]\n\n===\n\n1314520047734321155 [2020-10-09] @visakanv 💜 76 🔁 2\nthread of my mutuals’ tweets that I quote most often\n↓\n1314520323966996480 [2020-10-09] @visakanv 💜 33\n1. this tweet should grow into a blogpost and maybe a book even https://t.co/KL01SsyLpY\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1314520681493610496 [2020-10-09] @visakanv 💜 3 🔁 1 [(SEED) type=quote_of_root]\n2. ^ actually that probably applies to all of these tweets https://t.co/nUwNeTP0JU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1314520967406739456 [2020-10-09] @visakanv 💜 30 🔁 1\n3. https://t.co/0WOQkVj0Lz\n  [Quoting Tweet 1027604793101959168 (missing)]\n↓\n1314525843482308608 [2020-10-09] @visakanv 💜 16 🔁 1\n4. thread on being a knowledge worker https://t.co/I6Sm7PLOuL\n  [Quoting Tweet 1050248832267640833 (missing)]\n↓\n1314945947030355968 [2020-10-10] @visakanv 💜 38 🔁 3\n5. the writing process https://t.co/6fTiJ7Xz47\n  [Quoting Tweet 877018612447313920 (missing)]\n↓\n1326923781454004224 [2020-11-12] @visakanv 💜 41\n6. a recent one that I foresee myself quoting a lot\n\nhttps://t.co/O6od1IEJ2s\n  [Quoting @GeniesLoki: 1. Instead of having a profound spiritual awakening you can just actually solve your problems.]\n↓\n1341071127800516609 [2020-12-21] @visakanv 💜 30\n7. the eigenrobot classic https://t.co/BwqtjozP4W\n  [Quoting @eigenrobot: everything 👏  is 👏  monocausal 👏 and 👏 specifically 👏 results 👏 from 👏 whatever 👏 shit 👏 I'm 👏 on 👏 about 👏 at 👏 any 👏 given 👏 time]\n↓\n1341441748808003585 [2020-12-22] @visakanv 💜 15\n8. https://t.co/DWMXXRfyiq\n  [Quoting Tweet 1300466339673501699 (missing)]\n↓\n1369348609997742085 [2021-03-09] @visakanv 💜 13\n9. we aren't mutuals but I've quoted this tweet like a dozen times now  https://t.co/6jJJuH9jPe\n  [Quoting Tweet 1080115336832339968 (missing)]\n↓\n1389285524196663298 [2021-05-03] @visakanv 💜 11\n10. this tweet is me summarizing an absolute smash hit that @pragueyerrr casually dropped on @tasshinfogleman's podcast \n https://t.co/DfpVFTsvE8\n  [Quoting @visakanv: ooh G connected some great dots here  - 3. gratitude feels physically amazing in the body - 2. you can't be grateful for something you don't notice - 1. how you direct your attention in the world affects what you notice  1 → 2 → 3: directing your attention leads to embodied joy]\n↓\n1518878065396686849 [2022-04-26] @visakanv 💜 13\n11. https://t.co/WNzlBtsEgq\n  [Quoting Tweet 1506451523835994121 (missing)]\n↓\n1579917251636973568 [2022-10-11] @visakanv 💜 7\n12. https://t.co/kD8rtOgxkF\n  [Quoting Tweet 991800763616706560 (missing)]\n\n===\n\n1345717798606028800 [2021-01-03] @kcorazo 💜 190 🔁 15 [(SEED) type=semantic_search]\nProductivity gets a bad rap because people use it to force themselves to do work they hate.\n↓\n1345718179482513409 [2021-01-03] @m_ashcroft 💜 15 🔁 1\n@Roamfu Yes! There's a version of productivity that helps people achieve work they love, but it almost needs a new set of language to distance itself from that other kind.\n\n===\n\n1352140008447205378 [2021-01-21] @nopranablem 💜 5 [(SEED) type=quote_of_root]\nHuuuge shift in culture once non coercive productivity becomes as popularized as David Goggins style productivity. Transcend &amp; include https://t.co/P5pGpnE2El\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1369288311987077122 [2021-03-09] @visakanv 💜 285 🔁 10\nThis is a huge part of the premise of my book... man I could probably write my book entirely out of my friends’ tweets https://t.co/7oIPeY7tVL\n  [Quoting Tweet 1369274783804833796 (missing)]\n\n===\n\n1435457170456264704 [2021-09-08] @visakanv 💜 16 🔁 1\nhttps://t.co/Z6aFSSGYbZ\n  [Quoting Tweet 1435369007436214274 (missing)]\n↓\n1442106823549472769 [2021-09-26] @visakanv 💜 16\nyes\nhttps://t.co/xF5ZJNPYGI\n  [Quoting Tweet 1442104549905362944 (missing)]\n↓\n1449628813202128896 [2021-10-17] @visakanv 💜 18\nyou can’t bully yourself into courage, freedom, love https://t.co/XlJNiu2MRL\n  [Quoting Tweet 1449448207038173189 (missing)]\n↓\n1460893466414628864 [2021-11-17] @visakanv 💜 12\neach part of you has a reason for being https://t.co/QEr3gdj7sx\n  [Quoting @Malcolm_Ocean: one part's \"self-sabotage\" is another part's \"freedom fighter\"]\n↓\n1461263745728987141 [2021-11-18] @visakanv 💜 10\npreemptive strike https://t.co/f1S1QcmW4j\n  [Quoting Tweet 1460736446269063172 (missing)]\n↓\n1463307788684128258 [2021-11-24] @visakanv 💜 8\nhttps://t.co/INSO9i8Qmh\n  [Quoting Tweet 1463185218781724677 (missing)]\n↓\n1463726695576326144 [2021-11-25] @visakanv 💜 5\n21. https://t.co/9vkWpZQXdY\n  [Quoting @tasshinfogleman: every action you take tells a story]\n↓\n1464171359907434496 [2021-11-26] @visakanv 💜 17\n22. technically you can do this anywhere, but Twitter is especially friendly to this process because its container structure encourages you to consider a morsel of thought to be complete all by itself https://t.co/x12yagkX5A\n  [Quoting @QiaochuYuan: today i am thankful for twitter, a place where you can write things faster than your self-doubt can censor]\n↓\n1465016918285320196 [2021-11-28] @visakanv 💜 15\n23. and by doing lots of journaling, you will learn more about yourself than you might expect to https://t.co/UlQJxuAERL\n  [Quoting Tweet 1464699403814555651 (missing)]\n↓\n1465301382995480580 [2021-11-29] @visakanv 💜 10\n24. we can do this for ourselves and we can help each other with it https://t.co/inomSrF0uW\n  [Quoting @nosilverv: Losing it at this lady figuring out she needs to end her relationship as she types a Quora answer https://t.co/vaG9diX8cE]\n↓\n1466105891770359809 [2021-12-01] @visakanv 💜 14 [(SEED) type=quote_of_root]\n25. Revisiting this absolute banger from Lulie. Today I'm thinking, if people weren't internally conflicted, then nobody would ever do anything \"bad\". Nobody would smoke cigarettes, eat junk food, stay up too late playing video games. https://t.co/nUwNeTP0JU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1476734231791374336 [2021-12-31] @visakanv 💜 21\n26. yes https://t.co/D7RtU8eDpk\n  [Quoting Tweet 1476731455627665414 (missing)]\n↓\n1477621900452925441 [2022-01-02] @visakanv 💜 15\n27. yes https://t.co/SLMsHikPYM\n  [Quoting Tweet 1477621544188878848 (missing)]\n\n===\n\n1400100837947371520 [2021-06-02] @uberstuber 💜 13 🔁 1\nwhat is toxic productivity?\n↓\n1400271924622618624 [2021-06-03] @kcorazo 💜 2 [(SEED) type=quote_of_semantic_search]\n@uberstuber when you're slowly killing your soul with it https://t.co/jI9wNYFr2H\n  [Quoting @kcorazo: Productivity gets a bad rap because people use it to force themselves to do work they hate.]\n\n===\n\n1404373489289732101 [2021-06-14] @nosilverv 💜 28 🔁 1\nNot work: self love! Then correct “work” will emerge naturally and spontaneously out of loving yourself lol\n↓\n1404412313214636033 [2021-06-14] @nosilverv 💜 30 🔁 2 💬 1 [(SEED) type=semantic_search]\nyou dont MAKE yourself productive, lol! you self love and then (stuff that would be called work) NATURALLY emerges from you!\n\n===\n\n1404410215374766083 [2021-06-14] @FriedKielbasa 💜 1\nI think i introspect too much at a surface level\n\nIdeal mix is (most likely) rational brain / introspection for determining long term goals and then experiencing life emotionally\n↓\n1404410422351044609 [2021-06-14] @FriedKielbasa 💜 1\nSelf Authoring was useful in generating deeper introspection\n\nTrusting emotions over reason on daily living is tough tho :/\n↓\n1404412808268238859 [2021-06-14] @FriedKielbasa 💜 1\nThis is why I'm so unsure that working hard is useful / effective. Maybe the reasons WHY you're working hard matter more?\n\nIf your compass is pointed in the wrong direction wrt yourself and / or the world, working hard is counterproductive\n↓\n1404413664384401408 [2021-06-14] @FriedKielbasa  [(SEED) type=quote_of_semantic_search]\nOk yah like this LOL\n\nhttps://t.co/vPc5TXMYJJ\n  [Quoting @nosilverv: you dont MAKE yourself productive, lol! you self love and then (stuff that would be called work) NATURALLY emerges from you!]\n\n===\n\n1477838709454036995 [2022-01-03] @visakanv 💜 102\nOk I need some help for the final stretch: can you tell me about any of my tweets, talking points, etc that you found personally helpful? Would be great if you can point to it, but if you only vaguely remember it that’s also useful\n↓\n1478004591623036930 [2022-01-03] @m_ashcroft 💜 4\n@visakanv the public is insufficiently educated at how to be a good public\n↓\n1478004934373044224 [2022-01-03] @visakanv 💜 5\n@m_ashcroft funnily, while I still stand by the truth of this, I no longer QT it because it's not what I want to focus on\n↓\n1478006462504845315 [2022-01-03] @sharanvkaur 💜 8\n@visakanv @m_ashcroft does it hurt. being so goddamn consistent. all the time?\n↓\n1478007500179791872 [2022-01-03] @visakanv 💜 6 [(SEED) type=quote_of_root]\n@sharanvkaur @m_ashcroft i mean, if a principle is correct, then it's correct. I'm not trying to be consistent, i'm trying to be correct. turns out everything gets increasingly elegant as they get increasingly correct\n\nhttps://t.co/nUwNeTP0JU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1499288557441060865 [2022-03-03] @visakanv 💜 77 [(SEED) type=semantic_search]\npeople typically see me railing against mandatory productivity but I also gotta say that being productive (out of your own volition) does feel really good so it’s pretty tricksy stuff\n\n===\n\n1552948040113172480 [2022-07-29] @kcorazo 💜 2 [(SEED) type=quote_of_semantic_search]\nWe are back in this part of the productivity discourse cycle https://t.co/jI9wNYFr2H\n  [Quoting @kcorazo: Productivity gets a bad rap because people use it to force themselves to do work they hate.]\n\n===\n\n1562838221259542528 [2022-08-25] @AskYatharth 💜 6\nevery day my brain with the best intentions will say “i wanna watch a video now!” and it is its well-intentioned way of saying “i need a break”\n↓\n1562838222761209857 [2022-08-25] @AskYatharth 💜 1\nover the last six months, ive been realising “i really wanna open youtube!” is really the only way to pull me out of my work when i am deep in it\n↓\n1562838228465463297 [2022-08-25] @AskYatharth 💜 1\ni made a “rest bed” (≠ sleep bed), and i just go lie in that instead\n\neventually, it’s become easier for my brain to interrupt me and say, “no more workie! time to lie down for a minute or few!”\n\nand i just… listen https://t.co/O92ulkLPas\nImages:\n  - [Image #0] The image shows a mattress on the floor with a blue-gray sheet and a few pillows. The mattress is placed in the corner of a room, with a white wall behind it and a window to the right, partially covered by a white curtain.\n↓\n1562838231158116352 [2022-08-25] @AskYatharth \nand my brain doesn’t need to YANK my attention anymore that hard\n↓\n1562838232521330690 [2022-08-25] @AskYatharth \nwhere did this come from? ofc it came from being a child. school and studying. “pfff! a wave of tiredness shouldn’t make you leave the desk!”\n\n“actually, now that’s exactly what i do”\n↓\n1562838233829912577 [2022-08-25] @AskYatharth 💜 1 [(SEED) type=semantic_search]\nno doubt discipline is important, but not discipline that fucks you over from doing work optimally\n↓\n1562838235058880513 [2022-08-25] @AskYatharth 💜 1\nhow to not be tired?- simply do not get tired https://t.co/6V2sBlp8ai\n  [Quoting @AskYatharth: the solution to not being tired is to not get tired in the first place  like drink up when you need to. don’t exert socially even around friends when you don’t want to. infinite energy]\n↓\n1562838236682080256 [2022-08-25] @AskYatharth 💜 1\nbc if you get too tired, by that time your body is already screaming, and your soul is already weary, and you *can* do nothing but watch videos https://t.co/u29GLHEpmH\n  [Quoting @AskYatharth: sometimes watching videos is the only form of rest we can access because doing nothing would be too stressful]\n\n===\n\n1574072038918017025 [2022-09-25] @AskYatharth 💜 18 [(SEED) type=semantic_search]\nif someone had a bunch of mental resistance to the word “productivity”, bc it feels associated with coercive contexts, forcing yourself to do things, being a cog in a huge system, what would you recommend?\n├── 1574072040297943040 [2022-09-25] @AskYatharth 💜 7\n│   someone said “intentionality” which feels better\n│   ↓\n│   1574072041480679424 [2022-09-25] @AskYatharth 💜 5\n│   ive been straight up going for the word “freedom.” like “freedom to be with a paycheck in two months → ok work this week.” “freedom to be free → go fly my kite at the beach”\n│   ↓\n│   1574072042663514112 [2022-09-25] @AskYatharth 💜 5\n│   something about freedom evokes the thing in a way intentionality didn’t for me\n│   \n│   intentionality still sounds productivity-adjacent. like im hewing to some external idea of what’s right\n│   \n│   freedom feels deeply internally realised\n├── 1574072160876109825 [2022-09-25] @visakanv 💜 2\n│   @AskYatharth https://t.co/hhwjbAbKPI\n│     [Quoting @visakanv: @yacineMTB what would you like to be doing instead?]\n└── 1574206824202768384 [2022-09-26] @justavagrant_ \n    @AskYatharth I struggle with this exact thing! Depending on context I’ve been saying creating value (which still has corporate connotations), or creating joy &amp; goodness (which Is a little cringe but at least earnest). Or efficacy if I’m just trying to refer to doing the thing\n\n===\n\n1579917775812038656 [2022-10-11] @visakanv 💜 64 🔁 3 [(SEED) type=quote_of_root]\nhow are you currently conflicted about what you want to do? https://t.co/nUwNeTxXHU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n├── 1579950629275185152 [2022-10-11] @blisstweeting 💜 5\n│   @visakanv work consumes too much time and it clashes with my drive to make my own stuff\n└── 1580117503896072193 [2022-10-12] @alex_with_ease 💜 1\n    @visakanv I want to both become radically more mindful, wise and competent, but apparently I also want things to roughly stay the same.\n\n===\n\n1594474465735639041 [2022-11-20] @Malcolm_Ocean 💜 51 🔁 3\nin the same way that it's wasteful to drive with the handbrake on\n\n   —it might work, but you get worse results at greater energy cost—\n\nit's wasteful to try to do things in the face of inner resistance\n↓\n1594553048663482368 [2022-11-21] @visakanv 💜 6 [(SEED) type=quote_of_root]\n@Malcolm_Ocean I always think about- \nhttps://t.co/nUwNeTxXHU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1647698842047922179 [2023-04-16] @strangestloop 💜 9 🔁 1\nso has anyone found a solution for the endless pursuit of productivity maximization? let me know\n↓\n1647895381869568007 [2023-04-17] @kcorazo 💜 1 [(SEED) type=quote_of_semantic_search]\n@strangestloop what exactly is the problem? isn't it just getting better at your craft?\n\nit just is like the endless pursuit of getting healthier or getting better at relationships or being at peace with yourself\nhttps://t.co/D2kTRM3PX9\n  [Quoting @kcorazo: Productivity gets a bad rap because people use it to force themselves to do work they hate.]\n\n===\n\n1671602363982032896 [2023-06-21] @uberstuber 💜 247 🔁 16 💬 1 [(SEED) type=semantic_search]\nwe desperately need a \"how to be productive\" guide that isn't like, \"force yourself to do xyz\"\n\ni don't think non-coercion is it either\n\nit's a practice, it's devotional\n├── 1671618668449374209 [2023-06-21] @Malcolm_Ocean 💜 12 🔁 2\n│   @uberstuber yeah \"non-coercion\" is still fundamentally neurotic/reactionary/awayness-based\n│   \n│   although many things start that way because they first need to thoroughly critique the existing thing so it stops hiding in the background\n│   https://t.co/A3Z9V0IlVn\n│     [Quoting @Malcolm_Ocean: I've recently started appreciating &amp; refining a concept of \"neurotic\" which is a strategy for caring about something that's based on trying to avoid various pitfalls or problems without a clear idea of what \"good\" looks like.]\n│   ├── 1671624746121969664 [2023-06-21] @uberstuber 💜 7 🔁 1\n│   │   @Malcolm_Ocean https://t.co/fMlnZ95tNC\n│   │     [Quoting @AskYatharth: @uberstuber non-coercion is like repairing the knee injury so you can begin to do the yoga or movement practices everyone else recommends]\n│   └── 1671757157333712896 [2023-06-22] @positive_loop 💜 2\n│       @Malcolm_Ocean @uberstuber Do you have any ideas for a towardsness-based name for the thing that non-coercion points at?\n│       \n│       (Spelling it out I'm not even sure the question makes sense)\n│       ↓\n│       1671956803180003465 [2023-06-22] @Malcolm_Ocean 💜 2\n│       @positive_loop @uberstuber no the question makes perfect sense\n│       \n│       \"freedom\" is the best word I have found I think\n│       https://t.co/j8yNRoHBrp\n│       ↓\n│       1671957095707451400 [2023-06-22] @Malcolm_Ocean 💜 2\n│       @positive_loop @uberstuber I sometimes think of this as \"fundamental freedom\"\n│       \n│       https://t.co/eNA1KLCNQO\n│         [Quoting @Malcolm_Ocean: you are absolutely free to do what you want  you are not free from the consequences of doing what you do  you wouldn't want to be—otherwise what would be the point of doing it?]\n│       ↓\n│       1674106765124698131 [2023-06-28] @positive_loop 💜 1\n│       @Malcolm_Ocean @uberstuber Hmm... I this resonates for interpersonal coercion but not so much for self-coercion 🤔\n│       \n│       I would say I'm still exercising my fundamental freedom when I'm coercing myself\n├── 1671619756703752192 [2023-06-21] @visakanv 💜 3\n│   @uberstuber thing i've written that's closest to this:  \n│   https://t.co/hX0JcpwCju\n│     [Quoting @visakanv: are you also a fidgety boi? you may be interested in my draft notes for Constructive ADHD:  https://t.co/e0Q0Z661CJ]\n├── 1671620630863593473 [2023-06-21] @AskYatharth 💜 5 💬 2\n│   @uberstuber non-coercion is like repairing the knee injury so you can begin to do the yoga or movement practices everyone else recommends\n│   ↓\n│   1671621509851533313 [2023-06-21] @uberstuber 💜 2\n│   @AskYatharth yes, an essential step\n├── 1671691529973563393 [2023-06-22] @kcorazo 💜 9 🔁 1\n│   Work is such a strong god that treating it spiritually risks what @p_millerd and @SimoneStolzoff seem to be solving for in their books (seem: I haven't finished reading them yet)\n│   \n│   This was not a problem before the Death of God, because all gods were tamed under The Omnipotent One\n│   \n│   The options today seem to be:\n│   - Polytheism: have other strong gods\n│   - Return to God\n│   (atheism, as DFW said, only hides your gods)\n│   \n│   There's an essay in my head entitled \"The Meaning of Work at the Crossroads of Desire and Money\" which I will only write after I've read pathless path and good enough job\n│   \n│   I'll riff on this table, which is inspired by @lukeburgis's Wanting\n│   \n│   I sense @ungatedcreative has also been exploring this topic\n│   Images:\n│     - [Image #0] The image is a handwritten table on lined notebook paper, divided into three columns and two rows, exploring the relationship between economic status and various aspects of work or motivation. To reproduce the table, start by drawing a grid with three columns and two rows on lined paper.\n│       \n│       The column headers, from left to right, are labeled \"Animal,\" \"Normetic,\" and \"Transcendental.\" The row headers, from top to bottom, are labeled \"Post Economic\" and \"Economic.\" \n│       \n│       The table contains the following entries:\n│       - Under \"Post Economic\" and \"Animal\": \"care, affection\"\n│       - Under \"Post Economic\" and \"Normetic\": \"status byal many\"\n│       - Under \"Post Economic\" and \"Transcendental\": \"truth, growth, beauty\"\n│       - Under \"Economic\" and \"Animal\": \"food, shelter, children\"\n│       - Under \"Economic\" and \"Normetic\": \"status, image, money\"\n│       - Under \"Economic\" and \"Transcendental\": \"entrepreneurship as a vocation\"\n│       \n│       The handwriting is in black ink and appears to be written with a ballpoint pen. The overall appearance suggests a brainstorming or note-taking session, possibly for an essay or discussion on the meaning of work.\n│   ↓\n│   1671696593551237121 [2023-06-22] @uberstuber 💜 5\n│   @kcorazo @p_millerd @SimoneStolzoff if you haven’t read them already, you might be interested in Pieper’s Leisure: The Basis of Culture or Andrew Taggart’s Total Work talks/blogs\n│   ↓\n│   1671766386379755521 [2023-06-22] @kcorazo 💜 1\n│   @uberstuber @p_millerd @SimoneStolzoff Taggart is new to me! Looks interesting and builds on Pieper.\n│   \n│   I did a Pieper on non-coercion thread after I read Leisure :)\n│   https://t.co/jz3TzT27QZ\n│     [Quoting @kcorazo: Pieper approaches it from a different angle  Actually, several - liberal arts vs servile arts - virtue (not vs vice, but lack of education*) - and of course, leisure vs utilitarian work  Let me share some snippets below  The 1st 2 are ancient, not sure w 3 https://t.co/VwhyJb2mTb]\n├── 1671760297801940992 [2023-06-22] @the_wilderless 💜 8\n│   @uberstuber I was toying with this pretty intentionally under the frame of “graceful non-linear productivity” for a couple months this year,,\n│   \n│   since then I’ve poked at it here and there, but I stopped the really focused inquiry. might be a good time to pick it back up https://t.co/I2U2SISR43\n│   Images:\n│     - [Image #0] The image is a text-based image on a black background, discussing the author's exploration of \"graceful non-linear productivity.\" The text is transcribed as follows:\n│       \n│       \"So if I'm going to leave behind the raw rocket-fuel of self-hate and scarcity, and also leave aside most of the stored wisdom of non-coercive productivity, where does that leave me? What's my starting point?\n│       \n│       A few things come up:\n│       • the core inquiry: can I do the tasks my soul has been given—in a way that's driven by curiosity, exploration, & care?\n│       • this work has to involve my whole being body, heart, mind, & soul. I can't just take the usual road of working only with the mind while ignoring or suppressing the rest.\n│       • these new sources of energy have a less mechanical, more muscular vibe to them—I’ll have to give up any reliance on brute force and instead focus on things like gracefulness, balance, and growing my capacity. Just because these muscles are fairly weak and clumsy right now doesn't mean they have to stay that way.\n│       • (vague): something about weaving, connected with this sense of gracefulness. I work on many projects at the same time, and there’s a sense that these projects want to grow together. They always do. I can't pluck out a single one and drive it to the finish line without doing some harm to the whole project-complex.\n│       \n│       Those feel like enough starting points to be getting on with.\"\n├── 1671886633451548672 [2023-06-22] @IaimforGOAT 💜 1\n│   @uberstuber I am starting to realize I am productive just not in a way that society values ???\n│   \n│   Maybe the issue is not productivity and more like... how can you make money with what you are naturally inclined to do?\n│   \n│   It's not the productivity that needs to be fixed, + like the packaging idk\n└── 1673064993757986816 [2023-06-25] @abhayance 💜 1\n    @uberstuber https://t.co/SY2jfGTmYs\n\n===\n\n1671620275371139074 [2023-06-21] @demiurgently 💜 20 🔁 1 [(SEED) type=quote_of_semantic_search]\nmaking spreadsheets in the spreadsheet factory is not devotional and i do need guides for self-coercion, please keep writing them https://t.co/tfMYnWybKM\n  [Quoting @uberstuber: we desperately need a \"how to be productive\" guide that isn't like, \"force yourself to do xyz\"  i don't think non-coercion is it either  it's a practice, it's devotional]\n├── 1671621305890754561 [2023-06-21] @demiurgently 💜 10\n│   not trying to dunk on the original tweet to be clear!! I just find there are lots of good and worthwhile things in life that I need coercion to accomplish and I’m a tiny bit tired of TPOT thought (not pictured here) that seems to think this is innately bad\n└── 1671622049767489536 [2023-06-21] @uberstuber 💜 6\n    @demiurgently yes! there's self-coercion (left side of midwit meme) and then there's self-coercion (right side of midwit meme) and i struggle to explain the difference\n    ↓\n    1671622235772305410 [2023-06-21] @uberstuber 💜 5\n    @demiurgently or like, use the self-coercive thing but also recognize the costs and take measures to rest appropriately later\n\n===\n\n1672317836881174528 [2023-06-23] @visakanv 💜 271 🔁 7\nlooking at notes I’ve taken from many conversations I’ve had over the years, something jumps out quite strikingly. it’s so striking it seems almost too obvious in hindsight, yet I don’t think my corresponding models connected here before:\n↓\n1672318059355459585 [2023-06-23] @visakanv 💜 243 🔁 14\nthe people who ask to be bullied into doing or not-doing things, are the same people who don’t know what they want.\n↓\n1672318467574464512 [2023-06-23] @visakanv 💜 66\n(you can get into some jokes about things like kinks and bdsm or being topped and dommed blah blah, I’m not talking about that. I’m talking about a very specific and distinct pattern in people who are stuck)\n↓\n1672318667034603520 [2023-06-23] @visakanv 💜 120 🔁 5 [(SEED) type=quote_of_root]\nanother way to read the above tweet is as a remix of the following: https://t.co/nUwNeTxXHU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n├── 1672319793620488192 [2023-06-23] @visakanv 💜 166 🔁 4\n│   “bully me” is a short term fix to paper over a longer-term problem. relying on an external force to scrape you through an internal muddle is something that, unless you get lucky, has a strong chance of abrasively degrading your sense of self-sovereignty\n│   ↓\n│   1672320597353959425 [2023-06-23] @visakanv 💜 76 🔁 3\n│   and I don’t mean to be absolutist about it; there are circumstances in which sometimes that’s a trade maybe worth making. what I’m trying to do here is not to tell people how to act (that would be me pushing), but to invite people to consider their situations more thoroughly\n│   ↓\n│   1672321784249712643 [2023-06-23] @visakanv 💜 67 🔁 1\n│   wow it’s becoming clearer to me that this is at the crossroads of like a dozen of my threads about sovereignty\n│   ↓\n│   1672322785769816065 [2023-06-23] @visakanv 💜 53 🔁 1\n│   I have stewing for a loooong time on writing an essay about sovereignty but i think this (current) thread may have finally set me up to do it. almost. very close https://t.co/O4NFz9C9Ff\n│     [Quoting @visakanv: Everyday is a new opportunity to assign value to things, to decide what is important, what is beautiful, what is good, what is deserving. In this regard you are truly the Monarch of your life, first of your name, bla bla https://t.co/YGXHATd5Ke]\n│   ↓\n│   1672323357646389251 [2023-06-23] @visakanv 💜 52\n│   will attempt a crack at it when I next get back to my computer. Might be the 3rd “10 year reference” essay on my substack if I handle it correctly. Got the tingles. Good sign\n│   ↓\n│   1672325994047471623 [2023-06-23] @visakanv 💜 48 🔁 1\n│   these are the first 8 steps then 9 is asking someone or something to bully you\n│   \n│   it might be a celebrity but even then the celebrity is really performing an avatar of- omg it’s all connected https://t.co/wbSm8YBe0p\n│     [Quoting @visakanv: i'm reflecting on how layered it is  1. there's some desire in ur heart  2. follow it, get burned. pain 3. create a barrier around the desire, lock it up 4. now feel cold, desolate 5. feel bad abt cold 6. beat self up for feeling bad 7. detach  8. ugh why am i so bored &amp; listless]\n│   ├── 1672326223681445888 [2023-06-23] @visakanv 💜 58\n│   │   Broooooo 🤯\n│   │   \n│   │   (I’ll explain it properly in the essay but for now damnnnn all my things are converging holy shit) https://t.co/GIXrspbwEl\n│   │     [Quoting @visakanv: in some ways the job of celebrities is to function as theatrical archetypes for people to project their internal conflicts onto]\n│   │   ├── 1672327526751010816 [2023-06-23] @visakanv 💜 32 🔁 1\n│   │   │   me rn, spiraling once again deep in the whole of inexplicable oneness and integration of all concepts https://t.co/xvGI5e4I4Z\n│   │   │     [Quoting @visakanv: 🧘🏾‍♂️ https://t.co/wWmhJ9bvVY]\n│   │   │   ↓\n│   │   │   1672328341184188416 [2023-06-23] @visakanv 💜 64 🔁 1\n│   │   │   336am and my entire body is buzzing in waves of euphoria from a convergence I’ve been frustratedly-earnestly working on for years \n│   │   │   \n│   │   │   tho realistically tmr I’m gonna wake up and be like “huh what was that all about?” lol https://t.co/4KnO6PNNXl\n│   │   │   Images:\n│   │   │     - [Image #0] The image shows a blurry, pixelated screenshot of a man in a black suit and hat, with his right arm raised in the air. The image appears to be a still from a video of a sports event, likely a soccer game, with a score displayed in the top-left corner.\n│   │   │   ↓\n│   │   │   1672329509436284928 [2023-06-23] @visakanv 💜 92 💬 1\n│   │   │   but these quiet moment in the dead of the night, these are the real high points of being a writer, for me, much more than external praise and outward success etc. crazy that I had it in real time while tapping on my magic rectangle and my friends and strangers get to see\n│   │   └── 1672328206261669889 [2023-06-23] @michelleakin 💜 2\n│   │       @visakanv https://t.co/5oz4RqHIPC\n│   │       Images:\n│   │         - [Image #0] The image shows a woman with blonde hair and a pink shirt standing in front of a door. She has a surprised or concerned expression on her face, and the NBC logo is visible in the bottom-right corner.\n│   │       ↓\n│   │       1672328790742290432 [2023-06-23] @visakanv 💜 2\n│   │       @MichelleAkin I know you get it at multiple layers!!!\n│   │       ↓\n│   │       1672329101716144129 [2023-06-23] @michelleakin 💜 2\n│   │       @visakanv i dooooo 😭😭😭\n│   │       \n│   │       im feeling the tingles too. very excited for what comes of all this dot connecting!!!\n│   └── 1672700020351434754 [2023-06-24] @ultimape \n│       @visakanv avatar of- Peterson, telling young men to just clean their room. lmao.Thus we have the foundation for the idea of paternalistic forms of government. https://t.co/CSR0zc6mGC.\n└── 1672326113459163136 [2023-06-23] @m1guelpf 💜 2\n    @visakanv i feel like this is a combination of general determination but also the ability/state of mind to ignore optionality\n    \n    as in, looking at all of the things you could be doing and deciding to keep working towards what you're working\n\n===\n\n1693031624194002954 [2023-08-19] @imhinesmi 💜 4 [(SEED) type=semantic_search]\nwhile wanting to work hard is unusual, wanting to want to work hard is very normal\n\nhence the genre of productivity porn, endless accusations of laziness, people deluding themselves about how productive they are\n↓\n1693032035835646305 [2023-08-19] @imhinesmi 💜 4\nsince working hard is no longer the difference between \"enough to eat this winter\" &amp; \"not enough to eat this winter\", people don't want to work\n\nbut the ideal of working hard for your family is still real &amp; compelling\n\nhttps://t.co/FAhIj79ocF\n  [Quoting @imhinesmi: we have built a society so rich that even useless layabouts with no money can live as well as kings did a thousand years ago  this is the win condition for human prosperity https://t.co/8yY0NAHxFf]\n↓\n1693166981166596303 [2023-08-20] @pachabelcanon 💜 1\n@imhinesmi what should you do, then?\n↓\n1693263389458321896 [2023-08-20] @imhinesmi 💜 1\n@pachabelcanon idk man\n\nthis is a life-complete problem, there's no clear map here &amp; I wouldn't trust anyone who showed me one\n\n===\n\n1738773256050811199 [2023-12-24] @franki3stone 💜 1 [(SEED) type=quote_of_root]\nThis whole thread though. God damn 🥵🙌 https://t.co/7EpsbQ1pKI\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n\n===\n\n1748737418268967101 [2024-01-20] @visakanv 💜 285 🔁 11\nrival's best and most underappreciated tweet in my view https://t.co/6bPqbApnjg\n  [Quoting @nosilverv: Many kids become hyperrational as kids because that's the game adults are ostensibly playing. They get no purchase, ofc, because adults are just cosplaying being rational so that they don't get unpersoned. Take a long time to discover it's emotional disregulation all the way down]\n↓\n1748737675480461780 [2024-01-20] @visakanv 💜 70\npairs beautifully with what i consider one of the best tweets ever written by anyone ever https://t.co/6GNWB8mSFm\n  [Quoting @DRMacIver: A lot of visible problems that you can't seem to solve are secretly solutions you don't want to admit to adopting to problems you don't want to admit to having.]\n↓\n1748738064846082341 [2024-01-20] @visakanv 💜 38 [(SEED) type=quote_of_root]\nsince i'm listing out banger tweets, https://t.co/nUwNeTxXHU\n  [Quoting @reasonisfun: 'Self discipline' is a patch for being conflicted about what you want to do.  Often, productive people are interpreted as 'having discipline': able to force themselves to do the work even when it's unpleasant.  But creative productivity only ever works in *spite* of that.]\n↓\n1748738326360977471 [2024-01-20] @visakanv 💜 26\nhttps://t.co/DFLB7QK1wh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @visakanv My latest frame for this: everyone is basically living in a dream mashup of their current external situation and their old emotional meanings. Like dreaming you're at school but it's also on a boat somehow.  &amp; as in dreams, somehow the weirdness of this mashup goes unnoticed]\n↓\n1748738417947803765 [2024-01-20] @visakanv 💜 31\nhttps://t.co/0WOQkVB9ZH\n  [Quoting Tweet 1027604793101959168 (missing)]\n↓\n1748743667265765721 [2024-01-20] @visakanv 💜 47 🔁 1\nstrong case could be made for \"no, this is rival's best tweet actually\" https://t.co/uZ3XQx8Sa8\n  [Quoting @nosilverv: Psychological maturity is realizing your dad was just some guy lol]\n├── 1748975591620243590 [2024-01-21] @visakanv 💜 9\n│   https://t.co/TUUvha1eLh\n│     [Quoting @mechanical_monk: life gives you problems (in the David Deutsch sense, or in the math textbook sense)  you transform them, in your head, into Problems (psychic entities)  you put them on pedestals. you walk around them all day, look at them, occupy yourself with them. you tremble at their might]\n└── 1750141317928129003 [2024-01-24] @nosilverv 💜 3\n    @visakanv Extremely touched by being featured twice in this thread.\n\n===\n\n1764820607328305293 [2024-03-05] @nosilverv 💜 11 [(SEED) type=quote_of_semantic_search]\n&gt; discipline remembering what you want\n\nWho wants to be my extended memory\n  [Quoting @reasonisfun: \"Discipline is remembering what you want.\"  When that works, it's not 'discipline'; it's getting less conflicted.]\n↓\n1765016893709078991 [2024-03-05] @tasshinfogleman 💜 2\n@nosilverv look no further https://t.co/EkxoxRYnVU\n  [Quoting @strangestloop: @nosilverv @tasshinfogleman https://t.co/CV54I5Uzaf]\n↓\n1765017933414040051 [2024-03-05] @strangestloop 💜 3\n@tasshinfogleman @nosilverv lmao i'm so funny\n↓\n1765043249805205529 [2024-03-05] @nosilverv 💜 1\n@strangestloop @tasshinfogleman this was indeed excellent\n\n===\n\n1764897967335510466 [2024-03-05] @cxgonzalez 💜 18 [(SEED) type=quote_of_semantic_search]\noptimistic but wrong view of our psychology to make non-coercion maximimalism seem more tenable https://t.co/lK4Fb23zuM\n  [Quoting @reasonisfun: \"Discipline is remembering what you want.\"  When that works, it's not 'discipline'; it's getting less conflicted.]\n├── 1764897973274616076 [2024-03-05] @cxgonzalez 💜 11\n│   i really wish it were true that simply reminding yourself of what you want long term was enough to factually dissolve any inner tension and robustly defeat akrasia, but in practice this isn’t the case\n│   ↓\n│   1764897975292010555 [2024-03-05] @cxgonzalez 💜 9\n│   i really wish that the world was structured so that all you had to do was reframe the situation to make it organic and 0 friction to just Do The Thing. but unfortunately the world isn’t structured that way \n│   \n│   sometimes, often times, you just have to clench and push through\n│   ↓\n│   1764897977775087940 [2024-03-05] @cxgonzalez 💜 6\n│   having a Will is not only a useful for a flourishing life but a requirement for any sort of agency at all. if all you ever did was what your desires commanded are you really an agent at all?\n│   ↓\n│   1764900732199678180 [2024-03-05] @cxgonzalez 💜 5\n│   non-coercion is best thought of as a course correction for the many who have a very harsh internal critic who only hampers, not helps, their motivation to act in a way that’s concussive to their flourishing. some people need the adjustment to soften their self-judgement\n│   ↓\n│   1764900759844299179 [2024-03-05] @cxgonzalez 💜 4\n│   (ofc this isn’t an attack on Lulie, she adds wonderful memes to the water supply)\n├── 1764909349858681130 [2024-03-05] @RichDecibels 💜 4\n│   @cxgonzalez if non coercion maxxing doesn't work at the mega and meso scales why would we expect it to work at the micro scale\n│   ↓\n│   1764925136250048708 [2024-03-05] @maebichka 💜 3\n│   @RichDecibels @cxgonzalez Are u joking orA HUGE portion of things that work at micro scale don't work at bigger scales!!\n│   ↓\n│   1764939879979397587 [2024-03-05] @RichDecibels 💜 3\n│   @not_a_hot_girl @cxgonzalez not joking. reframe it: where do you see non coercion maxxing work?\n│   ├── 1764942279020523767 [2024-03-05] @maebichka 💜 2\n│   │   @RichDecibels @cxgonzalez In me rn :3 https://t.co/8eyBfRHcVe\n│   │   Images:\n│   │     - [Image #0] The image depicts a cartoon cat drinking from a carton of milk. The cat is gray with pink inner ears and cheeks, and it has brown eyes and eyebrows. It is holding a pink carton of milk in its paws, with the word \"milk\" written on it, and is drinking from it through a straw.\n│   └── 1764946662680662443 [2024-03-05] @Tangrenin 💜 3\n│       @RichDecibels @not_a_hot_girl @cxgonzalez Maybe this counts a bit?https://t.co/naUxMq8N9U'if you let children find out and learn what they want they learn useful things' (lots of caveats and unknowns probably ofc)\n│       ├── 1764948152518406237 [2024-03-05] @cxgonzalez 💜 2\n│       │   @Tangrenin @RichDecibels @not_a_hot_girl there’s lots of things a kid should learn that they won’t initially find interesting, actually\n│       │   ↓\n│       │   1764950160495309291 [2024-03-05] @Tangrenin 💜 3\n│       │   @cxgonzalez @RichDecibels @not_a_hot_girl True! And it helps to contextualize to the kids why these things are relevant. To have an inner sense of  direction when you gotta push through / do what you gotta do Max anything is rarely wise but more inner alignment(s) rather than just non coercion\n│       └── 1764956999857443123 [2024-03-05] @RichDecibels 💜 3\n│           @Tangrenin @not_a_hot_girl @cxgonzalez there's still plenty of coercion involved, eg hardcore antisocial behaviours are banned and will be enforced with violence if necessary\n└── 1765183914954694725 [2024-03-06] @pachabelcanon 💜 3 💬 1\n    @cxgonzalez the non-coercion people have an altogether too idealistic view of the self, and in the final analysis its equivalent to a totally \"cynical\" understanding\n    ↓\n    1765184285592764670 [2024-03-06] @pachabelcanon 💜 1\n    @cxgonzalez that's the point of the discovery of the super-ego: it's not a list of rules, or a morality, but a sadistic agency that punishes you the more you live to its standards. trying to put a nice face on this misses the point of what discipline is\n    ↓\n    1765184807498396122 [2024-03-06] @pachabelcanon 💜 2\n    @cxgonzalez in fact \"non-coercion\" very easily gels to the superego - the most common form of the superego is \"don't coerce yourself\", which easily becomes a coercion\n\n===\n\n1826945482968420610 [2024-08-23] @inkolore_ 💜 127 🔁 16\nOne of the most common form of miscommunication I see is what I call a \"channel mismatch\". It's very common between men and women, but it's more universal than that.\n\nEx1: A man tells his wife that planes are safe by giving her statistics about plane VS car crashes, but\n↓\n1826945485283668312 [2024-08-23] @inkolore_ 💜 42\nhis wife doesn't feel safer at all, because she doesn't want *data*, she wants a guarantee that it will be fine. In that regard, physical reassurance would probably do a lot more.\nSo they are not communicating in the same channel so to speak.\n↓\n1826945487385039048 [2024-08-23] @inkolore_ 💜 35 🔁 2\nEx2: Techno optimists who are obsessed with traveling to other planets and the development of AI, while other people just want to settle down and build relationships and a family, and feel like it's becoming more and more difficult.\nVery different priorities, but they sort of\n↓\n1826945489553490148 [2024-08-23] @inkolore_ 💜 37 🔁 3\ntalk besides one another and never acknowledge how different their priorities in life are.\n\nEx3: The part of you that wants to get things done, coming into conflict with the part of you that wants more freedom, but instead of acknowledging the 2nd part, it's seen as lazy, or as\n↓\n1826945491487133739 [2024-08-23] @inkolore_ 💜 36 🔁 1 [(SEED) type=semantic_search]\n\"self-sabotage\", as if it only had bad intentions! Maybe the part of you that resists the work you want to do has valid reasons, but it's always being interpreted on the lazy/productive spectrum instead of being listening to on its *own* terms.\n↓\n1826946056602395110 [2024-08-23] @inkolore_ 💜 29 🔁 2\nSo I guess a way to summarize all of this: different people also have different priorities, duh. But we sort of become blind to this in disagreements because the culture we live in is geared towards pushing everyone towards the same lifestyle and way of thinking, unfortunately.\n↓\n1826947610210394329 [2024-08-23] @inkolore_ 💜 15\nTrust gap VS technological solution is a huge channel mismatch as well\nhttps://t.co/dj8rrGoFZl\n  [Quoting @inkolore_: You cannot bridge a trust gap with technology. You might be able to build additional layers on top of shaky trust, which can give you enough \"stability\" for things not to break, but that will never ever replace true trust. Techno-optimists are constantly baffled that]\n\n===\n\n1831222327637413933 [2024-09-04] @Untrulie 💜 413 🔁 18 💬 1\nhave any of you lost the ability to read books and then got it back again? \n\nwhat did you do?\n↓\n1831223384992284967 [2024-09-04] @visakanv 💜 22 🔁 1\n@metaLulie my interest in books ebbs and flows depending on my life situation— and this might be projecting but i think a lot of people who say they've lost the ability to read have mostly lost *interest* in reading and are kinda in denial abt it + nostalgic for their previous life-sitch\n↓\n1831223695744106597 [2024-09-04] @visakanv 💜 2\n@metaLulie if i'm conflicted about wanting to read something (vs doing other things), the way for me to get into it is to contextualize it better for myself, to soften the ground by making it more relevant and compelling for me\nhttps://t.co/bC3sTcTMfG\n  [Quoting @visakanv: I notice a thing in my media consumption patterns where sometimes there's something I want to watch or read or learn more about, but it doesn't really happen until something else \"softens the ground\".   Eg: I've vaguely wanted to learn more about Miles Davis for a few years now]\n↓\n1831223885767037086 [2024-09-04] @visakanv 💜 2 [(SEED) type=quote_of_semantic_search]\n@metaLulie aka https://t.co/NhxXho1Z9B\n  [Quoting @reasonisfun: \"Discipline is remembering what you want.\"  When that works, it's not 'discipline'; it's getting less conflicted.]\n\n===\n\n1839245024644706551 [2024-09-26] @franki3stone \ndoing an assignment on critical thinking nd my strengths and weakness in the skillset. unsurprisingly its hard bc i have to figure out my bias in different places both consciously and unconsciously. urgh. its the worst but also the best ya kno\n↓\n1839273237433454819 [2024-09-26] @franki3stone \nmade this instead of reading pages i need to finish reading, seems fitting. https://t.co/nK5Qhlq59g\nImages:\n  - [Image #0] The image presents a diagram illustrating the concepts of bias, objectivity, and skepticism. The diagram is divided into two main sections: \"Bias\" on the left and \"Objectivity & Skepticism\" on the right, with a horizontal arrow connecting them.\n    \n    **Bias Section:**\n    \n    *   **Unconscious Bias**\n        *   Implicit associations and assumptions that influence our thinking without awareness.\n        *   These can lead to errors in judgment and decision-making.\n    *   **Conscious Bias**\n        *   Explicit preferences or prejudices that we are aware of.\n        *   These can be based on personal experiences or cultural influences, and may affect our reasoning process.\n    \n    **Objectivity & Skepticism Section:**\n    \n    *   **Clarity**\n        *   The ability to express ideas clearly and precisely.\n        *   It involves defining terms, structuring arguments logically, and avoiding ambiguity in communication.\n    *   **Intellectual Humility**\n        *   Recognizing the limits of one's knowledge and being open to new ideas and perspectives.\n        *   It involves acknowledging mistakes and changing views when needed.\n    *   **Critical Distance**\n        *   The ability to step back from one's own beliefs and opinions to evaluate them objectively.\n        *   It involves questioning assumptions and considering alternatives.\n    \n    The diagram suggests that as one moves from left to right, they progress from being influenced by biases to cultivating objectivity and skepticism. The concepts presented are interconnected, with clarity, intellectual humility, and critical distance being essential for achieving objectivity and skepticism. By understanding and addressing unconscious and conscious biases, individuals can strive towards more objective and skeptical thinking.\n↓\n1839273554090799592 [2024-09-26] @franki3stone  [(SEED) type=semantic_search]\nhmm this has made me realise that even though im putting pressure on myself to \"do the thing i NEED to do\". what i actually WANT to do is be productive in another, more creative way...forgetting that reading these pages will assist in helping me be creative.lets play sum tricks\n↓\n1839273727684735313 [2024-09-26] @franki3stone \nlets give my brain something to creatively chew on, and see if i can twist and trick my brain into actually being excited about reading the last 6 pages i need to.\n↓\n1839273982870303151 [2024-09-26] @franki3stone \nit knows i want to trick it, so its not going to be complicit like that bot i was playing with earlier.but if i make it a game itll find it fun, so it being a \"trick\" wont matter. all that matters to this part of my brain is \"fun\".\n↓\n1839274212399423582 [2024-09-26] @franki3stone \ncreative is fun. writing this out is way more fun than reading chapters on critical thinking. So now im going to ask myself \"why is this more fun than learning bout critical thinking?\"\n↓\n1839274408034316477 [2024-09-26] @franki3stone \nthe first ting that pops up is bc it doesnt have any pressure or preconceived assumptions (otherwise known as bias) around it. AHA\n↓\n1839274564984947056 [2024-09-26] @franki3stone \nfirst trick played. I got my brain to unknowingly admit to having a bias which is part of my assignment on the topic. LOL. this is SO MUCH FUN..lets keep going...\n↓\n1839274788273139954 [2024-09-26] @franki3stone \nthat reason feels good to know but this level just got harder bc now there is a message sitting in my inbox, probs from someone id love to talk to and use as distraction. NO TODAY DEMON.\n↓\n1839275063960547343 [2024-09-26] @franki3stone \ninstead im going to not ignore it but dive deeper into wanting ti know more about bias and where my strengths and weakness in bias are, which ill only know if i keep reading about it....brb reading another page of tom chatfields - critical thinking (the thing i actually need to r\n\n===\n\n1900209738148704637 [2025-03-13] @NickBardoukas 💜 2 [(SEED) type=semantic_search]\nAlways needing to be busy and productive isn't discipline—it's just fear pretending to be ambition.\n\n===\n\n1917724433269285212 [2025-04-30] @chrisbarber  [(SEED) type=semantic_search]\n\"part of me wants to achieve, but other parts of me don't want to do the work\"\n\nI was talking with my brilliant friend Siddharth about why smart and ambitious people often experience more internal conflict and how to approach it without \"forcing\" yourself to do things\n\n(I'm very anti \"self-discipline\" -- I think when people say self-discipline in practice it looks like one part of them forcing other parts of themselves to do something, I prefer self-collaboration and win-win negotiation)\n\n===\n\n1941920119686402416 [2025-07-06] @ethereal_mists 💜 38 🔁 2 [(SEED) type=semantic_search]\nI'm questioning this belief I've carried that discipline means forcing myself to do things I don't want to do.\n\nWhat if true discipline is actually knowing myself well enough to create conditions where effort feels natural rather than forced?\n\nStill figuring that one out.\n\n===\n"
}