{
  "tweet_id": 1074043268898336769,
  "thread_text": "1074043268898336769 [2018-12-15] @visakanv 💜 384 🔁 63 💬 23 [(SEED) type=root]\nGoo for my prickly friends\nPrickles for my gooey friends\n├── 1074043437245030400 [2018-12-15] @visakanv 💜 31\n│   https://t.co/NcMQNtpNym\n│     [Quoting Tweet 1000540084175818759 (missing)]\n│   ↓\n│   1095418367983288320 [2019-02-12] @visakanv 💜 25\n│   https://t.co/kElowfU8ji\n│     [Quoting @visakanv: \"git gud by getting your ass beat, hopefully in a nourishing and artful way\" is an inadvertently good summary of my approach to things, which confuses both hardbros and the softbros  hard takes for my soft friends  soft takes for my hard friends https://t.co/evv4WNVYaL]\n│   ↓\n│   1095420026373328896 [2019-02-12] @visakanv 💜 38 🔁 1\n│   \"Lots of the advice people give is useful for some people, but the opposite advice is useful for other people.\" \n│   \n│   https://t.co/SsG2upFsFB\n│   ├── 1095420852475113472 [2019-02-12] @visakanv 💜 74 🔁 13\n│   │   Two opposing-but-necessary thought-pathways that you have to synthesize into your brain:\n│   │   \n│   │   1. Your position is perfectly understandable, and there is absolutely no shame in it. \n│   │   \n│   │   2. You are out of excuses and we are running out of patience. \n│   │   \n│   │   https://t.co/1irV8ykFkN https://t.co/0ppUCaYmVa\n│   │   Images:\n│   │     - [Image #0] The image shows a text passage that discusses the importance of synthesizing two opposing thought pathways. The passage is divided into three paragraphs.\n│   │       \n│   │       The passage begins by stating that there are two contradictory thought pathways that must be synthesized into one's brain. The first pathway acknowledges that the reader's position is understandable and that there is no shame in it. The second pathway emphasizes that everyone is facing hard times and that the reader is out of excuses and running out of patience.\n│   │       \n│   │       To reproduce this image, one would need to recreate the text passage with the same content and formatting. The text should be presented in a clear and readable font, with the same paragraph structure and sentence layout as the original image.\n│   │       \n│   │       The text in the image reads: \n│   │       \n│   │       \"Oh I have two beginnings for you, two opposing-but-necessary thought-pathways that you have to synthesize into your brain. They are contradictory. You will not like them. But you must read them. They are:\n│   │       \n│   │       1. These are hard times, and it is okay to be where you are. Your position is perfectly understandable, and there is absolutely no shame in it. You can work on this, and you can bring yourself into the life that you would like to have. Everyone takes a different path, and no one path is better than any other - some people simply come into themselves later in life.\n│   │       \n│   │       2. These are always hard times and everyone is in a recession. You are out of excuses and we are running out of patience. Others spent their twenties improving themselves, taking joy in their skills, building their futures and forming their hearts in the very same difficult economic climate; you spent your twenties so terrified of risk and rejection that you bummed yourself right out of the game, and it's nobody else's responsibility to haul you back into it. You are not inherently entitled to a regular wage, a pleasant job, a comfortable home or a willing girlfriend, and complaining that life has not yet handed you these things because \"you still need to work on your confidence\" is naive at best and offensive at worst.\n│   │       \n│   │       Absorb and reconcile these two pathways in your head. Both are true. You are in an understandable place; but you have been selfish with your energy and lazy with your opportunities. You are going through some very real, very difficult stuff; yet you have not given very much to the world. You have to pay something into the Universe's collection plate before you can reasonably expect to get anything back. Give some piece of your body, soul, time, energy, labor, strength, intelligence,\n│   │   ↓\n│   │   1095423413206757376 [2019-02-12] @visakanv 💜 49 🔁 1\n│   │   love tells me I am everything\n│   │   \n│   │   wisdom tells me I am nothing \n│   │   \n│   │   https://t.co/148m0Tc96v\n│   │     [Quoting @visakanv: @spiritualpoet_ \"Love tells me I am everything. Wisdom tells me I am nothing. And between these 2 banks, flows the river of my life.\" - Nisargadatta]\n│   │   ↓\n│   │   1438721594931642369 [2021-09-17] @visakanv 💜 39 🔁 1\n│   │   dreams for my friends who toil\n│   │   \n│   │   toils for my friends who dream\n│   │   ↓\n│   │   1454721057005326340 [2021-10-31] @visakanv 💜 23 🔁 1\n│   │   https://t.co/fEhKDRJyUo\n│   │     [Quoting @visakanv: Kiki upstairs Bouba downstairs https://t.co/tSBMQYtHjJ]\n│   │   ↓\n│   │   1648585221955260416 [2023-04-19] @visakanv 💜 10\n│   │   https://t.co/wg6nhzvMnb\n│   │     [Quoting Tweet 1648435685404323840 (missing)]\n│   └── 1417560431686684674 [2021-07-20] @Malcolm_Ocean 💜 1\n│       @visakanv This great article by @everytstudies talks about how this shows up in arguments (or shows up as making conversations seem like arguments when they mostly aren't).\n│       \n│       https://t.co/qsKHxi1wID\n│       ↓\n│       1417560842661285890 [2021-07-20] @Malcolm_Ocean 💜 1\n│       @visakanv @everytstudies Might be something you can gauge about how robust someone's perspective is if you try critiquing it from multiple directions and dimensions and see how it responds (\"$1000/mo UBI? why not $2000/mo?\")\n│       \n│       Have seen this discussed; forget where.\n│       \n│       Also this ofc:\n│       https://t.co/jSCsq5Vley\n│         [Quoting @frideswyth: Meta-rats talking:  metarat1: heads metarat2: I agree, but also tails metarat1: yes I agree about tails  both in unison: this is the same coin  metarat1: but it's good to argue the side for heads metarat2: yes, and also for tails  both in unison: yes]\n├── 1748104369219006578 [2024-01-18] @visakanv 💜 26 🔁 2\n│   courage for my strategic friends\n│   strategy for my courageous friends\n│   \n│   https://t.co/OOFa6dX1Dg\n│     [Quoting Tweet 1745149312362033199 (missing)]\n├── 1775716640359063578 [2024-04-04] @visakanv 💜 8\n│   lots of good stuff to chew on in this thread https://t.co/i3GMOkNzNa\n│     [Quoting Tweet 1775654874979451111 (missing)]\n├── 1775768481532936195 [2024-04-04] @visakanv 💜 25\n│   therapy for my philosophy friends\n│   philosophy for my therapy friends\n│   https://t.co/ia1gtjaU0m\n│     [Quoting @RomeoStevens76: @mourader @visakanv oops. It means that therapists usually aren't set up to handle emotions being about actual big life questions. Philosophers aren't set up to handle their grand theories actually being about mundane socialization problems.]\n├── 1807824038120902953 [2024-07-01] @visakanv 💜 13\n│   https://t.co/gt4mskl5zh\n│     [Quoting @nosilverv: FUCKED UP how you always need the opposite of your inclination: gym rats should go to therapy and therapycels should hit the gym, I fucking love sciencers should get into woo and hippies should study logical argument, …]\n├── 1831910878553501917 [2024-09-06] @visakanv 💜 5\n│   bumble for my puss friends\n│   puss for my bumble friends https://t.co/UfHCKY79MR\n│     [Quoting Tweet 1831802861942153509 (missing)]\n└── 1838422604019044748 [2024-09-24] @visakanv 💜 22\n    https://t.co/mbQpDmuqnd https://t.co/KOEWA9jSG0\n      [Quoting Tweet 1838345797769007452 (missing)]\n\n===\n\n1162525206063140864 [2019-08-17] @visakanv 💜 36 🔁 4\nI keep bumping into people who have inherited some form of worldview that miserably hyperfixates on “is it optimal?”, and they hate it but they’re stuck\n\nPersonally, my framing (considering the problem of imperfect information and premature optimisation) is “is it groovy?” https://t.co/xnzshKdHRS\nImages:\n  - [Image #0] The image shows a man standing in front of a crowd, with his hands raised. The man is wearing a white shirt and a tie, and he appears to be speaking or presenting to the audience.\n    \n    *   The man is standing in the center of the image, facing the camera.\n        *   He is wearing a white shirt and a tie.\n        *   His hands are raised in front of him, as if he is gesturing while speaking.\n    *   The crowd is seated behind the man, facing him.\n        *   They are all wearing casual clothing, such as t-shirts and jeans.\n        *   Some of them are clapping or cheering.\n    *   There are several logos visible in the image.\n        *   A CNN logo is visible in the bottom-right corner of the image.\n        *   A partially obscured logo is visible in the bottom-left corner of the image.\n    *   The background of the image is dark, suggesting that it was taken at night.\n        *   There are some trees visible in the background, which are lit up by lights.\n    \n    Overall, the image appears to be a screenshot from a news broadcast, possibly taken during a live event or speech.\n↓\n1162525678463410176 [2019-08-17] @visakanv 💜 5 [(SEED) type=quote_of_root]\nhttps://t.co/UbvYkcr3b1\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1162536002923032576 [2019-08-17] @visakanv 💜 4\nThe virgin optimizer vs the groovy chad\n\nhttps://t.co/4v4Xe6hiuq\n  [Quoting @visakanv: all of this can seem very removed, very abstract  but here's what I think I know, from my personal experience  I used to be a much needier person than I am now  and I believe you can actually *see* this change in my *face*  people can feel this difference and treat me differently https://t.co/Gr1Wswf0e2]\n\n===\n\n1232561734021341184 [2020-02-26] @visakanv 💜 75 🔁 8 💬 1\nToying with the thought (or frame, ha ha) that the most important skill is the ability to artfully and appropriately frame your reality\n\nand that most people get stuck with over-loose or over-rigid frames, for a myriad of reasons\n↓\n1232562281398976514 [2020-02-26] @visakanv 💜 11\nThis is a remix of an older yin/yang type idea: how both too much order or too much chaos can cause suffering, and the whole art of life is to find the Goldilocks balance in each situation\n↓\n1232562792378421248 [2020-02-26] @visakanv 💜 8\nLots of people tend to be imprinted by their suffering and their circumstances, many become kinda boring and predictable as a result\n\nToo much order bad!! \n\nNo, too much chaos bad!!\n\nBreak the system!!\n\nNo, improve the system!!\n↓\n1232562924931018753 [2020-02-26] @visakanv 💜 1 [(SEED) type=quote_of_root]\nhttps://t.co/UbvYkcr3b1\n\n☯️ https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1258776396148510721 [2020-05-08] @visakanv 💜 22 🔁 1\nthe latest round of tech vs journalism wars is funny-sad to me, because I sometimes think of myself as a technologist, sometimes a journalist, love the best things about both, loathe the worst things about each, and find it a lot like being caught in the middle of a family fight\n↓\n1258776583914975232 [2020-05-08] @visakanv 💜 15\nI guess this also generalizes for me to almost every form of human conflict. I have always been team [Naively] Can't We All Get Along\n↓\n1258778050172293121 [2020-05-08] @visakanv 💜 6 [(SEED) type=quote_of_root]\nhttps://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1261855687107203072 [2020-05-17] @visakanv 💜 50 🔁 2\nall patterns are the same pattern when seen from a different side https://t.co/Ct4kusELUP\n  [Quoting Tweet 1261781161484808192 (missing)]\n↓\n1261856204914978817 [2020-05-17] @visakanv 💜 16\npatterns of on and off, zeroes and ones, 10101110110100111\n\npainting is music at a different frequency\n\nall things are made up of things in relation to things\n\nhttps://t.co/s61EBl7Aa9\n  [Quoting @visakanv: a person is a system is a science is a mind is a language is a city is an organism is art]\n↓\n1261858712118890499 [2020-05-17] @visakanv 💜 26 🔁 5\nTo Understand Is To Perceive Patterns, by @jasonsilva https://t.co/TOlB4EsKVM\nImages:\n  - [Image #0] The image is a dark, abstract composition featuring a central, glowing blue-purple shape against a black background. The shape is irregular and appears to be made up of various shades of blue and purple, with some lighter areas that give it a sense of depth or dimensionality.\n↓\n1737621560146719150 [2023-12-20] @visakanv 💜 23 🔁 2 [(SEED) type=quote_of_root]\n@JasonSilva https://t.co/Bym36t77eW https://t.co/2OGeBZ8tZL\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\nImages:\n  - [Image #0] The image presents a visual representation of the concept that different phenomena exhibit similar patterns, categorized into two distinct groups: \"Signature Pattern of Vibration\" and \"Signature Pattern of Discharge.\" \n    \n    **Signature Pattern of Vibration**\n    \n    *   The top section, titled \"SIGNATURE PATTERN OF VIBRATION,\" features a collage of four images showcasing various patterns characterized by wavy or undulating shapes.\n        *   The first image depicts a black-and-white abstract pattern with wavy lines.\n        *   The second image shows ripples on water.\n        *   The third image displays sand dunes.\n        *   The fourth image is a microscopic view of a brain or other biological tissue, featuring folds and creases.\n    \n    **Signature Pattern of Discharge**\n    \n    *   The bottom section, titled \"SIGNATURE PATTERN OF DISCHARGE,\" presents another collage of four images illustrating patterns marked by branching or radiating lines.\n        *   The first image captures a lightning bolt striking the ground.\n        *   The second image shows bare tree branches against a blue sky.\n        *   The third image is a microscopic view of a neuron, highlighting its dendrites and axon.\n        *   The fourth image displays a network of blood vessels or a river delta.\n    \n    The image effectively conveys the idea that diverse natural phenomena can be grouped based on their visual patterns, suggesting underlying commonalities or principles governing their behavior.\n\n===\n\n1271064759165530112 [2020-06-11] @visakanv 💜 21\nTempted to do a a earnestly-silly port of F.A.N. into a pastafarianism-type silly-jokey religion by working thru 0 HP's Major Ingredients. Please do not read this thread if you are overly susceptible to idolatry and/or True Belief. Ask your doctor if True Belief is right for you\n\n===\n\n1271077124523225089 [2020-06-11] @visakanv 💜 9\nat any given time, you can be certain some FANs are experimenting with breathwork, others with psychedelics, some are going back to church, some are playing in metal bands– nobody claims to have the One True Solution, everybody is curious to hear about everybody else's experience\n↓\n1271077775592456192 [2020-06-11] @visakanv 💜 7\n5. Dietary Taboos. I don't personally care too much about what I eat. FANs probably kinda lean health-conscious-ish: less sugar, maybe vegetarian or vegan-ish, some keto folks, etc etc, some diversity, common sense thoughtfulness, No Need To Make a Huge Thing About It\n↓\n1271078316502466562 [2020-06-11] @visakanv 💜 9\nnow when we talk about INFORMATION diets, we get much stronger opinions and POVs. FANs are infovores; hungry hungry hippos for learning and knowledge. You might even think of them as competitive eaters but for insight, perspective, worldviews and so on\n↓\n1271078821286961152 [2020-06-11] @visakanv 💜 8\none of the core info diet rules of FANs is \"do not quote tweet cringe. if your friend quote tweets cringe, inform her privately so that she might realize her mistake and take it down\"\n\n https://t.co/xhWl1NpoFE\n  [Quoting @visakanv: quote-tweeting cringe should be a graver faux pas than posting cringe in the first place]\n↓\n1271079243120668672 [2020-06-11] @visakanv 💜 8\nwhy? because FANs depend on the sanctity of the public commons in order to do their work. they respect and revere the commons, and so they do not pollute the commons with cringe that gets amplified into runaway cascading effects. save that shit for your private alt\n↓\n1271080690235305986 [2020-06-11] @visakanv 💜 8 🔁 1 💬 1\nEvery FAN does a little public service + cleanup duty in the commons around their spheres. Some of them started out as angry Facebook Warriors, but have since learned that it's more productive and less stressful to play the long game – be cheerfully curious, collect allies\n↓\n1271082057117007873 [2020-06-11] @visakanv 💜 5\n6. Evangelism, ie Spreading The Word. FANdom is fairly easy-ish to spread. It can be copied. One person's thread can inspire hundreds others to make threads, too. You don't need to be a perfect FAN yourself to help make the world more FAN-friendly. Support your local FAN today!\n↓\n1271082423321673729 [2020-06-11] @visakanv 💜 12\nan important core principle of FAN evangelism is that you can never persuade someone else to care by yelling at them that they should care more. YOU have to care. YOU have to be interested. so don't worry about evangelising. Just obsess about what you love https://t.co/BrcjWpZaie\n  [Quoting @visakanv: You can’t get people to read books by telling them that literature is important. You get them to read books by being excited about books. And “books are so exciting!!!” doesn’t cut it, you have to get into precisely what you’re excited about. This is how interest spreads]\n↓\n1271083015863537665 [2020-06-11] @visakanv 💜 11\nin any given population, there are always some closeted FANs. they've simply never known other FANs IRL, and so live in fear of expressing themselves, their feelings, their ambitions, their passions. part of the joy of being a FAN is helping young FANs along. (no pressure tho!!)\n↓\n1271084491482619905 [2020-06-11] @visakanv 💜 12\nThere you have it, a broad overview of the FAN religion. (FAN...dom? 😅) It is...\n\n- cheeky\n- curious\n- playful\n- mischievous\n- constructive\n- collaborative\n- long-term thinking\n- supportive\n- rebuilding the Library of Alexandria / Baghdad House of Wisdom\n- paint, dance, wine\n↓\n1271084882563743744 [2020-06-11] @visakanv 💜 7 [(SEED) type=quote_of_root]\napollonian types will see FANs as dionysian, because they like to party\n\ndionysian types will see FANS as apollonian, because they like to build\n\nFANs are hard to pin down because they're always earnestly following their curiosity, always switching frames\n\nhttps://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1271085698309709824 [2020-06-11] @visakanv 💜 4\nFANs will sometimes accidentally offend people by asking too many questions. oops. sorry. we never meant to offend or upset anybody we just had some questions\n\nhttps://t.co/ylOrbDAkuc\n  [Quoting Tweet 1169511884816441344 (missing)]\n↓\n1271086027327721478 [2020-06-11] @visakanv 💜 5\n(FANs will be annoyed when bad-faith actors weaponize \"just asking questions\" as a way to harass people. being friendly means being sensitive. if you notice you're making people uncomfortable with your questions, stop, at least for now. we're trying to play the long game here)\n↓\n1271086855656574976 [2020-06-11] @visakanv 💜 9\nAnyway. That's my attempt, at taking the fun little game I'm playing and putting it into a different frame. (Classic FAN move.) Happy to hear any thoughts from any other self-identifying FANs\n\nPS: if you take this *TOO* seriously u will be excommunicated for the sin of solemnity\n↓\n1271087463012773889 [2020-06-11] @visakanv 💜 4\noh yea, if you enjoyed the free sermon and would like to hear more about the FAN life, then you must certainly grab a copy of the Sacred And Holy Text, currently only available in PDF format https://t.co/fJAWvHnDqP\n\n===\n\n1298905944269524996 [2020-08-27] @visakanv 💜 61 🔁 4\nwhen I think the thought \"literally everything about my life is a competitive advantage\", I can't tell if it's because (1) I'm really lucky, or because (2) I'm very good at reframing things to my advantage\n\n(2) is kind of an eg of (1) but it's also kind of an impt distinction\n↓\n1298907164853977089 [2020-08-27] @visakanv 💜 22\neg: it's an advantage that I was put through such a ridiculous amount of scrutiny as a tall dark minority child, bc it means that as an adult I have almost no fear of being mocked, ridiculed, disliked, etc, which allows me to take bolder actions that others seldom even think of\n↓\n1298907485667913728 [2020-08-27] @visakanv 💜 24\nits an advantage that I have intense ADHD that made it impossible for me to do my homework, because it meant that the conventional path was never a serious option for me, so I have spent decades preparing to thrive in the chaos of the present moment\n↓\n1298907874748329984 [2020-08-27] @visakanv 💜 19\ni tone it down because it can be cringe when it's read in text and you don't hear me giggling as I say it – I'm kinda the sort of guy who's like, \"oh you cut off my arm? ha, you fool, now I have one less arm to worry about. I am more focused with one arm than you are with two\"\n↓\n1298908496369344512 [2020-08-27] @visakanv 💜 15\nis it *true* tho?? 🤔🤔🤔\n\nseems like it often doesn't matter if it's \"absolutely\" true, it mostly just needs to be \"true enough\"\n\nif you look enough like a maniac bc you believe it enough, most people won't fuck with you\n\nI suppose the challenge is when u encounter other maniacs\n↓\n1298909013329866753 [2020-08-27] @visakanv 💜 6 [(SEED) type=quote_of_root]\nwell then the person who wins – assuming its a head-to-head contest of some kind, which itself is hardly ever the best frame anyway – is the one who gets into the other's OODA loop\n\nhttps://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1298909228719988736 [2020-08-27] @visakanv 💜 6\nbut I honestly don't wanna fight, https://t.co/C3EPq422yj\n  [Quoting @visakanv: @matt_sven I honestly believe that deep down I want my enemies to be my friends]\n↓\n1298909696661757953 [2020-08-27] @visakanv 💜 10\n\"I can't believe this thread, visa is such a fucking idiot\"\n\naha, you fool, you have fallen into my trap. it is to my advantage that you underestimate me...\n↓\n1298909833266003968 [2020-08-27] @visakanv 💜 10\n\"o shit, damn. maybe visa is smart actually.\"\n\naha you fool, you have fallen into my trap. it is to my advantage that you think highly of me...\n↓\n1298912104225759233 [2020-08-27] @visakanv 💜 18\nme_irl https://t.co/nVdlr6aEzd\n  [Quoting @visakanv: @juliagalef Oglaf- Delusionist https://t.co/BqDBgZvfMk]\n\n===\n\n1318735005724545026 [2020-10-21] @visakanv 💜 22 🔁 1\nI encourage everyone to do this https://t.co/b7Gm1a8UhL\n  [Quoting Tweet 1318729141475176448 (missing)]\n↓\n1318735471405539329 [2020-10-21] @visakanv 💜 11\nbeen thinking a little bit all morning about the playful quality of the older internet (90s? 00s? pre-FB?), and how I miss it and would like to devote myself to keeping its spirit alive, hence: https://t.co/U4N0YGWKiW\n  [Quoting @visakanv: goofball mindset]\n↓\n1318736248253509633 [2020-10-21] @visakanv 💜 14\nat the same time I’ve been thinking - and maybe it’s the same thing - about how everything seems to be “discourse” now, there’s this creeping icky goop that seems to tile out more silly, esoteric forms of expression. Everything seems to be turned into takes for the take god\n↓\n1318736598620536832 [2020-10-21] @visakanv 💜 2\n(Btw how do I find articles or writing about the concept of “tiling out”? Am I imagining this? Googling gives me nothing but interior decoration. There’s this idea of like some Borg-like system of something overwhelming another, boring blandness go brrr...)\n↓\n1318739074656555008 [2020-10-21] @visakanv 💜 17\nI believe life should be *fun*, even amidst hardship &amp; despair. Even in war zones and hideous circumstances, people have always  tried to find a way to laugh. Not to dismiss or diminish the horror, but to *face* it. To reclaim your power. I know the line can be tricky, https://t.co/GLf4sRZTs3\nImages:\n  - [Image #0] The image depicts a still from the 1975 film \"Monty Python and the Holy Grail,\" showing two characters in a wooded area. The character on the left wears a white tunic and a white cap, while the character on the right is dressed in black with a red symbol on the chest and a white cap. The caption at the bottom of the image reads, \"I've had worse.\"\n↓\n1318740045747036163 [2020-10-21] @visakanv 💜 6\nCould do a whole separate thread about the perils of using humor as an unhealthy coping mechanism, typically to avoid responsibility, avoid facing reality, etc etc. \n\nBut I wanna focus on the bleakness of the *absence* of humor. I have always been v sensitive to this\n↓\n1318740476128677888 [2020-10-21] @visakanv 💜 10\nI probably can’t say it better than John Cleese did: https://t.co/EorRhhDk39\nImages:\n  - [Image #0] The image is a screenshot featuring a quote from John Cleese. The quote reads:\n    \n    \"Solemnity, I don't know what it's for. I mean, what is the point of it? The two most beautiful memorial services that I've ever attended both had a lot of humor. It somehow freed us all and made the services inspiring and cathartic. But solemnity, it serves pomposity. The self-important always know at some level of their consciousness that their egotism is going to be punctured by humor. That's why they see it as a threat. And so, dishonestly, they pretend that their deficiency makes their views more substantial.\"\n    \n    To recreate this image, follow these steps:\n    * Start with a white background.\n    * Add a large quotation mark at the top left.\n    * Include a small, rounded square photo of a man (presumably John Cleese) to the right of the quotation mark.\n    * Place the quote in a black serif font, spanning 13 lines, below the quotation mark and photo.\n    * Position the attribution \"John Cleese\" below the quote, also in black text.\n    \n    The overall design is simple, with a focus on presenting the quote prominently.\n↓\n1318740957408317440 [2020-10-21] @visakanv 💜 9\nOne way to think of humor is about playing with frames. The setup presents one frame, the punchline reveals another. The people with extremely rigid frames are usually intolerant of other people “puncturing their egotism”, as Cleese puts it. It’s a kind of fragility\n↓\n1318741822554828801 [2020-10-21] @visakanv 💜 10 🔁 1\nwhat would be funny? what would be exciting? what mischief can we get up to? I feel like these are very important questions to ask. I wish that the spirit of cheeky tricksters always be kept alive. when we take ourselves too seriously we get psychologically constipated\n↓\n1318742358347841536 [2020-10-21] @visakanv 💜 9\nindeed- if we ever get to a world where pompous solemnity has been eradicated, I promise to be the one to bring it back https://t.co/RL18FAEMCp\n↓\n1318742992690147328 [2020-10-21] @visakanv 💜 9 [(SEED) type=quote_of_root]\nme to solemn mofos: yall gotta lighten up jeez\n\nme to a bunch of incorrigible goofballs: yall gotta learn to be srs when it counts https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1323892392756342789 [2020-11-04] @visakanv 💜 95 🔁 6\nit’s been funny and interesting for me to witness people interpret “unlearning coercion” in much broader terms than I had in mind when I first started using it. \n\nIMO, if your self-coercion doesn’t feel like a hand around your throat, you probably don’t need to worry about it https://t.co/MqRa9nhKlr\nImages:\n  - [Image #0] The image depicts a comic book panel featuring Superman kneeling, with his head in his hands, and being towered over by a large, armored figure. \n    \n    The image contains the following text:\n    * \"powerful narcissist you, doing the hating\" (superimposed over the armored figure)\n    * \"poor little you, subjected to hate\" (superimposed over Superman)\n    * \"rest of society encouraging this fucked up dynamic\" (in the bottom-right corner)\n    \n    The accompanying tweet discusses the concept of \"unlearning coercion,\" with the author clarifying that they intend it to refer to situations where an individual feels a strong sense of self-coercion, likened to having \"a hand around your throat.\"\n↓\n1323892676777844743 [2020-11-04] @visakanv 💜 41 🔁 3\n“But what if I try to motivate myself with a little guilt and shame”\n\nDepends, does this process make you hate yourself and not want to live? If so, it might be worth dismantling! If you’re cool with it then you’re cool with it, enjoy yourself\n↓\n1323893574035886089 [2020-11-04] @visakanv 💜 27 🔁 1\n“But maybe I need to hate myself first so I can beat myself into building a life that’s worthy of love?”\n\nSounds suspicious to me, I wouldn’t recommend it- but if that’s what you want to do I’m not going to stop you! 😂 I’ll be here if/when you eventually tire of that approach 🤓\n↓\n1323893941586939904 [2020-11-04] @visakanv 💜 26 🔁 2\n“Ha, what if I hate myself SO WELL that I tyrannize myself into a joyous existence???”\n\nWell done I guess? Congrats! Lol\n↓\n1323895217703985152 [2020-11-04] @visakanv 💜 24 🔁 1\nIt might be useful to visualize this as a relationship between 2 people. have you ever seen a relationship and thought “wow that’s abusive”? that’s the thing I’m talking about undoing\n\nif they’re playfully ribbing each other, it could be out of love, or contempt, or even both\n↓\n1323895852444737542 [2020-11-04] @visakanv 💜 26\n“How do I tell if my relationship with myself is loving or contemptuous or both?”\n\nThat’s a very big and broad question and you can’t rly reduce it down to a couple of tells. You have to evaluate the entirety of the relationship. Nobody’s perfect but some are much more fucked up\n↓\n1323896157316157440 [2020-11-04] @visakanv 💜 30\nA good way to do it in my experience is to do copious amounts of journaling, and then evaluate the language later on to see how you talk about yourself to yourself. It’ll be like overhearing gossip. You can probably tell when someone is disdainful and resentful of another\n↓\n1323896848516435970 [2020-11-04] @visakanv 💜 20 [(SEED) type=quote_of_root]\nPS: everything is contextual. If you think the sun shines out of your ass then you’d need a different approach. But if that’s you then you wouldn’t listen to me anyway https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1624685140499914752 [2023-02-12] @visakanv 💜 7\nfollowup thread; put the gun down https://t.co/PCgXPgCGNl\n  [Quoting @visakanv: yelling at people is a horrible strategy for behaviour modification. this is true internally as well. it typically comes from a place of desperation and neediness and it almost always makes things worse rather than better https://t.co/6b2RXJdlYA]\n\n===\n\n1346458755169357825 [2021-01-05] @visakanv 💜 26 🔁 3\nme to all my friends tbh https://t.co/s9eBPUP39o\n  [Quoting @visakanv: @kaschuta I’d be curious to hear something more dreamy and aspirational from you]\n↓\n1346458879958208518 [2021-01-05] @visakanv 💜 10 [(SEED) type=quote_of_root]\nunless that's all you poast\n\nhttps://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1386437227887042567 [2021-04-25] @m_ashcroft 💜 1\nWhich way?\n↓\n1386437846920171521 [2021-04-25] @visakanv 💜 2 [(SEED) type=quote_of_root]\n@m_ashcroft yes https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1421009433333698566 [2021-07-30] @visakanv 💜 15 🔁 1\ncool thing abt me IMO is that I'm very accomodating, very willing to compromise and play the counter-melody, harmony, backup, etc\n\nso two of me would not actually result in \"two similar/equal visas\", but two very different visas who divide up all the tasks/labors interestingly https://t.co/Sv8elwQM19\n  [Quoting Tweet 1418462505760739333 (missing)]\n↓\n1421009755129057281 [2021-07-30] @visakanv 💜 7 [(SEED) type=quote_of_root]\nthis is how I am socially too – if someone new shows up and starts repeating all of my talking points, I would be happy to cede that ground to them and eagerly start seeking unexplored (for me) territory  \nhttps://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1421012040278179840 [2021-07-30] @visakanv 💜 6\ngood question and a clever way to ask \"what are you currently most conflicted about already\"\n\none visa would be like \"be more bold! be daring! be audacious! fuck it!\" and the other would be \"that's irresponsible. can we please be measured about this\"\n\nhttps://t.co/d7b4P1aokB\n  [Quoting Tweet 1421010586461220868 (missing)]\n\n===\n\n1424568100674965506 [2021-08-09] @visakanv 💜 67 🔁 3\nI generally don’t like thinking in terms of outcomes, but sometimes I meet people whose thinking is so divorced from outcomes that I’m like, aw fuck, you’re gonna make me talk about outcomes\n↓\n1424568390513954817 [2021-08-09] @visakanv 💜 18 [(SEED) type=quote_of_root]\nblind spots rule everything around me\n\nI think. I don’t know for sure, I can’t see them https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1424633314795823110 [2021-08-09] @SurenVynn  [(SEED) type=semantic_search]\nGoo for my prickly friends\nPrickles for my gooey friends\n\n===\n\n1437401916603047940 [2021-09-13] @TylerAlterman 💜 46\nWhen people say \"right brain\" they mean things like:• Intuition• Emotion• Imagination• Spontaneity• Poetryvs \"left brain\":• Analysis• Planning• SystematizingWe now know these terms are anatomically inaccurate, but I still use them. What are good replacements?\n↓\n1437414670403444736 [2021-09-13] @visakanv 💜 12 [(SEED) type=quote_of_root]\n@TylerAlterman https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1437423433038635008 [2021-09-13] @TylerAlterman 💜 2\n@visakanv hahaha\n\n===\n\n1437599027617361920 [2021-09-14] @AskYatharth 💜 4\ncanon https://t.co/44VpEX6Lb1\n  [Quoting Tweet 1437422354355789831 (missing)]\n↓\n1437599273256820740 [2021-09-14] @AskYatharth 💜 2 [(SEED) type=quote_of_root]\noh this is good too, as a serious, yet comprehensible replacement for left brain, right brain\n\nhttps://t.co/FTALQGpJxh\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1437599480803590145 [2021-09-14] @AskYatharth 💜 1\nfluffy brain, crunchy brain is now my official favourite, it was good while it lasted\n\nhttps://t.co/VyvZOgFcDs\n  [Quoting Tweet 1437420776106467331 (missing)]\n\n===\n\n1440731773109899272 [2021-09-22] @tasshinfogleman 💜 3\nprickly / prickliness is a word I've really enjoyed adding to my vocabulary https://t.co/Kt1d4xSFLh\n↓\n1440732119198691334 [2021-09-22] @HiredThought 💜 1 [(SEED) type=quote_of_root]\n@tasshinfogleman https://t.co/po2CmnL8wO\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1440732570317037568 [2021-09-22] @tasshinfogleman \n@HiredThought damn that's a good tweet, I do need some prickly people in my life\n↓\n1440732658502287370 [2021-09-22] @tasshinfogleman \n@HiredThought https://t.co/NgYvxEhVNj\n  [Quoting @tasshinfogleman: as much as i love good vibes it can be good to have some grumps on the tl]\n\n===\n\n1440926697776238593 [2021-09-23] @visakanv 💜 98 🔁 7\npeople put in a tremendous amount of work to remain exactly where they are, and they even collaborate, coordinate and conspire to reinforce this https://t.co/WyN5s9TPZR\n  [Quoting @visakanv: if you ever think someone isn’t creative you should look at their excuses]\n↓\n1440927063788060675 [2021-09-23] @visakanv 💜 43\nif you think you want to make more money, be more successful, be more powerful, etc etc, the primary bottleneck is almost never the amount of effort you are expending in general, but rather, almost always the social and psychological guardrails holding you in place\n↓\n1440928592653733896 [2021-09-23] @visakanv 💜 31 🔁 2\npeople coordinate to misdiagnose their problems together + validate each other’s misdiagnoses. \n\nthis is a lot of what the polite fiction of socialising is. I almost wanna go so far as to say “society is when we validate each other’s bullshit” https://t.co/jZuQSJ7uFW\n  [Quoting @visakanv: Thank you Mario! But the root of our problem is in another castle!]\n↓\n1440929152295600134 [2021-09-23] @visakanv 💜 34 🔁 2\nevery so often a handful of people come together and say, “hey what if we didn’t do that?”\n\nthese people, if they play their cards right, then collectively appear superhuman, achieve tremendous feats together\n\nit’s not superhuman\n\nit’s human\n\neveryone else lives suppressed https://t.co/L80NrZTczH\n  [Quoting @visakanv: a flourishing scene is a context where people unblock each other at a tremendous rate https://t.co/cQkJ0Xfgcn]\n↓\n1440930162757947394 [2021-09-23] @visakanv 💜 40 🔁 2 [(SEED) type=quote_of_root]\nbeing EITHER agreeable OR disagreeable limits your development, limits what you can learn, what you can know, what you can do\n\nall the magic happens in the yin/yang collision of the two. productive, prolific, honest disagreements conducted fairly and sustainably…ish https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1440930994467442688 [2021-09-23] @visakanv 💜 19\nif you start investigating you’ll see this pattern everywhere. it’s been driving me mad lately. we *have* the knowledge. we can learn from our predecessors. they left us all the clues we need to recreate their magic\n\nit’s not actually magic https://t.co/pSo4jCyDUk\n  [Quoting @visakanv: “After long arguments we often found ourselves in the ludicrous position of each having been converted to the other’s side.” – Orville Wright  “I like scrapping with Orv. He's such a good scrapper.” – Wilbur Wright https://t.co/hdvCYleHY6]\n↓\n1440931148335509512 [2021-09-23] @visakanv 💜 9\nhttps://t.co/lpnhXxhDUc\n  [Quoting @visakanv: 🤔 magic is curiosity + attentiveness +  persistence + willingness to revise and re-evaluate everything 🤔]\n↓\n1440931724133683200 [2021-09-23] @visakanv 💜 12\nif you only knew how powerful we can and will become, together!! 🔥🔥🔥 https://t.co/GB7tvCuaa7\n  [Quoting @visakanv: [pounds table] learning, *true* learning, is the most radical punk-ass shit. School wants you to be a pocket lighter - a small, predictable flame that does what it’s told &amp; doesn’t ask too many questions. I want y’all to be f***in’ firestorms. Ignite the eons with your curiosity https://t.co/vNe5qVWnv4]\n↓\n1440932051373342725 [2021-09-23] @visakanv 💜 8\nhttps://t.co/3zzP4IhmGZ https://t.co/RhTDvvVIdA\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1440933292287557636 [2021-09-23] @visakanv 💜 21 🔁 8\n🌍 🌌 https://t.co/cqyeeAbkCB\nImages:\n  - [Image #0] The image is a meme featuring a quote from Edgar Mitchell, an Apollo 14 astronaut, superimposed over a photograph of the Earth from space.\n    \n    * The quote is written in white text and reads: \n      * \"You develop an instant global consciousness, a people orientation, an intense dissatisfaction with the state of the world, and a compulsion to do something about it. From out there on the moon, international politics look so petty. You want to grab a politician by the scruff of the neck and drag him a quarter of a million miles out and say, 'Look at that, you son of a bitch.'\"\n      * \"- Edgar Mitchell, Apollo 14 astronaut\"\n    \n    * The background of the image is a photograph of the Earth from space, taken from the surface of the Moon.\n      * The Earth is depicted as a blue and white marble suspended in blackness, with the lunar surface visible in the foreground.\n      * The image conveys a sense of vastness and perspective, highlighting the fragility and beauty of our planet.\n    \n    The overall effect of the meme is to emphasize the profound impact that seeing the Earth from space can have on one's perspective, and to express frustration with the state of global politics.\n\n===\n\n1448264002744717317 [2021-10-13] @visakanv 💜 19\nthere’s an interesting Scylla 🐉 and Charybdis 🌀 pincer re: media volume \n\n(Thinking about this while watching an aesthetically pleasant YouTube video that takes a tediously long time to give a superficial answer to its question)\n↓\n1448264373823102977 [2021-10-13] @visakanv 💜 18\nthe densest vids are typically not pretty\n\nthe prettiest vids are typically not dense\n\nanybody who manages to synthesize the two is disproportionately rewarded https://t.co/btJH2Os4QJ\n  [Quoting @visakanv: Most men with ambition have no taste and most men with taste have no ambition]\n↓\n1448265792202571776 [2021-10-13] @visakanv 💜 13 [(SEED) type=quote_of_root]\nmy attractive friends think of me as the nerdy one\n\nmy nerdy friends think of me as the attractive one\n\nI am always trying to synthesize everything \n\n(if you ask me I think I’m a nerd who’s trying to be pretty than the other way around, but it obvs depends on your frame of ref) https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1448267010920443907 [2021-10-13] @visakanv 💜 4\nno but anyway like\n\nThere’s a 2x2 maybe\n\nrambling and insightful\ncondensed and meaningless\ndense and elegant (💎)\nIncoherent noise\n\nI’m not sure what the right words are to use, so this is rambling, and I’d like to believe there’s something useful here, hence it’s worth parsing\n↓\n1448267361815961602 [2021-10-13] @visakanv 💜 13\nthere’s some parallels to the precision/accuracy 2x2. The YouTube vid I just watched was beautifully precise aesthetically, but some ways off from anything actually interesting https://t.co/VrpzMvvEUj\nImages:\n  - [Image #0] The image presents a diagram illustrating the concepts of accuracy and precision, featuring four target diagrams with varying levels of accuracy and precision.\n    \n    *   The top-left target:\n        *   Labeled as \"Low accuracy\" and \"Low precision\"\n        *   Displays five black dots scattered randomly across the target, with none hitting the center\n        *   Indicates a lack of both accuracy and precision\n    *   The top-right target:\n        *   Labeled as \"Low accuracy\" and \"High precision\"\n        *   Shows five black dots clustered together in the upper-right corner of the target, away from the center\n        *   Demonstrates high precision but low accuracy\n    *   The bottom-left target:\n        *   Labeled as \"High accuracy\" and \"Low precision\"\n        *   Features five black dots spread out around the center of the target, with some hitting the center and others not\n        *   Illustrates high accuracy but low precision\n    *   The bottom-right target:\n        *   Labeled as \"High accuracy\" and \"High precision\"\n        *   Displays five black dots tightly clustered around the center of the target\n        *   Represents both high accuracy and high precision\n    \n    In summary, the diagram effectively visualizes the differences between accuracy and precision, providing a clear understanding of these important concepts.\n↓\n1448268067792777221 [2021-10-13] @visakanv 💜 15\nmy favorite conversationalists are the ones who choose to be deliberately sketchy with their vocabulary and grammar to help you see that their ideas are sketchy too, and that you’re invited to come tinker and mess around. this is an alternative to tweeting fortune cookies\n\n===\n\n1454719632850391044 [2021-10-31] @visakanv 💜 196 🔁 11\nI spent like the first decade of my intellectual life arguing with smart people that they could be more earnest, and it took me a lot of wasted effort to realize that it’s much more effective to teach earnest people to be more thoughtful and strategic \n\nyou can’t teach hunger\n↓\n1454720193351938050 [2021-10-31] @visakanv 💜 39\nalthough funnily enough you then do find that there’s a substantial % of earnest people who are very averse to any kind of strategic thinking\n↓\n1454720394473078787 [2021-10-31] @visakanv 💜 16 [(SEED) type=quote_of_root]\nmy whole life: https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1457378330018205696 [2021-11-07] @visakanv 💜 37 🔁 1\nhttps://t.co/qhWFXnX9v0 https://t.co/PMuyut3OQb\n  [Quoting @visakanv: There’s a spectrum from obvious cliché to incomprehensible gibberish and all the magic is in the turbulent sweet spot in the middle]\nImages:\n  - [Image #0] The image is a meme that parodies the classic painting \"Scylla\" by Howard Pyle, with overlaid text. The painting depicts a sea monster, Scylla, attacking a ship in the water.\n    \n    To recreate this meme, the following steps can be taken:\n    \n    * Start with the original painting \"Scylla\" by Howard Pyle, which features a sea monster with multiple heads and a long, serpentine body.\n    * Overlay three text boxes with white text on black backgrounds onto the image.\n    * The first text box should be placed near the swirling water on the left side of the image, containing the text \"incomprehensible gibberish\".\n    * The second text box should be positioned near the head of the sea monster, containing the text \"obvious cliches\".\n    * The third text box should be placed near the ship being attacked, containing the text \"ayy lmao\".\n    \n    The resulting meme humorously comments on the contrast between the complex, confusing elements of a story or situation (\"incomprehensible gibberish\") and the more obvious, overused tropes or cliches (\"obvious cliches\"), with the reaction \"ayy lmao\" indicating amusement or sarcasm.\n↓\n1457378898635747342 [2021-11-07] @visakanv 💜 6 [(SEED) type=quote_of_root]\nhttps://t.co/Bym36sOY0O https://t.co/cWipriEHmy\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\nImages:\n  - [Image #0] The image is a meme featuring a depiction of the sea monster Scylla from Homer's Odyssey, with a ship passing by. The scene is set against a rocky coastline with a swirling whirlpool in the water.\n    \n    *   The image is a painting of a sea monster, Scylla, attacking a ship.\n        *   Scylla is depicted as a multi-headed sea serpent with red heads and necks, and a yellow body.\n        *   The ship is small and appears to be under attack by Scylla.\n        *   The background of the image features rocky cliffs and a yellow sky.\n    *   The image has been edited to include text labels.\n        *   The text labels are in white font on black rectangles.\n        *   The labels read \"goo\", \"ayy lmao\", and \"prickles\".\n        *   The labels appear to be referencing the sea monster and its attack on the ship.\n    *   The overall effect of the image is humorous and playful.\n        *   The use of informal language and internet slang (\"ayy lmao\") adds to the lighthearted tone.\n        *   The image appears to be poking fun at the idea of a sea monster being intimidating or threatening.\n↓\n1457381856773427202 [2021-11-07] @visakanv 💜 3\nOG https://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n\n===\n\n1460134320916484098 [2021-11-15] @visakanv 💜 25\nI continue to bang the drum and die on the hill that those people are then by definition not the most ambitious https://t.co/C5IQ8q26df\n  [Quoting Tweet 1460047743531962370 (missing)]\n↓\n1460134855719538694 [2021-11-15] @visakanv 💜 7\nbut ok words are negotiable and I’m happy to work around this – maybe I would say their ambition is devoid of taste, which then makes it tacky and brittle https://t.co/btJH2Os4QJ\n  [Quoting @visakanv: Most men with ambition have no taste and most men with taste have no ambition]\n↓\n1460135161517858818 [2021-11-15] @visakanv 💜 5 [(SEED) type=quote_of_root]\nget more people to see the value of the other side of the coin challenge https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1487037556235505672 [2022-01-28] @visakanv 💜 116 🔁 3\nthe people who advocate for toughness and the people who advocate for tenderness are both correct\n↓\n1487038094079528960 [2022-01-28] @visakanv 💜 36 🔁 2 [(SEED) type=quote_of_root]\nhttps://t.co/Bym36sOY0O https://t.co/g8EqouGWLG\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\nImages:\n  - [Image #0] The image is a meme that depicts a classic painting of a sea monster attacking a ship, with the text \"cloying, abject tenderness,\" \"brittle, rigid toughness,\" and \"ayy lmao\" superimposed over it.\n    \n    * The painting shows a large, multi-headed sea serpent emerging from the rocky shoreline on the right side of the image.\n    \t+ The serpent has five heads, each with sharp teeth and a menacing expression.\n    \t+ The heads are colored red, orange, and yellow, with green scales on the neck.\n    \t+ The serpent is attacking a small sailing ship in the water below.\n    * The ship is being pulled towards the serpent's mouth by one of its heads.\n    \t+ The ship has a dark blue hull with gold trim and a tall mast.\n    \t+ The sails are not visible, suggesting that the ship is not under sail.\n    * The background of the image features a rocky coastline with steep cliffs and jagged rocks.\n    \t+ The sky is yellow, suggesting a sunset or sunrise.\n    \t+ The water is choppy and white-capped, with a large whirlpool forming around the ship.\n    * The text \"cloying, abject tenderness\" is written across the whirlpool.\n    \t+ The text is in white font on a black background.\n    \t+ It appears to be describing the ship's situation.\n    * The text \"brittle, rigid toughness\" is written across the serpent's body.\n    \t+ The text is also in white font on a black background.\n    \t+ It appears to be describing the serpent's characteristics.\n    * The text \"ayy lmao\" is written across the ship.\n    \t+ The text is in white font on a black background.\n    \t+ It appears to be a humorous or ironic comment on the situation.\n    \n    Overall, the image is a humorous take on the classic painting, using the text to add a layer of irony and wordplay to the scene.\n├── 1487038562881048577 [2022-01-28] @sharanvkaur 💜 5\n│   @visakanv how many of these do you have. are they in a folder? do you make and discard? i have questions\n│   ↓\n│   1487039612740456455 [2022-01-28] @visakanv 💜 2\n│   @sharanvkaur I just have the base image on my desktop and I create a new one each time, take a screenshot and delete https://t.co/aLuwrp8kvI\n│   Images:\n│     - [Image #0] The image is a screenshot of a computer desktop, showing a collection of folders and a single image file. \n│       \n│       The image shows 6 blue folders labeled \"pdfs\", \"ebooks\", \"2020feb1-archives\", \"youtube\", \"pics\", and \"consulting\". There is also a green folder labeled \"newfolder\". The image file is titled \"PayneWhirlpool-G-1.jpg\". The background of the image is a gradient that transitions from dark blue at the top to light pink at the bottom.\n│   ↓\n│   1487040136835592200 [2022-01-28] @sharanvkaur 💜 3\n│   @visakanv but why. if i want to compile them all, i have to manually search your twitter? why visa why?\n│   ↓\n│   1487041429582925828 [2022-01-28] @visakanv 💜 2\n│   @sharanvkaur well it will be a labor of love and you will find lots of fun things along the way...\n│   ↓\n│   1487041701633871873 [2022-01-28] @sharanvkaur 💜 5\n│   @visakanv https://t.co/IsfydNfM7p\n│   Images:\n│     - [Image #0] The image depicts a still from the movie \"Brave\" featuring Merida sitting at a wooden table, resting her head on the table with her eyes closed and mouth open as if she is laughing or screaming. She has long, curly red hair, is wearing a green dress with white fur cuffs, and is holding a knife in her right hand.\n└── 1487038989425016841 [2022-01-28] @visakanv 💜 37 🔁 5\n    let there be toughness in your tenderness\n    let there be tenderness in your toughness https://t.co/gRbx7G1Jkc\n    Images:\n      - [Image #0] The image depicts a black and white yin-yang symbol, which is a representation of the harmony and interconnection of opposites. The symbol is a circle divided into two halves, one black and one white, with a small circle of the opposite color within each half.\n\n===\n\n1493980341576548352 [2022-02-16] @nosilverv 💜 3 [(SEED) type=semantic_search]\n@kevinsimler prickles and goo is just kiki and bouba hahah\n\nhttps://t.co/qOopG3nojh\n\n===\n\n1501908459553316868 [2022-03-10] @visakanv 💜 501 🔁 64\neach person is on a different trajectory \n\nsometimes, for some period of time, a group of people find themselves in the same vicinity. they feel like peers. they have shared challenges, can relate to each other\n\nbut it doesn’t last. eventually they diverge https://t.co/d7sZrvAG6f\nImages:\n  - [Image #0] The image shows a simple diagram drawn on a white surface, likely a whiteboard or a piece of paper. The diagram consists of a circle with eight lines radiating from it, resembling the spokes of a wheel.\n    \n    To recreate this diagram, follow these steps:\n    \n    1. Draw a circle in the center of the surface.\n    2. Draw eight lines extending from the circle, spaced evenly apart.\n    3. Ensure the lines are straight and radiate outward from the center of the circle.\n    \n    The diagram is drawn in black ink or marker, and the background is a plain white surface. The overall effect is a simple yet striking visual representation of divergence or radiation.\n↓\n1501982230050131969 [2022-03-10] @nat_sharpe_ 💜 10\n@visakanv https://t.co/U7W8XQx2yA\n  [Quoting @nat_sharpe_: Most of my friends are either nerds becoming hippies or hippies becoming nerds. Which is wonderful because somehow I'm doing both]\n↓\n1501982439480037383 [2022-03-10] @visakanv 💜 10 [(SEED) type=quote_of_root]\n@nat_sharpe_ ❤️ https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1502175743563862016 [2022-03-11] @RichDecibels 💜 21\n@visakanv I think you've been saying something to the effect that there's a risk this scene will underestimate its own power... can you say more?\n↓\n1502177239940485127 [2022-03-11] @visakanv 💜 20 💬 1\n@RichDecibels buncha nerds are used to feeling downtrodden, disenfranchised, etc and aren’t typically prepared to have power, which comes with responsibility, and has consequences for other people https://t.co/ARFu68WKO9\n  [Quoting @visakanv: 30. Webcomics  \"We were all stupid and young, just learning to be people.\"  \"We were a bunch of nerds feeling power for the first time.\"   Featuring Randall (XKCD), Jeph (QC), Zach (SMBC) and others  (h/t @prateekxarora)   https://t.co/n89QopoPfK]\n↓\n1502177866900860930 [2022-03-11] @visakanv 💜 19\n@RichDecibels this is the problem in all sorts of domains. it explains a bunch of fucked up Hollywood and showbiz bullshit too, and basically anywhere where a bunch of people who have chips on their shoulders, unprocessed trauma, etc end up having power over a bunch of new kids. Web3 for sure\n↓\n1502179748784578560 [2022-03-11] @RichDecibels 💜 5\n@visakanv do you have a hunch about likely bad outcomes in this specific case of the awakening twitter friend scene?\n↓\n1502181114017767427 [2022-03-11] @visakanv 💜 16\n@RichDecibels it’s the same as in every other scene\n\nsome people don’t know how to handle the attention\n\nsome people are predatory\n\npeople aren’t very good at managing public spats and conflicts in an artful way, so when those happens it’s polarising and people leave\n↓\n1502182378390933505 [2022-03-11] @RichDecibels 💜 4\n@visakanv makes me want to build on some explicit governance (sorry)\n↓\n1502185003916087296 [2022-03-11] @RichDecibels 💜 5\n@visakanv boundaries come in real handy when you need to make a clear example of what behaviours are excluded\n↓\n1502187945146687493 [2022-03-11] @RichDecibels 💜 4\n@visakanv I'm wondering, what if your aversion to explicit org structures is symptomatic of some unprocessed trauma\n\nthen I'm thinking the shape of this question is a recipe for paranoia\n↓\n1502189878188011520 [2022-03-11] @visakanv 💜 2\n@RichDecibels I live in a country that is fairly often described as an authoritarian state, I had to go to school and serve in the military (school was worse) against my will, I’m pretty familiar with the origins of my aversion 🤗\n↓\n1502190920501968896 [2022-03-11] @RichDecibels 💜 2\n@visakanv different flavour obvs but I also grew up in a kinda authoritarian community and my reaction has been to mostly reconstruct it after I left. humans are wild\n\nI guess we don't need to be individually purified of trauma but just to balance each other out\n↓\n1502191387978002437 [2022-03-11] @visakanv 💜 4 [(SEED) type=quote_of_root]\n@RichDecibels I get perceived differently by different people. Some people consider me the most structured, focused, rigorous, explicit person they know. How I talk tends to be a function of the context I’m operating in https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1503053792752795648 [2022-03-13] @visakanv 💜 101 🔁 2\nobsessing about seeking power, thinking you'll only be happy if you have more power, being needy and desperate about it, is not good\n\nbut bending over backwards to renounce power, and to make a big show of how power *itself* is \"intrinsically bad\", is also not good\n↓\n1503054109292650496 [2022-03-13] @visakanv 💜 51 🔁 2\nwhat's good then? being honest with yourself about the amount of power you do actually have, and striving to use it to the best of your ability to achieve the best possible results you can, for yourself, for those around you, and if you like: for society, for God, for posterity\n↓\n1503054527334797312 [2022-03-13] @visakanv 💜 28 🔁 1\nmost people are so swept up one way or another, repressed, intoxicated, obsessed, resentful, etc, that any person who is able to think calmly and act honestly, will find their power levels rising almost naturally as a consequence of moving gently-yet-resolutely through the world\n↓\n1503055306439335942 [2022-03-13] @visakanv 💜 11\nover the last decade or two, (some would say the last half century or longer, idk), we hear a lot about the problem of excess – mankind is too hard, too tyrannical, too sadistic, too manipulative, too addicted \n\nhttps://t.co/Q7GRKX8vih\n  [Quoting @visakanv: the thing I really like about the KWML archetypes is how they break it down into the failure modes. Too much yin or too much yang, too soft or too hard, too needy or too detached https://t.co/nXIMqdzJt6]\n↓\n1503055577903087616 [2022-03-13] @visakanv 💜 24\nbut the opposite problems are also problems! one can be too soft, too weak, too masochistic, too depressed, too much in denial. and interestingly both of these polar opposites tend to oscillate. the tyrant and the weakling are the same person, oscillating\nhttps://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1503056232503906306 [2022-03-13] @visakanv 💜 17 [(SEED) type=quote_of_root]\nsome people need to be more gentle, some people need to be more resolute. some need more yin, some need more yang. if you're honest with yourself, you know what you need.  ppl often know. a lot of the yelling &amp; arguing in the commons is a distraction  https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1503090417159475200 [2022-03-13] @s0ulDirect0r 💜 5\n@visakanv need like, a solid 50 lbs of yang tbh, i went deeeeeep yin from like 28-32 and i get the need for balance now.\n↓\n1503093952781512706 [2022-03-13] @QiaochuYuan 💜 1\n@s0ulDirect0r @visakanv ooh follow @OperationMoksha, he has one of the best yin / yang balances of anyone i know, leaning yang for fun\n\n===\n\n1505674131471224835 [2022-03-20] @visakanv 💜 52 🔁 2\na truly hideous oversimplification that makes an almost surprising at-least-narratively-compelling amount of sense is \"who fucked you up more, your mom or your dad?\" and then extrapolating from that to things like liberal/conservative, woke/antiwoke schisms, kiki/bouba and so on\n↓\n1505674459319238663 [2022-03-20] @visakanv 💜 26 🔁 1\nshitty conservative auth-tyrant dad will turn u lib, shitty lib chaos-narc mom will turn u conservative\n\nreality is of course infinitely more complex but sticky narratives be sticky init\n↓\n1505674979144531968 [2022-03-20] @visakanv 💜 12\nto add more funsies, lotsa ppl do often re-play out their parental bond drama with their partner/spouse\n↓\n1505675456263364610 [2022-03-20] @visakanv 💜 11\ni don't actually know how I would personally answer this question for myself off the top of my head\n\nI think i'm very 50/50 between my parents and I'm also v 50/50 in terms of masculine/feminine \"energy balance\"\n\nsounds like a copout but it really feels true for me idk\n↓\n1505675619736367106 [2022-03-20] @visakanv 💜 7 [(SEED) type=quote_of_root]\nI mean yea, always-been.jpg\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1505676133848989697 [2022-03-20] @visakanv 💜 12\nso i've always been like the annoying centrist who's like \"both sides make good points, both sides have legitimate grievances, and both sides need to do better\", which does also get you booed from both sides https://t.co/5kmWu48UB4\n  [Quoting @visakanv: @QiaochuYuan @Klockwerklime @bahstgwamt @AdmiralOPG @chaosprime @vinayaki_ @nuanceexists @selentelechia world: hi, welcome to the world. you have to pick a tribe  me: I choose everyone   world: then you just offend and upset everybody  me: [tearfully] I choose everyone]\n↓\n1505676560330010626 [2022-03-20] @visakanv 💜 10\nI guess if you circle back to the start and you try and add some nuance it might be like\n\nhave u been more fucked up by unhealthy order or unhealthy chaos\n\nand the general assumption that holds more than 50% of the time in mainstream contexts is the yin/yang resonance dynamic\n↓\n1505676744518696960 [2022-03-20] @visakanv 💜 8\nand yeaaa maybe ur mom was the strict disciplinarian and your dad was a chaotic feminine serpent from the underworld idk dont @ me\n↓\n1505677865228312577 [2022-03-20] @visakanv 💜 6\nthinking on this more like, funnily enough, broadly I think this whole framework is less than useless for thinking about a lot of my close friends, because we are all weirdos and misfits along orthogonal dimensions. but it vaguely tracks for a bunch of our family members\n↓\n1505678101665423361 [2022-03-20] @visakanv 💜 8\nor, of course, all of this is absolutely wishful thinking, hoping to find some kind of story where there is none\n\nbut the thing about human affairs is, if the stories are sticky enough, you can predict that other people will also be misled along the same paths\n↓\n1505679149419347969 [2022-03-20] @visakanv 💜 15 🔁 1 💬 1\nwhat is humanity but anxious packs of monke living life in accordance with sticky misleading stories vaguely sorta agreed upon\n↓\n1505679478013726722 [2022-03-20] @visakanv 💜 7 🔁 1\n🖐🏾\nhttps://t.co/hcN6mogN1k\n  [Quoting @visakanv: @primalpoly cave paintings in Sulawesi, Indonesia  they're about 40,000 years old https://t.co/QFyYvqoEdf]\n\n===\n\n1507424655753195524 [2022-03-25] @AskYatharth 💜 4\nive begun to hate thinking of problems as purely “emotional” problems\n\nthere’s always often an element of just gitting gud at the thing\n↓\n1507424849823629312 [2022-03-25] @AskYatharth 💜 2\nthe “fear” of public speaking is a block\n\nbut also legitimately there is an element of just getting good at it that exposes you to different consequences\n\nreplace {public speaking} with X\n↓\n1507427385225871360 [2022-03-25] @AskYatharth \nthis is coming from a culture &amp; space where the default framing is to consider, “oh, what are the emotions here”\n\n(as if you could solve everything in emotional space)\n\nhttps://t.co/G1N2268wXf\n  [Quoting @AskYatharth: @CurziRose and @webdevMason and many others have pointed out this strange assumption rats seem to have that infinite introspection can somehow make you infinitely malleable https://t.co/jhkZq7FOjS]\n↓\n1507427386773553155 [2022-03-25] @AskYatharth  [(SEED) type=quote_of_root]\nhence going back to the gitting gud thing\n\nwhereas if someone is coming from the mainstream (?), the thing that will fuck over is not realizing their emotions are real and a thing and so so important\n\nin both doing things and being happy\n\nhttps://t.co/SJzZ50eb8D\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1507427388073734145 [2022-03-25] @AskYatharth \nthey won’t be touching, Focusing on the feelings blocking them\n\nthose feelings are an orientation to what might need to be done next\n↓\n1507427388879081472 [2022-03-25] @AskYatharth \njust like you can’t solve all problems by just sitting and thinking, you can’t necessarily solve the problem in feeling space\n\nonly unblock the next thing\n\nhttps://t.co/jotMfrqXcg\n  [Quoting @AskYatharth: freezing things is isolation. introspection is isolation. it can help, to slow and examine things. it can also freeze things, making them invisible to see and increasingly unhinged  the feelings are being blocked from participating in action  https://t.co/0FP3e2KT3q]\n\n===\n\n1509660302610157572 [2022-03-31] @__drewface 💜 13 🔁 1\ni request more open childish naiveté from tech + rats\n\neveryone is signaling that they \"get it\": what's important, why, how, when\n\nthis is cool. but equal and oppositely cool is understanding nothing, wondering about everything\n\nit is a joy to be wide eyed in a world of wonder\n↓\n1509666022680322049 [2022-03-31] @__drewface 💜 4\n@vgr clearly gets it. Look at this description of his book! I couldn't help but laugh, it was a joy to read his self-effacing description. https://t.co/1oDhzf789c\nImages:\n  - [Image #0] The image displays a passage of text that appears to be a book description. The transcribed text is as follows:\n    \n    \"significance. Drawing on the lessons of his own life and the philosophies of Douglas Adams and James Carse among others, he attempts to construct a playbook for a life full of enriching experiences, satisfying accomplishments, and deep relationships. After a dozen long, meandering essays, he entirely fails to get to anywhere even remotely useful, and crashes gracelessly to the edge of the void, where he discovers the void giving him the stink eye. Originally published on ribbonfarm.com between 2014, when Rao turned 40, and 2016, when he turned 42 (a significant threshold in his religion), having learned nothing in the interim, these essays provide a poignant and vivid illustration of the art of entering middle age with all your indignity, incomprehension, and cluelessness intact.\"\n    \n    To reproduce this image, one would need to create a white background with a black text box containing the given text, and apply a black strip pattern over parts of the text.\n  - [Image #1] The image shows a text passage on a white background. The text is written in white against a series of black rectangles. Here is the transcription of the text in the image:\n    \n    \"significance. Drawing on the lessons of his own life and the philosophies of Douglas Adams and James Carse among others, he attempts to construct a playbook for a life full of enriching experiences, satisfying accomplishments, and deep relationships. After a dozen long, meandering essays, he entirely fails to get to anywhere even remotely useful, and crashes gracelessly to the edge of the void, where he discovers the void giving him the stink eye. Originally published on ribbonfarm.com between 2014, when Rao turned 40, and 2016, when he turned 42 (a significant threshold in his religion), having learned nothing in the interim, these essays provide a poignant and vivid illustration of the art of entering middle age with all your indignity, incomprehension, and cluelessness intact.\"\n↓\n1509667134170935299 [2022-03-31] @__drewface 💜 6\nThis might cut deep into the core of the rat v postrat holy war\n\n\"when the mask wins, you are treated like a person, but don't feel like one. When the daemon wins, you feel like a person, but are treated as less.\"\n\nmask = smart, logical, right\ndaemon = naive, irrational, weird https://t.co/d44bf31a1W\nImages:\n  - [Image #0] The image displays a passage of text discussing the concepts of \"mask\" and \"daemon\" and their relationship to personal identity and self-actualization. The text is transcribed as follows:\n    \n    \"When the mask wins, you are treated like a person, but don't feel like one (what I called gollumization is a special extreme case). When the daemon wins, you feel like a person but are treated as less than one by others.\n    \n    Either zero-sum outcome is the beginning of the end. The only way out is to integrate the mask and the daemon in a non-zero-sum way. This is self-actualization and it takes imagination.\"\n    \n    The text is highlighted in yellow, with the words \"gollumization\" and \"treated as less than one\" underlined in blue.\n  - [Image #1] The image displays a text passage discussing the concepts of \"mask\" and \"daemon\" in relation to personal identity and treatment by others. The text is presented in black font on a white background, with certain phrases highlighted in yellow.\n    \n    The text reads:\n    \n    \"When the mask wins, you are treated like a person, but don’t feel like one (what I called gollumization is a special extreme case). When the daemon wins, you feel like a person but are treated as less than one by others.\n    \n    Either zero-sum outcome is the beginning of the end. The only way out is to integrate the mask and the daemon in a non-zero-sum way. This is self-actualization and it takes imagination.\"\n    \n    The highlighted phrases include:\n    \n    * \"gollumization\" (in blue hyperlink text)\n    * \"treated as less than one by others\" \n    * \"Either zero sum outcome is the beginning of the end\"\n    * \"The only way out is to integrate the mask and the daemon in a non-zero-sum way\"\n    * \"This is self-actualization and it takes imagination\"\n↓\n1509669304299663367 [2022-03-31] @__drewface 💜 5 [(SEED) type=quote_of_root]\nnot to be hypocritical\n\nof course, I also request more rigor and ambition from the hippies + postrats\n\nOP was really a self-critique. i'd like to be more openly naive and wondering atm\n\nhttps://t.co/SSAXMwOI6U\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1509670750197796875 [2022-03-31] @__drewface 💜 7\ni guess a big part of what I'm trying to say is ACTING naive does not actually take your skill away\n\na wise monk can enjoying acting the fool all the more because, inside, she knows she is not\n\nIf you're competent, enjoy acting naive, you can take off the competence mask for fun\n↓\n1509672268670156813 [2022-03-31] @__drewface 💜 5\nwhy do we drink alcohol? it makes us dumb, naive, incompetent. but \"acting drunk\" produces a similar effect\n\nperhaps \"social lubricant\" really means \"an excuse to drop my competence mask\" in intellectual circles\n\nwhen in good company, consider losing the mask without imbibing\n\n===\n\n1515232727116939266 [2022-04-16] @visakanv 💜 176 🔁 13\ni dont feel like anybody ever talked to me about filters and boundaries in the way that i'd have liked to hear about them\n\nyou need quite a lot of info about the world to actually begin to use them in an appropriate &amp; effective way\n\ni wonder if people dont like admitting this\n↓\n1515232984760487940 [2022-04-16] @visakanv 💜 69\nwe often hear simplistic-ish directives like \"ignore the haters\" or \"don't be an asshole\" but both of these are actually very, very complicated things in practice!\n↓\n1515233304995561479 [2022-04-16] @visakanv 💜 96 🔁 1\nignore the haters: ok, how do you make sure you don't overcorrect and accidentally ignore good, necessary criticism from people who care about you?\n\ndon't be an asshole: ok, how do you make sure you don't overcorrect and accidentally let yourself be exploited by bad-faith actors?\n↓\n1515233917238153218 [2022-04-16] @visakanv 💜 71\nthe only real answer to this, as far as I can tell, is\n\n1. hope you had good placement in the birth lottery, lol\n\n2. grow wise over time through painful experiences, mistakes, failures, study, reflection\n\nit makes complete sense to be anxious as fuck while you're figuring it out\n↓\n1515234771961802753 [2022-04-16] @visakanv 💜 59 [(SEED) type=quote_of_root]\nseems a lot of people roughly default to a certain posture in the world (open/closed, etc), and they sorta accept the tradeoffs that come with it. the wild thing is they might not even realize that they're doing this, or that they have a choice at all\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1515235316902543365 [2022-04-16] @visakanv 💜 49 🔁 1\nwhen i look back on my teens and early 20s, i see that I \"wasted\" many, MAAAANY hours talking with people in conversations that, I can now see in retrospect, were 98% doomed to fail from the start. but it took that raw experience for me to have any genuine knowledge about it\n↓\n1515235692426960901 [2022-04-16] @visakanv 💜 37\nalso part of wisdom is realizing that you can still be surprised even when you do everything correctly. sometimes the expert player who does everything right gets steamrollered by the random newbie who got ridiculously lucky. so there's no point ever being smug about anything\n↓\n1515236020933267458 [2022-04-16] @visakanv 💜 44\nin retrospect I don't consider those hours \"wasted\", because I now see that they made me wise. and here by wisdom I mean, they gave me the interior understanding from experience, a felt sensitivity to the kind of frames people are operating with, the assumptions they tend to have\n↓\n1515236197639270402 [2022-04-16] @visakanv 💜 38 🔁 1\nand even then like, the most critical thing at the heart of it is to restate that i have no idea wtf i'm talking about. because the moment you're like \"oh yea, this is just like that, so it will definitely happen exactly the same way\" is exactly the moment you get killshot'd\n↓\n1515236717170946054 [2022-04-16] @visakanv 💜 53 💬 1\ni feel like all of this parallels with the phenomenon of imposter syndrome\n\nyou cannot solve either of these problems inside your own head, by simply thinking harder or smarter or whatever\n\nbecause the problem is not inside your head, not exactly. it's in-between you &amp; the world\n↓\n1515237017516670976 [2022-04-16] @visakanv 💜 39\nso increased anxiety &amp; neuroticism, \"think harder\", doesn't actually help IME\n\nwhat helps is hearing from other people abt their experiences. reading is a pretty great proxy, you can get a LOT from that, but even so I think there's something you glean from people's body language\n↓\n1515237130846769159 [2022-04-16] @visakanv 💜 76 🔁 9 💬 4\n\"talk to loads of people!!\" is a tremendous solution to a lot of problems that I very seldom hear people prescribe. i wonder why\n↓\n1515237666690052104 [2022-04-16] @visakanv 💜 63 🔁 4\nexpand your search\n\nwhether you're looking for a spouse, a friend, a cofounder\n\ntalk to 1000 people instead of 50\n\nit takes more time yea, but the world is massive, and people's values, experiences, backgrounds vary tremendously, and new people's POVs can change your whole life\n↓\n1515238297240760325 [2022-04-16] @visakanv 💜 47 🔁 2\nyou can't* think your way out of a perspective problem\n\n___\n*not exactly, not directly. you have to be creative and try to figure out new ways to look at things from different angles. some people travel or fast or use drugs or whatever. you also can literally talk to people\n↓\n1515238469496635394 [2022-04-16] @visakanv 💜 18\nanyway this whole thread was me talking to my kid-self, if you're not feeling it, don't worry about it lol keep scrollin'\n\n===\n\n1532950023075414016 [2022-06-04] @nobu_hibiki 💜 2 [(SEED) type=semantic_search]\nPricklyyyyy\nThings are pricklyyyyyy\n↓\n1532950205028499456 [2022-06-04] @nobu_hibiki 💜 1\nEverything feels like nails scratching on the blackboard\n\n===\n\n1536221448611635200 [2022-06-13] @visakanv 💜 38 🔁 2\na couple of friends have DMed me other peoples tweets with comments along the lines of “lolll looks like introspection is becoming unfashionable, how do u respond” and my response is: https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1536221674185428993 [2022-06-13] @visakanv 💜 17\nthe point is to act. always been. https://t.co/PGGQhIksya\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1536222339779530752 [2022-06-13] @visakanv 💜 16\ngroup sentiment will pendulum back and forth, but if you step back, read some history, stick around, observe, make notes, see patterns, you can map out most of the loop and build perennially useful things that will wax and wane in popular interest https://t.co/tvh6a0HatF\n  [Quoting @visakanv: people are really not used to dealing with someone who's well-prepared]\n↓\n1536222853539848195 [2022-06-13] @visakanv 💜 7 [(SEED) type=quote_of_root]\n🐉 @FANswitchboard \n🌀 @introspectVV \n⛵️ ayy https://t.co/Bym36sOY0O\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1539549400929910784 [2022-06-22] @RichDecibels 💜 124\nkinda hilarious how my last pfp brought out the douchebag in me but its time for a vibe shift. let peace reign https://t.co/FHvSowmOxr\nImages:\n  - [Image #0] The image is a close-up photograph of a man with a beard, looking to his left. The man has short dark hair and a thick, dark beard that is flecked with gray hairs. He is wearing a light-colored knit sweater with a button at the top. The background is a plain beige wall.\n↓\n1539550003278086144 [2022-06-22] @tasshinfogleman 💜 4 [(SEED) type=quote_of_root]\n@RichDecibels https://t.co/IWzSdKjoGt\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1547284708937338880 [2022-07-13] @visakanv 💜 54 🔁 2 [(SEED) type=quote_of_root]\nstrategy for my tactical friends\ntactics for my strategic friends https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1547286581861847040 [2022-07-13] @visakanv 💜 15\nannoying as it might seem, i would likely spend 80% of the conversation asking WHY they want to improve their sleep. clarity of purpose (why are you really doing this) + awareness of the actual bottlenecks (what is actually stopping you) is critical to succeeding https://t.co/MCUQhmKvnd\n  [Quoting Tweet 1547015519890464769 (missing)]\n↓\n1547288434485886976 [2022-07-13] @visakanv 💜 15\nthere is no shortage of advice on what to do; often the real deficit– what most people need to hear– is *themselves*, out loud, in the presence of a supportive and encouraging figure (who is careful not to contaminate the ideation with interruptions)\n\nnot always though, lol\n↓\n1547288793920974848 [2022-07-13] @visakanv 💜 12\nSometimes someone comes to you asking how to sleep better and 20 mins in they realize they need to &lt;do completely separate upstream thing that’s stressing them out and ruining their sleep&gt;\n↓\n1547289196406374400 [2022-07-13] @visakanv 💜 11\nAnd sometimes they just need to stop drinking coffee at 6pm\n\nbut why are they drinking coffee at 6pm? there’s always a reason…\n\n===\n\n1549239441931341825 [2022-07-19] @tasshinfogleman 💜 43\ntasshin can have a little illegibility, as a treat\n↓\n1549240635206541312 [2022-07-19] @tasshinfogleman 💜 15 [(SEED) type=quote_of_root]\n*visa voice* legibility for my illegible friendsillegibility for my legible friendshttps://t.co/bQTxpcloPl\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1564020686477176832 [2022-08-28] @AskYatharth 💜 4\n&gt; you're A+ to most people if you are sensitive to what they consider personal, enquire/apologize about mistakes &amp; know how to back off/disengage. \n\nthe case f \"goo for my prickly friends or respecting intimacy boundaries and not blowing past them https://t.co/21WNFfSmKG\n  [Quoting Tweet 1564009699531714561 (missing)]\n↓\n1564020689274675200 [2022-08-28] @AskYatharth 💜 3 [(SEED) type=semantic_search]\n\"goo for my prickly friends, prickles for my gooey friends” https://t.co/3292g44Oww\n  [Quoting Tweet 1564009659945852928 (missing)]\n\n===\n\n1565683369723183104 [2022-09-02] @cxgonzalez 💜 14\nme vs twitter https://t.co/XHSEkjNXeu\nImages:\n  - [Image #0] The image is a meme that depicts a scene from the movie Home Alone, with a twist. The meme shows a woman, likely the mother, looking back at her screaming child in the backseat of a car. \n    \n    To recreate this meme, you would need to:\n    * Use the image of the woman and the child from Home Alone\n    * Add the text \"Why can't you just be normal?\" above the woman's image\n    * Add the text \"*Screams*\" below the child's image\n    * The meme is a humorous take on the frustration of being different and not being able to be \"normal.\" \n    \n    The tweet context \"me vs twitter\" suggests that the meme is being used to poke fun at the idea that people often present themselves differently online versus in real life, and the humor lies in the relatability of being perceived as \"not normal\" by others.\n↓\n1565691151302246403 [2022-09-02] @nosilverv 💜 4\n@CXGonzalez https://t.co/TcY4OBfe49\nImages:\n  - [Image #0] The image is a four-panel comic that depicts a group of pink figures being excluded by a larger group of gray figures. \n    \n    To recreate the image, the following steps can be taken:\n    * Panel 1: Draw a group of gray figures on the left side, with three pink figures below them. The gray figures should be saying \"you do not fit in here\" in a purple speech bubble.\n    * Panel 2: Draw the three pink figures standing on a yellow platform, with a green speech bubble saying \"okay we will make our own place\".\n    * Panel 3: Draw the group of gray figures on the left side again, with the pink figures on the yellow platform below them. The gray figures should be saying \"why are you excluding us\" in a purple speech bubble, and one of the pink figures should be saying \"oh no\" in a green speech bubble.\n    * Panel 4: Draw the gray figures and pink figures together, with the gray figures now surrounding the pink figures. The gray figures should be saying \"you do not fit in here\" in a purple speech bubble.\n    \n    The overall tone of the comic is one of exclusion and the cyclical nature of prejudice.\n↓\n1565692028880670726 [2022-09-02] @cxgonzalez \n@nosilverv https://t.co/TWsYOZN5Zq\nImages:\n  - [Image #0] The image depicts the album cover for DJ Khaled's \"Suffering from Success.\" The cover features a black-and-white photograph of DJ Khaled, shown from the chest up, with his head tilted down and his right hand resting on his forehead. He is adorned with multiple gold chains and a large diamond ring on his right hand. The title of the album, \"SUFFERING FROM SUCCESS,\" is displayed in white and yellow text at the bottom left of the image, while the artist's name, \"DJ KHALED,\" is written in white text above it. A parental advisory logo is situated in the bottom-right corner. The background of the image is a cloudy sky, with a dark landscape visible in the distance.\n↓\n1565697107536875521 [2022-09-02] @strangestloop 💜 1 [(SEED) type=semantic_search]\n@CXGonzalez @nosilverv my favorite pricklies 🥰\n\n===\n\n1567394669092573184 [2022-09-07] @AskYatharth 💜 17 🔁 2\n100 hot astrology takes\n\n===\n\n1567396616067493888 [2022-09-07] @AskYatharth 💜 4\n7. you could rotate all the signs by one (Aries becomes Taurus, etc.) and there would still be *some* resonance to the system. heck, you could randomise the houses\n\nbut some systems are going to have higher resonance. highest resonance. centuries of meaning-making-refined\n↓\n1567397341329788928 [2022-09-07] @AskYatharth 💜 5\n8. people say the rising sign is what your “mask” is or how other people see you, but this is misleading\n\nthe rising is hard to name. it is the subconscious vibe. people often can’t name it\n↓\n1567397343473078272 [2022-09-07] @AskYatharth 💜 4\nthe sun your legible mission or archetype. what smn would say if they met you in a business meeting\n\nit is easier to name consciously, the rising is harder to name but felt. the subconscious vibe\n↓\n1567397832461807617 [2022-09-07] @AskYatharth 💜 5\n9. astrology is like music. there are no wrong notes. only notes you haven’t made right yet https://t.co/2ZtJVILJfH\n  [Quoting @Malcolm_Ocean: @visakanv Herbie Hancock describing a similar realization he had early on playing with Miles Davis, and \"right in the middle of Miles Davis' solo, I played the wrong chord. Sounded like a big mistake! ...and Miles paused for a second... then he played some notes that made my chord right.\" https://t.co/NsDiTfdH5g]\n↓\n1567397893832863745 [2022-09-07] @AskYatharth 💜 3\n10. the mainstreamification of astrology is good, actually\n↓\n1567398717925490688 [2022-09-07] @AskYatharth 💜 13 🔁 1\n11. people can be too into astrology. this is cringe. you must simultaneously be too into astrology and not into it. you must cringemaxx and cringeminn at the same time. these must be held in ironic tension. irony is god-adjacent\n↓\n1567398722816065536 [2022-09-07] @AskYatharth 💜 7\n12. astrology is best delivered with a smirk and tone of irony that does not allow the listener to ascertain if you are serious or shitpostting\n↓\n1567398726087618561 [2022-09-07] @AskYatharth 💜 2\n13. doxxing birth time is a serious offence https://t.co/51mnCEau7q\n  [Quoting @AskYatharth: it reminds me of premodern folks talking about the danger of knowing someone’s name. to know someone’s true name was to have terrible power over then!  well, a photo has the name written in it, it gives you someone’s number]\n↓\n1567398853279903744 [2022-09-07] @AskYatharth 💜 7\n14. queer people do astrology better. the reasons are unclear\n↓\n1567399286492790784 [2022-09-07] @AskYatharth 💜 6\n15. astrology is usefully fake. but also you must consider that is real (see hot take #6) https://t.co/YW5CIqweK2\n  [Quoting @AskYatharth: 6. energy beams must be treated as a real thing. the planets are literally beaming energy to you. all other metaphors are subpar https://t.co/gV8e36GtS0]\n↓\n1567399289168740354 [2022-09-07] @AskYatharth 💜 8 [(SEED) type=quote_of_root]\n16. (to the rest of my hoes) astrology is real. but also you must consider that is it fake https://t.co/SJzZ50wkmL\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1567400175563571202 [2022-09-07] @AskYatharth 💜 3\n17. astrology is best learnt as an apprentice to someone who is already making useful use of it in their lives\n↓\n1567400177593647104 [2022-09-07] @AskYatharth 💜 3\nit ensure you have at least *one specific* application of astrology that is useful *to at least one person*\n\nit still might not be useful to you, but you have a much better shot at it\n↓\n1567400179711774725 [2022-09-07] @AskYatharth 💜 2\n18. it is a miracle books work at all to convey astrology. they do though\n↓\n1567400181406236673 [2022-09-07] @AskYatharth 💜 3\n19. the focus on birth charts is hyper-individualistic and this is good actually https://t.co/PoHvYj9G6d\n  [Quoting @AskYatharth: the only way out of hyper-individualism is through]\n↓\n1567420792891383809 [2022-09-07] @AskYatharth 💜 3\n20. the purpose of astrology hot takes is to be provocative, not to be correct\n\nincidentally, this is the also the function of astrology\n↓\n1567420794845937664 [2022-09-07] @AskYatharth 💜 2\n21. astrology is a provocation, not the truth\n↓\n1567420796674646019 [2022-09-07] @AskYatharth 💜 3\nor as @crystalxduan would say: astrology is an invitation\n↓\n1567420798042009600 [2022-09-07] @AskYatharth 💜 4\n(to what? to encounter The Real) https://t.co/ZS5SBBUXl7\n  [Quoting @AskYatharth: the challenge of astrology or spirits or any spirituality is to consider the possibility something is Real  it’s to allow yourself to Take It Seriously  it’s to herald back and throw yourself into the participatory fertile void https://t.co/X9fBbwL6ir]\n↓\n1567420801028325381 [2022-09-07] @AskYatharth 💜 2\n22. some provocations are better than others\n↓\n1567420802932547586 [2022-09-07] @AskYatharth 💜 2\n23. most provocations are bad. this is ok actually\n\n===\n\n1568873555328225286 [2022-09-11] @cxgonzalez 💜 220 🔁 2 💬 1\nit’s so over https://t.co/uVcetUbCHG\nImages:\n  - [Image #0] The image is a screenshot of an article from Wired, featuring a graphic and headline about dating.\n    \n    *   The top of the image has a black bar with the Wired logo on the left side. \n        *   The logo is a black circle with a white \"W\" inside it, surrounded by a rainbow-colored ring.\n        *   To the right of the logo is the word \"wired\" in white text.\n        *   On the right side of the black bar are three dots, likely representing a menu or options.\n    *   Below the black bar is a light blue background with a graphic of a file folder.\n        *   The file folder is yellow with a red heart in the center.\n        *   The folder has three tabs labeled \"VALUES\", \"INTERESTS\", and \"TESTIMONIALS\".\n        *   Above the folder, the words \"SINGLE FILE\" are written in small black text.\n    *   Below the graphic is a headline that reads, \"Ditch the dating apps—start a 'Date Me' doc instead\".\n        *   The headline is written in large black text, with a left-pointing arrow symbol before it.\n        *   In the bottom-right corner of the image is a small black bar with a white \"W\" logo, matching the one at the top of the image.\n↓\n1568975703982456833 [2022-09-11] @strangestloop 💜 2 [(SEED) type=semantic_search]\n@CXGonzalez my prickly guy 🖤\n\n===\n\n1572434993070346243 [2022-09-21] @visakanv 💜 111 🔁 13\nthere are no objective answers re: how harsh or soft to be, how prickly or gooey, open or closed— everyone inherits a bunch of vibes and then has a bunch of experiences (everything happens so much…), and we adjust and corregulate and chafe and soothe and until eventually we die\n↓\n1572435875153465345 [2022-09-21] @visakanv 💜 34 🔁 1\nwhat’s wack is when we overly constrain ourselves in response to events from early in our lives. but there’s no objective measure of “overly constrained” either, since it’s all contextual, it’s all interpretive, it’s all framing, it’s all creative accounting\n↓\n1572436276430909441 [2022-09-21] @visakanv 💜 44 🔁 1\nthe only specific bit of useful advice I can think of right now is “seek to experience and inhabit frames radically different than your own”. Not because they are right and you are wrong (itself a very limiting frame), but because life is dynamic https://t.co/k7nThqbWOD\n  [Quoting @visakanv: it feels like a great injustice that we are trained to be so rigid in such a dynamic world]\n↓\n1572436524482064384 [2022-09-21] @visakanv 💜 19 🔁 1 [(SEED) type=quote_of_root]\nand of course a little rigidity might be what someone needs, if that’s what they’re missing https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1583989047478714368 [2022-10-23] @strangestloop 💜 27 🔁 1 [(SEED) type=semantic_search]\nexperimenting with prickliness please understand https://t.co/qjPSCt95pe\n\n===\n\n1589399470818873345 [2022-11-06] @strangestloop 💜 1 [(SEED) type=semantic_search]\npricklies need gooeys! gooeys don't need pricklies!\n\n===\n\n1594530810173849602 [2022-11-21] @visakanv 💜 62 💬 1\nI do have a reflexive lil contrarian in me that, upon reading a sentence like “it’s difficult to overstate how devastating this is,” cheekily wants to say “yes, and it’s also difficult to overstate how little anything matters”. Basically a Calvin https://t.co/vjskgzm8cY\nImages:\n  - [Image #0] The image is a Calvin and Hobbes comic strip. \n    \n    The comic strip consists of 4 panels. The text in the panels is as follows:\n    Panel 1: \n    \"Miss Wormwood, I have a question about this math lesson...\"\n    Panel 2: \n    \"Yes? Given that, sooner or later, we're all just going to die, what's the point of learning about integers?\"\n    Panel 3: \n    \"Turn to page 83, class.\"\n    Panel 4: \n    \"Nobody likes us 'big picture' people.\"\n↓\n1594537400096919552 [2022-11-21] @visakanv 💜 32 [(SEED) type=quote_of_root]\nI will also do the opposite tho, like if I witness someone being all “everything is pointless nothing is real” and be like “true… personally as for me rn I’m very into the history of coffee” (or whatever arbitrary curiosity I have at the moment) https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1594538394691899392 [2022-11-21] @visakanv 💜 27\nthink I used to overdo this as a teenager in part bc I was uncomfortable abt people having strong feelings- I felt a need to diffuse the tension. then I went the opposite direction in my 20s, internalizing “shut up, listen, don’t interrupt”, now it’s ayy, https://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n\n===\n\n1599695041332924416 [2022-12-05] @visakanv 💜 52 🔁 2\na way of summarizing a lot of what i'm about is that I try to be deliberately informal, and the funny thing is that sometimes this upsets people who are primarily deliberate, and sometimes this upsets people who are primarily informal\n↓\n1599695400319217667 [2022-12-05] @visakanv 💜 21 [(SEED) type=quote_of_root]\nprickle criticism: \"you can't be serious without having clear, well-defined goals!\"\ngoo criticism: \"you can't manufacture serendipity!\"\n\ni mean they're both right... ⛵️\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1599696443358720002 [2022-12-05] @visakanv 💜 16\nand yet it's possible https://t.co/7MX024Ps6q\n  [Quoting @visakanv: 75. You can increase your exposure to luck.  You can improve your odds by taking random walks (literally and figuratively), and by paying attention to the peripheries. Have a public body of work, which is like a spiderweb that catches the attention of people looking for you]\n\n===\n\n1633333986280833029 [2023-03-08] @visakanv 💜 2012 🔁 153 💬 1\nI have several variations of the following recommendation:\n\n1. practice hanging out with people without talking about The Thing that you’ve made Central in your life\n↓\n1633334180678434816 [2023-03-08] @visakanv 💜 619 🔁 18\n2. seek out environments, contexts, etc where nobody cares about The Thing, and be curious and interested in whatever everyone actually cares about\n↓\n1633334552184647680 [2023-03-08] @visakanv 💜 455 🔁 10\n3. go somewhere different, try something new, see who you are away from The Thing. it will in fact enrich your appreciation and understanding of The Thing to have more literacy/fluency about Anything That Is Not The Thing\n↓\n1633334952036122624 [2023-03-08] @visakanv 💜 245 🔁 3\nwhen people invite me to speak at some conference or venue where everyone is gathered to discuss The Thing, I often say,\n\n4. what you have here is wonderful, and everyone outside of here should get a chance to experience it, and… I wish you a very merry Fuck Off From The Thing\n↓\n1633335164758573056 [2023-03-08] @visakanv 💜 132 [(SEED) type=quote_of_root]\n5. https://t.co/Bym36t6zpo\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1633335577012576256 [2023-03-08] @visakanv 💜 242 🔁 15 💬 3\n6. beware monocropping your mind, your life, your social graph. seek a diversity of experiences, an ecology of being. it’ll make you more interesting and much less susceptible to getting pwned https://t.co/M1KhUQlgoZ\n  [Quoting @AskYatharth: @visakanv on monocropping and Calvin &amp; Hobbes; being suspicious of monocropping, its cost of independence https://t.co/7YcLQ8p5ug]\n↓\n1633336016655339520 [2023-03-08] @visakanv 💜 113 🔁 3\n7. this maybe takes it a little further than most people would be comfortable with, but it’s interesting to consider as at least a thought experiment or daydream https://t.co/5irdnGdeLF\n  [Quoting @visakanv: to me, it is risky to not have:  - alt models of reality - alt sources of meaning - alt scenes and social graphs to hang out in - alt identities - alt jobs/income sources  they don't teach *any* of this in school, &amp; people end up depressed, suicidal, abusive... it's insane to me]\n↓\n1633336421539799041 [2023-03-08] @visakanv 💜 111 🔁 1\nthe age-old proverb for this is of course, \n\n8. don’t put all your eggs in one basket\n↓\n1633336911887585280 [2023-03-08] @visakanv 💜 95 🔁 4\n9. try using different language to say what you mean\n↓\n1633337574394609665 [2023-03-08] @visakanv 💜 153 🔁 8\n10. visit a part of town you haven’t been to before\n\ntry a different dish at your favorite cafe/restaurant \n\nbrush your teeth with the other hand\n\ntext an old friend you haven’t talked to in years\n\ntry to do one new little thing every month-ish that you’ve never done before\n↓\n1633337844113498115 [2023-03-08] @visakanv 💜 80\nthese are all just prompts/suggestions, no pressure, feel free to ignore them etc\n\nit’s just the stuff that people have reliably reported back to me as casually life-changing\n↓\n1633338335396519936 [2023-03-08] @visakanv 💜 48 🔁 3\nIf u want 300 pages of this sorta stuff that’s @introspectvv\n\n===\n\n1635697135126560769 [2023-03-14] @m_ashcroft 💜 12\nI like to mix my serious tweet and my silly tweets all under the one account to keep everyone on their toes https://t.co/hbuZ5UK1vv\n  [Quoting Tweet 1635695686770470935 (missing)]\n↓\n1635726561344192533 [2023-03-14] @inkolore_  [(SEED) type=quote_of_root]\n@m_ashcroft https://t.co/wnFFoDoBXP\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1651799187611086851 [2023-04-28] @univrsw3th4rt 💜 4\ni felt forgiveness for this today 🫶 https://t.co/J2gtMTG0j1\n  [Quoting @univrsw3th4rt: i was kinda robbed for first place lol but whatever 🤪]\n↓\n1651799367664254977 [2023-04-28] @univrsw3th4rt 💜 3\nhe needed people to believe in his idea. i needed a fire lit under my ass to prove them all wrong\n↓\n1651799474392518659 [2023-04-28] @univrsw3th4rt 💜 3 [(SEED) type=quote_of_root]\nhttps://t.co/z2dEgyLlwM\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1653228128012042242 [2023-05-02] @mbateman 💜 17\nMuch more worried about missing the trees for the forest.\n↓\n1653401972588912644 [2023-05-02] @__drewface 💜 3 [(SEED) type=quote_of_root]\n@mbateman - says famously thoughtful forest-appreciator\n\nhttps://t.co/81p1XRfpL8\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1655969127264309248 [2023-05-09] @visakanv 💜 230 🔁 5\ncosigned https://t.co/pNvPUsKSY5\n  [Quoting Tweet 1655924291240615940 (missing)]\n↓\n1655969235913564160 [2023-05-09] @visakanv 💜 41 [(SEED) type=quote_of_root]\nunless you were noxiously deranged to begin with, in which case maybe play it a little cool, as a bit\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1661779834261975054 [2023-05-25] @inkolore_ 💜 5\nI feel like I am too doomer for the hopers, but too hoper for the doomers, destined to be a mimetic nomad\n↓\n1716140248093085785 [2023-10-22] @inkolore_ 💜 3\nYep still hasn't changed, if anything I find that awkward middle ground to be more and more the case:\n- Too weird for the normies, too normie for the weirdos\n- Too emotional for the intellectuals, too intellectuals for the emotionals\n↓\n1716144008664420582 [2023-10-22] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@inkolore_ I think you’d be at home with a lot of the people I RT on @fanswitchboard https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1662727051240177664 [2023-05-28] @visakanv 💜 430 🔁 42\nwith great power comes great responsibility works backwards too– behaving responsibly is part of the process of accumulating real meaningful power. It’s far from the only way to do it, but it’s roughly the best and most sustainable\n↓\n1662727369411674118 [2023-05-28] @visakanv 💜 74 🔁 5\npeople’s power is often bottlenecked by their willingness to behave responsibly. In practice what this looks like is, an unwillingness to conduct oneself with grace and decorum when one still feels like a comparative underdog\n↓\n1662727667794468864 [2023-05-28] @visakanv 💜 74 🔁 3\n“why should I have to treat others with kindness and grace when they are more privileged, have more advantages, more X more Y than me?” You certainly don’t have to, but that is how you win the long game\n↓\n1662728939742334977 [2023-05-28] @visakanv 💜 39\nthat’s what I believe, anyway. and over time I accumulate shared understandings with other people who share that belief. It’s a lot of work at first, but it gets easier over time as we find more of each other, help each other out, and create a healthy commons amongst ourselves\n↓\n1662733043717783552 [2023-05-28] @visakanv 💜 41 [(SEED) type=quote_of_root]\nthere are some inversions to this depending on your priors. if you spent your whole life being “well-behaved” and “not rocking the boat” etc then this wasn’t really written for you, and you might need a little more daring instead https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1670236524431147008 [2023-06-18] @SarahAMcManus 💜 22\nI'm making a new logo for my coaching site! \n\nTurns out a 10K+ person conference is just what I needed to kickstart that intention, though I've been thinking about it for months\n\nHere's the old logo, and the current version: https://t.co/dQlCCNnO6i\nImages:\n  - [Image #0] The image presents a striking visual representation of two distinct circular patterns, set against a clean white background. The left circle features a black and silver metallic design, characterized by a series of pointed shapes that radiate from the center, creating a sense of depth and dimensionality. In contrast, the right circle showcases a vibrant, swirling pattern reminiscent of oil slicks or psychedelic art, with hues of blue, orange, and yellow.\n    \n    **Key Features:**\n    \n    * **Left Circle:**\n    \t+ Black and silver metallic design\n    \t+ Pointed shapes radiating from the center\n    \t+ Creates a sense of depth and dimensionality\n    * **Right Circle:**\n    \t+ Vibrant, swirling pattern\n    \t+ Resembles oil slicks or psychedelic art\n    \t+ Features hues of blue, orange, and yellow\n    * **Background:**\n    \t+ Clean white background\n    \n    The juxtaposition of these two circles creates a visually appealing and thought-provoking image, inviting the viewer to explore the contrast between the dark, metallic tones and the bright, psychedelic colors.\n↓\n1670236528101195776 [2023-06-18] @SarahAMcManus 💜 6 [(SEED) type=quote_of_root]\nThey're both riffing on the idea of \"prickles and goo\" -- which is itself an Alan Watts reference.\n\nA big part of my coaching practice is dancing with these stances and helping people weave them into interesting, useful, enjoyable patterns \n\nhttps://t.co/A12U2VmEA1 https://t.co/qnIqT5kjrZ\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\nImages:\n  - [Image #0] The image contains a passage of text on a gray background. The text is transcribed as follows:\n    \n    \"There are basically two kinds of philosophy. One's called prickles, the other's called goo. And prickly people are precise, rigorous, logical. They like everything chopped up and clear. Goo people like it vague. For example, in physics, prickly people believe that the ultimate constituents of matter are particles. Goo people believe it's waves. And in philosophy, prickly people are logical positivists, and goo people are idealists. And they're always arguing with each other, but what they don't realize is neither one can take his position without the other person. Because you wouldn't know you advocated prickles unless there was someone advocating goo. You wouldn't know what a prickle was unless you knew what a goo was. Because life isn't either prickles or goo, it's either gooey prickles or prickly goo.\"\n↓\n1670236530630352898 [2023-06-18] @SarahAMcManus 💜 3\nI like the old version - it's got gooey prickles on one side as ferrofluid spikes &amp; really interesting 'gooey' soap film on the other, and they interlace in the middle.\n\nBut the overall design of my site has been feeling a little cold, and I want to make it more warm &amp; organic https://t.co/ycgO7qJYWD\nImages:\n  - [Image #0] The image is a graphic design featuring two overlapping circles, each with a distinct visual effect. The left circle contains a black and white image resembling ferrofluid spikes, while the right circle displays a colorful, swirling pattern reminiscent of soap film. The circles overlap in the middle, creating a sense of depth and visual interest.\n    \n    **Key Features:**\n    \n    * **Left Circle:**\n    \t+ Black and white image\n    \t+ Resembles ferrofluid spikes\n    * **Right Circle:**\n    \t+ Colorful, swirling pattern\n    \t+ Reminiscent of soap film\n    * **Overlap:**\n    \t+ Circles overlap in the middle\n    \t+ Creates a sense of depth and visual interest\n    \n    **Visual Effects:**\n    \n    * The ferrofluid spikes in the left circle give the impression of a metallic, three-dimensional surface.\n    * The soap film pattern in the right circle appears to be in motion, with swirling colors that evoke a sense of fluidity and dynamism.\n    \n    **Overall:**\n    \n    * The image is a visually striking representation of two different textures and patterns.\n    * The overlap between the circles adds complexity and interest to the design.\n↓\n1670236532886884353 [2023-06-18] @SarahAMcManus 💜 4\nI started with a few sketches, inspired by ammonite suture patterns, before hitting on one that goes from a sort of simple gooey wave on one side to a fractally prickly wave on the other https://t.co/o2bnqcrU6t\nImages:\n  - [Image #0] The image shows a whiteboard with a blue marker drawing of a wavy line that transitions from simple to complex, resembling a fractal pattern, accompanied by a series of curved lines and circles below it. The whiteboard is held up in front of a room, with a doorway and furniture visible in the background.\n↓\n1670236535407648769 [2023-06-18] @SarahAMcManus 💜 7\nThat sketch sat for months, and eventually I decided I wanted to fill it in with colors that look like southwestern canyons https://t.co/ghpuCsT2Bq\nImages:\n  - [Image #0] The image depicts a vibrant, abstract canyon with swirling red, purple, and orange hues. The canyon's walls are smooth and curved, resembling a flower or a wave, with shades of deep red, purple, and orange gradating into lighter tones towards the center.\n↓\n1670236537878102020 [2023-06-18] @SarahAMcManus 💜 5\nI got bogged down for a while, thinking I had to learn how to make it work in a vector art program. \n\nFinally I was down to the wire, the night before my flight, still without new business cards! \n\nI did a first test with watercolor pencils: https://t.co/9TTIm0jDrg\nImages:\n  - [Image #0] The image depicts a hand holding a spiral-bound sketchbook with a vibrant, abstract drawing on the page. The artwork features a colorful, rounded shape resembling a jellyfish or a blob, divided into sections of blue, purple, pink, red, and orange hues. The drawing is rendered in watercolor pencils, with bold black outlines defining its contours.\n    \n    In the top-left corner of the page, there are some illegible notes written in pencil, accompanied by a few scribbles. The sketchbook is being held by a person's left hand, which is visible at the bottom left of the image. The background appears to be a cluttered table or desk, with various objects partially visible beneath the sketchbook.\n↓\n1670236540453400577 [2023-06-18] @SarahAMcManus 💜 11\nAnd then in the airport yesterday, I drew another version, cleaned it up on the computer, made a business card in Canva, and sent it off for next-day printing in Colorado -- all before my flight boarded! 😅 https://t.co/zCyiobyHRn\nImages:\n  - [Image #0] The image shows a hand holding a sketchbook with a drawing of a rainbow-colored, abstract, flame-like shape. The drawing is colored with colored pencils and has a black outline.\n    \n    To recreate this image, follow these steps:\n    \n    * Start with a white spiral-bound sketchbook.\n    * Draw a rounded, flame-like shape on the page, with the top facing left and the bottom facing right.\n    * Divide the shape into sections, coloring each section with colored pencils in a gradient of colors from blue to purple, red, orange, and yellow.\n    * Outline the shape and sections with a black pen or marker.\n    * Hold the sketchbook with your fingers at the bottom of the page, with your thumb on one side and your other fingers on the other.\n    \n    The resulting image should be a colorful, abstract drawing of a flame-like shape, held by a hand in a sketchbook.\n↓\n1670236543477510144 [2023-06-18] @SarahAMcManus 💜 14\nAnd today I picked them up in Colorado, ready to go! https://t.co/24D2vmRhqf\nImages:\n  - [Image #0] The image shows a hand holding a business card with a stack of cards behind it, featuring a colorful abstract design and the name \"Sarah McManus\" in brown cursive text. The card includes the tagline \"Integration coaching\" and the website \"pricklesandgoo.com\", as well as social media handles \"SarahAMcManus\" and \"mcmanus.sarah.a\".\n\n===\n\n1672973782577717248 [2023-06-25] @strangestloop 💜 24 🔁 1\ni'm serious. if you're dating a prickly please tell me about it https://t.co/4mPLP6ITOt\n  [Quoting @strangestloop: trying to imagine a prickly in a relationship. are they sweet to their sweetie? or is it like \"i tolerate you\"]\n↓\n1672975158212960257 [2023-06-25] @goblinodds 💜 9\n@strangestloop ok what is a prickly and what is the other thing\n↓\n1672975448462991361 [2023-06-25] @tasshinfogleman 💜 14\n@goblinodds @strangestloop the other thing is a gooeyhttps://t.co/m46wQwRMCo\n  [Quoting @strangestloop: the ideal prickly-gooey relationship https://t.co/0PBvkSq1IP]\n↓\n1672976784827056128 [2023-06-25] @goblinodds 💜 10\n@tasshinfogleman @strangestloop oh right\n\nok pls i need an elaborate set of definitions\n↓\n1672977094039547904 [2023-06-25] @tasshinfogleman 💜 11 [(SEED) type=quote_of_root]\n@goblinodds @strangestloop this is all that came with the manualhttps://t.co/bQTxpcloPl\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1672977304081891329 [2023-06-25] @tasshinfogleman 💜 10\n@goblinodds @strangestloop goo is sweet, open, agreeable, nice over kindprickly is cranky, closed, disagreeable, kind over nice\n↓\n1672978511798104064 [2023-06-25] @goblinodds 💜 3\n@tasshinfogleman @strangestloop kind over nice? 👀 like telling ppl what they need to hear vs what they want to?\n↓\n1672978642027069440 [2023-06-25] @tasshinfogleman 💜 3\n@goblinodds @strangestloop yeah that sorta thing\n↓\n1672984568603787269 [2023-06-25] @goblinodds 💜 2\n@tasshinfogleman @strangestloop ahhh okok\n\n===\n\n1675008282195562497 [2023-07-01] @visakanv 💜 203 🔁 8\none of the interesting ongoing disputes i see all the time in all sorts of contexts might be describable as something like, soul vs soulless. my choice of framing makes it p obvious where I stand on this, but it's interesting bc even a lot of ppl on \"team soul\" have self-doubt https://t.co/FViPv7aDzv\n  [Quoting Tweet 1674479601672916992 (missing)]\n\n===\n\n1675009223145693186 [2023-07-01] @visakanv 💜 56 🔁 1\nwhich brings us to the ppl in the middle with self-doubt, who I'd much rather talk to: people who have had some glimpse of what soul is, why it matters – but often I hear from them their worries that \"the world\" will not appreciate it – and tweets like vinod's may rattle them\n↓\n1675009920465526784 [2023-07-01] @visakanv 💜 35\nthere's layers to it, it can take years to begin to develop something of a grounded and comprehensive perspective on why soul matters. i've written a lot about this over the years but it'll take time even to assemble it all in one place... this is a start https://t.co/rbmNeyMytI\n  [Quoting @visakanv: On the utility of art, a thread! https://t.co/eFTdavp52n]\n↓\n1675011434013655042 [2023-07-01] @visakanv 💜 107 🔁 4\nthis bit from ethan hawke that i quoted at the end, i think captures most of what matters in 80 seconds https://t.co/hU7t6gUWd7\n  [Quoting Tweet 1369875542569144320 (missing)]\n↓\n1675012050681217024 [2023-07-01] @visakanv 💜 42 🔁 1\n\"do you think human creativity matters?\" – in my frame, do you think 'soul' matters?\n\nand team soulless will say, no it doesn't matter, the robots will do it for us. ok. you do you, boo! enjoy. really.\n\nmy next Q: do you think 0.1% of humans will think that soul matters?\n↓\n1675012734407135234 [2023-07-01] @visakanv 💜 52 🔁 1\n0.1% of people is a lot of people. right now that's over 8,000,000 people. fuck team soulless. we don't need them. there have always been people who give a shit about human-to-human contact, intimacy, meaning, joy, heart, etc, and we can focus our time and energy on each other\n↓\n1675013032026738689 [2023-07-01] @visakanv 💜 18\n❤️💫 https://t.co/B40mCMeSy3\n  [Quoting @visakanv: also this cover of Hans Zimmer's First Step (from Interstellar) by @tusharlall02 is one of my favorite things to cry to while thinking about the splendor and despair of humanity https://t.co/5zXQYKdG3B https://t.co/O9mLv81fnc]\n↓\n1675014350493614081 [2023-07-01] @visakanv 💜 21 🔁 1\nhere's a recent pop-ish song that made me feel things because of how honest and penetrating it is\n\nhttps://t.co/Lcxbj7qDG2\n  [Quoting @visakanv: “beauty is a knife I’ve been holding by the blade” - Nessa Barrett, born 2002 https://t.co/YuokwTiJCs]\n↓\n1675014818670202880 [2023-07-01] @visakanv 💜 33\nthe soul, the love, the heart, the feeling of musicians is a critical part of why I am alive today, and so I personally have 0 self doubt that I'll be spending the rest of my life finding and helping the others who yearn to be saved in the same way\n↓\n1675015154579427328 [2023-07-01] @visakanv 💜 12\nif you get me started on \"visa play me some music with real soul\" we'll be here all day 😂\nhttps://t.co/PCJSo7zfLG\n  [Quoting @visakanv: in all my years of searching I have never found a better version of Metallica's Nothing Else Matters than this 2014 cover by Thaikkudam Bridge https://t.co/eE2ZfQnu7r https://t.co/apUs2cjLrz]\n↓\n1675027222313463808 [2023-07-01] @visakanv 💜 19\ni am not entirely averse to the possibility that machines will one day somehow have soul too but there is a very distinct, discernable difference between the people who get it and the people who don't. minsky got it imo  https://t.co/NVvCEdaa9W\n  [Quoting @visakanv: @TaylorPearsonMe “Will robots inherit the earth? Yes, but they will be our children.” - Marvin Minsky]\n↓\n1675033363592417280 [2023-07-01] @visakanv 💜 23 🔁 1 [(SEED) type=quote_of_root]\nalso, funny note: my artist friends tend to know me as the annoying tech-promoter who's always asking them to write online, make videos, etc etc\n\ni love technology. it empowers us, enables us. it lets us care more. but it is not a *substitute* for caring\n https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1675035113879642112 [2023-07-01] @visakanv 💜 14 🔁 1\nand to be clear, putting paint on a canvas or singing some songs or writing some words is no definitive proof of caring either. artists do not have a monopoly on caring, or on being decent people. if i keep listing caveats we'll be here all day too lol\n\n===\n\n1685658237561929728 [2023-07-30] @strangestloop 💜 2 [(SEED) type=semantic_search]\ni see some pricklies are slowly gooeypilling themselves 🥰\n\n===\n\n1698438944789008825 [2023-09-03] @visakanv 💜 15 🔁 1\ntbh this is me about most topics https://t.co/b2NAee89K9\n  [Quoting @visakanv: @austnryder its very complicated lol im always holding all the possible positions for and against simultaneously]\n↓\n1698439335089979799 [2023-09-03] @visakanv 💜 8 🔁 2 💬 1 [(SEED) type=quote_of_root]\noften times if you see me advocate strongly for some particular point of view, its because i feel it’s underrepresented in the context we’re in https://t.co/Bym36t6zpo\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1719002969885307069 [2023-10-30] @strangestloop 💜 185 🔁 16\nI suspect that half of all people need to do stuff before they're able to love themselves, and the other half need to love themselves before they're able to do stuff\n↓\n1719112596920696935 [2023-10-30] @visakanv 💜 9 [(SEED) type=quote_of_root]\n@strangestloop https://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1730772903883592043 [2023-12-02] @visakanv 💜 356 🔁 23 💬 2\nelaborating as hard as possible is one of the most valuable skills to learn for people whose only social interaction for a couple decades has been refusing to elaborate https://t.co/V07apr5FNY\n  [Quoting @monistowl: Refusing to elaborate is one of the most valuable skills to learn for people whose only social interaction for a couple decades has been elaborating as hard as possible]\n↓\n1730772949572157510 [2023-12-02] @visakanv 💜 36 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1736548861420712092 [2023-12-18] @tasshinfogleman 💜 2 [(SEED) type=semantic_search]\ngoo for my people friends, prickles for my system friends\n\n===\n\n1740723788701151343 [2023-12-29] @tasshinfogleman 💜 17 💬 1 [(SEED) type=quote_of_root]\nbest thing about this format is it allows for context-specific advice https://t.co/bQTxpclWET\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1746693588162122104 [2024-01-15] @tasshinfogleman 💜 17\nall of my prickly friends showing up to the thing to tell me even more about what it's like to be them, to fill in the details 😍 https://t.co/gPuXb41N23\n  [Quoting @tasshinfogleman: breaking news: evidence would indicate that disagreeable people feel respected, cared for, valued, loved when being disagreed with??? that they may even enjoy it???]\n↓\n1746693727102603763 [2024-01-15] @tasshinfogleman 💜 5 [(SEED) type=quote_of_root]\nc.f. https://t.co/uY9FY7hexQ\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1751991054482755799 [2024-01-29] @visakanv 💜 105 🔁 1\nsometimes people are sort of skeptical when i tweet something that suggests that i could be more productive. i think if any serious person watched how i live my life they would be like \"oh yea for sure this guy could be more productive\", it's pretty glaringly obvious\n↓\n1751991225069257104 [2024-01-29] @visakanv 💜 23 🔁 1\nsometimes such tweets set off these countermeasures like \"oh well productivity isn't everything, you shouldn't define your life according to your productivity,\" and like, yea, i know, i spend the vast majority of my time not giving a shit about productivity, lol. but\n↓\n1751991484075884579 [2024-01-29] @visakanv 💜 28 🔁 3\ncritically, I *get to do that* BECAUSE i've been productive before. if you see an adventurer and a village drunk in the same tavern each having their second tankards of ale it might look superficially similar in some respects but it's not the same thing\n↓\n1751991856886685798 [2024-01-29] @visakanv 💜 24 🔁 1\ni dont mean to be dramatic but good things happen to people other than myself when i'm being productive\n\nand i'm not saying that means i should push myself to be productivity-maxxing, but like 20-50% more productive than my \"can't be arsed rn\" state is pretty meaningful\n↓\n1751992566428635395 [2024-01-29] @visakanv 💜 50 🔁 4 [(SEED) type=quote_of_root]\nhappy idleness for my workaholic friends, \nmaterial progress for my derelict bum friends\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1752016342725931088 [2024-01-29] @profoundish  [(SEED) type=quote_of_root]\nRT @visakanv: happy idleness for my workaholic friends, \nmaterial progress for my derelict bum friends\n\nhttps://t.co/Bym36t77eW\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1762396414704075250 [2024-02-27] @visakanv 💜 239 🔁 10\nthis got me thinking about what’s the stickiest idea I have that I really got from someone else (so I can properly credit them).\n\nDo 100 Things is a remix of the pottery class parable\n\n‘joke about outcomes you want’ is a remix of Ogilvy’s “make your thinking as funny as possible” https://t.co/f5lJqLitIr\n  [Quoting Tweet 1762186140667555853 (missing)]\n↓\n1762397057434918944 [2024-02-27] @visakanv 💜 33 🔁 2\n“play long games” is a descendant of Nietzsche’s “long obedience”, my bandmate gave me that one over a decade ago\n↓\n1762397777873822111 [2024-02-27] @visakanv 💜 34 🔁 3 💬 2\nOh, people sometimes say “haters are fans too” - @visakanv \n\nbut that’s directly a Kanye quote, not even a remix. probably the best answer for the original prompt https://t.co/p42PSjtD43\nImages:\n  - [Image #0] The image shows a tweet from Kanye West's Twitter account. To recreate the image, follow these steps:\n    \n    * Create a white background.\n    * In the top-left corner, include a blue and green globe icon, representing the Earth, next to the text \"ye\" and a blue checkmark, followed by the handle \"@kanyewest\" in gray text.\n    * Below this, display the tweet: \"even the haters haters are fans too\" in black text, with the words \"haters\" on either side of a gap.\n    * Underneath the tweet, show the timestamp \"9:57 PM · 30 Dec 18\" in gray text, followed by \"Twitter for iPhone\" in blue text.\n    * Below the timestamp, display the engagement metrics: \"2,176 Retweets\" and \"7,560 Likes\" in black and gray text, respectively.\n    * At the bottom of the image, include four icons: a speech bubble, a retweet symbol, a heart, and a share symbol, all in gray.\n    \n    The tweet reads: \"even the haters haters are fans too\". The text is presented in a clean and simple format, with the author's handle and engagement metrics clearly visible.\n↓\n1762398478389657885 [2024-02-27] @visakanv 💜 36 🔁 3\nthis one is a remix of Bertrand Russell’s “everything is vague to a degree we do not realize until we attempt to make it precise” https://t.co/hxbEJJqLSs\n  [Quoting @visakanv: 16. All advice is context-dependent to a degree we do not realize until we encounter a different context]\n↓\n1762398926236479899 [2024-02-27] @visakanv 💜 23 🔁 3\nthis one is a remix of clarke’s third law, “any sufficiently advanced technology is indistinguishable from magic” https://t.co/v7yO86SRaC\n  [Quoting @visakanv: 17. Sufficiently caveated advice is indistinguishable from chaos]\n↓\n1762443996679258232 [2024-02-27] @tasshinfogleman 💜 1 [(SEED) type=quote_of_root]\n@visakanv alan watts (quote in thread) https://t.co/uY9FY7gGIi\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n\n===\n\n1765212284266455219 [2024-03-06] @nobu_hibiki 💜 1\nDeath to friends and trust. Long live friends and trust. https://t.co/prG3SN7Scs\n  [Quoting @nobu_hibiki: I know how it feels to drift away from friends and that one I learned how to be okay with, I know what stories to tell myself to keep my heads up. But broken relationships due to conflicts? Where I have very little control over? Ones where there's nothing I can do?]\n↓\n1765225223937532238 [2024-03-06] @nobu_hibiki 💜 2 [(SEED) type=quote_of_root]\nI say this because I saw a few tweets talking about community and hosting and saw people talking about doubling down on building trust and rewarding those who are active and consistent and I feel a deep instinctual prickly for my gooey friends\nhttps://t.co/nCUWfF8naN\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1765225989465133442 [2024-03-06] @nobu_hibiki 💜 1\nThink it's because locally this is how things are done and has always been done, and it has run it's course and has been taken too far and is bad. I wanna be able to form relationship with a sharp blade and there isn't much to sharpen the blade.\n\n===\n\n1822305957793447999 [2024-08-10] @chercher_ai 💜 27 🔁 1\nOn a rescue mission today https://t.co/OYXoZKjM0l\nImages:\n  - [Image #0] The image is a photograph of a porcupine in a dark plastic container, with a red blanket or cloth beneath it. The porcupine is curled up, showing its back and quills.\n↓\n1822353443782008929 [2024-08-10] @SarahAMcManus 💜 3 [(SEED) type=semantic_search]\n@chercher_ai prickles for your gooey friends!\n\n===\n\n1856532633884188778 [2024-11-13] @danielgolliher 💜 8 🔁 1\n\"The Ballad of Antonin and Ruth,\" or: how great differences combine for the success of the republic. Or: an examination of whether and when you can be friends with people who are very different from you, especially in government. https://t.co/MTsBgbO2EC\n↓\n1856532635117310347 [2024-11-13] @danielgolliher 💜 3\nFeaturing this post:https://t.co/haUJkcidW4\n  [Quoting @mbateman: Today is James Baldwin’s 100th birthday.  It’s hard for me to put to words how he’s influenced me. I started reading him in high school. I didn’t and don’t share his politics or worldview. But I fell in love with him; he’s in my very small personal pantheon.]\n↓\n1856532636820287563 [2024-11-13] @danielgolliher 💜 3 [(SEED) type=quote_of_root]\nAnd featuring this post: https://t.co/pnQyuVsNtE\n  [Quoting @visakanv: Goo for my prickly friends Prickles for my gooey friends]\n↓\n1856532638670172467 [2024-11-13] @danielgolliher 💜 4\nUnderrated: building deep relationships with others who drive you further, and make you better, even if there's friction.But sometimes you also have operas written about your friendship. https://t.co/a5NhydRvcR\nImages:\n  - [Image #0] The image depicts a group of people dressed in various costumes, with some wearing wigs and formal attire. The scene appears to be a gathering or party where the individuals are posing for a photograph, showcasing their elaborate outfits and accessories, including a woman holding a fan.\n\n===\n"
}