{
  "tweet_id": 1196038612451676162,
  "thread_text": "1080477891249430529 [2019-01-02] @visakanv 💜 62 🔁 3\na funny-sad thing is going through Quora questions that have marketing spam in the answers, clicking on the links and finding that the startups have since gone out of business\n\nfunny because they wasted their time\n\nsad because they polluted our commons\n↓\n1261530103323885575 [2020-05-16] @visakanv 💜 24\nI wanna elaborate on this, because I don't think many people appreciate just how costly polluted commons is. It's not obvious. Polluted commons make good people less likely to want to participate. It makes people trust each other less. It makes people put in less effort\n↓\n1261530815143358464 [2020-05-16] @visakanv 💜 17\npeople get so used to operating with the assumption that the public commons *must* necessarily be a cesspool of filth and bullshit that they might even struggle to imagine it any other way. and yet there are clearly variances across different sections of different public spaces\n↓\n1261531673918750721 [2020-05-16] @visakanv 💜 12\nI would even maybe argue that you can think of several  golden ages as instances in which some subset of some public sphere in some city was uncommonly receptive to high-quality discourse – and those lead to tremendous cultural and scientific progress  https://t.co/f0f7HKFx8K\n  [Quoting @visakanv: Interesting bit from Bertrand Russell about the Dutch golden age, resonates with @DavidDeutschoxf's riffs about conjecture and criticism https://t.co/vfizFuZXYq]\n↓\n1261531933193822208 [2020-05-16] @visakanv 💜 20 🔁 1\nit takes a diverse group of smart, kind, thoughtful people to be able to find each other, play and experiment with each other, and yes challenge and criticize each other – respectfully enough – in order to produce the best work that the world has ever seen\n\nthis is not fiction!!!\n↓\n1261532536842317824 [2020-05-16] @visakanv 💜 28\n\"huh but what does that have to do with marketing spam on quora??\"\n\nhardly anybody I know worth talking to spends any time on quora any more. it was once a fascinating coffeehouse of thoughtful people having interesting conversations. it felt like it was really going somewhere\n↓\n1261533636932730883 [2020-05-16] @QiaochuYuan 💜 10\n@visakanv i went through a cycle in grad school where i'd periodically quit quora because it was exhausting filtering through the terrible questions to find good ones i could give fun answers to. i never understood why they were so bad at filtering questions. eventually stayed gone\n↓\n1261534308335906816 [2020-05-16] @visakanv 💜 5 [(SEED) type=quote_of_root]\n@QiaochuYuan if I had to guess... https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1261542209515487232 [2020-05-16] @CountJ0ecool 💜 1\n@visakanv @QiaochuYuan Metrics? Being in opposition to real human connections? Poppycock!\nSurely if that were the case we would have metrics on it.\n\n===\n\n1135799079265492992 [2019-06-04] @visakanv 💜 159 🔁 12\na thread of my best one-liners https://t.co/zIn2mJGyj3\n\n===\n\n1219917604921532416 [2020-01-22] @visakanv 💜 18\n22. https://t.co/zTe37HKKfh\n  [Quoting @visakanv: fucking is labor, fuckability is capital]\n↓\n1219917731534757889 [2020-01-22] @visakanv 💜 20\n23. https://t.co/Ly5uPL5bkn\n  [Quoting @visakanv: thinking is easy, information architecture is hard]\n↓\n1224446133763633152 [2020-02-03] @visakanv 💜 25\n24. https://t.co/o7mP4ZuirP https://t.co/wDKS62i5dG\n  [Quoting @visakanv: you can’t think your way out of a courage deficit]\n↓\n1226590671496073217 [2020-02-09] @visakanv 💜 9\n25. https://t.co/j5YJ168doC\n  [Quoting @visakanv: @sonyasupposedly @vgr [lights cigarette] art is the most humanitarian thing there is]\n↓\n1229232274576531457 [2020-02-17] @visakanv 💜 6\n26. https://t.co/OnIc3XJRDG https://t.co/ghR3pFQs3R\n  [Quoting @visakanv: Success can be very dehumanizing]\n↓\n1230540338915205120 [2020-02-20] @visakanv 💜 13\n27. https://t.co/MWfTTwRFpl https://t.co/rSgB2LnYOr\n  [Quoting Tweet 1169511884816441344 (missing)]\n↓\n1230540516783058944 [2020-02-20] @visakanv 💜 11\n28. https://t.co/pXaib2pc0R https://t.co/OXfqp96uRP\n  [Quoting @visakanv: @simpolism Self-loathing is a form of narcissism]\n↓\n1230976560531820545 [2020-02-21] @visakanv 💜 11\n29. https://t.co/yje65nZgYp https://t.co/SBFAzQvA3S\n  [Quoting @visakanv: @literalbanana [half-jokingly] people contain multitudes, coherence is fascism]\n↓\n1231925578720149504 [2020-02-24] @visakanv 💜 16\n30. https://t.co/LqS4F1JWlb\n  [Quoting @visakanv: @MsHortonTweets people don't wanna make better choices, they wanna make shitty choices and then complain about the shitty outcomes]\n↓\n1231931479380262912 [2020-02-24] @visakanv 💜 8\n31. https://t.co/DwKeeMqgYF\n  [Quoting @visakanv: civilization is a sort of iterated, recursive potty training]\n↓\n1231997762415128576 [2020-02-24] @visakanv 💜 12 [(SEED) type=quote_of_root]\n32. https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1233632073585319937 [2020-02-29] @visakanv 💜 3\n33. https://t.co/LFJrKdczGM https://t.co/LP34mdT3zb\n  [Quoting @visakanv: to think for yourself is to construct an echo chamber for yourself]\n↓\n1393898043120914439 [2021-05-16] @visakanv 💜 4\n34. https://t.co/umSTMvpb8A\n  [Quoting @visakanv: it is critically important and absolutely pointless to oscillate between extremes]\n↓\n1393898128319795201 [2021-05-16] @visakanv 💜 10\n35. https://t.co/WyN5s9TPZR\n  [Quoting @visakanv: if you ever think someone isn’t creative you should look at their excuses]\n↓\n1398371426403487748 [2021-05-28] @visakanv 💜 13\n36. https://t.co/btJH2OatZb\n  [Quoting @visakanv: Most men with ambition have no taste and most men with taste have no ambition]\n↓\n1398613955489132545 [2021-05-29] @visakanv 💜 13\n37. https://t.co/zvdJb3RVSJ\n  [Quoting @visakanv: inside every hot girl there is a skeleton]\n↓\n1406520502068277249 [2021-06-20] @visakanv 💜 4\n38. https://t.co/AXqk3fvNwb\n  [Quoting @visakanv: nice norms u got there, it would be a shame if someone were to transgress them]\n↓\n1425543267924385795 [2021-08-11] @visakanv 💜 2\n39. https://t.co/eUl2HI7ntx\n  [Quoting @visakanv: if you’re serious about thinking about your positioning, it can change your positions]\n↓\n1425545545771220992 [2021-08-11] @visakanv 💜 8\n40. https://t.co/UkMsnFjOLh\n  [Quoting @visakanv: this is not a practice life]\n↓\n1442567185755348998 [2021-09-27] @visakanv 💜 3\n41. https://t.co/PnFcHbRFQK\n  [Quoting @visakanv: @eigenrobot many intelligent people are *advanced* bad at thinking]\n↓\n1473300842732089350 [2021-12-21] @visakanv 💜 4\n42. https://t.co/m2b1UG5ODO\n  [Quoting @visakanv: @AgnesCallard nobody deserves anything]\n\n===\n\n1195656478654267392 [2019-11-16] @visakanv 💜 154 🔁 14 💬 2\nI notice that @Twitter is experimenting with how it presents threads, prioritizing showing other people's replies to a thread over the continuity of the thread itself, making it look like threads end sooner than they do\n\nI knew the golden age of threading would end eventually https://t.co/7IwDM3XHOX\nImages:\n  - [Image #0] The image is a screenshot of a tweet thread by Visakan Veerasamy. The tweet thread is as follows:\n    \n    Visakan Veerasamy (@visakanv) \n    \"I saw someone tweet 'I wish smart writing came to me as easily as dumb tweeting' and I am here to share with you my strategy for using the latter to precipitate the former\n    4:05 PM · Jan 24, 2019 · Twitter for iPhone\"\n    \n    Visakan Veerasamy (@visakanv) - Jan 24\n    Replying to @visakanv\n    \"The first rule of smart writing is you must recognise what smart writing is. Sounds simple enough but most people fail at this. Lots of smart writers get their good quotes ignored and their tepid quotes celebrated. This lowers everybody's standards. Orwell warned about this\"\n    \n    Visakan Veerasamy (@visakanv) - Jan 24\n    \"If you want to write well, I think you may need to spend more time identifying good writing than actually writing. At least at the start, but IMO, *always*. You need to develop your aesthetic taste re: what good *is*. No one else can do this for you\"\n    \n    Visakan Veerasamy (@visakanv) - Dec 18, 2018\n    \"steve jobs said a bunch of really insightful things over the years, but it can be surprisingly tedious to find them because there's so much noise from people over-quoting the inspirational babble. I find myself thinking this a few times a year; probably worth making my own set\"\n    \n    The tweet has 31 retweets and 136 likes.\n↓\n1195777305135603712 [2019-11-16] @visakanv 💜 78 🔁 4\n@Twitter wow so I've had 7 hours to get used to this and I really fucking hate it. it's completely broken my experience of twitter. I make threads so that I can revisit them. now I have to click dozens of times to expand my own replies on my own threads. seriously fuck this\n↓\n1195778353208279040 [2019-11-16] @visakanv 💜 56 🔁 1\nSeriously FUCK THIS https://t.co/nh0fFcK3Yc\nImages:\n  - [Image #0] The image shows a side-by-side screenshot of a user's Twitter feed on a phone, with the left side displaying a tweet thread and the right side showing the Twitter homepage.\n    \n    The left side of the image displays a tweet thread from the user @visakanv, who is expressing frustration with Twitter's new threading feature. The tweets are dated January 24, 2019, and November 17, 2019, and include text that reads: \"I notice that @Twitter is experimenting with how it presents threads, prioritizing other people's replies to a thread over the continuity of the thread itself, making it look like threads and sooner than they do\" and \"I know the golden age of threading would and eventually\". The second tweet says, \"I saw someone tweet 'I wish smart writing came to me as easily as dumb tweeting' and I am here to share with you my strategy for using the latter to precipitate the former\". The third tweet is a reply to the second one, expressing frustration with having to click multiple times to expand replies in their own threads.\n    \n    The right side of the image shows the Twitter homepage, with a search bar at the top and a list of trending topics below it. The trending topics include \"#stayhomechallenge2\" with 82.3K tweets, \"ゆるキャラグランプリtheckey\" with 32.1K tweets, \"LIPPS\" with 61.4K tweets, \"競いおーっ\" with 113K tweets, and \"ジャニーズ\" with 37.8K tweets. The background of the image is dark, indicating that the phone is in dark mode.\n↓\n1195780053226754048 [2019-11-16] @visakanv 💜 63 🔁 1\nI think this might actually be the end of the @visakanv twitter thread show. if I need to spend minutes just to LOAD my own threads so I can READ them, I'm going back to blogging\n↓\n1195788103836811265 [2019-11-16] @visakanv 💜 59 🔁 1\nFound a workaround\n\nI have to search for my threads... in incognito\n\nAdds a whole unnecessary layer of fuckery but ok whatever https://t.co/Dm9oEn6PMT\nImages:\n  - [Image #0] The image is a screenshot of a computer screen displaying a Twitter search result for the phrase \"aoc zuck.\" The search result shows a tweet from Visakan Veerasamy (@visakanv) dated October 23, with the text \"aoc zuck\" and 1 like, 10 retweets. To recreate this image, follow these steps:\n    \n    * Open a web browser and navigate to Twitter.com.\n    * Log in to your Twitter account or use an incognito window if necessary.\n    * Type \"aoc zuck\" in the search bar and press enter.\n    * The search results page will display a list of tweets containing the searched phrase.\n    * Locate the tweet from Visakan Veerasamy (@visakanv) dated October 23.\n    * The tweet should have 1 like and 10 retweets.\n    \n    The image is related to a tweet complaining about having to search for threads in incognito mode, implying that the user is having trouble accessing certain content on Twitter due to some issue, possibly related to their account or browsing history.\n↓\n1196037285038325760 [2019-11-17] @visakanv 💜 90 🔁 1 💬 1\ntwitter: let's optimize for replies by breaking threads!\n\npeople: *start replying to earlier tweets in my threads with bits that are already addressed later in those now-broken threads*\n\nme: *starts replying by quote-tweeting later tweets from my threads*\n\ntwitter: this is good!\n↓\n1196038612451676162 [2019-11-17] @visakanv 💜 844 🔁 251 💬 22 [(SEED) type=root]\nTHE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE\n├── 1223959762020130818 [2020-02-02] @visakanv 💜 74 🔁 1\n│   https://t.co/j2w8zYb0Yj https://t.co/o1WXfSTN0C\n│     [Quoting Tweet 1056963654581596160 (missing)]\n├── 1489968012224389122 [2022-02-05] @sharanvkaur 💜 1\n│   @visakanv https://t.co/b9erldkv2d https://t.co/GWCHDFZ4df\n│     [Quoting Tweet 1489328529133211651 (missing)]\n├── 1701931662366462367 [2023-09-13] @Malcolm_Ocean 💜 2\n│   @visakanv https://t.co/iXKLjTRH5s\n│     [Quoting @ulyssepence: @GabriellaG439 When we make it less obvious our ads are ads, engagement with them goes up! Wow A/B testing can help us arrive at the best user experience. -Social Media Companies  🤦‍♂️]\n└── 1744443298276663603 [2024-01-08] @danielbrottman 💜 4\n    @visakanv evergreen tweet\n    ↓\n    1744445093296128180 [2024-01-08] @danielbrottman 💜 2\n    @visakanv i only started writing on twitter a couple years ago, so seeing how threads used to load in their entirety is like - i didn't know what i'd been missing, AND, that feels like a quaint problem compared now when they're not showing that tweets are part of a thread at all!\n\n===\n\n1196041193160728576 [2019-11-17] @visakanv 💜 20 🔁 2 [(SEED) type=quote_of_root]\nwhat products come to mind when you see this? I think of facebook (notifications), and evernote (they kept... trying to get me to upgrade? I can't remember. I stopped using them) https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1196049008591917056 [2019-11-17] @easoncxz 💜 1\n@visakanv Like literally any VC-funded business? 1Password upcoming.\n↓\n1196049268336779267 [2019-11-17] @visakanv \n@easoncxz :(\n↓\n1196049524449394690 [2019-11-17] @easoncxz \n@visakanv 😂 :(\n\n===\n\n1198492305344188416 [2019-11-24] @visakanv 💜 74 🔁 9\nI still have a lot of feelings about twitter breaking threads. they really broke the best thing about this site. I was telling my wife, it really feels like I let myself fall in love with something and it just kicked me in the gut for it. I don't expect anybody to relate to this\n↓\n1198492706869088256 [2019-11-24] @visakanv 💜 33\npart of \"visa is that guy who has a thread for everything\" also means \"visa is that guy whose second brain depends on twitter not breaking threads\". ie I feel like somebody just came into my personal library, which I've meticulously put together, and just rampaged through it https://t.co/XiDpcFit94\nImages:\n  - [Image #0] The image shows a still from the TV show \"Friends\" featuring the character Chandler Bing, played by Matthew Perry. He is holding a large stack of papers and looking unimpressed.\n↓\n1198493105759981568 [2019-11-24] @visakanv 💜 47 💬 1\nfeeling sad, angry, disappointed, frustrated etc is manageable\n\nfeeling like an idiot for trusting a profit-seeking corporation with my thoughts... that's the hard part\n\nmy greatest strength is also my greatest weakness and sometimes it really fucking sucks like this\n↓\n1198493374262566912 [2019-11-24] @visakanv 💜 10 🔁 2 [(SEED) type=semantic_search]\nlook at how they massacred the user experience https://t.co/OeMpvQ0VXd\nImages:\n  - [Image #0] The image is a screenshot of a tweet from Lucy McBath, a mother who lost her son Jordan Davis in a shooting incident. \n    \n    To recreate this image, follow these steps:\n    * Create a tweet with a dark background and white text.\n    * Include a photo of Lucy McBath, a middle-aged woman with dark hair, with a somber expression.\n    * Add a photo of a poster or memorial with a picture of Jordan Davis, a young man wearing a red shirt, on the left side of the image.\n    * Write the tweet text: \"Today marks seven years after my son, Jordan, was shot for playing his music. This is always the hardest day of the year for me. So this year, I want to share a letter I wrote to my son. Dear Jordan: [1/x]\".\n    * Include the timestamp \"11:47 PM · Nov 23, 2019\" and the text \"Twitter for iPhone\" below the tweet.\n    * Add engagement metrics: \"10.9K Retweets\" and \"47.4K Likes\".\n    * Include a reply from Nicole Sano, with her Twitter handle \"@NicoleLSano\", saying \"@threadreaderapp unroll\" with 1 reply, 8 retweets, and 8 likes.\n↓\n1198493888920506368 [2019-11-24] @visakanv 💜 17\nI mean, maybe all of this is premature. maybe they'll fix it. maybe I'm having a bunch of feelings for no reason. but I feel betrayed all the same. And it's really my own assumptions, my own expectations that are kicking my ass. Lol\n↓\n1198494232287203328 [2019-11-24] @visakanv 💜 21\n\"But Visa all the stuff is still there? it just takes longer? and it's harder to find?\"\n\nI KNOW!! but I depended on having easy access to it, I depended on being able to access everything in seconds. Fuck me for getting complacent, getting used to magic and expecting it to last\n↓\n1198495053150220289 [2019-11-24] @visakanv 💜 34\nAnyway. I'll be fine. I just have a lot of feelings. Twitter was so well-positioned to be the future of hypermedia. I actually introduced dozens of people to this website and taught them how to thread. Feels a little like I betrayed them all. Yes I am very dramatic\n↓\n1198496295368835072 [2019-11-24] @visakanv 💜 23\nall will be lost in time, like tears in rain https://t.co/hJ53FKS1Br\nImages:\n  - [Image #0] The image is a still from the movie \"Logan\" featuring Wolverine, played by Hugh Jackman, with a shirtless torso and a contemplative expression. The text at the bottom of the image reads, \"Peaceful thoughts...\" in white font.\n\n===\n\n1204671929292140549 [2019-12-11] @Malcolm_Ocean 💜 13\nOSes &amp; ways-of-being 😍👇\n\nPart of what is messy about contemporary technology is the everythingness of everything. Hard to stay focused in reading a book while reading it on a device that's also everything else. https://t.co/xfrs2NTD4x\n  [Quoting Tweet 1120919728157888512 (missing)]\n\n===\n\n1204671940633468928 [2019-12-11] @Malcolm_Ocean 💜 4\nThe first way Complice uses modal states is by separating the daily workflow of the today page into three phases:\n\nhttps://t.co/8L5sPXB1Js\n  [Quoting Tweet 1204658580860915712 (missing)]\n↓\n1204671941703086080 [2019-12-11] @Malcolm_Ocean 💜 4\nBy separating intention-setting &amp; reflection out from do-tasks mode, Complice blocks certain user intents, &amp; in the process creates clearer contexts for when to do these different things.\n\nMore is possible here—it's still easy to fall into old patterns.\nhttps://t.co/uws5XQjYzh\n  [Quoting @Malcolm_Ocean: @QiaochuYuan @andy_matuschak &amp; while it has an \"intention\" list instead of a \"task\" list, they're still structurally/functionally very similar to tasks so it's easy to fall back into old patterns.  If you want to help develop next iteration of Complice, get in touch! My full-time focus is elsewhere atm.]\n↓\n1204671946543288320 [2019-12-11] @Malcolm_Ocean 💜 3\n2nd modal type guides momentary flow of user's choice-making to be more conscious &amp; intentional.\n\nIf you don't do something one day, instead of it staying on the list tomorrow, you have to consciously intend it again. And after a couple of days skipped, Complice starts prompting: https://t.co/s7lAvZPsC1\nImages:\n  - [Image #0] The image shows a screenshot of a task management interface. To recreate this image, start by creating a white text box with a gray border. At the top of the box, display the text \"You sure? 4x skipped...\" in black font. Below this, write the question \"If this is important, how are you going to make it happen today?\" in smaller gray text.\n    \n    In the middle of the box, show the task \"1))))) write about Goal-Crafting Intensive Workshop\" in purple font, with a large white text box underneath for input.\n    \n    At the bottom of the box, include two buttons: a gray \"Cancel\" button on the left and a purple \"Keep\" button on the right.\n↓\n1204671948028088320 [2019-12-11] @Malcolm_Ocean 💜 2\nThis adds friction—in a place where friction helps the user stay in touch with what they deeply care about 💖\n\nOften there's a reason we don't do something today, and if we don't stop to listen, we might not notice something our intuition knows.\n\nhttps://t.co/ujzxqvx36c\n  [Quoting Tweet 1204660078915260417 (missing)]\n↓\n1204671949164752898 [2019-12-11] @Malcolm_Ocean 💜 2\nSo! There are some examples of modal interfaces used to nudge users towards valuable and easily-overlookable parts of workflows, and help them curate their focus.\n\nI'm about to go abstract again, so open this link in a new tab &amp; check out Complice later 🚀 https://t.co/OCzW6dsxkN\n↓\n1204671950276177921 [2019-12-11] @Malcolm_Ocean 💜 2\nOkay, abstract again: what does nurturing design look like on the level of an operating system? There are some neat hacks that a few friends of mine have tried, to give their computer different modes, oriented to work or play or other options.\n\nEasier on desktop than on phone.\n↓\n1204671951278608384 [2019-12-11] @Malcolm_Ocean 💜 3\nWhat if you could boot up your phone into a mode where you couldn't access any of your messenger apps?\n\nWhat if you could boot it up into a mode that only had your ebook reader &amp; notes app?\n\nWhat about a mode where messages can be sent but not received? (Hard to do on OS lvl)\n↓\n1204671952247574528 [2019-12-11] @Malcolm_Ocean 💜 1\nHow long would it have taken for them to invent airplane mode if it hadn't been required by airplanes???\n\nHalf-decent do-not-disturb &amp; silence &amp; notification control just hit android a couple years ago.\n\n&amp; that's tiny stuff.\n↓\n1204671957779853312 [2019-12-11] @Malcolm_Ocean 💜 1\nWays of being. What matters.\n\nIn Complice, almost everything one does is connected to a goal/purpose. Many people then want to have those goal names/colors elsewhere to organize things.\n\nWorkFlowy, IFTTT+Hue, Gmail labels (out of date), post-its (can't find photo) https://t.co/KzurwAOEim\nImages:\n  - [Image #0] The image shows a screenshot of an inbox with a list of tasks or goals organized using a specific system. \n    \n    The text in the image is transcribed as follows: \n    \"Inbox \n    Captain's Log #bg-blue\n    Reorganization follows awareness. Sanity feels good.\n    #1CC CoStrategy & CoDesign\n    #2XX Exalt Our Chothers\n    #3CO Complice\n    #4HS Hemispheres\n    #5DB Digesting Blocks\"\n    \n    The image is a screenshot of a digital task management system, likely an email inbox or a task list, with a list of items labeled with hashtags and colored text.\n↓\n1204671959197454336 [2019-12-11] @Malcolm_Ocean 💜 2\nWhat would it look like for \"thing I care about\" to be a sort of natural object that syncs between apps, in the way that contacts, calendars, docs do?\n\nIt's tough. No matter how meaningful, any articulation of purpose is at best oversimplified and at worst a proxy.\n↓\n1204671960141185024 [2019-12-11] @Malcolm_Ocean 💜 3 [(SEED) type=quote_of_root]\nBut still; currently companies are pouring billions of dollars into optimizing their apps to hack peoples' brains to make metrics go up. Design by proxy, not by vision, purpose, or a sense of alignment with the *user's* vision, purpose, or empowerment.\n\nhttps://t.co/WtU2SSe8LB\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1204671961282097153 [2019-12-11] @Malcolm_Ocean 💜 1\nI hack twitter with userstyles &amp; userscripts so it won't fuck with me as much, but there's only so much I can do given the platform constraints.\n\nTho seriously check this 👇 out if you hate the red dot. Omg I'd go crazy using this site without this:\nhttps://t.co/IKl32Xd5lA\n  [Quoting @Malcolm_Ocean: Problem 😡 I wanting to leave a tweet open for reference or to reply to the thread... but the (1) in the title or the red dot in the favicon makes me end up checking notifications.  Solution 😎 this custom userscript I just wrote: https://t.co/QigTD8VkFM https://t.co/u7E6uIMJVc]\n↓\n1204671962481643520 [2019-12-11] @Malcolm_Ocean 💜 1\nI notice finding it hard to stay as big-picture visionary as @andy_matuschak &amp; @tristanharris  were inviting. Given that I can usually come up with a lot of ideas for improving systems, that's a sign that our whole design paradigm is busted in some way I haven't seen thru yet 🤯\n\n===\n\n1212301695574626304 [2020-01-01] @visakanv 💜 118 🔁 12 💬 2\n⏮ 2019 tweets https://t.co/LuRYyxHqDk\n  [Quoting @visakanv: australia fires tweet]\n\n===\n\n1223625686604115968 [2020-02-01] @visakanv 💜 14\ninternal monologue tweet\n↓\n1223836415248584704 [2020-02-02] @visakanv 💜 12\nyud mirror selfie tweet\n↓\n1223976423922159619 [2020-02-02] @visakanv 💜 15\npalindrome date tweet\n↓\n1224255058256134144 [2020-02-03] @visakanv 💜 10 🔁 1\ngreat grandpa’s chinese egg monopoly tweet\n↓\n1224334439326441472 [2020-02-03] @visakanv 💜 6\nshakira superbowl tweet\n↓\n1224334450621702144 [2020-02-03] @visakanv 💜 5 🔁 1\nbaby nut tweet\n↓\n1225055136877178880 [2020-02-05] @visakanv 💜 5\niowa caucus tweet\n↓\n1225171017200390145 [2020-02-05] @visakanv 💜 5\ndiverse classic novel covers tweet\n↓\n1228217117582823425 [2020-02-14] @visakanv 💜 11\nrat / postrat tweet\n↓\n1228218525501648897 [2020-02-14] @sharanvkaur 💜 2\n@visakanv twitter needs to fix its shit and not let me click things https://t.co/a3FZkieCO8\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1228219597913915398 [2020-02-14] @visakanv 💜 2 [(SEED) type=quote_of_root]\n@sharanvkaur https://t.co/NFEL6NBknM https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1254462139185553409 [2020-04-26] @visakanv 💜 44 🔁 2\na thing that is not obvious to most casual twitter users most of the time is that twitter is itself an ingroup\n\npeople only ever seem to realize this when there are cross-platform altercations, like 4chan vs tumblr back in the day\n↓\n1254462470338428928 [2020-04-26] @visakanv 💜 12\nask my wife, I am the naive Internet wanderer that goes from sphere to sphere looking for people who realize that if they joined forces they could become more powerful than anybody can even imagine\n\nhttps://t.co/Wqp6HoA63W\n  [Quoting @sharanvkaur: honestly, my beloved dumbass has been trying to get people to be kind for years??? https://t.co/nHVArpiGh7]\n↓\n1254463613730873344 [2020-04-26] @visakanv 💜 33\nwhat I'm saying is that while twitter is pretty damn good, if 100 of us got together with the intent of making it REALLY FUCKING GREAT, the rest of the internet would have *no choice* but to take notice. YouTubers would start making videos about the threads that transpire here\n↓\n1254464671131688960 [2020-04-26] @visakanv 💜 20 🔁 1\nunfortunately I know from experience that being too explicit about a call-to-action re: this sort of thing tends to attract inexperienced players, who tend to crash and burn. so... as you were, lol. I'm just drinking my tea over here and thinking about life\n↓\n1254466689896505351 [2020-04-26] @forthrighter 💜 2\n@visakanv what patterns do the experienced players see, that lead them not to answer the call to action?  Or is it just that there are vastly more inexperienced players than experienced\n↓\n1254466873917231105 [2020-04-26] @visakanv 💜 1\n@forthrighter experienced players have known disappointment, failure, betrayal, all that negative stuff. so they're wary, and wait for substantial proof of work first\n↓\n1254467783741636609 [2020-04-26] @forthrighter 💜 1\n@visakanv what if you were successful? Might this attract an unwanted attention which could undo the tight-knit dynamic that led to the epic threads?\n\nStep 1: Assemble army\nStep 2: epic threads\nStep 3: (wide recognition of awesomeness)\nStep 4: ?\n↓\n1254468806321278981 [2020-04-26] @forthrighter 💜 1\n@visakanv fundamentally platforms aren't here to cultivate good content it's views. I like your content, but I will be honest my man, with your org. approach and vision, you CAN bring it about, but you might be more effective as a twitter product manager than as a tweeter\n↓\n1254469069803118593 [2020-04-26] @visakanv  [(SEED) type=quote_of_root]\n@forthrighter hahaha twitter would not want me as a PM https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1254469611254435841 [2020-04-26] @forthrighter 💜 1\n@visakanv I struggle with cynicism over these platforms because I suspect you're right. You'd improve content and totally fuck up the ad clickthrough rates. Like a guy who invents better car tires that need replacement 1/2 as often, I mean, HOW DARE YOU\n↓\n1254469957338845184 [2020-04-26] @visakanv 💜 2\n@forthrighter I remain optimistic about individuals even as I am pessimistic about platforms. the end-game requires building real relationships with real people. platform failures can be a painful hit, but if the relationships are strong enough, people will seek you out on alternatives\n↓\n1254471432848969729 [2020-04-26] @forthrighter \n@visakanv So basically growing your YouTube channel is your \"Twitter Armageddon\" backup plan.  😅\n↓\n1254471739104301056 [2020-04-26] @visakanv \n@forthrighter it's a little more complicated than that, but technically that's correct\n\n===\n\n1254569257758670853 [2020-04-27] @visakanv 💜 37 🔁 1\nI wish SV were obsessed with user experience https://t.co/3TWnYotf2q\n↓\n1254569618431021056 [2020-04-27] @visakanv 💜 14 [(SEED) type=quote_of_root]\nReality: https://t.co/NFEL6NBknM https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1254571857019154432 [2020-04-27] @visakanv 💜 29\nThe reason he says “sophisticated networks AND GREAT USER INTERFACES” is because a power tool with a shitty user interface goes unused\n\nIe, improving user interface *is* tech innovation, because it makes tech *usable* https://t.co/qIJx0kTDbb https://t.co/omW1EbZZkS\n  [Quoting @garrytan: Steve Jobs in 1990: Interpersonal networked computing (through great software and UX) will give rise to decentralized orgs that allow people at every level work together remotely  Crazy how Jobs could see clearly 30 yrs into the future!  https://t.co/fqewFraHyC https://t.co/iPsLx0R7qI]\n↓\n1254573401458372608 [2020-04-27] @visakanv 💜 26\nDrew Houston: I made a thing\n\nHN commenter: if you use linux you can already build this quite trivially... just FTP... mount locally with curlftpfs...\n\nDrew: that’s a shit user experience. This is plug &amp; play\n\nDropbox: $8.65B market cap, and more importantly, my mom can use it https://t.co/XYzvmfSvip\nImages:\n  - [Image #0] The image is a screenshot of a Hacker News (HN) comment section discussing Dropbox, a file-sharing service. The main text is a comment from user BrandonM on April 5, 2007, responding to a post about Dropbox.\n    \n    To recreate this image, follow these steps:\n    \n    * Start with a light gray background.\n    * At the top, include the title \"My YC app: Dropbox - Throw away your USB drive (getdropbox.com)\" in black text.\n    * Below the title, display the following information in smaller gray text: \"104 points by dhouston on Apr 4, 2007 | hide | past | web | favorite | 71 comments\".\n    * The main content is a comment from BrandonM on Apr 5, 2007, with the text:\n    \t+ \"I have a few qualms with this app:\" followed by three numbered points:\n    \t\t- \"For a Linux user, you can already build such a system yourself quite trivially by getting an FTP account, mounting it locally with curlftpfs, and then using SVN or CVS on the mounted filesystem. From Windows or Mac, this FTP account could be accessed through built-in software.\"\n    \t\t- \"It doesn't actually replace a USB drive. Most people I know e-mail files to themselves or host them somewhere online to be able to perform presentations, but they still carry a USB drive in case there are connectivity problems. This does not solve the connectivity issue.\"\n    \t\t- \"It does not seem very 'viral' or income-generating. I know this is premature at this point, but without charging users for the service, is it reasonable to expect to make money off of this?\"\n    * The text is in black, and the background remains light gray throughout.\n    \n    By following these steps, you can recreate the image accurately.\n├── 1254575857869312000 [2020-04-27] @visakanv 💜 34 🔁 5\n│   Technology is about making tools\n│   \n│   There are two parts to any tool: The part that fits the problem, and the parts that fits the user\n│   \n│   A better user experience = a better tool\n│   \n│   https://t.co/mwon47BDRj https://t.co/6f8WoLiOtD\n│     [Quoting @visakanv: the tool should fit the user https://t.co/PfgUVOGVwK]\n│   ↓\n│   1254581930487508992 [2020-04-27] @easoncxz 💜 2\n│   @visakanv 🤯 for all the time I've spent using and creating tools, I don't think I've ever come across this idea (\"a part that fits the problem, a part that fits the user\"). It's so obvious.\n│   ↓\n│   1254582329483247627 [2020-04-27] @visakanv \n│   @easoncxz Lots of things are simpler than people realize. One that blew my mind was from Andy Grove: if you’re not doing something, it’s either because you’re unwilling or unable (or both). It’s can only be those so things. You have to fix your motivation or train your ability. That’s it\n├── 1254645311777026048 [2020-04-27] @RunbyAtwirl 💜 1\n│   @visakanv Someone: \"Hey, I'm starting this company where I build houses for people!\"\n│   \n│   HN: \"Sorry, but building a house is actually quite trivial if you're a builder, so I don't see why anyone would pay for your services.\"\n└── 1254735139600510977 [2020-04-27] @sjmoody \n    @visakanv If we got flying cars you’d figure out how to teach your mom to use them\n    ↓\n    1254739264018870274 [2020-04-27] @visakanv \n    @sjmoody my mom would get herself killed in a flying car in a week\n\n===\n\n1256755911684583430 [2020-05-03] @visakanv 💜 124 🔁 24\ndating apps don’t really want you to succeed, they mostly want you to keep using the app https://t.co/7r5JuP3SxH\n  [Quoting Tweet 1256729002598793216 (missing)]\n↓\n1256756037375279105 [2020-05-03] @visakanv 💜 15 [(SEED) type=quote_of_root]\nhttps://t.co/NFEL6NBknM https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1256756235052826626 [2020-05-03] @visakanv 💜 6\n(I could be wrong idk. Just guessing)\n\n===\n\n1264454938400133129 [2020-05-24] @visakanv 💜 18 [(SEED) type=quote_of_root]\ntwitter I am already one of your heaviest users, I don't need... sigh https://t.co/r7X1AFoy6F https://t.co/s97loMSwsD\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1264455230793461760 [2020-05-24] @visakanv 💜 10\nhttps://t.co/OBOi3j8G3g\n  [Quoting @visakanv: @eigenrobot Try again https://t.co/lEnuQl8l7o]\n\n===\n\n1276110456373952512 [2020-06-25] @visakanv 💜 13\nmy google drive tells me that I'm using 15.7 GB out of 17GB and suggests I buy storage. I'd rather get rid of stuff. But when I click on Storage, there are only 171 files – 3 of which are 23 MB, ~160 of which are under 1MB. Where's the 15 GB coming from? I'm guessing email...?\n↓\n1276110767700369408 [2020-06-25] @visakanv 💜 4\naha yes I think this is it. thx https://t.co/vL9RwAPqO5\n  [Quoting @gnostrils: @visakanv might be Photos, too]\n↓\n1276111562122485760 [2020-06-25] @visakanv 💜 14 [(SEED) type=quote_of_root]\nalso just got 1 GB from clearing my trash, thanks friendly DM person. Google really doesn't make this obvious, which I suppose is to boost conversion rates for their monthly storage subscription sales\n\nhttps://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1276754996583956480 [2020-06-27] @yashkaf 💜 139 🔁 9 💬 1\nIn 2014 @okcupid let me search users, sort by match %, and message. I went on many great dates, and happily paid for A-list. \n\nThen they made messaging swipe-contingent. Then they degraded the match by spamming political questions. Today they removed the search and sort feature.\n↓\n1276987305912401922 [2020-06-27] @Malcolm_Ocean 💜 6 🔁 1 [(SEED) type=quote_of_root]\n@yashkaf @okcupid https://t.co/WtU2SSe8LB\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1299312090226790401 [2020-08-28] @DRMacIver 💜 6\nI don't really understand why hold music is so reliably crackly with some companies. It's really weird.\n↓\n1299337056598896641 [2020-08-28] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@DRMacIver my theory is that they deliberately make it unpleasant to frustrate people into hanging up https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1299337576227119106 [2020-08-28] @visakanv \n@DRMacIver would be interesting to contrast with say any service where the person calling is going to spend substantial money- I bet any hold lines on that are great\n\n===\n\n1312706469628796929 [2020-10-04] @visakanv 💜 68 🔁 1 [(SEED) type=quote_of_root]\nme: [painstakingly puts people in lists so I can browse their tweets on my own time, rather than see everything on the timeline]\n\ntwitter, deciding to insert those tweets into my timeline anyway: https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1312707225404624897 [2020-10-04] @visakanv 💜 33 🔁 1\nI literally have started doing a “filter:follows since:2020-10-01” search and sort by latest to see my timeline without all of twitter’s interference that I didn’t ask for\n\n===\n\n1328722479037247489 [2020-11-17] @ultimape 💜 2\nGet your copy-cat features here. #fleets https://t.co/x5JUF2SLKw\n  [Quoting @ultimape: Facebook is using people's identity to rollout new features like a snapchatesque profile filter system, and stickers. Digital Peer Pressure?]\n↓\n1328723208544149504 [2020-11-17] @ultimape 💜 3\nI am on twitter to read tweets. Not to partake in another me-too addiction mechanic by using time-sensitive preferential content to boost engagement. I it's been almost 2 years and I still hate this feature in youtube https://t.co/XWNpVEFgLy.https://t.co/SMLQWmrwaz\n  [Quoting @ultimape: Hearing rumors of @Instagram stories compared to @Snapchat, on social platform where @pmarca (@facebook's board?) popularized tweetstorms. 🤔]\n↓\n1328724010448859136 [2020-11-17] @ultimape 💜 4\nToday: Scraping my Twitter DMs because there is no way to export all the hours of writing I put into them.https://t.co/VWKyDOiXzp\n  [Quoting Tweet 1328711774435205121 (missing)]\n↓\n1328724582925217801 [2020-11-17] @ultimape 💜 2\nAs seen in a fleet shared as a shake-cam recording on mastodonhttps://t.co/oyvwDldgnu\n  [Quoting @ultimape: A tiktok montage of youtube videos of twitter threads of tumblr memes paraphrased from reddit that were passed on via [insert endless chain of transfer ] of a story about a trickster god symbolized as an armadillo pretending to be a cat.]\n↓\n1328756526312468486 [2020-11-17] @ultimape 💜 4\nI am glad I am not alone in my disgust for this new feature.https://t.co/wpzVV764JI\n  [Quoting Tweet 1328754360990437377 (missing)]\n↓\n1328807518110412800 [2020-11-17] @ultimape 💜 3 [(SEED) type=quote_of_root]\n🔁https://t.co/q28UoI041D\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1328811488056930310 [2020-11-17] @ultimape 💜 2\nInsightful tweet speculating at the possible dynamics behind feature copy-cat'ing.https://t.co/JHPRYabqwx\n  [Quoting Tweet 1328793164086448128 (missing)]\n↓\n1328811563269099522 [2020-11-17] @ultimape 💜 2\nReminds me of https://t.co/VA5ulFSHUD which also describes a similar dynamic around innovation in terms of 'flexibility'.TL;DR: https://t.co/nFzzGzCRaW\n  [Quoting Tweet 1162255935638667266 (missing)]\n↓\n1328811691602227200 [2020-11-17] @ultimape 💜 1\nMAU go up.\n↓\n1328813022161342468 [2020-11-17] @ultimape \nA service has intrinsic FOMO for users due to non-algorithmic timeline.Twitter: \"hey, lets add an algorithmic timeline!\"Users: Cool! I don't have to login to twitter all the time because it'll show me stuff whenever....Twitter: Muh engagement metrics.https://t.co/7FHrdsqiyk\n  [Quoting @ultimape: \"as opposed to an automatic connected-is-awlays-implicitly-good response\"https://t.co/yf7GM9kz4O via @CurlyChimera https://t.co/WOGDX4I8l1]\n\n===\n\n1330984685992722433 [2020-11-23] @visakanv 💜 1329 🔁 256 💬 10\nCan’t sleep, time to do a fresh reboot of VV’s talking points\n\n===\n\n1330996249793679360 [2020-11-23] @visakanv 💜 244 🔁 28\n18. Nothing is edgier than being earnest\n↓\n1330996509786083328 [2020-11-23] @visakanv 💜 256 🔁 23 💬 8\n19. there is no advice that cannot be creatively weaponized in some way to justify getting back on your bullshit\n↓\n1330996643794014213 [2020-11-23] @visakanv 💜 267 🔁 16\n20. people wanna be fuckable more than they wanna fuck\n↓\n1330996857724538882 [2020-11-23] @visakanv 💜 80 🔁 5\n21. narcissist PR works because people can’t help taking the bait every time\n↓\n1330996960640126977 [2020-11-23] @visakanv 💜 166 🔁 5\n22. joy is freedom from the shackles of narrow utilitarianism\n↓\n1330997070606438400 [2020-11-23] @visakanv 💜 307 🔁 37\n23. self-loathing requires that you participate in the delusional conceit that you know who you are\n↓\n1330997177674461186 [2020-11-23] @visakanv 💜 234 🔁 18\n24. fucking is labor, fuckability is capital\n↓\n1330997308448600064 [2020-11-23] @visakanv 💜 230 🔁 17\n25. thinking is easy, information architecture is hard\n↓\n1330997373359669248 [2020-11-23] @visakanv 💜 299 🔁 19\n26. you can’t think your way out of a courage deficit\n↓\n1330997547159044097 [2020-11-23] @visakanv 💜 232 🔁 34 💬 3\n27. people contain multitudes, coherence is fascism\n↓\n1330997803410018304 [2020-11-23] @visakanv 💜 131 🔁 5 [(SEED) type=quote_of_root]\n28. https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1330998738937020417 [2020-11-23] @visakanv 💜 151 🔁 9 💬 1\n29. imagination deficits rule everything around me\n↓\n1331000135954829313 [2020-11-23] @visakanv 💜 351 🔁 37\n30. real ambition is something far beyond mere prestige and accolades. real ambition is about serving your deepest values at the highest level possible. it is certainly dangerous if it isn’t intertwined with a genuine love for humanity\n↓\n1331000887477604357 [2020-11-23] @visakanv 💜 216 🔁 10\n31. curiosity is a tiny spark that can develop into a powerful flame. unfortunately it often gets stamped out of lots of kids. this is a crime against humanity\n↓\n1331001874695163906 [2020-11-23] @visakanv 💜 289 🔁 23\n32. Never downplay your work. Never be the one to sabotage your success. There are more than enough obstacles in the world to challenge you without you creating your own\n↓\n1331002084603224064 [2020-11-23] @visakanv 💜 143 🔁 14\n33. One must imagine Sisyphus LOL-ing\n↓\n1331002744077836289 [2020-11-23] @visakanv 💜 365 🔁 33 💬 1\n34. Boredom is a bug of the mind. Very specifically, a tired mind in a cluttered space with unclear purpose and unrealistic expectations.\n\nI’ve thought about this a *lot*, I choose all of those words very carefully\n├── 1331003236451422208 [2020-11-23] @visakanv 💜 443 🔁 29\n│   35. If you’re trying to get healthy, drinking a glass of water and going for a walk will serve you much better than spending time researching obscure details about nutrition and exercise. Figure out a good-enough next step and execute it. This applies to practically everything\n│   ↓\n│   1331003957846523904 [2020-11-23] @visakanv 💜 258 🔁 21\n│   36. Lots of problems boil down to fear. Articulate (write it down!) *precisely* what you’re afraid of, and then take steps to address them. If you’re scared of doing something big, start by doing something small and work your way up progressively\n│   ↓\n│   1331004363448360960 [2020-11-23] @visakanv 💜 147 🔁 7\n│   37. when life kicks your ass, try to accept it with as much grace as you can manage. life kicks everyone’s ass in the end\n│   ↓\n│   1331004784204161024 [2020-11-23] @visakanv 💜 117 🔁 4\n│   38. if circumstances require that you have to kick someone’s ass (eg firing someone), don’t beat around the bush. be clear, be firm, try to be kind, and absolutely do not gloat or be a dick about it\n└── 1542503391598759936 [2022-06-30] @justavagrant_ \n    @visakanv have you expanded on boredom somewhere else i could read?\n\n===\n\n1333327443495534592 [2020-11-30] @visakanv 💜 54 🔁 2 [(SEED) type=quote_of_root]\nInstagram, swapping out the likes/notification tab for a shopping tab which links to a bunch of meh stores with meh products, that lots of people probably accidentally click through by accident out of muscle memory: https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1333338126866022400 [2020-11-30] @visakanv 💜 10\n“accidentally click through by accident” https://t.co/lY88eoXK55\nImages:\n  - [Image #0] The image depicts a white, furry creature with a puzzled expression sitting on a brown box. The creature has a round head, small eyes, and a short snout, with its arms and legs outstretched, and its tail raised behind it, and is labeled \"BRUH\" at the bottom.\n\n===\n\n1363541263023149056 [2021-02-21] @visakanv 💜 69 🔁 2\nthere are people in social groups that probably shouldn’t interact, for both of their sanity’s sake- bc of their different experiences and coping mechanisms etc, but if they have mutual friends, Twitter will insist on smooshing them against each other and send everyone to hell\n↓\n1363542658572902405 [2021-02-21] @visakanv 💜 21 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1368823614590443522 [2021-03-08] @visakanv 💜 76\nA thing that is not really my business to talk about + I can’t stop periodically obsessing about was how amateurish makeup and photography was in the late 90s / early 2000s. Idk if it was different earlier than that, but Instagram changed the game tremendously\n\n===\n\n1368824320319913996 [2021-03-08] @visakanv 💜 30\nEvery so often I google pics of singaporean magazine covers etc from the early 2000s, just to look at it again - it was so bad. But it feels like it would be rude to bring that stuff up. But it also feels like important... media studies material. I might make a video maybe\n↓\n1368827903924834309 [2021-03-08] @visakanv 💜 32\nthis is kind of one facet of what I’m talking about. I remember it looking weird in 2003 too so it’s not just a fashion trend evolution  thing https://t.co/iSWTPTXuWB\n  [Quoting Tweet 1011670529793814528 (missing)]\n↓\n1368828859987075076 [2021-03-08] @visakanv 💜 16\nMs Singapore Universe 2000 vs 2017 https://t.co/BiFnTTa8Jk\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1568646940908486657 [2022-09-10] @sharanvkaur 💜 1\n@visakanv oh god the blue eyeshadow red lipstick gives me horrifying flashbacks to prom night\n↓\n1568647416760643585 [2022-09-10] @visakanv \n@sharanvkaur that in turn reminds me i wrote a whole article for poached magazine about the popes and sq air stewardesses... now poached is gone lmao sadface\n↓\n1568649743861166084 [2022-09-10] @sharanvkaur 💜 3\n@visakanv awwww i liked ur poached pic 😍😍😍 https://t.co/6gWe7crNHT\nImages:\n  - [Image #0] The image is a screenshot of a webpage from Poached Magazine, featuring an author profile for Visa, a perspective writer. \n    \n    The top of the page displays a browser toolbar with a URL and navigation buttons. Below this, there is a black-and-white photograph of a man holding a sign that reads \"POACHED\" in front of a mugshot background. The man has short dark hair and is wearing a dark t-shirt with a graphic design on it.\n    \n    Below the photo, the text \"VISA\" appears in bold, followed by \"Perspective Writer.\" in smaller font. A brief bio describes Visa as someone who enjoys discussing abstract concepts, politics, religion, and other taboo topics. It also mentions his aspirations to write the Great Singaporean Novel and his tendency to annoy his wife by staring listlessly into space. The bio concludes with links to Visa's website (visakanv.com) and Twitter handle (@visakanv). \n    \n    The overall design of the page is clean and simple, with a white background that allows the content to take center stage.\n↓\n1568650640104255488 [2022-09-10] @sharanvkaur \n@visakanv hahahahahahahahah it lives!!! https://t.co/tEGt7h1YnT\n↓\n1568651124651229184 [2022-09-10] @sharanvkaur 💜 1\n@visakanv damn you rly put sq stewardesses, the pope, david marshall, prince william, aishwarya all in one article 😳\n↓\n1568651791457480704 [2022-09-10] @visakanv \n@sharanvkaur the world is not ready for my essays\n↓\n1568652204315389953 [2022-09-10] @sharanvkaur 💜 1\n@visakanv why time flat circle https://t.co/czcpIlvWpS\nImages:\n  - [Image #0] The image is a screenshot of a blog post titled \"BOYCOTTING MY FAVOURITE WESTERN FOOD STORE.\" The title is displayed in bold, black text at the top of the image, followed by a brief summary of the post in smaller gray text. \n    \n    The accompanying image shows a plate of Western-style food, featuring fried chicken, baked beans, fries, and a tomato slice on a white plate. \n    \n    Below the summary, the author's name \"Visa\" and the date \"13 December 2012\" are listed in black text. At the bottom of the image, four tags are displayed in orange text: \"Auntie,\" \"Coffeeshop,\" \"Fish And Chips,\" and \"Inflation.\"\n↓\n1568652476752220161 [2022-09-10] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@sharanvkaur https://t.co/r7X1AF7v4F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1383395420936626179 [2021-04-17] @visakanv 💜 36\nis this happening to everyone? https://t.co/A3QuXBKcnK https://t.co/spY84tUZCj\n  [Quoting Tweet 1383394928374419456 (missing)]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1383396122337505281 [2021-04-17] @visakanv 💜 17 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1417013488690483201 [2021-07-19] @sharanvkaur 💜 19 🔁 4\n\"He said \"long-cherished ideas\" like public spaces and mixed developments will likely need to be re-examined... Instead of large public spaces, it is perhaps time to plan for \"micro public spaces\"\"🥳https://t.co/v6swgxmlPC\n↓\n1434806914852872197 [2021-09-06] @sharanvkaur 💜 2 🔁 1\n\"it is precisely bc these business centres are so successful that only the more well-heeled... can afford to live here - certainly not Gen Z students and early-career knowledge workers. And Gen Zs are crucial, as to truly innovate, you need young people.\"https://t.co/NLl2YmoceW\n  [Quoting Tweet 1434705412146688008 (missing)]\n↓\n1434807482208034818 [2021-09-06] @sharanvkaur 💜 5 🔁 1\n\"The famous urbanist Jane Jacobs, who argued that \"new ideas need old buildings\", lauded how creative hubs like Greenwich Village in New York City thrived because old buildings had been re-purposed for new uses like affordable housing.\"pinch of salt though, dude's a landlord 🤑 https://t.co/hRd0bTMx9A\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1461318684241121283 [2021-11-18] @sharanvkaur 💜 2 🔁 1\n@visakanv poccasthttps://t.co/Vxi5PsJoWX\n↓\n1494289712399462401 [2022-02-17] @sharanvkaur 💜 13 🔁 1\n@visakanv \"Singapore, by most counts, has the trappings of a great city... However, on closer inspection, you’ll realise Singapore can only be the perfect city for a select group of people. For anyone else, it is a place wrought with restrictions and roadblocks.\"https://t.co/o5jL4dvl2w\n↓\n1494561727098212352 [2022-02-18] @sharanvkaur 💜 9 🔁 2\n@visakanv Singapore Songlines - Portrait of a Potemkin Metropolis (1995, Rem Koolhaas)\"Like the Dutch, who also fabricated their country, Singapore is about selling and manipulation – an ideology, a population, an island.\"https://t.co/uU2JlxbayH https://t.co/RLLY019XoE\nImages:\n  - [Image #0] The image shows a text excerpt from a book or article, likely discussing Singapore's urban development. The text reads: \n    \n    \"There is nothing less urbane, nothing less productive of cosmopolitan mixture than raw renewal, which displaces, destroys, and replaces, in that mechanistic order,\" writes Fumihiko Maki in 1964 in Investigations in Collective Form, a small but influential book that is an early Asian voice in the so far almost exclusively Western debate.27 But in Singapore it is as if Maki's diagnosis is taken as motto, becomes the new republic's blueprint, its dystopian program: displace, destroy, replace.\n↓\n1532391514181017600 [2022-06-02] @sharanvkaur 💜 2 [(SEED) type=quote_of_root]\nthere's a displace, destroy, replace x user experience degraded until metrics improve mash-up that's just out of my brain's reach https://t.co/myfFN1ScX4\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1417241968501919746 [2021-07-19] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\nI hate that in the new @SlackHQ favicon, \"unread mention/DM\" looks like ANY MESSAGES UNREAD IN THE ENTIRE SLACK WORKSPACE\n\nwhat the actual fuck? there are workspaces where I'm in dozens of channels &amp; 99%+ of the time have shit unread\n\nbelow=\n(no unread | unread | unread mention) https://t.co/WtU2SRWxn1 https://t.co/eRioTmcrgb\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\nImages:\n  - [Image #0] The image is a screenshot of a browser with multiple tabs open, showing the Slack workspace icons and a URL bar. The tabs are labeled \"Slack | Sara\", \"Slack | *fe\", and \"Slack | Agri\" with their respective Slack logos. The URL bar displays \"complice.co/m/today\". Below the URL bar, there are three buttons: a gray gear icon, \"Saved\", and \"Next Action\" in a peach-colored box, and \"Organize\".\n↓\n1417242085086793737 [2021-07-19] @Malcolm_Ocean \n@SlackHQ eventually I may figure out how to hack this bullshit with a userscript and fix it, but it'll be hard if I want to preserve having the red dot when there should be a red dot—I do want to know about DMs! (I think? hmmm...)\n\n(harder than below, for instance)\nhttps://t.co/IKl32XuGd8\n  [Quoting @Malcolm_Ocean: Problem 😡 I wanting to leave a tweet open for reference or to reply to the thread... but the (1) in the title or the red dot in the favicon makes me end up checking notifications.  Solution 😎 this custom userscript I just wrote: https://t.co/QigTD8VkFM https://t.co/u7E6uIMJVc]\n↓\n1417243257025687570 [2021-07-19] @Malcolm_Ocean \n@SlackHQ Yo @slack_design this is bad and you guys could fix it. Could make the middle icon less flashy or could make a per-workspace option to just ignore \"unreads-aside-from-mentions\" in the favicon.\n\nhttps://t.co/JpDEDqNfHr\n  [Quoting Tweet 1415024458969006081 (missing)]\n\n===\n\n1425724200132562945 [2021-08-12] @sharanvkaur 💜 13 🔁 1 [(SEED) type=quote_of_root]\nopening twitter today: https://t.co/Ves9UaC4Kd\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1427149302669840392 [2021-08-16] @visakanv 💜 293 🔁 41 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AFoy6F https://t.co/t8bHaBcJ13\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1427338551767683072 [2021-08-16] @transkatgirl  [(SEED) type=quote_of_root]\nRT @visakanv: https://t.co/r7X1AFoy6F https://t.co/t8bHaBcJ13\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1458837713931624455 [2021-11-11] @mimi10v3  [(SEED) type=semantic_search]\nUX matters! https://t.co/FJVUqA4lc8\n\n===\n\n1467079339829186563 [2021-12-04] @sharanvkaur 💜 9\nidk wtf twitter has done to my search page but it keeps auto playing loud noises pls make it stop 🛑\n↓\n1467079979296968706 [2021-12-04] @visakanv 💜 4 [(SEED) type=quote_of_root]\n@sharanvkaur https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1467080537877532675 [2021-12-04] @sharanvkaur 💜 3\n@visakanv i’m gonna scream at you unless u fix this 😠\n↓\n1467080830052802562 [2021-12-04] @visakanv 💜 1\n@sharanvkaur I do not yet have this much power\n↓\n1467082622136303618 [2021-12-04] @sharanvkaur 💜 1\n@visakanv https://t.co/1HXPnkUsIn\nImages:\n  - [Image #0] The image is a screenshot from a movie or TV show featuring a woman with red hair and a caption at the bottom. \n    \n    The woman has shoulder-length red hair and is wearing a strapless top, looking to the left with an open mouth as if she is speaking. The text at the bottom of the image reads, \"I WAS ROOTING FOR YOU WE WERE ALL ROOTING FOR YOU\" in white font with a black outline. \n    \n    The background is out of focus but appears to be a dimly lit room with a brick wall and a light fixture.\n\n===\n\n1467090668874964992 [2021-12-04] @visakanv 💜 138 🔁 5 💬 2\nslowly increasing the # of tweets I have literally hotkeyed https://t.co/l9T9Hu2Q5O\n\n===\n\n1467091292203061252 [2021-12-04] @visakanv 💜 12\ncardsright https://t.co/QCM7vrkuBW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1467091320816619523 [2021-12-04] @visakanv 💜 18\nayylmao https://t.co/cLpQFclk3N\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1467091496981598209 [2021-12-04] @visakanv 💜 8\ntxtrpg https://t.co/Zn2QbrVItr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1467092358940348417 [2021-12-04] @visakanv 💜 10\nwifemanaged https://t.co/GlLF8aRusy\n  [Quoting @visakanv: me: I love you  wife: how much  me: why this obsession with quantification   wife: what gets measured gets managed]\n↓\n1467092944049954816 [2021-12-04] @visakanv 💜 8\nmvpmodel https://t.co/PGGQhIksya\n  [Quoting @visakanv: 1/ It's very interesting and useful I think to apply the MVP model of product development to personal development. http://t.co/ef1dY1UNr8]\n↓\n1467093228818034689 [2021-12-04] @visakanv 💜 10\nkneelbeforezod https://t.co/ZQ7JbXSJVD\n  [Quoting @visakanv: https://t.co/EzaHMVnlUT]\n↓\n1467093758621609993 [2021-12-04] @visakanv 💜 4\nfriendsbook https://t.co/EEnPgdIJLB\n  [Quoting @visakanv: This is a huge part of the premise of my book... man I could probably write my book entirely out of my friends’ tweets https://t.co/7oIPeY7tVL]\n↓\n1467094065199992832 [2021-12-04] @visakanv 💜 3\ngoodreplygame https://t.co/9Fzs72xbgl\n  [Quoting @visakanv: There is an art to replying and commenting, and probably like 60-70% of people I’ve seen on the internet fail at it. The important thing is not to speak your mind, but to “support” the OP. You can support them by disagreeing well &amp; you can “mis-support”  them by agreeing stupidly]\n↓\n1467094271492644864 [2021-12-04] @visakanv 💜 6\nsurvivorbias https://t.co/tnB88b86kC\n  [Quoting @visakanv: the big lesson of survivor bias is that you should optimize for being a survivor]\n↓\n1467094883483541507 [2021-12-04] @visakanv 💜 8\nfocusmoreof https://t.co/tFaWtEZM1p\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1467095246471196674 [2021-12-04] @visakanv 💜 8 [(SEED) type=quote_of_root]\nuxdegraded https://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1467095369074962434 [2021-12-04] @visakanv 💜 8\nshittychoices https://t.co/LqS4F1JWlb\n  [Quoting @visakanv: @MsHortonTweets people don't wanna make better choices, they wanna make shitty choices and then complain about the shitty outcomes]\n↓\n1467095610218082304 [2021-12-04] @visakanv 💜 4\nfidgetyboi https://t.co/hX0Jcpet5m\n  [Quoting @visakanv: are you also a fidgety boi? you may be interested in my draft notes for Constructive ADHD:  https://t.co/e0Q0Z661CJ]\n↓\n1467096593597808641 [2021-12-04] @visakanv 💜 6\nlowresmodels https://t.co/19zdOv4ZUs\n  [Quoting @visakanv: People typically have high-res models of their own lives and lower-res models of other people’s. We are all born clueless with incredibly low-res models of the world - then we tweak and upgrade our models. Different people do this to different degrees depending on many variables]\n↓\n1468308980325752834 [2021-12-07] @visakanv 💜 3\nplansdisregard\n\nhttps://t.co/svGsmVhzzq\n  [Quoting @visakanv: @michaelcurzi Plans are worthless, planning is priceless. Spend a day making elaborate plans and then disregard them completely to make whatever you think is most compelling. Repeat monthly or quarterly]\n↓\n1468309377547333633 [2021-12-07] @visakanv 💜 1\nstorysuck https://t.co/3lLFJWHeom\n  [Quoting @visakanv: Story:  You suck at something  It bothers you, so you work hard at it &amp; many years, through lots of pain and failure  You are now good at the thing &amp; it comes easy to you   You look around and you see that most people suck at this  Why don’t they just get good?? Being good rules!]\n↓\n1468309475916279808 [2021-12-07] @visakanv 💜 3\nweirdohuh https://t.co/PEQnmKDv1b\n  [Quoting @visakanv: so you're a weirdo, huh https://t.co/XExDMfrydc]\n↓\n1468528071330304002 [2021-12-08] @visakanv 💜 9\n20. wordartist https://t.co/hbbXXkBK7p\n  [Quoting @visakanv: My goal in life is to be a word artist-magician. Words are proxies for thoughts, and a master manipulator of words is a skilled navigator in the tumultuous ocean of meaning. Moana, but the ocean is the mind of humanity https://t.co/KY27aZUguA]\n↓\n1502586244119040006 [2022-03-12] @visakanv 💜 5\n21. desirepaths https://t.co/ZeoA1ThAAq\n  [Quoting @visakanv: my twitter philosophy, which informs my content philosophy, which is informs my life philosophy, is something like... pay attention to the sticky riffs in your conversations, and embellish them, and then use them as landmarks to navigate by, and pave the desire paths https://t.co/e0sOJHf1ju]\n↓\n1502678881714593800 [2022-03-12] @visakanv 💜 2\n22. assemblemind https://t.co/RxDCpECJOh\n  [Quoting @visakanv: Now that more of us are playing the threading game:  As we compete+collaborate effectively articulate things we all care about,  And weave each other’s thoughts into our respective webs,  The desire paths will assemble a mindcity paved with the best individual thoughts]\n↓\n1502679176339288069 [2022-03-12] @visakanv 💜 3\n23. originstories https://t.co/GIO36SQpuv\n  [Quoting @visakanv: @sonyasupposedly @SHL0MS one day people will write about how this part of twitter was legendary for all the overlapping origin stories]\n\n===\n\n1479394321887498245 [2022-01-07] @sharanvkaur 💜 27 🔁 1\nwhy do companies with working websites torch them to force you onto a \"brand-new\" glitchy ass mobile app? there must be a reason but i'm not seeing it.\n↓\n1479412237840236547 [2022-01-07] @visakanv 💜 5 [(SEED) type=semantic_search]\n@sharanvkaur https://t.co/38chdFpyht\n\n===\n\n1479657378358317057 [2022-01-08] @QiaochuYuan 💜 32\nwhoa if i shake my head fast enough i can doppler-effect the sound of music\n↓\n1479891211351691266 [2022-01-08] @m_ashcroft 💜 4\n@QiaochuYuan why is there an ad here no no bad https://t.co/w0NtcSlLUi\nImages:\n  - [Image #0] The image is a screenshot of a tweet and its reply on Twitter. The tweet is from the user @QiaochuYuan and reads, \"whoa if i shake my head fast enough i can doppler-effect the sound of music.\" The tweet is dated August 1, 2022, and has 1 retweet, 1 quote tweet, and 32 likes. \n    \n    Below the original tweet is a reply from the same user, which states, \"pretty sure this is not a good idea but? on the other hand? it's *really* funny.\" The reply is dated 15 hours after the original tweet. \n    \n    At the bottom of the image, there is an advertisement for Getir, a grocery delivery service, which reads, \"Getir delivers groceries in minutes. Choose from over 1,000 products and get a delivery in minutes. 677K reviews.\" The ad is labeled as \"Promoted.\"\n↓\n1479891576595746817 [2022-01-08] @QiaochuYuan 💜 2\n@m_ashcroft i hear it’s a whole new (terrible) thing now\n↓\n1479892108433674247 [2022-01-08] @m_ashcroft 💜 2 [(SEED) type=quote_of_root]\n@QiaochuYuan https://t.co/v0oZSSBfk6\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1479892284112003075 [2022-01-08] @m_ashcroft 💜 1\n@QiaochuYuan https://t.co/3IjUP1sxEN\n  [Quoting Tweet 1056963654581596160 (missing)]\n\n===\n\n1481533191534309376 [2022-01-13] @sharanvkaur 💜 39 🔁 2\nthe 80s must have been fun https://t.co/bGbmHoo5li\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1481534289183666179 [2022-01-13] @visakanv 💜 5 🔁 1\n@sharanvkaur 💃🏾🕺🏾 https://t.co/65Z5atvm2I\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1481534630851653633 [2022-01-13] @sharanvkaur 💜 2\n@visakanv yooooooo what\n↓\n1481535371712561155 [2022-01-13] @visakanv 💜 10\n@sharanvkaur it was phenomenally successful, almost like 10% of the country's population took part... and then some bureaucrats decided to discontinue it because... they wanted it to be more family friendly? https://t.co/EeKkvB2l8v\nImages:\n  - [Image #0] The image is a screenshot of an article titled \"Swing Singapore\" by Thulaja, Naidu Ratnala. The article discusses the history of Swing Singapore, a street party that began in 1988 as part of the National Day celebrations. \n    \n    The article is divided into two sections: the first section provides a brief overview of the event's history, while the second section, labeled \"Description,\" delves deeper into the details of the 1988 event. \n    \n    To reproduce the image, one would need to recreate the article's content, including the title, author, and body text, as well as the layout and formatting. The text would need to be arranged in the same way, with the title at the top, followed by the first section, and then the \"Description\" section below. The hyperlinks in the text, such as \"National Day celebrations\" and \"Fraser & Neave (F&N),\" would also need to be included.\n↓\n1481539196506750977 [2022-01-13] @sharanvkaur 💜 7 🔁 2 [(SEED) type=quote_of_root]\n@visakanv singapore as a country, basically https://t.co/ukqu0nVHTU\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1486539924014714884 [2022-01-27] @QiaochuYuan 💜 14\nguys wtf can anyone else confirm for me that the list of columns that spotify displays in playlists *cannot be edited in any way whatsoever*? https://t.co/MUS1G0DKRV\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1486539925566595081 [2022-01-27] @QiaochuYuan 💜 15\ni cannot imagine the state of mind of the motherfucker at spotify who thought this was a good idea. probably the same motherfucker who for some truly inconceivable reason thought removing the \"artists\" column was a good idea. what the *actual fuck*\n↓\n1486540223433428996 [2022-01-27] @QiaochuYuan 💜 13 [(SEED) type=quote_of_root]\nspotify why are you doing this to me\n\nhttps://t.co/3ROjpzQyH9\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1502916647958441987 [2022-03-13] @visakanv 💜 16\ntf is up with all these scammy looking viral tweets with funny memes and a link to a Space that looks dodgy as hell\n↓\n1502917134434807808 [2022-03-13] @visakanv 💜 16\njfc https://t.co/OoKX0Sp3a1\n  [Quoting Tweet 1502882247723999238 (missing)]\n↓\n1502917166768685056 [2022-03-13] @visakanv 💜 24 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1503237379133358083 [2022-03-14] @sharanvkaur 💜 10 [(SEED) type=quote_of_root]\n&gt; create new twitter account&gt; twitter wants your phone number&gt; nvm i'll just post nonsense on main&gt; twitter emails nonsense every day&gt; you must log in with your phone number to unsubscribe https://t.co/kmjGM7mN31\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1503242037209939969 [2022-03-14] @sharanvkaur 💜 7\nalso is it just me or did they make usernames in notifications blue and then turn it back to black\n\n===\n\n1510896563060568064 [2022-04-04] @visakanv 💜 17 🔁 1 [(SEED) type=quote_of_root]\nfleets were a good and interesting feature\n\ntweets should have adjustable timers on them \n\nTwitter will never do this because leaving tweets up to be permanent incentivizes fighting, aka engagement \n\nhttps://t.co/r7X1AFoy6F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1518136894932267008 [2022-04-24] @visakanv 💜 88 🔁 3 💬 1\ni hate this fucking chicken. https://t.co/a1OGgMak7K\nImages:\n  - [Image #0] The image depicts a cartoon chicken in mid-air, with its legs splayed out to the sides and its head tilted upwards. The chicken is orange with a red comb and wattle, and it appears to be falling or jumping.\n    \n    * The chicken is positioned above a pink rectangle, which is centered at the top of the image.\n    \t+ The chicken is facing to the right, with its wings tucked in and its tail feathers visible.\n    \t+ The pink rectangle has a rough, torn edge around it.\n    * Below the chicken, there is white text that reads \"No results for 'from:visakanv china'\".\n    \t+ The text is in a bold, sans-serif font and is centered on the page.\n    \t+ The phrase \"'from:visakanv china'\" is enclosed in quotation marks.\n    * Underneath the main text, there is smaller gray text that provides additional information.\n    \t+ The text reads: \"Try searching for something else, or check your Search settings to see if they're protecting you from potentially sensitive content.\"\n    \t+ The word \"Search settings\" is highlighted in blue, indicating that it is a clickable link.\n    * The background of the image is solid black, providing a stark contrast to the colorful elements in the foreground.\n    \n    In summary, the image features a cartoon chicken in mid-air, accompanied by text that suggests that a search query on a social media platform returned no results. The image may be humorous or ironic, as the chicken appears to be falling or jumping in a way that is not directly related to the text.\n↓\n1518137086872031233 [2022-04-24] @visakanv 💜 38\nespecially when I know for a fact that I have results. so not only is twitter lying to me, it's making me look at a fucking chicken. why? what the fuck?  https://t.co/JreOz7qebu\n  [Quoting @visakanv: there's a teahouse / bubble tea brand called BaWangChaJi from Yunnan, China and I kinda love how it straight up looks like an Alternate Universe Starbucks https://t.co/MFFZvTAKX5]\n↓\n1518137233319944193 [2022-04-24] @sharanvkaur 💜 10 💬 1\n@visakanv https://t.co/I0RXohMkov\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1518137398185848833 [2022-04-24] @visakanv 💜 10 [(SEED) type=quote_of_root]\n@sharanvkaur i want to d*e\n\nhttps://t.co/r7X1AF7v4F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n↓\n1521435300584558593 [2022-05-03] @sharanvkaur 💜 6\n@visakanv they made it even worserer https://t.co/ZBJFEHVvc5\nImages:\n  - [Image #0] The image is a screenshot of a Twitter page, specifically the \"Quote Tweets\" section. \n    \n    * The main content of the image is a cartoon parrot with a green body and red spots, facing left.\n    \t+ The parrot has a yellow beak and white feet.\n    \t+ It is standing in front of a yellow brush stroke background.\n    \t+ There are three thought bubbles above the parrot's head: one pink, one blue, and one green.\n    * Below the parrot, there is text that reads \"No Quote Tweets yet\" in large black font.\n    \t+ Underneath this, in smaller gray font, it says \"Add your take when sharing someone else's Tweet and it'll show up here.\"\n    * The background of the image is plain white.\n    \n    The image appears to be a placeholder or a notification indicating that there are no quote tweets to display.\n\n===\n\n1607087650191847427 [2022-12-25] @nobu_hibiki 💜 1 [(SEED) type=semantic_search]\nWhoa what happened to metrics https://t.co/S9J7qv8Ndq\n\n===\n\n1615419495337627671 [2023-01-17] @IgorBrigadir 💜 1 🔁 1 [(SEED) type=semantic_search]\nMaddeningly beautiful: \n\nhttps://t.co/1FaeBu1ABW \n\nThe perfect User Experience.\n\n===\n\n1617717473389998080 [2023-01-24] @visakanv 💜 11\nI keep getting this rn, very annoying https://t.co/PmeVwwdRNn\n  [Quoting @christineist: every single tweet now says it failed to post, but when I click retry it says you already said that, and indeed it had posted the first time despite the failure notice]\n↓\n1617717638964318209 [2023-01-24] @visakanv 💜 3\neven when posting this https://t.co/6hPVKfZ5PJ\nImages:\n  - [Image #0] The image shows a screenshot of a Twitter thread. The description of the image is as follows:\n    \n    The screenshot displays a Twitter thread with a dark background, featuring a tweet from the user \"@christineist\" that reads, \"twitter is breaking down there are lots of bugs I run into nowadays.\" The tweet has 129 views and 6 likes. A pop-up window is visible, displaying the message \"Tweet not sent\" in white text on a gray background. The pop-up also includes the text \"We're sorry, we weren't able to send your Tweet. Would you like to retry or save this Tweet in drafts?\" with two options: \"Go to drafts\" and \"Retry.\" \n    \n    Below the original tweet, there are two replies. The first reply, also from \"@christineist,\" states, \"somehow lists home disappeared from desktop/web.\" The second reply, from \"@nat_sharpe,\" says, \"yeah the bugs are stacking up.. sad.\"\n↓\n1617717831327698944 [2023-01-24] @visakanv 💜 7 [(SEED) type=semantic_search]\nhttps://t.co/38chdFHHvB\n\n===\n\n1620870597218824192 [2023-02-01] @visakanv 💜 316 🔁 41\nthe HR-ification of language can lead to much more violent acts being laundered through euphemistic language. a teacher helping special needs kids might say \"i fuckin killed it bro!!\" in the breakroom while lockheed martin will say \"target neutralized\" upon blowing up the school https://t.co/0OkrhJ2E4P\n  [Quoting Tweet 1620128829661675520 (missing)]\n↓\n1620870976102871040 [2023-02-01] @visakanv 💜 41 🔁 1\nnot directed at OP, but instead of considering your language maybe try considering how you're coming across as fuckin' person https://t.co/rXk10U9JUf\n  [Quoting @visakanv: wishing them all love and success https://t.co/F3Q82ntKYk]\n↓\n1620871496993505281 [2023-02-01] @visakanv 💜 42 🔁 3 [(SEED) type=quote_of_root]\nThe HR-ification of language will continue while outcomes deteriorate. Have a pleasant day! \n\nhttps://t.co/r7X1AF7v4F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1621026986784337922 [2023-02-02] @XDevelopers 💜 20005 🔁 82222 💬 7\nStarting February 9, we will no longer support free access to the Twitter API, both v2 and v1.1. A paid basic tier will be available instead 🧵\n↓\n1621118747426844672 [2023-02-02] @visakanv 💜 27 🔁 2 [(SEED) type=quote_of_root]\n@TwitterDev nice https://t.co/r7X1AF7v4F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1640903323011239936 [2023-03-29] @goblinodds 💜 4\nwhat fresh hell is this new tiktok feature where if you comment on someone's video it reposts it by default what the FUCK\n↓\n1640904190636457986 [2023-03-29] @goblinodds 💜 3\ni think you can permanently clear the setting but jesus christ\n↓\n1640906553296318468 [2023-03-29] @imhinesmi 💜 1 [(SEED) type=semantic_search]\n@goblinodds quality will degrade until metrics improve\n\n===\n\n1646337626520293376 [2023-04-13] @visakanv 💜 92 🔁 7 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AF7v4F https://t.co/W9EAWyE80W\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1709971675129721009 [2023-10-05] @mbateman 💜 3 🔁 1 [(SEED) type=semantic_search]\nThe UX degradation will continue until UAM plummets\n\n===\n\n1827684269243629968 [2024-08-25] @jose_goncalves_ 💜 1 [(SEED) type=semantic_search]\nprogressively greater UX at scale make people progressively stupider\n\n===\n\n1882773009485988260 [2025-01-24] @visakanv 💜 70 🔁 1\nlooks like X replaced communities tab with… xtok? https://t.co/E668r6MPyq\nImages:\n  - [Image #0] The image shows a screenshot of a mobile app's navigation bar, featuring a dark blue background with white icons. The navigation bar includes, from left to right, a house icon, a magnifying glass icon, a logo with \"GROK\" written below it, a play button icon, and an envelope icon.\n↓\n1882786997066145976 [2025-01-24] @visakanv 💜 39 [(SEED) type=quote_of_root]\nhttps://t.co/r7X1AF7v4F\n  [Quoting @visakanv: THE USER EXPERIENCE WILL BE DEGRADED UNTIL METRICS IMPROVE]\n\n===\n\n1917090240449196223 [2025-04-29] @IterIntellectus 💜 123 🔁 6\n1) WHAT?\n\nwe have free AGI at home thanks to china?! https://t.co/IP7c2EZWfe\nImages:\n  - [Image #0] The image presents a table comparing the performance of various AI models across different tasks. The table is divided into two main sections: the left column lists the tasks, and the top row lists the AI models being compared.\n    \n    *   **Tasks:**\n        *   ArenaHard\n        *   AIME'24\n        *   AIME'25\n        *   LiveCodeBench v3, 2024.10-2025.02\n        *   CodeForces Elo Rating\n        *   Aider Pass@2\n        *   LiveBench 2024-11-25\n        *   BFCL v3\n        *   MultiF 8 Languages\n    *   **AI Models:**\n        *   Qwen3-235B-A22B MoE\n        *   Qwen3-32B Dense\n        *   OpenAI-o-1 2024-12-17\n        *   Deepseek-R1\n        *   Grok 3 Beta Think\n        *   Gemini2.5-Pro\n        *   OpenAI-o-3-mini Medium\n    \n    The table provides a comprehensive comparison of the performance of these AI models across various tasks, with numerical values indicating their relative performance. The data is presented in a clear and organized manner, allowing for easy comparison and analysis of the different models.\n    \n    The table includes three footnotes at the bottom, which provide additional context and explanations for the data presented.\n    \n    1.  AIME'24/25: We sample 64 times for each query and report the average of the accuracy. AIME'25 consists of Part I and Part II, with a total of 30 questions.\n    2.  Aider: We didn't activate the think mode of Qwen3 to balance efficiency and effectiveness.\n    3.  BFCL: The Qwen3 models are evaluated using the FC format, while the baseline models are assessed using the highest scores obtained from either the FC or prompt formats.\n    \n    Overall, the table provides a detailed comparison of the performance of various AI models across different tasks, offering valuable insights into their strengths and weaknesses.\n↓\n1917090628435075153 [2025-04-29] @atlantis__labs 💜 4 [(SEED) type=semantic_search]\n@IterIntellectus the only metric that matters https://t.co/7x8LKid7TU\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n\n===\n\n1918288230270586910 [2025-05-02] @frknnsh 💜 2 [(SEED) type=semantic_search]\nUX improvement: partial loading on account analysis submission\n\nused to take 2-3 mins of dead waiting. now you get usable insights in like 10s\n\n(AI analysis takes longer, don't let video cuts deceive you. but metrics load fast enough to entertain waiting for the rest) https://t.co/qpdrZ8z8MM\n\n===\n\n1921167190293643558 [2025-05-10] @xlr8harder 💜 65 🔁 1\nOh god not this https://t.co/B81aPdOaZx\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1921216706803908884 [2025-05-10] @eshear  [(SEED) type=semantic_search]\n@xlr8harder The direct user-metric-based optimization will continue until morale improves\n\n===\n\n1929143232916549649 [2025-06-01] @charlesmiller_7 💜 13554 🔁 1727 [(SEED) type=semantic_search]\nThe only metrics that matter https://t.co/XckrqGCZ2d\n\n===\n\n1954216432444538931 [2025-08-09] @orphcorp 💜 4 [(SEED) type=semantic_search]\nUSER 👏 EXPERIENCE 👏 WILL 👏 BE 👏 DEGRADED 👏 UNTIL 👏 METRICS 👏 IMPROVE\n\n===\n"
}