{
  "tweet_id": 1200908347026788352,
  "thread_text": "1200908347026788352 [2019-11-30] @FioraAeterna 💜 259 🔁 47 💬 30 [(SEED) type=root]\ni was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1200918625323900928 [2019-11-30] @QiaochuYuan 💜 8\n@FioraAeterna hey @Malcolm_Ocean and @DougTataryn, basically the NEDERA process out in the wild!\n\n===\n\n1204282189044518914 [2019-12-10] @choosy_mom 💜 18 🔁 6\nFor a long time I used meditation (mostly vipassana/anapana) to cope with strong negative emotions\n\nSomewhat recently I’ve grown suspicious that it’s actually been an avoidance thing\n↓\n1204283033324417024 [2019-12-10] @choosy_mom 💜 11\nNot a knock on meditation at all, it’s mostly about the intention behind it. Generally I’m a more motivated, confident, charitable person when I’m practicing regularly.\n\nBut think I’m gonna stop using it in crisis mode, maybe try to magnify the feelings instead...\n↓\n1204436445152366593 [2019-12-10] @reasonisfun 💜 7 🔁 1\n@choosy_mom Aren't there some kinds of meditation where you do magnify or go into the feelings? \n\n@QiaochuYuan @meditationstuff @Malcolm_Ocean \n\nActually yeah, how is the bio-emotive stuff compatible with the observer-of-thoughts/feels thing?\n↓\n1204469881871175680 [2019-12-10] @Malcolm_Ocean 💜 10 🔁 1\n@reasonisfun @choosy_mom @QiaochuYuan @meditationstuff Very compatible. You encourage the feeling to totally fill up your body and your mind, &amp; yet also, if you have the mental space for it (many don't; meditation helps with this) you also can experience a present witness while *also* being made of sobs. 👁️😭\n↓\n1204470184339296257 [2019-12-10] @Malcolm_Ocean 💜 6 🔁 2 [(SEED) type=quote_of_root]\n@reasonisfun @choosy_mom @QiaochuYuan @meditationstuff As for *how* to do this, these instructions are kind of a simplified version of Bio-Emotive's NEDERA process and could be a place to start:\n\nhttps://t.co/teB5LvhrbY\n  [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n↓\n1204472910062080000 [2019-12-10] @choosy_mom 💜 9 🔁 3 💬 6\n@Malcolm_Ocean @reasonisfun @QiaochuYuan @meditationstuff Thanks for pointing back towards this—I think I'm somewhere between 2 and 3 right now\n\nCrying hard is a hard thing (h/t @QiaochuYuan + twitter sob squad for continuing to normalize this) and right now I think it is the most promising way forward\n↓\n1204475057965285377 [2019-12-10] @Malcolm_Ocean 💜 13 🔁 2 💬 1\n@choosy_mom @reasonisfun @QiaochuYuan @meditationstuff Sob Squad. Wow. Yup, that's going in my twitter bio:\n\n😭😎 #SobSquad\n\nMaking crying hard not just normal but *cool* https://t.co/A8EKzzTnZk\nImages:\n  - [Image #0] The image is a screenshot of a Twitter profile page.\n    \n    The profile picture is a circular image of a man with curly hair and a blue shirt. The background of the profile is black, with a colorful abstract design at the top. The user's name is \"Malcolm Ocean\" and their handle is \"@Malcolm_Ocean\". Their bio reads: \"Systems designer, bootstrapping meaningful purposeful living & working w culture-tech.\" Below the bio, there is a hashtag \"#SobSquad\" accompanied by two crying emojis. At the bottom of the page, there is a tweet that says \"Turn your to-do list into a today list: complice.co\" with a link to the website. The \"Edit profile\" button is located on the top right side of the page.\n↓\n1204531634839543808 [2019-12-10] @QiaochuYuan 💜 8\n@Malcolm_Ocean @choosy_mom @reasonisfun @meditationstuff alright i'm in let's make #SobSquad happen https://t.co/udUPw9IFxb\nImages:\n  - [Image #0] The image is a screenshot of a Twitter profile page. \n    \n    * The top section features a large yellow smiley face emoji with sunglasses and tears, accompanied by a circular profile picture of a man sitting cross-legged on grass in front of a serene lake and trees.\n    * Below this, the username \"@QiaochuYuan\" is displayed, along with the handle \"QC\".\n    * A quote is shown: \"'Down with the @QiaochuYuan's of the world and their constant barrage of 🔥 tweets!' - @cognazor\".\n    * The hashtags \"#SobSquad\" are listed underneath.\n    * The location \"Oakland, CA\" is specified, along with a link to \"thicketforte.com\" and the join date \"July 2018\".\n\n===\n\n1204563471691472896 [2019-12-11] @QiaochuYuan 💜 123 🔁 33 💬 3\n\"fuck it, we bawl\": thread of threads about crying, sobbing, weeping, wailing, gnashing of teeth\n\n😭🔜😎 #SobSquad\n\n===\n\n1204563472740077568 [2019-12-11] @QiaochuYuan 💜 10\nhttps://t.co/n8la3FMwN8\n  [Quoting @QiaochuYuan: Our feelings are like babies who never had a chance to grow up, and babies make messes. They scream and cry. They shit and vomit. It takes a lot to raise a baby, especially by yourself. And the world isn't set up for it.]\n↓\n1204563473822126081 [2019-12-11] @QiaochuYuan 💜 7\nhttps://t.co/DF2FpNYHdx\n  [Quoting @QiaochuYuan: yeah sex is good but have you ever tried helping a friend cry about how he feels responsible for his dad's death  and - this is the crazy shit - how he *needs* to feel responsible for his dad's death, because otherwise the world doesn't make any sense and god is a piece of shit]\n↓\n1204563474925285376 [2019-12-11] @QiaochuYuan 💜 5\nhttps://t.co/6RyAecTUYF\n  [Quoting @QiaochuYuan: sometimes self-care means skipping the halloween party to cry by the water, wish me luck]\n↓\n1204563476405862400 [2019-12-11] @QiaochuYuan 💜 7\nhttps://t.co/WRhMXhK9Fp\n  [Quoting @QiaochuYuan: @PhoropterRaptor @cognazor can't skip cry day bro]\n↓\n1204563477483773952 [2019-12-11] @QiaochuYuan 💜 5\nhttps://t.co/uRQpBdrvKM\n  [Quoting @QiaochuYuan: what if there's no such thing as tears of joy]\n↓\n1204563478616272896 [2019-12-11] @QiaochuYuan 💜 4\nhttps://t.co/tMhGpztyL2\n  [Quoting @QiaochuYuan: six words: break your own heart to cry]\n↓\n1204563479782289410 [2019-12-11] @QiaochuYuan 💜 2\nhttps://t.co/4Clro7nLns\n  [Quoting @QiaochuYuan: i’m definitely sad about something but i’ll be damned if i know what hmm this is what happens when i skip cry day]\n↓\n1204563481044733953 [2019-12-11] @QiaochuYuan 💜 10\nhttps://t.co/vZszU67Jyw\n  [Quoting @QiaochuYuan: you want to give men what they need to cry? disentangle crying from femininity. that association is modern and unnecessary. the ancient male heroes wept freely  https://t.co/7E6g6nw31M https://t.co/Aep2vFGJm3]\n↓\n1204563482294636544 [2019-12-11] @QiaochuYuan 💜 4\nhttps://t.co/kFNZBgBoU2\n  [Quoting @Malcolm_Ocean: The \"dissolving the patriarchy\" metaphor is very vivid for me: much of my trauma work so far has involved a lot of sobbing, so the tears are the solvent.  (I'm using the NEDERA process from Bio-Emotive/@DougTataryn, which tends to involve a lot of crying)  https://t.co/hMBZ402lPr]\n↓\n1204563483477475328 [2019-12-11] @QiaochuYuan 💜 6\nhttps://t.co/CL4ItcwgYT\n  [Quoting @Malcolm_Ocean: @choosy_mom @reasonisfun @QiaochuYuan @meditationstuff Sob Squad. Wow. Yup, that's going in my twitter bio:  😭😎 #SobSquad  Making crying hard not just normal but *cool* https://t.co/A8EKzzTnZk]\n├── 1204619554770636800 [2019-12-11] @yashkaf 💜 5\n│   @QiaochuYuan OK, but what if I actually haven't cried in more than a year? Any pointers on how to get my first good sob on? Asking not for a friend but for me because I want to try crying or cry trying.\n│   ↓\n│   1204620459817369601 [2019-12-11] @QiaochuYuan 💜 1 [(SEED) type=quote_of_root]\n│   @yashkaf ah thanks for reminding me to include this thread: https://t.co/sPnknGCjKx\n│     [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n└── 1204620517216374784 [2019-12-11] @QiaochuYuan 💜 7 [(SEED) type=quote_of_root]\n    https://t.co/sPnknGCjKx\n      [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n    ↓\n    1205030391700000768 [2019-12-12] @QiaochuYuan 💜 5\n    https://t.co/0ZxQBzgYFV\n      [Quoting @Malcolm_Ocean: I once did an emotional processing session starting w: \"I feel weird/bad trying to get out of bed\"  I found my way to expressing a hazy memory: \"Nobody woke me up and I missed the pancakes!\"  ...then I suddenly started sobbing 😭  Traumatic meaning can occur in benign situations.]\n    ↓\n    1205610845310341120 [2019-12-13] @QiaochuYuan 💜 3\n    https://t.co/znss3bBr9O\n      [Quoting @QiaochuYuan: this has been a pattern in my sessions lately: that acknowledging something \"negative\" i've been feeling for a long time doesn't quite generate a full reaction, but explicitly contrasting it with its \"positive\" version does  e.g.: https://t.co/UucfE2svms]\n    ↓\n    1205653288349138946 [2019-12-14] @QiaochuYuan 💜 7\n    https://t.co/eTYViuJwtI\n      [Quoting @QiaochuYuan: PSA since the #SobSquad tide has been rising lately: you 1000% don't need to push yourself into any more of your emotional stuff than you feel ready for. you're protecting yourself from that stuff for *good reasons* and that's worth honoring. it's good to protect yourself! ❤️]\n    ↓\n    1209285805950156800 [2019-12-24] @QiaochuYuan 💜 7\n    https://t.co/HjaVjhKUZ0\n      [Quoting Tweet 1188917819469004800 (missing)]\n    ↓\n    1246952231963742208 [2020-04-06] @QiaochuYuan 💜 3\n    https://t.co/rrZuyU9Ail\n      [Quoting Tweet 1246890739755364359 (missing)]\n    ↓\n    1254530795689009152 [2020-04-26] @QiaochuYuan 💜 3\n    https://t.co/MUKDOYWsCT\n      [Quoting @QiaochuYuan: i had a big NEDERA / crying session last night after feeling very bad for a week and am finally feeling a lot better, here are my notes on the session (from memory) https://t.co/7eyefCtjYy]\n    ↓\n    1254531467117355009 [2020-04-26] @QiaochuYuan 💜 3\n    https://t.co/cnXYjW07Ff\n      [Quoting Tweet 1248082644237078528 (missing)]\n    ↓\n    1260373896823365633 [2020-05-13] @QiaochuYuan 💜 3\n    https://t.co/MCfSK3OA3n\n      [Quoting @QiaochuYuan: might fuck around and make this my new crying spot https://t.co/IEFhJVQKH4]\n    ↓\n    1274806266758483968 [2020-06-21] @QiaochuYuan 💜 5\n    https://t.co/trmX8Xfc7Y\n      [Quoting @nosilverv: I jokingly shit on #sobsquad and @QiaochuYuan and @Malcolm_Ocean but I also genuinely like them and think they're on to something important. Now I LIEK to understand things so here's what I think is going on with that/crying/@dougtataryn's Bioemotive framework]\n    ↓\n    1479934684473692162 [2022-01-08] @QiaochuYuan 💜 5\n    yeah that's right we out here updating a thread from 2019\n    \n    https://t.co/EAPbubjw01\n      [Quoting Tweet 1479922255345901572 (missing)]\n\n===\n\n1211387282403536898 [2019-12-29] @mykola 💜 105 🔁 15 💬 1\nHey I have a request. If you are someone who has experienced complex trauma and have a history of \"overreactions\" to things, but you learned to overcome it sustainable and healthy way -- can you tell us about that?\n\nI'll RT any threads folks write about this!\n↓\n1211395903090618368 [2019-12-29] @QiaochuYuan 💜 14 🔁 1 [(SEED) type=quote_of_root]\n@mykola long story but the short version is a bunch of stuff for clearing out \"emotional constipation\" - can check out https://t.co/BNhWIuN3MK or this thread from @FioraAeterna: https://t.co/sPnknGCjKx\n  [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n\n===\n\n1213923555231928320 [2020-01-05] @QiaochuYuan 💜 11\n2 days for me too. oh boy. apparently meditation in a group brings up some stuff for me around feeling trapped, possibly in classrooms (h/t @Malcolm_Ocean) so that should be *fun* to work with https://t.co/Xvj9dJQ2Dv\n  [Quoting Tweet 1213891873707720704 (missing)]\n↓\n1214064326128132098 [2020-01-06] @RichDecibels 💜 1 [(SEED) type=semantic_search]\n@QiaochuYuan @Malcolm_Ocean Have a you tried clamping down on that feeling and avoiding it?\n\n===\n\n1227001953617498112 [2020-02-10] @goblinodds 💜 29 [(SEED) type=semantic_search]\noh fuck, i just realized\n\nif you're not supposed to bottle up feelings what are you supposed to *do* with them\n├── 1227001954586382337 [2020-02-10] @goblinodds 💜 10\n│   apparently clinically describing them to people is p much the same as bottling them up\n│   ├── 1227001961439825920 [2020-02-10] @goblinodds 💜 16\n│   │   genuinely, how do people live lives if they're feeling things all the time\n│   │   \n│   │   or even like some of the time\n│   │   ↓\n│   │   1227001962295484417 [2020-02-10] @goblinodds 💜 12\n│   │   context, if needed: an artist i rly like died recently and her story is just fuckin' heartbreaking and i'm like\n│   │   \n│   │   feeling feelings and i didn't even know her\n│   │   ↓\n│   │   1227001963226624000 [2020-02-10] @goblinodds 💜 9\n│   │   i guess i should try to do the sob squad thing but i mean\n│   │   \n│   │   i have shit i have to do and crying for real is loud-ish iirc, the walls are thin\n│   │   ↓\n│   │   1227002608251916288 [2020-02-10] @goblinodds 💜 4\n│   │   on the upside, i don't have the emotional bandwidth to be disturbed by the fact that there's steak in my wrap instead of shawarma\n│   │   ↓\n│   │   1227004354177056768 [2020-02-10] @goblinodds 💜 7\n│   │   legit had to resist the urge to google \"how to make correct crying sounds\" lolol\n│   └── 1227185743510020103 [2020-02-11] @GeniesLoki 💜 1\n│       @goblinodds I don't think this is true. It's an important but necessarily incomplete part of the process.\n├── 1227108543188414464 [2020-02-11] @natural_hazard 💜 1\n│   @goblinodds Sometimes I like to make faces and grunt. Ymmv\n│   ↓\n│   1227110761941463040 [2020-02-11] @goblinodds 💜 1\n│   @natural_hazard not the worst way to deal w it tbh\n└── 1227220222588923904 [2020-02-11] @SpeaksNanda 💜 2\n    @goblinodds I don't know the answer to this one but \"work out how to change your life so the bad-feeling stimulus doesn't occur\" is advice that I never see anyone* give and I don't know why not.\n    \n    *: one major exception y'all know who you are &lt;3\n    ↓\n    1227250133185646593 [2020-02-11] @goblinodds \n    @SpeaksNanda hahah i think i know who you're talking about!!\n\n===\n\n1243001904537329664 [2020-03-26] @QiaochuYuan 💜 27\none of the many questions obsessing me right now is how much the symptoms of any given case of the 'rona are psychosomatic\n\ni haven't seen anyone mention in a mainstream publication that e.g. shortness of breath is an anxiety symptom\n↓\n1243001909981536256 [2020-03-26] @QiaochuYuan 💜 7 🔁 1\nsome of the \"don't panic\" people correctly pointed out that staying relaxed and calm will actually be better for your health but it makes actually having symptoms this very strange game of wondering how much you can improve your symptoms by calming down\n\nhttps://t.co/JhniJD0tpZ\n  [Quoting @QiaochuYuan: not only can we be calm and playful in the face of a mini-apocalypse, it's good for our immune health! IME the immune benefits of staying emotionally healthy are shockingly strong  https://t.co/N6p5Tc8l1G https://t.co/UluuBclHZT]\n↓\n1243001915778031617 [2020-03-26] @QiaochuYuan 💜 9 🔁 1 [(SEED) type=quote_of_root]\nit will not surprise anyone to hear that my #1 emotional health intervention for myself personally continues to be crying, and in the absence of a better free resource plz refer to this tweet re: how to do that\n\nhttps://t.co/GqS8DZ4FyC\n  [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n\n===\n\n1311947451264311296 [2020-10-02] @nosilverv 💜 102 🔁 7 💬 1 [(SEED) type=semantic_search]\nPSA: if you feel bad you can just DO THINGS until you feel better\n├── 1311948835590078465 [2020-10-02] @mattdsegal \n│   @nosilverv Does it matter what kind of things you do?\n│   ↓\n│   1311962196902019072 [2020-10-02] @nosilverv \n│   @MattDSegal i mean, the default strategy would be do random things until you feels better lo\n│   ↓\n│   1312781022392590336 [2020-10-04] @cocadonv \n│   @nosilverv @MattDSegal It's even better if you do the thing you know you have to do if that exists. The more mindlessly you do it, the better\n├── 1311960595403616258 [2020-10-02] @GeniesLoki 💜 12\n│   @nosilverv Very @m_ashcroft voice: Or you could stop doing the things that make you feel bad.\n│   ↓\n│   1312781182333972482 [2020-10-04] @cocadonv \n│   @GeniesLoki @nosilverv @m_ashcroft What if what makes one feel bad is not doing anything?\n└── 1312769684534628356 [2020-10-04] @nosilverv 💜 8 🔁 1\n    'i felt bad, i did things, i feel good' - this is the secret of life\n\n===\n\n1354887463777439748 [2021-01-28] @goblinodds 💜 41 🔁 2 [(SEED) type=semantic_search]\nweird side effect of trying not to smash down feelings is... occasionally noticing when you have them\n↓\n1354887465559945217 [2021-01-28] @goblinodds 💜 17 🔁 1\neasier to avert a lil meltdown if i'm aware that i'm stressed out in the first place, and easier to avoid falling into \"what is this i have to stop it\" stress levels if i notice before it gets to that point\n\n===\n\n1370519496830554112 [2021-03-12] @imhinesmi 💜 6 💬 1\nalright guys ive figured out the method for not being stressed\n\nits easy you just say 'im not stressed' whenever anyone, including you, asks if youre stressed\n↓\n1370519608336084993 [2021-03-12] @imhinesmi 💜 2 [(SEED) type=semantic_search]\nthis is a fully general method for not feeling any emotion you dont like\n↓\n1370903596208775169 [2021-03-14] @imhinesmi 💜 3\nthis advanced method is stolen from @natural_hazard https://t.co/1yLeCaDivL\n↓\n1370933387985305602 [2021-03-14] @natural_hazard 💜 3\n@imhinesmi 🤣🤣🤣🤣\nyou're the first person to use it as a proper how-to guide\n↓\n1370934668275576833 [2021-03-14] @imhinesmi 💜 2\n@natural_hazard i honestly have no idea how long i have been doing this, i dont actually remember at any point being stressed about things\n\nand yet, i keep finding tension and having bad sleep around important events\n↓\n1371539465471148039 [2021-03-15] @natural_hazard 💜 2\n@imhinesmi my dad has a habit of \"not being stressed\" but his bowels reliably acting up when ever there is a sustained stressful situation\n\n===\n\n1404379880746323978 [2021-06-14] @nosilverv 💜 17 🔁 3 [(SEED) type=semantic_search]\nPSA: Way to deal with emotions is feel them, not desperate distraction\n\n===\n\n1508454602957631488 [2022-03-28] @nosilverv 💜 1109 🔁 132\nIf your life feels like a simulation, like a loop, I would encourage you to consider it might be: a loop, a simulation, that you yourself have created, to avoid doing something that would cause you to feel something you're deathly afraid of feeling.\n↓\n1508454604316545025 [2022-03-28] @nosilverv 💜 165 🔁 2\nVibing and \"flowing\" and \"just being\" would then come up as conscious cognitive goals, but attempts would just be further layering. The reason you're not vibing and flowing and just being is because you're living in a simulation of your own making.\n↓\n1508454605889413130 [2022-03-28] @nosilverv 💜 124 🔁 1\nIf everything is stilted, and robotic, and overthought, and underfelt\n\nIf you \"live from the intellect\". \n\nIf nothing feels natural or organic\n↓\n1508454607722270726 [2022-03-28] @nosilverv 💜 105 🔁 2\nIf you feel disembodied, armoured, a shell. If you have problems deciding, have needed to do \"feelings work\", have reliably had routines that took over your life.\n\nIf you had \"vacations\" or \"not real life\" where you actually could just flow\n↓\n1508454609479778307 [2022-03-28] @nosilverv 💜 68\nI would encourage you to consider...\n↓\n1508456942494273541 [2022-03-28] @nosilverv 💜 94 🔁 1\nHyper self-awareness is a way of avoiding feeling this feeling\n↓\n1508456943777632259 [2022-03-28] @nosilverv 💜 75\nAnnoying mind games you play with yourself is a way of avoiding feeling this feeling\n↓\n1508456945027624962 [2022-03-28] @nosilverv 💜 70\nComplicating and confusing things is a way to avoid feeling this feeling\n↓\n1508456946646630411 [2022-03-28] @nosilverv 💜 69\nDistraction is a way to avoid feeling this feeling\n↓\n1508456947854589959 [2022-03-28] @nosilverv 💜 74 [(SEED) type=semantic_search]\nInsights are a way to avoid feelings this feeling\n↓\n1508456949079289873 [2022-03-28] @nosilverv 💜 78 🔁 1\nTwitter is a way to avoid feeling this feeling\n↓\n1508456950371131392 [2022-03-28] @nosilverv 💜 101 [(SEED) type=semantic_search]\nThis thread is a way to avoid feelings this feeling\n\n===\n\n1554109472989073408 [2022-08-01] @christineist 💜 38\nhaving a good cry is important for the soul\n↓\n1554109719203131393 [2022-08-01] @christineist 💜 13\nfortunately I cry quite often, and easily. I used to not be able to, but then the death of a friend broke me wide open and now I can cry whenever\n↓\n1554110274990268417 [2022-08-01] @christineist 💜 15\nDo you cry easily? Do you not? Did you go from not crying to crying, crying to never crying? There is a lot of stigma, vulnerability, ego, control, etc around crying… curious to hear about peoples stories\n↓\n1554203703405531138 [2022-08-01] @christineist 💜 1\n👀 this has been discussed before (of course)\nhttps://t.co/ahr29C5tH9\n↓\n1554211352817766400 [2022-08-01] @christineist 💜 3 [(SEED) type=quote_of_root]\nwowww also love this thanks for surfacing @QiaochuYuan https://t.co/8XsVuU3X7M\n  [Quoting @FioraAeterna: i was recently shown a method for dealing w/unwanted feelings and its not special or anything but i figure there's some other people out there who never learned it either https://t.co/Rh1T1TKB1P]\n↓\n1554234455748816896 [2022-08-01] @christineist 💜 1\nwow beautiful, i especially like the metaphor of a body as a bridge- another medium to communicate and connect with the *waves hand* ether, subconscious, etc. also resonate with letting certain parts surface for the first time https://t.co/3whe3ckhs3\n  [Quoting Tweet 1188917819469004800 (missing)]\n\n===\n\n1570738470452342788 [2022-09-16] @zrkrlc 💜 2 [(SEED) type=semantic_search]\ngonna practice the ancient technique of \"ignoring my feelings until they go away\"\n\n===\n\n1735867361935433858 [2023-12-16] @kumbuchaqueen 💜 1\nround and roundsucks being alone and reminded of a gal i liked\n↓\n1735868129065181392 [2023-12-16] @kumbuchaqueen 💜 1 [(SEED) type=semantic_search]\nwhat do to to feel less this way\n↓\n1735868834425573498 [2023-12-16] @kumbuchaqueen 💜 1\ngetting out and being alivedoing it again,being pushy enough to not be alone\n↓\n1735871483875139602 [2023-12-16] @kumbuchaqueen 💜 1\ncommunication\n\n===\n\n1906140207453454639 [2025-03-30] @daintysloth 💜 324 🔁 7 [(SEED) type=semantic_search]\ndoes anyone know how to not feel really really bad\n\n===\n\n1906455934395970047 [2025-03-30] @ChrisChipMonk 💜 268 🔁 12\nthis is why i AVOID studying psychology, even as a ‘coach’. I Won't Swallow Poison.\n\nrecently started training a therapist in my method. he coached someone while i observed. afterward, he reflected:\n“went great—but i had to resist my urge to dig into the client's BAD feelings. your method always pulls toward wanted feelings. very alien to me!”\n\nif i’d studied more psychology, i’d also carry that memetic virus: dwelling on unwanted mental states instead of aiming at wanted ones. it’d be impossible to coach from first principles if bad ideas already contaminated my mind!\n\nbad ideas can be contagious. you won't even remember how uninfected thinking feels…\n  [Quoting @ChrisChipMonk: mental illnesses can be acquired via memetic viruses  @slatestarcodex https://t.co/qfFQdesKrp https://t.co/gLY6OKnqwm]\n↓\n1906701405076750668 [2025-03-31] @RafaelEnder1 💜 1 [(SEED) type=semantic_search]\n@ChrisChipMonk How do you understand, process and heal the bad feelings without digging I to them?\n↓\n1906833708713418919 [2025-03-31] @ChrisChipMonk \n@RafaelEnder1 https://t.co/WVwoe9IRDs\n  [Quoting @ChrisChipMonk: @shamsheerks because if you don't have a goal in mind, you're not going to go anywhere good!  don't have a dedicated post on this yet, but you can see an example here at 5:00: https://t.co/oEl8gzqTe0]\n\n===\n\n1909041591190269964 [2025-04-07] @heynibras 💜 86 🔁 5 💬 1 [(SEED) type=semantic_search]\ni realised there's a consistent process i use (for myself &amp; clients) when working with tough emotions\n\ninstead of writing a how to guide, i had claude create short stories where people use these techniques\n\nmy hope is you can read them &amp; absorb healthy emotional processing tools: https://t.co/oaMHK7DgAV\nImages:\n  - [Image #0] The image is a text passage about a person named Jamie who is experiencing anxiety. \n    \n    The passage is written in black typewriter-style font on a beige background and reads: \n    \"Jamie took a slow breath, not to make the anxiety go away, but to create a little more space around it. He glanced out the window at the wide-open sky. His anxiety was just one small part of this moment–not the whole story.\n    \n    As Ms. Rodriguez called his name, Jamie stood up. The anxiety came with him to the front of the class -and that was okay. It wasn't an enemy to defeat or a problem to solve. It was just part of being human sometimes.\n    \n    Walking to the podium, Jamie felt a flash of warmth toward himself and everyone else in the room. We all feel this way sometimes, he thought. May we all be okay with whatever we're feeling.\n    \n    The anxiety didn't disappear as he began speaking, but it no longer controlled him. It was just along for the ride.\"\n    \n    The author's name, \"nibras,\" is displayed in small gray text at the bottom right corner of the image.\n  - [Image #1] The image is a screenshot of a passage of text on a beige background, with black text. The passage is a story about a person named Jamie who is experiencing anxiety in a classroom setting. The passage describes Jamie's physical sensations, thoughts, and feelings as he tries to manage his anxiety.\n    \n    The text is transcribed as follows:\n    \n    \"Jamie stared at the clock: ten minutes until his turn to present. His stomach knotted and his hands trembled slightly as he sat in the back of the classroom.\n    \n    There it is again, he thought, recognising the familiar feeling of anxiety. Instead of trying to ignore it or wish it away, he decided to try something different this time.\n    \n    First, he just noticed what was happening in his body. My heart's beating really fast. My shoulders are tight. My breathing is shallow. He didn't try to change these sensations-just observed them with curiosity, like a scientist studying something interesting.\n    \n    \"It's okay that you're here,\" he silently told the anxiety. Usually, he'd get frustrated with himself for feeling this way, but today he was trying to be a friend to his feelings rather than fighting them.\n    \n    As his mind raced with thoughts like \"I'm going to mess up\" and \"Everyone will laugh,\" Jamie didn't push these thoughts away. Instead, he noticed them passing through his mind like clouds in the sky. There's a worried thought. There's another one. Just thoughts, not facts.\n    \n    He placed one hand on his chest, feeling his heartbeat. My toes aren't anxious, he realized. My knees aren't anxious either. The anxiety wasn't everywhere-just in certain places.\n    \n    Jamie took a slow breath, not to make the anxiety...\"\n    \n    The passage appears to be incomplete, as it ends abruptly in the middle of a sentence.\n↓\n1909163976535003618 [2025-04-07] @_brentbaum \n@heynibras woh there's something very very good here. I want to try this format\n\n===\n\n1909324468834738197 [2025-04-07] @tasshinfogleman 💜 12 🔁 1 [(SEED) type=quote_of_semantic_search]\ni think U want to read these loving, psychoactive, very short stories https://t.co/VTCwqYsnCL\n  [Quoting @heynibras: i realised there's a consistent process i use (for myself &amp; clients) when working with tough emotions  instead of writing a how to guide, i had claude create short stories where people use these techniques  my hope is you can read them &amp; absorb healthy emotional processing tools: https://t.co/oaMHK7DgAV]\n\n===\n\n1953191426495529460 [2025-08-06] @jonnym1ller 💜 18 🔁 1 [(SEED) type=semantic_search]\nHave you tried just feeling the emotion you're avoiding?\n\n===\n"
}