{
  "tweet_id": 1213026510086393856,
  "thread_text": "734765721851420672 [2016-05-23] @ultimape 💜 5\nI want to recreate John B. Calhoun's work but with an eye toward complex system modeling of genetic variation to make population predictions\n↓\n734769579944247296 [2016-05-23] @ultimape 💜 2\nrelated: https://t.co/ylzMlXWDxf\n  [Quoting @ultimape: The beauty of the human condition is our ability to adapt our social structures to the environment - sharing culture by spreading stories.]\n↓\n808391461876170752 [2016-12-12] @ultimape \nMe, contradictory? I have no idea what you're talking about...https://t.co/UwvtSfO1tb\n  [Quoting @ultimape: (No, I am not trying to recreate the rat parks of NIMH, I have no idea what you're talkignabout... *squeeks and scampers away*)]\n↓\n923505568651841537 [2017-10-26] @ultimape \nSwear I'm not @slatestarcodex.We're just mapping same territory from different directions.https://t.co/BTii653k3Nhttps://t.co/Q9heYLTFdI\n  [Quoting @ultimape: Why does @slatestarcodex always in sync w/ my own model of findings? Here's one that covers variation in perception:https://t.co/heVKygzc26 https://t.co/9rm9B75F3U]\n↓\n923506080373714944 [2017-10-26] @ultimape  [(SEED) type=quote_of_semantic_search]\nRat parks? what's that? https://t.co/M9JHqtbhIH\n  [Quoting @ultimape: \"Sometimes cultural norms supersede even our most primal instincts.\"https://t.co/Ae34dWyvaM]\n↓\n923670674878627841 [2017-10-26] @ultimape 💜 2 🔁 1\nBehavioral sinks. Cultural Hygiene. Rats of NIHM. (me: 2013)https://t.co/jp8f6fOFoG https://t.co/ELTUMlFAIX\nImages:\n  - [Image #0] The image shows a text discussing the original studies on rats and their behavior. The text is transcribed as follows:\n    \n    \"What many of the popular renditions of these original studies neglect to relate upon, and I think is a much more important aspect of the studies: is what the research continued on to do. They started to vary not just population, but selectively introduced 'smarter' rats. Rats that had better social skills, less temperamental, and better problem solvers, memories, etc. What they found was that societies of rats with a higher number of these individuals reduced and often eliminated the negative behaviors observed in the random assortments.\n    \n    I'd be curious to see these drug experiments compared to the later notions of the original study. I wonder if the 'smarter' mice react more quickly to attempt to reduce the drugs effects. How does the composition of the individuals in the rat-park change the effectiveness of the rat's ability to cope?\"\n\n===\n\n796982756572098560 [2016-11-11] @ultimape 💜 3 🔁 1\n\"Rats weren’t always thought to be the chortling sort, but now a large body of literature...\" https://t.co/tUpH5qQSnL *chortles*\n↓\n810115452345126913 [2016-12-17] @ultimape 💜 2 🔁 2 [(SEED) type=semantic_search]\n\"Sometimes cultural norms supersede even our most primal instincts.\"https://t.co/Ae34dWyvaM\n↓\n811274233410158593 [2016-12-20] @ultimape 💜 4\n\"Recognizing when an animal is happy or in pain could help people give captive animals a better quality of life\"https://t.co/I4nOLhBfhy\n↓\n811665153368485889 [2016-12-21] @ultimape 💜 4 🔁 1\nBayesian collectives\"studies of spatial behavior have usually been carried out on individuals…\"https://t.co/Ai5XiCobJI ht @GoatsThatStare\n↓\n891065078740549633 [2017-07-28] @ultimape 💜 1\nAre rats even alive?How do we know?What even are birds tho?https://t.co/PQXt90bhLa\n↓\n894203058338639872 [2017-08-06] @ultimape 💜 1\nIf you've got autistic rats, they seem to respond well to exercise.https://t.co/MIMWcW1OAx\n↓\n934594619928662016 [2017-11-26] @ultimape \nrats tho.https://t.co/FNcAEQqjl6 https://t.co/QBz4zBUFHL\nImages:\n  - [Image #0] The image is a text passage discussing the differences between the immune systems of wild and lab rats. The text is transcribed as follows:\n    \n    \"Parker has begun comparing wild and lab rat immune systems and it is clear they are different. Some antibodies, particularly IgE, are far more abundant in wild rats than in lab rats. A separate study has shown the same is true in the comparison between wolves and domestic dogs. One’s first reaction to noticing that the immune systems of lab rats behave differently from those of wild (and natural) rats might be to say that we should stop studying lab rats. Domestication has rendered them strange and no longer representative of a wild mammal. Fortunately, our own lifestyles have rendered us strange, too. The “strange” response of the lab rats more closely resembles that of our immune system than do the wilder responses of wild rats, wolves, or for that matter any of the other mammals that have been studied to date.\"\n↓\n936452614585307136 [2017-12-01] @ultimape \nrats tho.https://t.co/rAfDrlggSU https://t.co/PiTApeNoF9\nImages:\n  - [Image #0] The image shows a text about an experiment with rats. The text is transcribed as follows:\n    \n    All experiments in psychology are not of this type, however. For example, there have been many experiments running rats through all kinds of mazes, and so into little clear result. But in 1937 a man named Young did a very interesting one. He had a long corridor with doors all along one side where the rats came in, and doors along the other side where the food was. He wanted to see if he could train the rats to go in at the third door down from wherever he started them off. No. The rats went immediately to the door where the food had been the time before.\n    \n    The question was, how did the rats know, because the corridor was so beautifully built and so uniform, that this was the same door as before? Obviously there was something about the door that was different from the other doors. So he painted the doors very carefully, arranging the textures on the faces of the doors exactly the same. Still the rats could tell. Then he thought maybe the rats were smelling the food, so he used chemicals to change the smell after each run. Still the rats could tell. Then he realized the rats might be able to tell by seeing the lights and the arrangement in the laboratory like any commonsense person. So he covered the corridor, and, still the rats could tell.\n    \n    He finally found that they could tell by the way the floor sounded when they ran over it. And he could only fix that by putting his corridor in sand. So he covered one after another of all possible clues and finally was able to fool the rats so that they had to learn to go in the third door. If he relaxed any of his conditions, the rats could tell.\n    \n    Now, from a scientific standpoint, that is a A-Number-1 experiment. That is the experiment that makes rat-running experiments sensible, because it uncovers the clues that the rat is really using-not what you think it's using. And that is the experiment that tells exactly what conditions you have to use in order to be careful and control everything in an experiment with rat-running.\n    \n    I looked into the subsequent history of this research. The subsequent experiment, and the one after that, never referred to Mr. Young. They never used any of his criteria of putting the corridor on sand, or being very careful. They just went right on running rats in the same old way, and paid no attention to the great discoveries of Mr. Young, and his papers are not referred\n↓\n936454539699466241 [2017-12-01] @ultimape 🔁 1\n\"That's where double blind studies fall on their face [...] when you're dealing with 3 causes you'll get random results...\"\"As long as you restrict your study to 3 months, you can hide the evidence...\"\"What do you feed the control group?\"https://t.co/aDCgGKkmpsFucked.\n↓\n936454790372093953 [2017-12-01] @ultimape 💜 1 🔁 1\nFucked.https://t.co/o65ZmuUguj\n  [Quoting @ultimape: Bad: Glyphosate isn't toxic to bees.Good: Glyphosate affects foraging effectiveness in bees and fish, leading to poor nutrition selection.]\n↓\n936461926598676480 [2017-12-01] @ultimape 💜 4 🔁 1\nFuckedhttps://t.co/aVWp3WXulO\n\n===\n\n1213026510086393856 [2020-01-03] @VinveliVEERA 💜 87 🔁 23 💬 20 [(SEED) type=root]\nPeople who feel constrained by culture will enforce it\n\n===\n\n1278043599528013824 [2020-06-30] @visakanv 💜 319 🔁 24 💬 5\nWhen Jason was alone out at sea for months on end, his self unbundled into multiple personalities. \"It seemed completely sane\". This is consistent with other things I've read about people in ultra-solitude. The coherent self is constructed for interfacing with others https://t.co/kpRLk1Aq6V\nImages:\n  - [Image #0] The image contains a passage of text, which is transcribed as follows:\n    \n    \"During this period, I got really really lonely and I started talking to myself to keep myself company. I found these different personalities developing in my head during these conversations. There was an Irish, German and French guy. They were quite caricatured, but I would talk to them as the English guy. We'd have arguments together about how to do something and they almost took over my head.\n    \n    **And it's funny now, but I would imagine mildly frightening at the time.**\n    \n    It didn't seem frightening because to me it seemed completely normal. About a week before making landfall, I realized that if I arrived as one of these crazy lunatics rather than Jason Lewis then I'd probably get locked up. To me, out there, in the middle of nowhere, with no one to tell me otherwise, it seemed completely sane.\"\n    \n    This text is presented on a white background in black font.\n↓\n1668858925414862849 [2023-06-14] @Malcolm_Ocean 💜 8\n@visakanv Stowing this for reference in some writing I have drafted on the paradox of ego\n\nAbout how egos are painful to have but better than being egoless in a society that will fuck you up if you don't\n↓\n1668860067184082946 [2023-06-14] @Malcolm_Ocean 💜 3\n@visakanv Wait fuck the way I phrased this right now made me realize this is literally the same paradox as this one goddamn\n\nhttps://t.co/YUkCOVuYha\n  [Quoting @Malcolm_Ocean: The paradox I'm currently in love with: 1. existing culture is fucked up in ways I'll collectively call \"A\" 2. \"A\" is trying to fuck you up 3. \"A\" = \"people trying to protect from being fucked up by A\" 4. thus to shift \"A\" to \"B\", one must protect against \"A\" without protecting]\n↓\n1668877000642269184 [2023-06-14] @visakanv 💜 3\n@Malcolm_Ocean https://t.co/mJZ2q6dTEu\n↓\n1668877123841581056 [2023-06-14] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@Malcolm_Ocean https://t.co/k1aQNjLAez\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n↓\n1669495451165270016 [2023-06-16] @Malcolm_Ocean 💜 1\n@visakanv ah yep, very related!\n\nand then the puzzle is how to remain in society while feeling free, while also feeling unconstrained by it, so you don't feel the need to enforce it\n↓\n1669499828215353344 [2023-06-16] @visakanv 💜 2\n@Malcolm_Ocean it’s also possible to feel constrained but choose to try not to constrain others, which might be less than ideal but I think that was my dominant mode as a teenager / early 20s. “Cycle ends with me” sorta\n\n===\n\n1281802604402536448 [2020-07-11] @visakanv 💜 53 🔁 1\nI think more highly of people than they think of themselves, and this offends some of them\n↓\n1281803128912744450 [2020-07-11] @visakanv 💜 21 [(SEED) type=quote_of_root]\nlearned helplessness is a hell of a drug https://t.co/zDPViaVGt8 https://t.co/e3LTY1YBt1\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1286805772538503168 [2020-07-24] @visakanv 💜 21\nfor the curious: in my framework, “aggressively independent thinkers” map very closely to “ambitious nerds” https://t.co/LGrnUrg3SZ\n  [Quoting Tweet 1286618512996343808 (missing)]\n↓\n1286806652579004417 [2020-07-24] @visakanv 💜 7\nhttps://t.co/gDDJjXWsRd https://t.co/kJIkqN1pRu\n  [Quoting @visakanv: in a few more words: https://t.co/FK2ZCcjAu8]\n↓\n1286806830753013763 [2020-07-24] @visakanv 💜 7 [(SEED) type=quote_of_root]\nand here are the aggressive conformists: https://t.co/zDPViaVGt8 https://t.co/e3LTY1YBt1\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1305417192633020417 [2020-09-14] @visakanv 💜 50 🔁 4\nthe only thing more outrageous that unlicensed reproduction is licensed reproduction https://t.co/02FtxSvUij\n  [Quoting Tweet 1305397850772135936 (missing)]\n↓\n1305418926310924288 [2020-09-14] @visakanv 💜 34 🔁 2\nbut if you fiddle with the concepts a little, culture *is* a form of regulation. there might not be a bureaucrat with armed enforcers telling you what you should and should not do, but it’s your friends, and your mom, and aunties, and even the media and celebrities and so on\n↓\n1305419369397121024 [2020-09-14] @visakanv 💜 15 [(SEED) type=quote_of_root]\nand, https://t.co/e3LTY1YBt1\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1315221302181982208 [2020-10-11] @visakanv 💜 153 🔁 21\n\"i don't make the rules\" ah but you do choose to enforce them\n↓\n1315221458394570752 [2020-10-11] @visakanv 💜 31 🔁 1\nis there a rule that says everyone is supposed to enforce the rules? I do not see it\n↓\n1315223345734934531 [2020-10-11] @visakanv 💜 28 🔁 1 [(SEED) type=quote_of_root]\noh you mean nobody is paying you to do this? you do it because... someone did it to you? interesting\n\nhttps://t.co/2Fal4B33fY\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1330984685992722433 [2020-11-23] @visakanv 💜 1329 🔁 256 💬 10\nCan’t sleep, time to do a fresh reboot of VV’s talking points\n\n===\n\n1331008269926637568 [2020-11-23] @visakanv 💜 148 🔁 6\n42. Constructive disagreements require mutual trust, respect and goodwill.\n↓\n1331008764112035841 [2020-11-23] @visakanv 💜 156 🔁 6\n43. It is absolutely possible to change people’s minds over the Internet. It just typically takes much longer than people would like. \n\nIf you know you’re going to be around for decades anyway, why not play the long game?\n↓\n1331010144289783808 [2020-11-23] @visakanv 💜 226 🔁 24 💬 1\n44. The world is big. 0.1% of people is a lot of people. Find your weirdos.\n↓\n1331011653148704769 [2020-11-23] @visakanv 💜 110 🔁 5 💬 1\n45. Bureaucracy can be a kind of distributed brutishness. Nobody punches you in the face, but by the time you’re through with it, they might as well have 😂😅😩\n↓\n1331013230458617858 [2020-11-23] @visakanv 💜 153 🔁 9\n46. If you have a choice between arguing with internet strangers (and even friends) about abstractions, or building your personal capacity, it’s almost always wiser to build your capacity. Some arguments become interestingly irrelevant past a certain threshold of personal growth\n↓\n1331013666813034496 [2020-11-23] @visakanv 💜 225 🔁 14 💬 1\n47. Children are alien immigrants from a foreign land. This makes them incredibly valuable for their fresh perspective on things. Every philosophy department should be 50% staffed by children. I’m absolutely serious\n↓\n1331014519431172096 [2020-11-23] @visakanv 💜 245 🔁 15 💬 1\n48. Communication is *fundamentally* lossy. Misunderstanding is the default condition. It’s crazy that we even kinda-sorta understand each other at all!\n\nIf we appreciated this properly, we’d all give everybody lots of room to revise all their statements. But the public is insuf-\n↓\n1331014937456504833 [2020-11-23] @visakanv 💜 284 🔁 25 💬 1\n49. Courage is contagious. \n\nYou can become more courageous by associating with courageous people. And living your life with courage will similarly have an effect on the people around you.\n↓\n1331015780469641216 [2020-11-23] @visakanv 💜 187 🔁 11\n50. Real optimism is not just a posture but a way of being.\n\nFunnily, a lot of people pretend to be optimistic for social reasons, but aren’t fundamentally optimistic. You can tell by how they act. Optimists truly, casually believe that progress is possible, and act accordingly\n↓\n1331016427625533440 [2020-11-23] @visakanv 💜 211 🔁 10 💬 3\n51. Pedestalization is dehumanizing. We do our heroes a disservice when we pedestalize them. The kindest thing we can do for people we admire is to treat them as people. If you *have* to worship something, worship the game, not the individual players.\n↓\n1331016563558735873 [2020-11-23] @visakanv 💜 143 🔁 16 [(SEED) type=semantic_search]\n52. People who feel constrained by a culture will often contribute to enforcing it.\n├── 1331016884934893568 [2020-11-23] @m_ashcroft 💜 1\n│   @visakanv Ooooooooooh damn.\n└── 1331017822407847939 [2020-11-23] @visakanv 💜 148 🔁 10\n    53. If you don’t respect yourself, almost all your pursuits will be marred by its absence. \n    \n    Where to begin? People contain multitudes- you can start by investigating your own history. What are your proudest moments? When were you at your best? How can you do more of that?\n    ↓\n    1331018495576817666 [2020-11-23] @visakanv 💜 190 🔁 21\n    54. The most noble thing you can do with your strength is to use it to protect and nourish people - starting with yourself. \n    \n    Create spaces where people can grow strong in turn. Create contexts where trust can flourish, and people can count on each other.\n    ↓\n    1331019074042617857 [2020-11-23] @visakanv 💜 230 🔁 21\n    55. Storytelling is a superpower. Storytelling can save your life. Stories are humanizing. Stories get people to care. We all tell stories all the time, it’s worth getting good at it. Like ambition, this can be a dangerous force if not intertwined with a genuine love for humanity\n    ↓\n    1331020250465280000 [2020-11-23] @visakanv 💜 131 🔁 13\n    56. Talismans are simply objects that are meaningful to you. \n    \n    A wedding ring is a talisman everyone understands. You can imbue an object with narrative meaning via some kind of ritual or ceremony, and it can help you manage your psychology (which is The Hard Thing).\n    ↓\n    1331021002164191235 [2020-11-23] @visakanv 💜 284 🔁 21\n    57. The Hard Thing is managing your psychology (h/t Ben Horowitz). Everything else is moving levers and cranking widgets. Running a marathon, building a company, playing long games. It’s all just logistics, one foot in front of another. The hard part is managing your psychology.\n    ↓\n    1331023948444622848 [2020-11-23] @visakanv 💜 275 🔁 22 💬 1\n    58. Cruelty leaks. \n    \n    When you mock and insult others- even if they seem to deserve it- you become, to yourself, a person who mocks and insults others. \n    \n    This happens a lot with smart people who shame others for “being dumb”. They then live in chronic fear of being dumb themselves\n    ↓\n    1331025598785851395 [2020-11-24] @visakanv 💜 204 🔁 15 💬 1\n    59. Don’t summon demons. You can’t unsummon them.\n    \n    being metaphorical here: a demon is an all-consuming malevolent entity with no regard for human life. Outrage, vengeance, contempt. You might think you can “control” a demon to use as a weapon for righteous causes. You can’t.\n    ↓\n    1331026276170121217 [2020-11-24] @visakanv 💜 173 🔁 16\n    60. Read history! It’s like binge-watching past seasons of current affairs. Everything makes a lot more sense once you know the backstory\n    ↓\n    1331026867063648257 [2020-11-24] @visakanv 💜 83 🔁 8 💬 1\n    61. The Big Bang makes *much* more sense as The Great Cosmic Fart but unfortunately the scientific establishment is run by cowards\n    ↓\n    1331028433988583431 [2020-11-24] @visakanv 💜 152 🔁 12\n    62. Laughter and anxiety are two sides of the same coin. (h/t Alan Watts). It’s okay to be anxious about stuff. Saying “don’t be anxious!!” typically has the opposite effect. But if you can find a way to laugh, the anxiety usually dissipates. One must imagine Sisyphus LOL-ing\n\n===\n\n1416772878360449027 [2021-07-18] @nowtheo 💜 3 [(SEED) type=semantic_search]\nPeople _want_ to conform much more than they are _forced_ to conform\n\n===\n\n1423540594094182402 [2021-08-06] @sharanvkaur 💜 22\ni don't want to put this in a thread because i don't want to find it again because it makes me 🤢 what happened to those kids is downstream of this. https://t.co/ATbPa7rmAp\nImages:\n  - [Image #0] The image is a screenshot of a Google search results page. To recreate it, follow these steps: \n    \n    1. Open Google and type \"site:lovesingapore.org.sg inter-faith\" in the search bar. \n    2. The results page will display a list of relevant links from the LoveSingapore website, with titles and descriptions that mention \"inter-faith marriage.\" \n    The titles include \"PROMISE-KEEPING,\" \"CRYING SHAME,\" \"CITY WITHOUT WALLS,\" \"From The Ground Up,\" and \"PrayerLude,\" all related to the \"40.day 2021\" series on the LoveSingapore website.\n    \n    The titles and descriptions convey a negative attitude toward interfaith marriages, using religious language to condemn them.\n↓\n1423542008799395845 [2021-08-06] @sharanvkaur 💜 10 [(SEED) type=quote_of_root]\ni think it's simple to \"blame\" the adults for their cruelty and yes, bigotry, but if you zoom out - her mother's actions is rooted in a need for belonging and a fear of ostracization from her community. https://t.co/Be3gsFFRTV\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1424982275016568842 [2021-08-10] @Malcolm_Ocean 💜 24 🔁 1\na lot of confusions about human nature &amp; ethics are caused by not disambiguating sociopaths and non-sociopaths send tweet\n\n===\n\n1424982952463634433 [2021-08-10] @visakanv 💜 4\n@Malcolm_Ocean from:visakanv asshole problem\n↓\n1424984383354777609 [2021-08-10] @Malcolm_Ocean 💜 3\n@visakanv the name you have given to this is an example of such a confusion\n\n\"asshole\" really really really really doesn't cut it\n\nI've been called an asshole (I have, arguably, *been* an asshole) and I'm not a sociopath, and this fucked me up\nhttps://t.co/FBKnfrmHDT\n  [Quoting @Malcolm_Ocean: I ended up with a bunch of layers due to people seeing some of my behavior patterns as selfish/greedy or assholish, and then me trying to find my selfish parts or my asshole parts. Well, turns out I don't have any parts that identify as \"asshole\", so this was a wild goose chase.]\n↓\n1424984994770874369 [2021-08-10] @visakanv 💜 2\n@Malcolm_Ocean what’s your precise personal definition of sociopath?\n↓\n1424987546111651847 [2021-08-10] @Malcolm_Ocean 💜 2\n@visakanv oh shit, maybe I mean psychopaths\n\nI thought last time I looked this up the source said they were the same but now I'm getting a clear and important distinction\n\nhttps://t.co/qwEY8Py8qN https://t.co/4nJorGEJ9N\nImages:\n  - [Image #0] The image presents a comparison between sociopaths and psychopaths, highlighting their distinct characteristics. The image is divided into two columns, with the left column labeled \"Sociopath\" and the right column labeled \"Psychopath.\" Each column features a list of bullet points that outline the defining traits of each type.\n    \n    **Sociopath:**\n    \n    * Make it clear they do not care how others feels\n    * Behave in hot-headed and impulsive ways\n    * Prone to fits of anger and rage\n    * Recognize what they are doing but rationalize their behavior\n    * Cannot maintain a regular work and family life\n    * Can form emotional attachments, but it is difficult\n    \n    **Psychopath:**\n    \n    * Pretend to care\n    * Display cold-hearted behavior\n    * Fail to recognize other people's distress\n    * Have relationships that are shallow and fake\n    * Maintain a normal life as a cover for criminal activity\n    * Fail to form genuine emotional attachments\n    * May love people in their own way\n    \n    The image provides a clear and concise comparison between sociopaths and psychopaths, highlighting their differences in behavior, emotional attachment, and relationships.\n↓\n1424988056495349762 [2021-08-10] @visakanv 💜 5\n@Malcolm_Ocean always hard to nail the sea to the shore https://t.co/TBPQUFSCts\n  [Quoting @visakanv: Every word is a roughly-hewn representation of an idea, with some vague consensus about what it means. We stretch, distort, invert, resist]\n↓\n1424989689274986499 [2021-08-10] @visakanv 💜 3\n@Malcolm_Ocean so I think more than having a label for the problem, the important thing is to get clarity re: the shape of the problem. Which I think is that there are some small % of agents who are substantially deviant, aren’t deterred by usual social norms, and require a separate approach\n↓\n1424995349932957703 [2021-08-10] @Malcolm_Ocean 💜 2\n@visakanv yeah, though I do think that grokking the shape of the problem does require disambiguating {some people are doing damaging things because they lack empathy hardware} and {some people are doing damaging things because they have temporarily found a way to justify or ignore harm}\n↓\n1424996484974530561 [2021-08-10] @Malcolm_Ocean 💜 3\n@visakanv idk if you'll believe it, given how far I've come, but I felt a bit of fear when I first saw you tweeting about the asshole problem\n\nI've been the guy people wanted to get rid of\nhttps://t.co/3YzcTP6f7P\n  [Quoting @Malcolm_Ocean: @alt_visa After I facilitated BioEmotive for someone (basically a stranger) she kept insisting I was such a natural empathic listener, and I was like \"you have no idea how many times I've been called an asshole, and how hard I've trained to be able to do this\" but she wouldn't have it.]\n↓\n1424997166230167571 [2021-08-10] @Malcolm_Ocean 💜 2\n@visakanv ah that was also because of punishment-oriented tweets like this one\nhttps://t.co/v1AOLMVsEi\n  [Quoting @visakanv: Bad actors are not sufficiently penalised for the far-reaching consequences of their actions]\n↓\n1424998422202011648 [2021-08-10] @Malcolm_Ocean 💜 1\n@visakanv oh! an interesting connection between non-sociopathic asshole-dom &amp; genetic non-empathic psychopaths... relates to the envy thing!\n\nspecifically, if psychopaths don't respond to punishment, and someone's doing something I got punished for... 🤔🤯\nhttps://t.co/qwQXF6D4u4\n  [Quoting @natural_hazard: Different thing: I remember meeting a dude at a party and thinking he was an annoying asshole  what that actually meant: you are doing things I used to always want to do, but got punished into not doing, and somehow you are doing it and it's working and you're not being punished]\n↓\n1425000856085155844 [2021-08-10] @visakanv 💜 2 [(SEED) type=quote_of_root]\n@Malcolm_Ocean https://t.co/4LcuVZ3jgs\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1475424587366092804 [2021-12-27] @visakanv 💜 221 🔁 10\nit’s startling sometimes what people will reveal without intending to. here’s an example of a person who was traumatised, and partially knows it (“severely isolated”), but hasn’t yet connected the dots and faced the full pain and horror of it https://t.co/wj4axsggpw\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1475425042301288450 [2021-12-27] @visakanv 💜 58\nit reminds me of something similar I once encountered a couple of years ago that sent shivers down my back: a woman arguing desperately that she knew what she was getting into with her rapist, that she was in control, not like all those other stupid girls who didn’t know better\n↓\n1475425497173540866 [2021-12-27] @visakanv 💜 75\nit’s so easy to find ways to mock or insult people like this, especially when their broken methods of dealing with their trauma involves them shitting on other innocent people\n\nbut when you really see what’s going on it’s so sad. mockery doesn’t help at all\n↓\n1475426003228913668 [2021-12-27] @visakanv 💜 78\nthinking now also about older folks who need to insist that they were unharmed by their own parents’ beatings and abuse, and snap about how soft kids these days are, etc… there’s a similarity in the patterns\n↓\n1475426951904915460 [2021-12-27] @visakanv 💜 58 🔁 2\npeople who were punished for crying seem to get *especially* uneasy when they see other people crying. they can’t just scroll past. they have to get involved to remind themselves how strong and brave they were for not crying\n↓\n1475427266414800896 [2021-12-27] @visakanv 💜 77 🔁 4 [(SEED) type=quote_of_root]\n😔 those of us who can do better, let’s do better https://t.co/k1aQNk2Dgz\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n↓\n1475428257650466816 [2021-12-27] @visakanv 💜 107 🔁 6\n“if low grade abuse is so bad then how come I went through high grade abuse and I’m still standing, huh???” Oh honey ❤️ https://t.co/cNbXtTSLBQ\nImages:\n  - [Image #0] The image depicts a scene from the TV show \"The Fresh Prince of Bel-Air,\" showing Will Smith and his uncle, Philip Banks, standing in the living room of their mansion. The image is a still from the show, capturing a moment between the two characters.\n\n===\n\n1488356526028771329 [2022-02-01] @goblinodds 💜 843 🔁 47 💬 3\nhot take: virgins cant meaningfully consent to sex\n↓\n1488369016406114310 [2022-02-01] @goblinodds 💜 66\nwhoa, i've received notifs for almost none of the comments so far\n\nspooky\n↓\n1488370146166984706 [2022-02-01] @goblinodds 💜 133 🔁 1\nif u ever see me apologize for this tweet, that's a sign i'm being held hostage\n↓\n1488427261514633217 [2022-02-01] @AskYatharth 💜 4 🔁 1 [(SEED) type=semantic_search]\n@goblinodds some people are held hostage by their sense of conformity\n↓\n1488562115715629058 [2022-02-01] @goblinodds 💜 2\n@AskYatharth true :'(\n\n===\n\n1505181874427404290 [2022-03-19] @visakanv 💜 101 🔁 7\nafter years and years of thinking about it, observing it, analyzing it, questioning it, I've come to think of culture as a sort of \"aether\". it exists primarily in people's minds, of course, and it manifests in behavior patterns, architecture, rituals, all sorts of things...\n↓\n1505182319203995649 [2022-03-19] @visakanv 💜 61 🔁 7\nthe dominant thing culture does is it regulates. the aether is regulatory. it tells people how to act, how not to act, what they should argue about, what's rude, inappropriate, taboo, forbidden. the aether is largely hallucinated, and also, it can summon real violence upon you\n↓\n1505182832377090054 [2022-03-19] @visakanv 💜 38 🔁 1\nu could also think of culture as \"oceanic\", using a water metaphor. it's a medium. it has currents. it has waves and crests and whirlpools and typhoons, it hosts life, it can kill, there are ecosystems within ecosystems, you disrespect it at your own peril https://t.co/hbbXXkTTlx\n  [Quoting @visakanv: My goal in life is to be a word artist-magician. Words are proxies for thoughts, and a master manipulator of words is a skilled navigator in the tumultuous ocean of meaning. Moana, but the ocean is the mind of humanity https://t.co/KY27aZUguA]\n↓\n1505183483215609860 [2022-03-19] @visakanv 💜 39 🔁 4\nI think maybe ~1% of people really *produce* culture, at the cutting edge, at the frontiers. they remix and reshape and renew. most people are consumers, critics, enforcers, regulators. I used to be upset about this. Now I think \"1% is a lot of people!!!\" https://t.co/iUFSsOHwqY\n  [Quoting @visakanv: 8. don't ask questions just consume product and then get excited for next products https://t.co/e9WJfiQgyQ]\n↓\n1505184446194282501 [2022-03-19] @visakanv 💜 43 🔁 2 [(SEED) type=semantic_search]\npeople who feel constrained by culture are *especially* vigorous when it comes to enforcing it. whereas the people who surf the waves of culture confidently, and walk easily through its hallucinated walls, feel little need to enforce anything at all\n↓\n1505184992217149443 [2022-03-19] @visakanv 💜 36 🔁 2\none of the many ways of thinking about culture is its a way of conceptualizing reality. unconceptualized reality is too much, too overwhelming, too chaotic for most humans most of the time. you might glimpse it in moments of ecstasy, but the rest of the time u often need a system\n↓\n1505185480555786243 [2022-03-19] @visakanv 💜 19\neach way of seeing is *necessarily* and *definitionally* also a set of blinders. every frame has boundaries, the decision of what to include is simultaneously a decision of what to exclude. euphemistic language about inclusivity etc has clouded lots of ppl's thinking abt this\n↓\n1505187589699280896 [2022-03-19] @visakanv 💜 38 🔁 1\nthe big tension of my adult life is my confusion at my casual ability to walk thru the walls of hallucinated culture while everywhere around me people say things like \"that's not possible\", \"that can't be done\". it's made me question my own sanity + talk with thousands of people\n↓\n1505188896036261888 [2022-03-19] @visakanv 💜 16 🔁 1\nI've been thinking about this for a long time\n\nit's difficult to have this conversation in a public plaintext space like twitter and expect/assume good faith, partially bc people tend to be carrying their own private anxieties about related matters...\nhttps://t.co/KyAKBxJBXQ\n  [Quoting @visakanv: Childhood:  me: I’m just a nerd  others: fuck that... you’re special  me: I’m special? Oh shit! Get a load of me!  others: fuck you, you ain’t special  me: huh. I’m guess I’m not special. That’s kind of a relief. anybody can do what I do!  people: fuck you, you’re not normal  me: https://t.co/Oo0zzKyI6q]\n↓\n1505189305878474754 [2022-03-19] @visakanv 💜 22 🔁 1\nI do not want to exclude or alienate other people, so you can see I put in a ton of effort into being welcoming, encouraging, helping people feel at home\n\nbut I draw the line (and this took me a long time!!) at suppressing myself, my abilities, curiosities, etc\n↓\n1505189691360165898 [2022-03-19] @visakanv 💜 9 🔁 1\nand i've talked with enough people about this IRL, over zoom calls, etc, to know that there are people who take the time and trouble to consider this stuff seriously, and to see that it's not just a cry for attention or validation (and what's so wrong with that, anyway?)\n↓\n1505190282564096001 [2022-03-19] @visakanv 💜 13\nbut rather, it's an interesting and consequential challenge. what do you do with people who are cultural chimaeras, who are meant to operate at the frontier? well – sorta ironically, &amp; definitionally, there isn't really  an answer to that question. you just get used to discomfort\n↓\n1505190474675810311 [2022-03-19] @visakanv 💜 12 🔁 2\nto me, it's very important – and I think it's important for everyone – that the people who are at the frontiers of culture are able to do their work unhindered by stupid bullshit, because it's very consequential work. unfortunately, as a species we are still very bad at this\n↓\n1505190723637116930 [2022-03-19] @visakanv 💜 20\nfor the vast majority of human history, human creativity was primarily expended suppressing human creativity. this is weird to think about. but I'm pretty convinced it's true. read Deutsch's beginning of infinity for a more comprehensive explanation about how/why this is\n↓\n1505191010045140995 [2022-03-19] @visakanv 💜 11\nwe are very new to being ubermensch and we are very bad at it. most of us who are capable of it, or adjacent to being capable of it, are whining and pissing and shidding and farding about it. because it is hard. it is, again, by definition, I think, the hardest thing in the world\n\n===\n\n1516164224858341386 [2022-04-18] @nosilverv 💜 9 [(SEED) type=semantic_search]\nUptight people are pretty constrained\n↓\n1516164226238275592 [2022-04-18] @nosilverv 💜 7\nI think most Germanic people are like this. Don't know why, but lots of loops\n\n===\n\n1534024016318824449 [2022-06-07] @visakanv 💜 190 🔁 15\nhere’s a classic move from the Status Quo Soldier’s arsenal: “unless you can personally accomplish the change you seem to be  advocating for, you should be quiet.” I’ve seen this crop up in all sorts of contexts and it’s always fascinating to me https://t.co/TorWNHpryq\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1534024399187509248 [2022-06-07] @visakanv 💜 105 🔁 2\n1. first of all, it fails to acknowledge something that feels obvious to me, which is that talking about change is part of the process of enacting change. you need to tell people about the problem, build consensus that the problem exists and that something needs doing\n↓\n1534025248395661312 [2022-06-07] @visakanv 💜 70\n2. this argument can also be kinda self-defeating if you turn it on itself. either speech makes a difference or it doesn’t. if you think it doesn’t, then you should take your own advice and shut the fuck up! like, for your own sake, from your own premises!\n↓\n1534025812273672193 [2022-06-07] @visakanv 💜 35\nwe can get more nuanced about 2: that some speech can make more of a difference than others. I think this is true, especially considering that we have limited time and energy, so we ought to focus on what we want to see more of. so I don’t usually waste time arguing with SQSs…\n↓\n1534026442304278528 [2022-06-07] @visakanv 💜 36\nbut i do want to help my friends, and people who take the trouble to share their considered thoughts with the world, to better deal with SQSes when they encounter them. i’ve spoken before at length with some of these ppl. they’re hurting inside tbh. dominance-hierarchy-brained\n↓\n1534026975169617922 [2022-06-07] @visakanv 💜 40\nthere’s a parallel with the vocal pessimist who optimistically tries to persuade everyone to be more cynical, as if that would achieve something. \n\n(a true pessimist wouldn’t bother, because what’s the point?) https://t.co/T98Ut1dqCn\n  [Quoting @visakanv: pictured: optimists who believe in the utility of communication https://t.co/FyH4FQflPP]\n↓\n1534028091697561600 [2022-06-07] @visakanv 💜 36 🔁 1 [(SEED) type=quote_of_root]\nthe SQS has typically been hurt/attacked/insulted for their past expressions of optimism, of desire for positive change, of hope. so they imprison themselves internally, to protect themselves from disappointment, and become enforcers, seeking to perpetuate this in others https://t.co/k1aQNjLAez\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n↓\n1534028859632685056 [2022-06-07] @visakanv 💜 45 🔁 1\nonce you understand their psychology you realize you can’t dissuade them from this course of action by saying “that’s cruel/mean”, because their worldview is “life’s cruel/mean” \n\nand implicitly there’s also “…and i have no agency/power to be better than this cruel world” https://t.co/xwlTWLCgUW\n  [Quoting Tweet 1532862291644776448 (missing)]\n↓\n1534029514141241344 [2022-06-07] @visakanv 💜 35\nSo for the most part the move is to smile and nod and step right past them to continue to chat with the people who do get it\n\nif you must engage, i recommend using the So True Bestie https://t.co/utGysBYOrU\n  [Quoting @visakanv: Kpop stans are masters of this and I respect it. You insult them and they reply “so true bestie, anyway stream &lt;favorite artist&gt;”. And it is with that sort of relentless unbotheredness that they punch above their weight as a collective. Keep the end goal in mind]\n↓\n1534029752969076736 [2022-06-07] @visakanv 💜 45\nHere’s what the So True Bestie looks like in action https://t.co/iea7bmBRTi\n  [Quoting @visakanv: 🥰❤️ truly delightful I’m smiling ear to ear  A few hundred more beloved haters like this and I will probably be able to retire financially https://t.co/D8j3RYOgFT]\n↓\n1534032024457314304 [2022-06-07] @visakanv 💜 39\ntry to be gentle and kind to status quo soldiers if you can\n\nthose are alien concepts to them and it’ll confuse the mfs\n\n===\n\n1565214980307238913 [2022-09-01] @AskYatharth 💜 11\nif you distorted yourself to conform, you will resent those who seemingly didn’t make the sacrifice https://t.co/WNGFKXczu9\n  [Quoting Tweet 1564535863962386432 (missing)]\n↓\n1565214982152761345 [2022-09-01] @AskYatharth 💜 5\n“but that’s not fair”- said the boy \n\n“i thought we had to do the thing”\n\n“it’s not fair they didn’t have to do the thing”\n├── 1565215561146982401 [2022-09-01] @visakanv 💜 1 [(SEED) type=quote_of_root]\n│   @AskYatharth https://t.co/k1aQNk2Dgz\n│     [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n└── 1565222857952542720 [2022-09-01] @AskYatharth 💜 7 [(SEED) type=quote_of_root]\n    people who feel a lack of autonomy find it really hard to respect it in others https://t.co/VIzcOcEd3b\n      [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1587670866501849088 [2022-11-02] @visakanv 💜 394 🔁 24\npeople who give up when they make mistakes get very confused when they see someone making and correcting mistakes in real time\n↓\n1600206311660343296 [2022-12-06] @visakanv 💜 44\npeople who respond to discouragement get confused when they encounter someone who doesn't\n↓\n1600206585871355904 [2022-12-06] @visakanv 💜 45 🔁 3 [(SEED) type=semantic_search]\npeople who live according to social regulations get confused when someone doesn't\n↓\n1600206799520796672 [2022-12-06] @visakanv 💜 49 🔁 2\npeople who hate themselves get confused when they encounter someone who doesn't\n↓\n1600207122771644429 [2022-12-06] @visakanv 💜 40 🔁 2\npeople who obsess about sex and money get confused when they meet someone who doesn't\n↓\n1600207646296264704 [2022-12-06] @visakanv 💜 47 🔁 2\npeople who need arguments and explanations and justifications to live their lives get confused when they meet someone who doesn't\n↓\n1600208111939485697 [2022-12-06] @visakanv 💜 40 🔁 3\npeople who derive their sense of meaning n purpose from a singular source get confused when they meet someone who doesn't\n↓\n1600209003279450112 [2022-12-06] @visakanv 💜 59 🔁 4\nhowever you are, there's someone out there who isn't\n↓\n1600819660915879936 [2022-12-08] @visakanv 💜 22 🔁 1\npeople who have been down a moderate amount get confused by the messaging that only works for the people who are down BAD\n↓\n1600889644773560327 [2022-12-08] @eshear 💜 3\n@visakanv people who need an external source of justification to judge right and wrong get confused when they meet someone who does not\n↓\n1600889915507494927 [2022-12-08] @visakanv 💜 1\n@eshear just had this open in another tab! https://t.co/ConhQNyXqQ\n  [Quoting Tweet 1600827631091429376 (missing)]\n\n===\n\n1628425448282804225 [2023-02-22] @rslantonie 💜 3\nhow much effort do we put into formalizing something into legitimacy? https://t.co/jaupS8Ie0S\nImages:\n  - [Image #0] The image depicts a digital illustration of a person with a flower for a head, set against a teal background. The person is shown from the shoulders up, wearing a green jacket and black hat, with a red poinsettia flower replacing their head. The image features various text elements, including \"1/2\" in the top-left corner, \"2:20\" accompanied by a speaker icon in the bottom-left corner, and \"Voice\" in the bottom-right corner.\n    \n    *   The image is a digital illustration of a person with a flower for a head.\n        *   The person is shown from the shoulders up.\n        *   They are wearing a green jacket and black hat.\n        *   A red poinsettia flower replaces their head.\n    *   The background of the image is teal.\n    *   The image includes several text elements:\n        *   \"1/2\" is displayed in the top-left corner.\n        *   \"2:20\" is shown in the bottom-left corner, accompanied by a speaker icon.\n        *   \"Voice\" is written in the bottom-right corner.\n↓\n1628425568340545541 [2023-02-22] @rslantonie  [(SEED) type=semantic_search]\nhttps://t.co/25neyU2qqC https://t.co/oNWWDMGsUW\n  [Quoting @rslantonie: culture exists where you least enforce it]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n\n===\n\n1649534323870105602 [2023-04-21] @NathanpmYoung 💜 178 🔁 13 💬 1 [(SEED) type=semantic_search]\nimagine being constrained, helplessly bound by protocol, forced to do things you don't want without a word of protest\n\nbut enough about the civil service https://t.co/x4SmOtsRp4\nImages:\n  - [Image #0] The image is a screenshot of an article on Mail Online, titled \"Civil servants who enjoy bondage say they should get the same rights at work as other minority groups - including support networks and training courses.\" \n    \n    The article is written by Martin Beckford and was published on April 21, 2023, at 13:08, with an update at 13:36. The title is displayed prominently in large black text against a white background.\n    \n    Below the title, there is a photograph showing a person's wrists tied together with a black rope or cord, with their hands resting on their lap. The image is slightly blurred, and the person's face is not visible.\n    \n    At the bottom right corner of the image, there is a blue button with a camera icon and the text \"+3 View gallery,\" indicating that there are additional images available to view.\n↓\n1649534327351279617 [2023-04-21] @NathanpmYoung 💜 25\ndon't shame them! that's what they want\n↓\n1649679809293832193 [2023-04-22] @NathanpmYoung 💜 16\nObject level beliefs?\n\nKink is fine and one shouldn't be able to be fired for doing it. Who knows what reality is, this is a daily mail article. I don't think people should get work support for it and having work networks for NSFW activities seems strange to me.\n\n===\n\n1667574202243899393 [2023-06-10] @visakanv 💜 366 🔁 15\nI’ve been online 20+ years and have spoken to 1000s of people over hundreds of thousands of tweets/comments/posts etc and one thing I’ve noticed repeatedly is that its never happy or successful people who feel the need to dismiss the throwaway thoughts of others https://t.co/RRcqY64ya5\nImages:\n  - [Image #0] The image shows a tweet with a reply to the user @visakanv. The tweet is displayed on a dark blue background, and the text is written in white.\n    \n    * The tweet starts with a reply to @visakanv, indicated by the text \"Replying to @visakanv\" in light blue.\n    * The main text of the tweet reads: \"and getting into the 1% of the 1% of the 1% is even harder than that!\" followed by \"what an amazing insight!\".\n    * Below the text, there are four icons representing different actions that can be taken on the tweet:\n      * A speech bubble icon indicating 1 comment.\n      * A retweet icon.\n      * A heart icon.\n      * A bar chart icon indicating 32 views.\n      * A share icon.\n    * To the left of the tweet, there is a yellow smiley face emoji wearing sunglasses.\n    \n    The tweet is a response to @visakanv, expressing admiration for an insight related to achieving a high level of success, represented by \"getting into the 1% of the 1% of the 1%\".\n↓\n1667574728360599555 [2023-06-10] @visakanv 💜 112 🔁 2\nthere are multiple interesting parts to this, the first being the assumption that the author is trying to be insightful, or obliged to be insightful. IMO this is often some level of envy/resentment at the person having access to an audience, clout, etc that seems “undeserved”\n↓\n1667575129029894145 [2023-06-10] @visakanv 💜 137 🔁 9\nthe second bit, which is sometimes intertwined with the first, and the real sad part in my view, is the inability to appreciate that insight is something that emerges from a *process* of study. Which is to say, if you want to be insightful, you have to make “dumb” observations\n↓\n1667576042222133248 [2023-06-10] @visakanv 💜 175 🔁 20\nthe more time and energy you spend dunking on other people for having thoughts that you deem unworthy, the harder it becomes for you to say or do anything yourself, because you’ve normalized this sort of dismissive criticism. So these ppl end up screaming from a tiny chalk circle\n↓\n1667583918629855232 [2023-06-10] @tr_babb \n@visakanv Thinking of these people as externalizing an internal voice that says these same things to them, and prevents them from getting the exact things they're jealous of\n↓\n1667584197618286592 [2023-06-10] @tr_babb 💜 2 [(SEED) type=semantic_search]\n@visakanv Secondary observation: When people feel they're bound by rules, they try and make sure everyone else is bound by those rules too\n↓\n1667584474945830913 [2023-06-10] @visakanv 💜 1 [(SEED) type=quote_of_semantic_search]\n@tr_babb yes!! https://t.co/98KHAvBI67\n  [Quoting @visakanv: people who feel constrained by culture are *especially* vigorous when it comes to enforcing it. whereas the people who surf the waves of culture confidently, and walk easily through its hallucinated walls, feel little need to enforce anything at all]\n\n===\n\n1914644665535488422 [2025-04-22] @ca_highlights  [(SEED) type=quote_of_semantic_search]\non this day in 2023, @NathanpmYoung tweeted:\n\nhttps://t.co/ZgRVMT5W6O\n  [Quoting @NathanpmYoung: imagine being constrained, helplessly bound by protocol, forced to do things you don't want without a word of protest  but enough about the civil service https://t.co/x4SmOtsRp4]\n\n===\n\n1932120121688101095 [2025-06-09] @nosilverv 💜 204 🔁 9\nfuckfuckufkc should i write up my blogpost about this lol. one line is \"All culture is the creation and maintenance of taboos: the deliberate curtailing of one’s individual freedom for the sake of the group.\" and how taboos all work as enabling constraints\n↓\n1932122942193987947 [2025-06-09] @shan_rauf 💜 1 [(SEED) type=quote_of_root]\n@nosilverv I'd read it; reminds me of this tweet\n\nhttps://t.co/B7kqdiQpd9\n  [Quoting @VinveliVEERA: People who feel constrained by culture will enforce it]\n\n===\n\n1950270022162772451 [2025-07-29] @scottdomes 💜 2 [(SEED) type=semantic_search]\nthose who feel unfree will try to limit others’ freedom\n\n===\n\n1957130834273579413 [2025-08-17] @ChrisChipMonk 💜 712 🔁 64\nWhen I discover someone handles conflicts well, I respect &amp; trust them like 3x more. Being able to be in conflict without getting triggered OR being a pushover (which leads to outbursts and avoidance long-term) is extremely attractive, I want you in my life\n↓\n1957152076364165586 [2025-08-17] @Johnny2Fingersz  [(SEED) type=semantic_search]\n@ChrisChipMonk Everyone has a limit, imposed and enforced by culture\n\n===\n"
}