{
  "tweet_id": 1321518942033186822,
  "thread_text": "1188795948375232513 [2019-10-28] @easoncxz 💜 6\nPerhaps I should start a thread of ideas for Twitter power-tools. Who needs note-taking applications when you've got Twitter threads?\n↓\n1188796528959217667 [2019-10-28] @easoncxz \n- Searching within your own \"likes\".\n\n- A search filter for polls.\n\nhttps://t.co/bJtHJmloC1\n  [Quoting @easoncxz: Also, Twitter search is really being stretched to breaking point here: not only have I no way to search my favourited tweets (aka \"likes\"), there's also nothing to find polls, in the style of a `filter:polls` search term. https://t.co/7Yj8rzv5L8]\n↓\n1188796905502851072 [2019-10-28] @easoncxz \n- Usable UI for all \"advanced search\" terms/clauses\n\nhttps://t.co/oMaDVz98j0\n  [Quoting @easoncxz: The `filter:follows` operator mentioned in the earliest tweet in this thread is mentioned also in this Twitter search guide: https://t.co/ckgJiGJYsc  Interestingly, I have trouble finding this `filter:follows` clause in any official Twitter docs.]\n↓\n1188797325616959488 [2019-10-28] @easoncxz 💜 1\n- Timeline/List replay tool (ideally with usable scrubbing UI). This one is big for archaeology of historic events (aka news) on Twitter.\n\nhttps://t.co/ll1pSbCcBk\n  [Quoting @easoncxz: This is actually so incredibly fascinating: we can also see the opposing camp's perspective by finding a list of pro-China accounts, and rewind the timeline there. E.g. this horrible list: https://t.co/Z1uMUpJ5M9  Yields these HKIA videos: https://t.co/LpaRtB6jKw]\n↓\n1188799353688748037 [2019-10-28] @easoncxz \nA social network structure analysis tool, e.g. \"find my biggest followers\". Since we're aiming for \"power tool\", at max ambition, this could conceivably have SQL (!!) as its UI. Of course, alternatively, a click-through UI for common queries would also be nice.\n↓\n1188799877892820993 [2019-10-28] @easoncxz 💜 2\nAs always, @visakanv emits and attracts various Twitter skills; I've just stumbled upon this reference to a Twitter CLI power tool: https://t.co/Khm2QQJWjd\n  [Quoting Tweet 1050006798034526208 (missing)]\n↓\n1188803375036424193 [2019-10-28] @easoncxz 💜 1\n@visakanv Next idea: something that deals with the tree-ness of Twitter threads (we're lucky due to one tweet having only one in-reply-to tweet, we have a tree instead of a general graph). Relevant discussion: https://t.co/EaNrhofQq6\n\nThe solution could be a Reddit-like UI (!!) for Tweets.\n  [Quoting @Malcolm_Ocean: @GRITCULT For linear threads: @threadreaderapp. @kriskarzy For branchy conversations: Treeverse https://t.co/fX76jMpXuP  I want an app that lets you send tweets in-thread while browsing tree-wise, and would contribute $200-500 towards someone making it. RT if also interested. https://t.co/0hcfmoZnez]\n↓\n1188975929361649665 [2019-10-29] @easoncxz \n@visakanv Oh yeah, almost missed this obvious one (which was once upon a time provided by Twitter as an official feature): see a given user's timeline (i.e. of accounts they follow). https://t.co/WYEvehCXMf\n  [Quoting Tweet 1152321460079403008 (missing)]\n↓\n1197664353924739072 [2019-11-21] @easoncxz 💜 2\n@visakanv A super-condensed structural metadata visualisation tool, like Tetris: https://t.co/WN8nslIu3G\n↓\n1273256521162317830 [2020-06-17] @easoncxz \n\"You and X both blocked these 283 accounts: …\" and \"X is blocked by 125 accounts you follow\". https://t.co/mFIQeA8nJD\n\nAs it stands, this may not be possible because personal blocklists are not public, but there are (or had been! 😢) efforts like https://t.co/MWPLOLQvkb\n  [Quoting Tweet 1273186185083576322 (missing)]\n↓\n1322118276617363458 [2020-10-30] @easoncxz 💜 1 [(SEED) type=quote_of_root]\nPersonal-assistant for thread-composition: https://t.co/OVYOrGYXLK\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1385018216351617024 [2021-04-21] @easoncxz \nTweet calendar: a catalogue of tweets of one user (let's say yourself) organised by date units (week, month etc) https://t.co/dfGBkMxZD9\n\n===\n\n1267212828223713281 [2020-05-31] @exgenesis 💜 3 [(SEED) type=semantic_search]\nI'm so hyped to show you the new thread helper holy shit\n↓\n1267219448093704194 [2020-05-31] @natural_hazard \n@ExGenesis u working with rival? Or is this a dif thing?\n↓\n1267219743045492736 [2020-05-31] @exgenesis 💜 2\n@natural_hazard same thinghttps://t.co/CEzjYQf8m1\n  [Quoting @exgenesis: @nosilverv and I are working on a twitter thread helperSign up to the waiting list https://t.co/hfgB5VvCcX https://t.co/MIzxsmJfmB]\n\n===\n\n1314224358634721289 [2020-10-08] @nosilverv 💜 5 [(SEED) type=semantic_search]\nDraft from the email me @ExGenesis are writing to update people about the new version of Thread Helper https://t.co/inZ8yt0kS9\nImages:\n  - [Image #0] The image is a religious illustration with a blue and white logo in the center that reads \"Thread Helper\". The logo is superimposed over a depiction of Jesus Christ surrounded by angels and other religious figures.\n↓\n1314229069966344192 [2020-10-08] @exgenesis 💜 1 [(SEED) type=quote_of_semantic_search]\n@nosilverv open alphahttps://t.co/CjKKKmHDQR\n  [Quoting @exgenesis: THREAD HELPER OPEN ALPHA IS NEARLY UPON US]\n\n===\n\n1314228460039147520 [2020-10-08] @exgenesis 💜 11 🔁 2 [(SEED) type=semantic_search]\nTHREAD HELPER OPEN ALPHA IS NEARLY UPON US\n↓\n1314228461549088768 [2020-10-08] @exgenesis 💜 3\nGET READY TO WATCH YOUR PAST PRESENT AND FUTURE THOUGHTS CONVERGE INTO SWEET BABY INSIGHTS\n↓\n1314228463184867329 [2020-10-08] @exgenesis 💜 3\nSIMULTANEOUSLY WITH EVERYONE ELSE YOU KNOW AS YOU HYPERCONNECT YOUR BRAINS IN AND EX TERNALLY UNTIL GLORIOUS FLUID COMMUNICATION IS ACHIEVED\n↓\n1314228464766062594 [2020-10-08] @exgenesis 💜 5\nTIME BECOMING BOTH MEANINGLESS AND MEANINGNESS AS DESIRE PATHS OF QT FORM AND PAGERANK SHOWS THE TRUE GRAPH FORM OF OUR COLLECTIVE CONSCIOUSNESS\n↓\n1314228467228127238 [2020-10-08] @exgenesis 💜 3\nTHREADS REPLACING ONE ANOTHER IN THE KALEIDOSCOPIC TAPESTRY OF THE HUMAN COSMOS\n↓\n1314228469937647616 [2020-10-08] @exgenesis 💜 4\nYOU WILL SIMULTANEOUSLY SHIVER IN AWE AND BLOOM IN DELIGHT AS YOU GRASP THE TAPESTRIES LOOSE ENDS AND TAKE PART IN THE WEAVING OF A TRULY PLURAL BEING\n↓\n1314228717976051713 [2020-10-08] @exgenesis 💜 8\n@nosilverv https://t.co/jn1zuIAYa5\nImages:\n  - [Image #0] The image is a collage of religious artwork, with a prominent logo in the center. The logo features the text \"Thread Helper\" in a white box on a dark blue background, with \"Thread\" written in a stylized font and \"Helper\" in a more straightforward font.\n    \n    *   The top half of the image depicts a scene of Jesus Christ surrounded by angels and saints, all with halos, against a starry night sky.\n        *   Jesus is shown in a circular frame, wearing an orange robe and gesturing outward with both hands.\n        *   The surrounding figures are seated on benches, dressed in various robes, and appear to be watching Jesus.\n    *   The bottom half of the image is divided into three sections, each depicting a different biblical scene.\n        *   The left section shows a group of people gathered around a figure, possibly a baptism or other religious ritual.\n        *   The middle section features a person standing on a cliff, looking out over a body of water, with a figure in the distance.\n        *   The right section illustrates a dramatic scene of people being swept away by a large wave or flood, with a dragon-like creature in the foreground.\n    *   The overall atmosphere of the image is one of reverence and spirituality, with the religious artwork and logo suggesting a connection to a particular faith or community.\n    \n    The image appears to be promoting a service or tool related to online discussions or forums, possibly focused on religious or spiritual topics.\n\n===\n\n1314228832149397505 [2020-10-08] @exgenesis 💜 6 [(SEED) type=semantic_search]\nif @0x49fa98 wrote copy for threadhelper https://t.co/CjKKKmHDQR https://t.co/GxlUPonMxZ\n  [Quoting @exgenesis: THREAD HELPER OPEN ALPHA IS NEARLY UPON US]\nImages:\n  - [Image #0] The image features a collage of religious artwork, with a prominent logo in the center. The logo consists of a dark blue rectangle with a white squiggle and the word \"Thread\" written in white, accompanied by a white rectangle to its right containing the word \"Helper\" in blue.\n    \n    **Collage Composition:**\n    \n    * The collage is divided into four sections, each depicting a different scene from religious artwork.\n    * The top section shows a group of people seated on benches, with a figure in the center surrounded by a halo.\n    * The bottom-left section illustrates a scene with multiple figures, including some with halos, engaged in various activities.\n    * The bottom-right section portrays a dramatic scene with people being swallowed by a large mouth, while others are shown fleeing or being attacked by creatures.\n    \n    **Color Scheme:**\n    \n    * The dominant colors used in the collage are shades of red, orange, green, and blue, which are characteristic of traditional religious artwork.\n    \n    **Overall Impression:**\n    \n    * The image appears to be a promotional material for \"Thread Helper,\" possibly a tool or service related to social media or online content creation.\n↓\n1314229235603603456 [2020-10-08] @exgenesis \n(thread)\n\n===\n\n1314241258420830208 [2020-10-08] @exgenesis 💜 2 💬 1 [(SEED) type=semantic_search]\nthreadhelper the esoteric company: we don't make software, we make artifacts\n↓\n1314242284590895104 [2020-10-08] @exgenesis \nHow else would you act upon the collective consciousness?\n\n===\n\n1314570259265970176 [2020-10-09] @nosilverv 💜 5 🔁 1 [(SEED) type=quote_of_semantic_search]\nTHE ESOTERIC COMPANY\n\nEXOTERIC *AND* ESOTERIC THREADHELPER https://t.co/yXmXwsxYV5\n  [Quoting @exgenesis: threadhelper the esoteric company: we don't make software, we make artifacts]\n\n===\n\n1314571061770563584 [2020-10-09] @exgenesis  [(SEED) type=quote_of_semantic_search]\nRT @nosilverv: THE ESOTERIC COMPANYEXOTERIC *AND* ESOTERIC THREADHELPER https://t.co/yXmXwsxYV5\n  [Quoting @exgenesis: threadhelper the esoteric company: we don't make software, we make artifacts]\n\n===\n\n1317228587469180928 [2020-10-16] @exgenesis 💜 8\nI love you all but is anyone else kinda tired of reading tweets by thinking heads waxing abstractly?\n↓\n1317232880259461120 [2020-10-16] @JimmyRis 💜 1\n@ExGenesis Just don’t do that\n↓\n1317361372817166336 [2020-10-17] @exgenesis \n@JimmyRis I've got friends here :(\n↓\n1317760676593479680 [2020-10-18] @JimmyRis 💜 1\n@ExGenesis Spur them to specificity and action\n↓\n1317796322259439618 [2020-10-18] @exgenesis \n@JimmyRis Name one time spurring worked ever\n↓\n1317948988180500484 [2020-10-18] @JimmyRis 💜 2\n@ExGenesis https://t.co/TDZHhUc1ip https://t.co/i6KDv04AIx\n  [Quoting @DanielleFong: Feynman had a gf and she was so tired of him talking a big game and not actually writing up his work on quantum electrodynamics she actually locked him in a room and like, slipped flat food through the door till he wrote a paper  it won the nobel prize  giving me ideas https://t.co/dPQfj2jISs]\n↓\n1317949067775766528 [2020-10-18] @JimmyRis 💜 1\n@ExGenesis Personal anecdotes are mostly offline\n↓\n1317953531911925761 [2020-10-18] @JimmyRis  [(SEED) type=semantic_search]\n@ExGenesis What inspired creation of thread helper?\n↓\n1318477990884499458 [2020-10-20] @nosilverv 💜 2\n@JimmyRis @ExGenesis I have been summoned \n\n(March 2020) https://t.co/9HDOAZmNQc\nImages:\n  - [Image #0] The image is a document discussing Twitter threading, with the following content:\n    \n    The document is titled \"About me:\" and has two main sections: \"The Why\" and \"Opportunity\". \n    \n    \"The Why\" section discusses how problem-solving is bottlenecked by cognitive innovation, which comes from applying new perspectives to existing problems or creating new ones. It proposes an app to speed up the creation of unique worldviews via Twitter.\n    \n    The section lists three points to understand the opportunity:\n    1. Twitter threading is popular and powerful\n    2. Twitter threading is hard\n    3. The contemporary Twitter trend of \"atmaxxing\"\n    \n    The \"Opportunity\" section expands on the first point, stating that Twitter threading is popular and powerful, and provides examples of its effectiveness. \n    \n    The text is written in black font on a white background, with some words highlighted in red or blue.\n↓\n1318594188611514368 [2020-10-20] @JimmyRis \n@nosilverv @ExGenesis This strikes me as a document that was generated after you had already been inspired to build it\n↓\n1318594214477791232 [2020-10-20] @JimmyRis \n@nosilverv @ExGenesis True?\n↓\n1318595762134155267 [2020-10-20] @nosilverv \n@JimmyRis @ExGenesis hmmm i don't think 'inspiration' is a one-shot event, it's a thing that naturally grew as i wanted to make thraeding easier for myself and then this whole document is an articulation of why that is good\n↓\n1318596790158004224 [2020-10-20] @exgenesis \n@nosilverv @JimmyRis I agree ofc, and there have been many inspirations over time. I guess James was asking about the inception\n↓\n1318598265550430209 [2020-10-20] @JimmyRis 💜 1\n@ExGenesis @nosilverv And maybe how @ExGenesis specifically got into it\n↓\n1318612712407113728 [2020-10-20] @exgenesis 💜 2 💬 1\n@JimmyRis @nosilverv Building the prototype I realized the kind of emergent effects that this can have.Multiplayer sense making online is a joke and can be improved by TH.Big platforms are Bad and this is a potential wedge to get people outQTs below\n├── 1318613101655298051 [2020-10-20] @exgenesis \n│   @JimmyRis @nosilverv Irrigating the pasthttps://t.co/fNmLIEXr11\n│     [Quoting @exgenesis: By providing new paths of least resistance, attention is able to flow where it previously didn't. In this case, we're irrigating the past.@visakanv]\n│   ↓\n│   1318613895725174795 [2020-10-20] @exgenesis 💜 5 🔁 2\n│   @JimmyRis @nosilverv Threadhelper as a wedge, although we're not focusing on GPT3 for nowhttps://t.co/bf4LaQBSE8\n│     [Quoting Tweet 1284476597748338688 (missing)]\n└── 1318622548439937024 [2020-10-20] @JimmyRis 💜 1\n    @ExGenesis @nosilverv What led to you building the prototype? Like how did you get involved?\n    ↓\n    1318625624936820736 [2020-10-20] @exgenesis 💜 1\n    @JimmyRis @nosilverv @nosilverv asked me if I knew anyone technical for the job, I recommended a friend who started on it but didn't finish and I picked up the slack. I had fun web dev-ing for the first time + the reasons above 😄😄\n\n===\n\n1318563513753808898 [2020-10-20] @exgenesis  [(SEED) type=quote_of_semantic_search]\nAny sufficiently advanced magic is indistinguishable from science https://t.co/v4mXFIwar4\n  [Quoting @exgenesis: threadhelper the esoteric company: we don't make software, we make artifacts]\n\n===\n\n1321517532910653440 [2020-10-28] @exgenesis 💜 105 🔁 14 💬 3\nA THREADHELPER 🧵FROM @nosilverv &amp; @ExGenesis TH right now is a humble intervention on the Twitter experience.At a human level, it saves you search time and surprises you with relevant tweetsAt a system level, it redirects the flow of attention to IRRIGATE THE PAST.🧵1/17\n\n===\n\n1321517549520080903 [2020-10-28] @exgenesis 💜 19 🔁 1\nThe duration of your content's life is extended, it becomes viable to spend more effort on posts because we no longer expect them to be ephemeral as we get frictionless access to past insights.https://t.co/gPi3PB5qi9🧵7/17\n  [Quoting @visakanv: The race is on to assemble the best possible articulations of ideas in ways that are not just funny or clever, but deeply resonant in ways that make other people want to revisit and reuse them repeatedly  broke: viral tweet  woke: tweet that’s referenced &amp; reused in many threads]\n↓\n1321517556486885378 [2020-10-28] @exgenesis 💜 19\nAs you do this, so will others. From a fertile ecosystem, desire paths emerge around the threads most traveled. Around those paths, \"mindcities\", scenes, new forks pop up.https://t.co/oPWqMzAhgz🧵8/17 https://t.co/hEUgODcBgp\n  [Quoting @visakanv: Now that more of us are playing the threading game:  As we compete+collaborate effectively articulate things we all care about,  And weave each other’s thoughts into our respective webs,  The desire paths will assemble a mindcity paved with the best individual thoughts]\nImages:\n  - [Image #0] The image depicts a man walking on a dirt path in a park, with the words \"User experience\" and \"Design\" superimposed over the image.\n    \n    *   The man is walking away from the camera, carrying a red bag in his right hand.\n        *   He is wearing dark clothing and has short hair.\n        *   The dirt path he is on is surrounded by grass and trees.\n    *   The word \"User experience\" is written in black text on a white rectangle, positioned near the center of the image.\n        *   It is placed over the dirt path that the man is walking on.\n    *   The word \"Design\" is written in black text on a white rectangle, positioned near the bottom-right corner of the image.\n        *   It is placed over a paved path that runs parallel to the dirt path.\n    *   In the background, there are several buildings, including a large brick building with many windows.\n        *   There are also several benches and streetlights throughout the park.\n    *   The overall atmosphere of the image suggests a peaceful and serene environment, with the man enjoying a leisurely walk in the park.\n    \n    The image appears to be illustrating the concept of \"desire paths,\" which are informal paths that people create by walking through a space in a way that deviates from the intended design. The image suggests that the user's experience (the dirt path) can diverge from the intended design (the paved path), highlighting the importance of considering user behavior when designing public spaces.\n↓\n1321517559833911296 [2020-10-28] @exgenesis 💜 14\nOur plan is to become a \"needle-shaped vessel\",  a THREAD-SPACE-SHIP. Perceive and navigate this massive tapestry while interweaving your own threads into the mesh. 🧵9/17\n↓\n1321517563311017985 [2020-10-28] @exgenesis 💜 17\nYou'll be able to open full threads on the sidebar, with a tab interface that lets you shift click a tweet or QT to fork and see its thread. Also, you'll get a bird's eye view of threads you have open and how they intersect on a graph.(mockup)https://t.co/4UPAp2xtyN🧵10/17 https://t.co/gP5X3hkENX\n  [Quoting @visakanv: thanks to @ollybot_browne I finally have a visual on what the @visakanv web of threads looks like  https://t.co/t9KJvZ1bG4 https://t.co/7haf0S5zDJ]\nImages:\n  - [Image #0] The image is a screenshot of a user interface design for a Twitter feature called \"ThreadHelper.\" \n    \n    The image shows a dark blue interface with the title \"ThreadHelper\" in white text at the top left, accompanied by a green dot. To the right of the title is a gear icon and the text \"(load archive)\" in gray. Below the title are three icons: a curved arrow, a bookmark, and a heart. On the right side of the image, a graph displays a thread of tweets, with lines connecting the tweets to show their relationships. The background of the image is dark blue, providing a clean and simple visual representation of the ThreadHelper feature.\n↓\n1321517565433315333 [2020-10-28] @exgenesis 💜 15\nLess of a neat workspace, more a chaos-powered dashboard. Harness Twitter's dopamine mill and channel it into a massively collaborative ecosystem. Illegible wilderness becomes navigable-but-in-flux paths and structures.https://t.co/IhV6JUr8kN🧵11/17\n  [Quoting @visakanv: Twitter is the fucking coolest note-taking app. It’s like Evernote with a slot machine attached.  Sometimes you get incredible feedback or a response that gives you 10x more value than you expected, and sometimes you get people discussing your genitalia! So exciting https://t.co/GzFu6ErvXH]\n↓\n1321517567421353984 [2020-10-28] @exgenesis 💜 13\nLike Roam, but multiplayer-first.https://t.co/KnL2DOtln0🧵12/17\n  [Quoting Tweet 1247316304006008832 (missing)]\n↓\n1321517569510092800 [2020-10-28] @exgenesis 💜 14\nA bit farther into the future, we expect to be able to pull and search content from anywhere, basically a second-brain, allowing you to \"search yourself\".https://t.co/xb18Ey1ZzR🧵13/17\n  [Quoting @JimmyRis: @SupaMalaman @ExGenesis is threadhelper a solution to this pretty gnarly “can’t search myself” issue?]\n↓\n1321517571535998976 [2020-10-28] @exgenesis 💜 23 🔁 4 💬 1\nIf you get tired BIG COMPANY TM, we intend on eventually adopting a user-centric peer-to-peer architecture a la HolochainYour data goes from split btw different companies to associated with you and is merely read by services and other people. https://t.co/3oMWHVE0lE🧵14/17\n  [Quoting Tweet 1272945313725026306 (missing)]\n↓\n1321517573536686081 [2020-10-28] @exgenesis 💜 13\nIt matters to us that people remain sovereign and in control of their data. We'll help you store your data without compromising privacy.By gathering data from different sources and letting people access and post it, a new context is born from the use that's made of TH. 🧵15/17\n↓\n1321517575193399296 [2020-10-28] @exgenesis 💜 14 🔁 1\nWe have a vision for a fairer, more human-centric web. This is just an example but recommendation algorithms are often exploitative. A market for modular, open-source recommendation algorithms that you can switch between at will incentivizes fair play in what  gets shown🧵16/17\n↓\n1321517577059897344 [2020-10-28] @exgenesis 💜 28 🔁 1 [(SEED) type=semantic_search]\nEventually, ThreadHelper becomes a full-fledged vessel to surf and participate in the information web. The future is uncertain but having a trajectory feels right.ThreadHelper open alpha starts today. Have fun!🧵17/17\n↓\n1323960367614230534 [2020-11-04] @bierlingm 💜 2\n@ExGenesis cc @ThruTheHayes check this out\n\n===\n\n1321518942033186822 [2020-10-28] @nosilverv 💜 247 🔁 39 💬 19 [(SEED) type=root]\nGOOD NEWS EVERYONE!\n\nThreadHelper is now available! \n\nYou can go get it at https://t.co/vI0KWAfUny\n\nHere is what it looks like and what it does:\n\nhttps://t.co/etHq4r5sXc\n├── 1321518943631278088 [2020-10-28] @nosilverv 💜 25 🔁 1\n│   Why ThreadHelper? \n│   \n│   Read this thread by @ExGenesis \n│   \n│   https://t.co/wqkutUzLcd\n│     [Quoting @exgenesis: A THREADHELPER 🧵FROM @nosilverv &amp; @ExGenesis TH right now is a humble intervention on the Twitter experience.At a human level, it saves you search time and surprises you with relevant tweetsAt a system level, it redirects the flow of attention to IRRIGATE THE PAST.🧵1/17]\n│   ↓\n│   1321518945229246464 [2020-10-28] @nosilverv 💜 33\n│   You're back? Great. Time for some acknowledgments.\n│   \n│   Firstly to @tylercowen, whose Emergent Ventures grant got us started. Thank you.\n│   ↓\n│   1321518951441014785 [2020-10-28] @nosilverv 💜 16\n│   In truth, there are many people to thank for ThreadHelper being what it is today. \n│   \n│   @henrywfisher comes to mind. I see Henry as an honorary team member. He did a *lot of the work* on the UI.\n│   \n│   (This is how it looked originally. So you know how much he did.) https://t.co/41yI3R9E6n\n│   Images:\n│     - [Image #0] The image is a screenshot of a Twitter page with a tweet composition window open, overlaid on top of a darkened Twitter feed. \n│       \n│       To recreate this image, start by creating a dark gray background representing a Twitter feed. On the left side, include a profile picture and username \"@nosilverv\" with the text \"NotRivalVoices\" below it, along with some statistics. \n│       \n│       In the center, overlay a \"Compose new Tweet\" window with a cursor at the end of the text \"keyword keyword keyword keyword.\" The window should have various icons for media, GIFs, and location, as well as a \"Tweet\" button. \n│       \n│       To the right of the composition window, include a cartoon paperclip with eyes and a speech bubble saying, \"Hi My algo says that these tweets of yours might be related to the one you're composing! Let me know if this is right!\" \n│       \n│       Below the paperclip, display three tweets from the same user, \"@nosilverv,\" with different content and engagement metrics. \n│       \n│       Finally, include a large, darkened image of a person wearing a leather jacket and sunglasses, positioned below the composition window.\n│   ↓\n│   1321518953836040193 [2020-10-28] @nosilverv 💜 15\n│   @garybasin who provided me with the initial push to get this project going and without whom it wouldn't have started.\n│   ↓\n│   1321518955312435201 [2020-10-28] @nosilverv 💜 9\n│   Miguel Morel, @fiddlemath, and @nnevvinn without whose  experienced entrepreneurs lessons we couldn't have made it this far.\n│   ↓\n│   1321518956633612291 [2020-10-28] @nosilverv 💜 29 💬 2\n│   Of course, @visakanv and @0x49fa98. They provided the original inspiration for ThreadHelper with their threads. The original project codename  was “visa-as-a-service”, because I wanted to thread just as well as them without actually having to put in the manual (threading) work.\n│   ↓\n│   1321518958101618689 [2020-10-28] @nosilverv 💜 20\n│   @conaw - whose threads on tools of thought and incredible @RoamResearch success were a proof of concept of how it was possible to energise and direct the latent intellectual energy locked in Twitter.\n│   ↓\n│   1321518959557042176 [2020-10-28] @nosilverv 💜 15 💬 1\n│   All of the 50 (!!!!!) people who volunteered to be alpha testers and especially to @aaronzlewis, @egocv, @roberthaisfield, @lehoczkyescobar, @harmonylion1, and @ultimape.\n│   ↓\n│   1321518960999911435 [2020-10-28] @nosilverv 💜 12 🔁 2 💬 1\n│   To our first true believer trio: @TylerAlterman @Jeanvaljean689 and @btohtoh, hyping us from the beginning.\n│   ↓\n│   1321518962388197377 [2020-10-28] @nosilverv 💜 10\n│   Thank you also who all the people who sent us voice samples for our tutorial: @magicianbrain, @egocv, @m_ashcroft, @CurziRose. They shall be used.\n├── 1321540170856886272 [2020-10-28] @tnorthcutt 💜 2\n│   @nosilverv YESSSS! Where does \"upload archive\" upload to?\n│   ↓\n│   1321541291486834688 [2020-10-28] @tnorthcutt 💜 2\n│   @nosilverv I'm a doofus, I just got to that part in the video. Thanks!\n│   ↓\n│   1321541729208705025 [2020-10-28] @nosilverv 💜 1\n│   @tnorthcutt Yep, stored in your machine 😁\n│   ↓\n│   1321547283633111042 [2020-10-28] @tnorthcutt 💜 1\n│   @nosilverv Oooh I just thought of a feature/enhancement. You've probably thought of this already, but in case: surface things I've said to someone, if I'm replying to a tweet of theirs. E.g. if nothing matches my reply content, just look for other convos w/that person\n│   ↓\n│   1321855962626498560 [2020-10-29] @tnorthcutt 💜 2\n│   @nosilverv Another feature request! (is there a better way to communicate these...?)I use the Vimium extension, which makes links keyboard-clickable. Would be neat if the click-to-copy-url element in ThreadHelper was an &lt;a&gt; element so Vimium could act on it https://t.co/GIR1kjvZYm\n│   Images:\n│     - [Image #0] The image is a screenshot of a Twitter conversation. The left side shows a tweet from Travis Northcutt suggesting a feature for Twitter, and the right side shows a series of replies to a tweet.\n│       \n│       The text on the left side reads: \"Oooh I just thought of a feature/enhancement. You've probably thought of this already, but in case: surface things I've said to someone, if I'm replying to a tweet of theirs. E.g. if nothing matches my reply content, just look for other convos w/that person\" and \"Another feature request!\".\n│       \n│       The right side of the image shows a series of tweets, with the usernames, handles, and timestamps visible. The text is too small to read, but the image highlights several elements, including a \"Reply\" button, a \"copy\" button, and a circled \"SL\" and \"Mr\".\n│   ├── 1321861945532784641 [2020-10-29] @nosilverv 💜 1\n│   │   @tnorthcutt Here is great!\n│   └── 1323564373252677635 [2020-11-03] @nosilverv 💜 2\n│       @tnorthcutt @exgenesis - file of things i'd never think of, loool\n│       \n│       @henrywfisher you might wanna see this\n├── 1321657354870493184 [2020-10-29] @CountJ0ecool 💜 1\n│   @nosilverv It seems pretty good at finding relevant tweets already ❤️\n│   https://t.co/aDFK3ib4Nr\n│     [Quoting @CountJ0ecool: @orb_net @stormrose 🦋 is this self-love?]\n└── 1322240115100524546 [2020-10-30] @RichDecibels 💜 4\n    @nosilverv I think I don't want the search to match usernames. \n    @maybegray is way overrepresented in my results because maybe as a content word is matching Maybe as a person. OTOH if I have to have someone fucking with my serendipity generator I'm glad its her.\n    ↓\n    1322240540054835200 [2020-10-30] @nosilverv 💜 2\n    @RichDecibels @maybegray Oh Nice catch @ExGenesis\n    ↓\n    1322249276215447553 [2020-10-30] @exgenesis 💜 2\n    @nosilverv @RichDecibels @maybegray I think we need a huge temporary options menu while we fine tune default settings\n    ↓\n    1322249659281190912 [2020-10-30] @RichDecibels 💜 1\n    @ExGenesis @nosilverv @maybegray You can test a setting for MOARRR Maybe\n    ↓\n    1322249971320655874 [2020-10-30] @RichDecibels 💜 4\n    @ExGenesis @nosilverv @maybegray Srsly tho can I have a setting called Fuck Up Your Serendipity Generator\n\n===\n\n1321519157498781698 [2020-10-28] @exgenesis 💜 2 [(SEED) type=quote_of_root]\nGO GET IT IT'S OUT https://t.co/YyB0vboS7W\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321519499388936192 [2020-10-28] @uberstuber 💜 5 [(SEED) type=quote_of_root]\nIt's here! https://t.co/W8GRQb1Zd0\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321521129610248192 [2020-10-28] @m_ashcroft 💜 13 🔁 1 [(SEED) type=quote_of_root]\nAnd @visakanv-as-a-service is live! https://t.co/V9Vgaix7fV\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1321521211667525632 [2020-10-28] @m_ashcroft 💜 11\nI've been using it for a couple of weeks. It's fantastic. Get it.\n\n===\n\n1321526147025428480 [2020-10-28] @exgenesis  [(SEED) type=quote_of_root]\nRT @m_ashcroft: And @visakanv-as-a-service is live! https://t.co/V9Vgaix7fV\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321526222745120772 [2020-10-28] @exgenesis  [(SEED) type=quote_of_root]\nRT @tylercowen: From an earlier Emergent Ventures grant: https://t.co/LiY3wb6EB9\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321528769295847426 [2020-10-28] @TylerAlterman 💜 14 🔁 1 💬 1 [(SEED) type=quote_of_root]\nI can very earnestly say that ThreadHelper has depended my relationship with my exobrain. You’ll see what I mean after a few days of using it.I just wish there was a mobile app https://t.co/KUjzRw6dqE\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1321529078801960961 [2020-10-28] @TylerAlterman 💜 5\nIn contrast, using mobile Twitter without ThreadHelper now feels onerous ☹️\n\n===\n\n1321539777624039425 [2020-10-28] @tnorthcutt 💜 2 🔁 1 [(SEED) type=quote_of_root]\n@visakanv in case you haven't seen yet https://t.co/u5i5zdRanS\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321541301519736832 [2020-10-28] @mechanical_monk 💜 42 🔁 1 [(SEED) type=quote_of_root]\nthe random selection of your past tweets that threadhelper shows you when you're not composing a tweet is literally the fucking pond in the narcissus story\n\ni've been sitting motionless, refreshing and marveling over my own genius for the past five minutes https://t.co/KypNNeVyeU\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1321567318229442560 [2020-10-28] @goblinodds 💜 5\n@mechanicalmonk1 sucks 2 be u, desktop user\n↓\n1321568199603871744 [2020-10-28] @mechanical_monk 💜 3\n@goblinodds an integral part of my posting experience is searching my old tweets in another tab and QTing myself\n\nit's really inconvenient to do in a mobile browser, let alone app\n\n===\n\n1321556544660668417 [2020-10-28] @abhayance 💜 3 [(SEED) type=quote_of_root]\nAmazing. https://t.co/M6JdGiu4E8\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321572670916448256 [2020-10-28] @nosilverv 💜 10 [(SEED) type=semantic_search]\nthis is now a ThreadHelper hype account https://t.co/CcGzRkoMJr\n\n===\n\n1321619571829137408 [2020-10-29] @eigenrobot 💜 26 🔁 1 [(SEED) type=quote_of_root]\nok this is very cool https://t.co/ognqztgdiU\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321635513825071104 [2020-10-29] @goblinodds 💜 10 [(SEED) type=quote_of_root]\ngood plugin for making me painfully aware of responding to 90% of tweets with \"whoaaaa :o\" https://t.co/NWAZf54hwz\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321961538203209728 [2020-10-29] @easoncxz 💜 3 🔁 1 [(SEED) type=quote_of_root]\nThis looks like it's going to be the best Twitter tool since \"tweetstorms\" was a thing.\n\nHey @Twitter , you should do something -- hire these people, pay them, give them a shoutout, an award, high-volume API keys, something. https://t.co/OVYOrGYXLK\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1321989729840107520 [2020-10-30] @kcorazo 💜 3 [(SEED) type=quote_of_root]\n1/ This thread will be built with the top suggestion of Threadhelper. I'll riff on the suggestion. https://t.co/JOnFbLlKjx\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1321989732054622208 [2020-10-30] @kcorazo 💜 1\n2/ This thread of threads is the first suggestion. I guess that's a good introduction to this account https://t.co/IsoPW5i9wJ\n  [Quoting @kcorazo: 1/ I'll be on monk mode starting tonight up to Sunday.   Leaving you this thread of Roam-fu threads as I go off the grid.  I. Bringing Ideas to Reality II. Fabricating Serendipity III. Teaching IV. Zettelkasten https://t.co/HoG71lpiRZ]\n↓\n1321989733912780801 [2020-10-30] @kcorazo 💜 1\n3/ Threads are a great way to see what people are interested in. Drafts could become articles or events or side hustles or full on businesses. https://t.co/D8ewE105Ho\n  [Quoting @kcorazo: @CatoMinor3 Draft it as a thread first, then write it out if the response is good? This has been working for me.   Btw, I have 200+ Medium articles https://t.co/IcKJRLOmNl I get better reach and responses with threads.  @RoamFm might also be interested https://t.co/XJMVSQkcE5]\n↓\n1321989736601280512 [2020-10-30] @kcorazo 💜 2\n4/ This practice is also my equivalent of a pianist doing her scales. Communication is key to what I want to do in life. https://t.co/GOECXIhU8T\n  [Quoting @kcorazo: @ravcchaudhary @Knipps @joelrunyon @Austen @david_perell @tylercowen Goals: https://t.co/6SXPK0pd6y in 3-5 yrs, ((5mOSsatas)) in 2021, online training side-hustle in 2020  Top skills needed: communication, science  Scales: - Writing threads   - https://t.co/9c1hm1NKDf (ideally based on journal articles I read)   - https://t.co/vqvdSvfFaS]\n↓\n1321989738681802756 [2020-10-30] @kcorazo 💜 2\n5/ Thinking out loud via Twitter has worked so well that I've resolved to do the same for my spiritual life. I've created a alt account, but have yet to post. It's hard. @RoamanPilgrim  https://t.co/TnOxHMRpYe\n  [Quoting @kcorazo: My study is more for my spiritual growth.  If you seek God's will in scripture, and if you want to live the philosophy you study, you'd want them to be a block reference away from the rest of your life.  https://t.co/5HCcuCowmD]\n↓\n1321989740749496321 [2020-10-30] @kcorazo 💜 2\n6/ Threadhelper just explained the tweet above https://t.co/yENbQpygPh\n  [Quoting @kcorazo: I've already seen the power of software-assisted thinking in my professional life. It just makes sense to use it for my spiritual life as well. https://t.co/ItRxn0i9hJ]\n↓\n1321989742687260686 [2020-10-30] @kcorazo 💜 2\n7/ Another reason for tweeting: letting people know your challenges makes it more likely that someone qualified will solve it. https://t.co/hZk63l8dxf\n  [Quoting @kcorazo: @entropywizard That was more like... if you tweet somebody might build haha]\n↓\n1321989744461410306 [2020-10-30] @kcorazo 💜 2\n8/ Increase the probability of success by increasing the chances of serendipity, and increase serendipity by telling as many people as possible what you are passionate about. https://t.co/5OG3jQlpe6\n  [Quoting @kcorazo: The money part is more precise probabilistically:  Someone playing the @nateliason game will make $$$ in 8 of 10 versions of reality  Someone playing the @visakanv game, maybe 2 of 10?  @Conaw is playing the latter game. Most creators of tools for thought have failed &amp; will fail]\n↓\n1321989746285899777 [2020-10-30] @kcorazo 💜 3\n9/ Also, if you keep an idea in your head, it has a higher chance of just dying. https://t.co/FiPxKlKvQv\n  [Quoting @kcorazo: An idea not released from the mind is fragile: it is prone to getting lost. An idea written is robust: it stays the same across time. An idea stored somewhere in the magic junkyard is lost until called to life by serendipity. Resurrected ideas increase in antifragility.]\n↓\n1321989748831866880 [2020-10-30] @kcorazo 💜 2\n10/ This is getting weird. Another reason: by tweeting profusely, you might just become a conduit for ideas to reach their right partners in this world https://t.co/rMy7y1o3SU\n  [Quoting @kcorazo: In Liz Gilbert's mythology of inspiration, you could be a conduit for an idea meant for someone else.  I was possessed by that idea for around 9 months lol https://t.co/NR8iCpd8BE It seems my brother is now the one possessed https://t.co/S6b255Qk2P]\n↓\n1321989750828400641 [2020-10-30] @kcorazo 💜 2\n11/ Sharing ideas in threads is part of a system that molds me into the person I think I should be https://t.co/A4APduVkCq\n  [Quoting @kcorazo: @samuelbars @brandontoner I've decided to work on becoming the person that inevitably reaches what I feel I should be doing in this world rather than set arbitrary deadlines for imaginary finish lines.  Systems and habits over goals.]\n\n===\n\n1322234408271704064 [2020-10-30] @RobertHaisfield 💜 15 🔁 3 [(SEED) type=quote_of_root]\nI LOVE ThreadHelper. I use twitter searches constantly to thread my current ideas together with my past. ThreadHelper reminds me of tweets that I wouldn't have thought to search for. I'm happy to have been an alpha tester, and I'm happier that others can use it now as well. https://t.co/g7vpHk8IwB\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n↓\n1322235361012060162 [2020-10-30] @RobertHaisfield 💜 5\nSo of course, here's a link to a thread where I talk about some of the benefits of threaded thought to disconnect your thoughts from the present, resurfacing past ideas and pushing them into the future: https://t.co/3HEfZuBHbL\n  [Quoting @RobertHaisfield: This is why you thread notes together. It creates portals between save states to disconnect them from time. The priming Max describes is action in foresight, but you lack knowledge of future you. Threading is action in hindsight with new knowledge.https://t.co/f3DSrro8bM]\n\n===\n\n1323943639484162049 [2020-11-04] @bierlingm 💜 29 🔁 5 💬 1 [(SEED) type=semantic_search]\njust got off a call with @ExGenesis talking about possibilities for ThreadHelper and @holochain, and let me just say...\n\nY O U H A V E N O I D E A W H A T S C O M I N G A T Y O U\n\n===\n\n1323947799206109185 [2020-11-04] @exgenesis 💜 10 [(SEED) type=quote_of_semantic_search]\nSTAY. TUNED. https://t.co/yHguISacDo\n  [Quoting @bierlingm: just got off a call with @ExGenesis talking about possibilities for ThreadHelper and @holochain, and let me just say...  Y O U H A V E N O I D E A W H A T S C O M I N G A T Y O U]\n\n===\n\n1327755995808935936 [2020-11-14] @nosilverv 💜 356 🔁 13\nThe only political compass I need https://t.co/kCyK2IM6Ac\nImages:\n  - [Image #0] The image is a screenshot of a blocked Twitter account, featuring Nassim Nicholas Taleb's profile. The top section displays his name and Twitter handle, \"@nntaleb\", accompanied by a blue checkmark indicating verification. A large image of an owl's face is prominently displayed.\n    \n    *   The main content of the image is divided into two sections:\n        *   **Top Section:**\n            *   **Nassim Nicholas Taleb's Profile:**\n                *   Name: Nassim Nicholas Taleb\n                *   Twitter Handle: @nntaleb\n                *   Verification: Blue checkmark\n            *   **Profile Picture:**\n                *   A circular photo of Nassim Nicholas Taleb\n            *   **Header Image:**\n                *   A large image of an owl's face\n        *   **Bottom Section:**\n            *   **Blocked Message:**\n                *   \"You're blocked\"\n                *   \"You can't follow or see @nntaleb's Tweets.\"\n                *   \"Learn more\" link in blue text\n    \n    The image effectively conveys that the user has been blocked by Nassim Nicholas Taleb on Twitter, preventing them from viewing his tweets or following his account.\n  - [Image #1] The image is a screenshot of a tweet from Eliezer Yudkowsky, displaying a photo of a neon sign with the Bayes' theorem equation.\n    \n    The image shows a tweet from Eliezer Yudkowsky, a verified Twitter user, with 6,695 tweets. The tweet features a photo of a neon sign mounted on a wall or glass surface, displaying the Bayes' theorem equation: P(B|A)P(A)/P(B). The sign is blue and has a reflective surface, showing a reflection of the equation below it. \n    \n    Below the image, the user's profile information is visible, including their name, handle (@ESYudkowsky), and a blue checkmark indicating verification. However, the text below the profile information reads, \"You're blocked\" and \"You can't follow or see @ESYudkowsky's Tweets. Learn more,\" suggesting that the viewer is blocked from viewing the user's tweets.\n  - [Image #2] The image is a screenshot of a tweet from Farnam Street, a website that provides articles and resources on decision-making, strategy, and innovation.\n    \n    *   The top section of the image shows the Twitter profile header for Farnam Street.\n        *   The profile name is \"Farnam Street\" with a Twitter handle \"@farnamstreet\".\n        *   The profile has 4,694 tweets.\n    *   The main content of the tweet is an advertisement for \"The Great Mental Models\" book series.\n        *   The ad features a red background with white text that reads, \"THE GREAT MENTAL MODELS UPGRADE YOUR THINKING. #TGMM\".\n        *   Two red books are displayed, with the covers facing outward. The left book has a black line drawing of a box with various objects inside, while the right book has a black spiral design on its cover.\n        *   The Farnam Street logo is prominently displayed in a white circle on the left side of the ad.\n    *   The bottom section of the image indicates that the user has been blocked by Farnam Street.\n        *   A message reads, \"You're blocked\" in bold black text.\n        *   Below this, it states, \"You can't follow or see @farnamstreet's Tweets. Learn more\" in smaller gray text, with \"Learn more\" highlighted in blue.\n    \n    In summary, the image shows a tweet from Farnam Street promoting their book series, \"The Great Mental Models\", but the user viewing the tweet has been blocked by the account.\n  - [Image #3] The image depicts a screenshot of a Twitter page featuring a black-and-white photograph of a man standing in front of a chalkboard, with his right hand raised. The man has dark hair and is wearing a light-colored shirt. The chalkboard behind him is covered in illegible writing.\n    \n    **Key Elements:**\n    \n    * A circular inset in the bottom-left corner displays a simple pencil sketch of a face, divided into sections by lines.\n    * The Twitter handle \"@naval\" is displayed below the image, accompanied by the text \"You're blocked\" and \"You can't follow or see @naval's Tweets. Learn more.\"\n    \n    **Overall Impression:**\n    The image appears to be a screenshot of a Twitter page, with the user having been blocked from viewing the content of the account \"@naval.\"\n↓\n1327906350148579335 [2020-11-15] @nosilverv 💜 9 [(SEED) type=quote_of_root]\nLots of you asking what I did to deserve it and I gotta say I’m disappointed in y’all rushing to blame the victim also check out my only fans 👇 https://t.co/UylMQQoJLr\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1330297276733026306 [2020-11-21] @TylerAlterman 💜 11 🔁 2 [(SEED) type=quote_of_root]\nI am still using this many times per day. You heathens who are not being thread-helped are sad, silly men and women who dont deserve happiness https://t.co/KUjzRw6dqE\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n├── 1330297523496423428 [2020-11-21] @TylerAlterman 💜 3\n│   #threadcult\n└── 1330299574540496911 [2020-11-21] @nosilverv 💜 3\n    @TylerAlterman @ExGenesis 😂😂😂😂\n\n===\n\n1344669553989660673 [2020-12-31] @nosilverv 💜 11 [(SEED) type=semantic_search]\nkings, who's on firefox and wants to alpha test thraedhelper?\n├── 1344675887522996226 [2020-12-31] @frideswyth \n│   @nosilverv Yes\n└── 1344676858391105537 [2020-12-31] @IaimforGOAT \n    @nosilverv 🙋‍♂️\n\n===\n\n1371786952232538116 [2021-03-16] @nosilverv 💜 28 [(SEED) type=semantic_search]\nNew ThreadHelper is so good, you guys are gonna fucking die\n↓\n1371786953578975233 [2021-03-16] @nosilverv 💜 5\nI like the first version, it was the first time I turned an imagination into reality like that and it was very cool to have some people REALLY like it but i always felt something was missing\n↓\n1371786955281870853 [2021-03-16] @nosilverv 💜 2\nDon't get me wrong - the speed was great, the suggestions were great, but it wasn't *perfect*\n↓\n1371786956502351877 [2021-03-16] @nosilverv 💜 5\nI've talked about before how the prototype code name was Visa-as-a-service. For all the people who want to be like Visa in his threading... I remember that feeling, seeing his maze and being like 'shit, i wanna do that'... This version actually enables that\n↓\n1371786958133997575 [2021-03-16] @nosilverv 💜 5\nA bittersweet feeling: on the one hand you created something amazing, on the other hand, there's a feeling of doneness. A separation event. This must be what giving birth is like. You're so happy you've created this insanely amazing creature, but now it's not inside you anymore\n↓\n1371786959463587846 [2021-03-16] @nosilverv 💜 3\nIn any case, I guess it'll be on the fingers, and minds, of many many many people, and it will make their lives better, it ha -- it really is transformational. I thought old TH was a good add-on but new TH is just a new level\n↓\n1371786961275486215 [2021-03-16] @nosilverv 💜 5\nShit, I think maybe i should manage expectations? Quality = Value - Expectations? Fuck it lol this shit is actually that good.\n↓\n1371786962529619969 [2021-03-16] @nosilverv 💜 6\nI'm beyond excited fuckkkkkkkkkk you guys are gonna LOVE this\n\n===\n\n1371801924484407296 [2021-03-16] @nosilverv 💜 7 [(SEED) type=quote_of_semantic_search]\n'so good you'll fucking die' is your new tagline looool maybe not the most advisable. otoh lots of millenials memes about how they want to die so maybe its good actually, now to get quorum... https://t.co/58mpiYIrDP https://t.co/kwBjoMM9w1\n  [Quoting @nosilverv: New ThreadHelper is so good, you guys are gonna fucking die]\n\n===\n\n1372596316048662536 [2021-03-18] @exgenesis  [(SEED) type=quote_of_root]\nRT @vgr: This looks pretty cool. https://t.co/tp8IlzcrAx\n  [Quoting @nosilverv: GOOD NEWS EVERYONE!  ThreadHelper is now available!   You can go get it at https://t.co/vI0KWAfUny  Here is what it looks like and what it does:  https://t.co/etHq4r5sXc]\n\n===\n\n1372946539031756802 [2021-03-19] @nosilverv 💜 32 🔁 2 💬 1 [(SEED) type=semantic_search]\nＴＨＲＥＡＤＨＥＬＰＥＲ  2.0 ＩＳ  Ｎ Ｏ Ｗ　ＬＩＶＥ　\n\nJust kidding.\n\nBut, for real, we’re sending out a new version out today (0.3) and I’m PRETTY excited about it.\n\nHere’s the backstory: https://t.co/g4lFTr4CWz\nImages:\n  - [Image #0] The image is a screenshot of a tweet with four screenshots of the same tweet thread, overlaid with a blue cloud-shaped graphic containing white text that reads \"full tweet interaction, directly from the sidebar.\" \n    \n    The tweet thread is from the user \"@ExGenesis\" and discusses the \"ThreadHelper\" tool, which is described as a \"humble intervention on the Twitter experience.\" The thread explains that ThreadHelper saves users time by searching for relevant tweets at a human level and redirects the flow of attention to \"IRRIGATE THE PAST\" at a system level. The tweet has 2 likes, 1 retweet, and 26 replies. \n    \n    The background of the image is white.\n├── 1372946541435047937 [2021-03-19] @nosilverv 💜 4\n│   Twitter changed something that broke our back-end. We went from absolute panic to finding a patch to finding that the patch breaks current TH. We had been working on the new version and wanted to release in 2 weeks. But instead we’re releasing NOW. That’s startup life for you 🤷‍♀️\n│   ↓\n│   1372946542915637260 [2021-03-19] @nosilverv 💜 2\n│   I’m really, really, REALLY excited about this new version.\n│   ↓\n│   1372946548070481924 [2021-03-19] @nosilverv 💜 3 🔁 1\n│   First off, it’s much much beautifuler than the previous version. It’s much cleaner and much smoother in how you interact with it.\n│   \n│   I mean, just look at this shit!!!! https://t.co/yV93cLUj0X\n│   Images:\n│     - [Image #0] The image shows a screenshot of the \"ThreadHelper\" app, displaying a list of tweets. The text is transcribed as follows:\n│       \n│       \"RIVAL VOICES becom... @nosil... · 6m\n│       Interesting question. Most proposed answers don't explain why Cuba also became very strong in (medical) science especially. (Lung cancer vaccine, figured out how to eradicate mother-to-child transmission of HIV and syphilis in 20*15*)\n│       \n│       Dan Wang @danwwang · 11h\n│       I wonder if anyone has a book recommendation: how the Soviet Union developed strength in science. Wasn't pre-USSR Russia very poor? Was it mostly due to research foundations built during the war? And why was it also strong in math?\n│       Appreciate any suggestions you all might have.\n│       \n│       RIVAL VOICES become... @nosil... · 1h\n│       Yea I always felt the only way for anything to be fair is you can't see the number of votes (likes, plays) until you yourself have voted (liked, played). That plus random showing. But doesn't scale...\n│       \n│       Holly Her... @hollyher... · 16h\"\n│       \n│       To reproduce this image, create a screenshot of the \"ThreadHelper\" app with the following elements:\n│       * A search bar at the top with the text \"ThreadHelper\"\n│       * A list of tweets with the following information:\n│       \t+ Username and handle\n│       \t+ Time posted\n│       \t+ Tweet text\n│       \t+ Profile picture\n│       * The tweets should be arranged in a vertical list, with the most recent tweet at the top.\n│       * The background of the image should be white, with black text and gray accents.\n│   ↓\n│   1372946564671475718 [2021-03-19] @nosilverv 💜 3 🔁 2\n│   LOOK AT IT https://t.co/yiZdY3rwEP\n│   ↓\n│   1372946567225880576 [2021-03-19] @nosilverv 💜 3\n│   Secondly, we took over the search bar. Meaning, not only do you have ambient search for related tweets but also, if you know exactly what you want, you can search directly from and have the results in the sidebar.  Game-changer righ there: half my time is on the sidebar now.\n│   ↓\n│   1372946568781955086 [2021-03-19] @nosilverv 💜 3\n│   Also, you can do anything with the sidebar tweets you can do with a normal tweet. Not only copying their url for threading, but liking, retweeting, quote-tweeting, replying, expanding.\n│   ↓\n│   1372946581339709441 [2021-03-19] @nosilverv 💜 7 🔁 2\n│   The sidebar also works as a constant guardian against context collapse ⚔️ - if you open a tweet it automatically presents the results of a contextual search, and if it has quote-tweets you can see all of them immediately in the sidebar and scroll through them. https://t.co/JNG18uxIp8\n│   Images:\n│     - [Image #0] The image is a screenshot of a Twitter thread on the left and a ThreadHelper sidebar on the right. \n│       \n│       The tweet on the left is from \"RIVAL VOICES becomes a saint\" and reads: \"GOOD NEWS EVERYONE!\" followed by \"ThreadHelper is now available!\" and a link to the Chrome Web Store. The tweet includes a screenshot of a video tutorial for ThreadHelper and has 41 retweets, 60 quote tweets, and 273 likes.\n│       \n│       The ThreadHelper sidebar on the right displays a list of quote tweets related to the original tweet, including the usernames \"Zero HP Lov...\", \"RIVAL V...\", and \"Mechani...\".\n│   ↓\n│   1372946583789129729 [2021-03-19] @nosilverv 💜 7\n│   Look -- I can say many words but they can only convey so much. I’m really really excited, nearly SEXUALLY excited  out of how BEAUTIFUL and PLEASANT this version is to interact with it. Really like it and really want more people to interact w/ it. Try it:\n│   \n│   https://t.co/vI0KWAfUny\n└── 1372947501616144390 [2021-03-19] @nosilverv 💜 11\n    @visakanv @0x49fa98 if this version doesn't improve your flow enough that you start using desktop over mobile i will let you publicly spank me\n\n===\n\n1372948040194138118 [2021-03-19] @nosilverv 💜 4 🔁 1 [(SEED) type=quote_of_semantic_search]\nThanks to @empathy2000 @mbfops and @henrywfisher for their help getting this version out. Literally wouldn't have been possible without them https://t.co/W8fHUCAutB\n  [Quoting @nosilverv: ＴＨＲＥＡＤＨＥＬＰＥＲ  2.0 ＩＳ  Ｎ Ｏ Ｗ　ＬＩＶＥ　  Just kidding.  But, for real, we’re sending out a new version out today (0.3) and I’m PRETTY excited about it.  Here’s the backstory: https://t.co/g4lFTr4CWz]\n\n===\n\n1372948563966197762 [2021-03-19] @exgenesis 💜 5 [(SEED) type=quote_of_semantic_search]\nPROCURE H Y P EI R R I G A T E THE PASTwe're live baby, let me know what you think and what we can do better https://t.co/CZJIYEGKkc\n  [Quoting @nosilverv: ＴＨＲＥＡＤＨＥＬＰＥＲ  2.0 ＩＳ  Ｎ Ｏ Ｗ　ＬＩＶＥ　  Just kidding.  But, for real, we’re sending out a new version out today (0.3) and I’m PRETTY excited about it.  Here’s the backstory: https://t.co/g4lFTr4CWz]\n\n===\n\n1387394772394971138 [2021-04-28] @nosilverv 💜 7\nOk this actually did really nice things for my mind like I know that there's a number of people (~1000) using threadhelper but know it as a fact and not... viscerally felt. If you use it would you be so kind as to post a pic like the one below of it sitting on your computer? https://t.co/dl34e4LpK7\n  [Quoting @nobu_hibiki: coffee date with @amirism_ 🥰🥰🥰 https://t.co/KhAeotifhY]\n↓\n1387395451133992964 [2021-04-28] @nobu_hibiki 💜 1 [(SEED) type=semantic_search]\n@nosilverv here you go friend, and yes threadhelper is v good \nhttps://t.co/WoBnBfFExl\n  [Quoting @nobu_hibiki: look at that 🤩🤩🤩 https://t.co/cJ7Cnbe5xW]\n├── 1387395671020343296 [2021-04-28] @nobu_hibiki 💜 1\n│   @nosilverv here's one without the genshin 😜 https://t.co/2NNBOWpXRR\n│   Images:\n│     - [Image #0] The image shows a computer monitor displaying a Twitter page, with a user's notifications open on the screen. The monitor is black and has a thin frame, sitting on a desk or table with various items underneath it. \n│       \n│       To reproduce the image, one would need to:\n│       * Set up a computer monitor on a desk or table\n│       * Open Twitter on the computer and navigate to the notifications page\n│       * Ensure the Twitter page is displaying a user's profile and tweets, including a tweet from \"Rival Voices\" and several replies from \"Nobu of Promise\"\n│       * Place various items underneath the monitor, such as a yellow object, a white object with a blue cord, and a round orange object\n│       * Position the monitor in front of a green wall or backdrop\n│       * Capture a photo of the monitor and surrounding environment from a slightly angled perspective. \n│       \n│       The Twitter page on the monitor shows a user's notifications, including a tweet from \"Rival Voices\" that reads: \"Ok this actually did really nice things for my mind like I know that there's a number of people (~1000) using threadhelper but know it as a fact and not...viscerally felt. If you use it would you be so kind as to post a pic like the one below of it sitting on your computer?\" \n│       \n│       The tweet includes an image of a character from the game Genshin Impact, which is not visible in the provided image. The user's profile picture and username are also visible, along with several replies to their tweets from other users.\n│   ↓\n│   1387521557900242954 [2021-04-28] @nosilverv 💜 1\n│   @nobu_hibiki 🥰 thanks fren!!\n└── 1387521609733451776 [2021-04-28] @nosilverv 💜 1\n    @nobu_hibiki 🥰🥰🥰🥰\n\n===\n\n1425852766954704899 [2021-08-12] @exgenesis 💜 2\nWorking with the garage door open vs high effort lump sums of workhighest rewards are in networking (in a wholesome way) I just want a good calling card that shows off what I'm like without you having to lose yourself in the fractal prison of my threads or read long treatises\n↓\n1425866117655023621 [2021-08-12] @bierlingm \n@ExGenesis Personal website?\n↓\n1425866489127653383 [2021-08-12] @exgenesis 💜 1\n@bierlingm question is what to put on it and beating the friction of updating\n↓\n1425872480615518226 [2021-08-12] @bierlingm 💜 1\n@ExGenesis This is actually something that we're working on with AD4M and Perspect3ve (see https://t.co/7uiD8MD5hT, more info currently in production)\n↓\n1425873349943697411 [2021-08-12] @exgenesis 💜 1\n@bierlingm awesome, I'm excited about this stuff\n↓\n1425873921186967557 [2021-08-12] @bierlingm 💜 1 [(SEED) type=semantic_search]\n@ExGenesis Also, just reinstalled ThreadHelper, such a nice experience!\n↓\n1425877420155023363 [2021-08-12] @exgenesis 💜 1\n@bierlingm Thanks! Check out what [[ ]] does\n↓\n1425877857310498816 [2021-08-12] @bierlingm \n@ExGenesis As in, when I write it in a tweet? Like \"[[holochain]]\"? I see, it only pulls from the account with that username, right?\n↓\n1425878323662663683 [2021-08-12] @exgenesis 💜 1\n@bierlingm It restricts search to the expression inside [[]], not limited to account names. It helps you focus search\n├── 1425878609265319942 [2021-08-12] @bierlingm 💜 1\n│   @ExGenesis love it\n└── 1425878697047961604 [2021-08-12] @bierlingm 💜 2\n    @ExGenesis On an unrelated note, thanks for writing this: https://t.co/uPurorMVFx\n    ↓\n    1425883999046672398 [2021-08-12] @exgenesis 💜 2\n    @bierlingm thanks for reading 🥰\n\n===\n\n1776007600846340451 [2024-04-04] @nosilverv 💜 28 [(SEED) type=semantic_search]\nThey reinvented ThreadHelper 🤣🤣🤣 https://t.co/Mes2sVTK4n\n  [Quoting Tweet 1775932425098649923 (missing)]\n\n===\n"
}