{
  "tweet_id": 1326456124422324225,
  "thread_text": "161419931399888897 [2012-01-23] @visakanv 💜 1 [(SEED) type=semantic_search]\nWe keep going back, stronger, not weaker, because we will not allow rejection to beat us down. - Earl G. Graves\n\n===\n\n813588146952830976 [2016-12-27] @XyraSinclair 💜 1 [(SEED) type=semantic_search]\nRejection is so painful, but so motivating. I'm obviously just not strong/knowledgable/successful enough yet.  Good.  #GetAfterIt\n\n===\n\n1300353135794290689 [2020-08-31] @visakanv 💜 78 🔁 7\nPeople have laughed and told me that I suck all my life \n\nI usually respond with some form of “alright I hear you - how do I fix this?”\n\nAbout 50-80% will keep laughing and making jokes, but about 20% will be like, huh, you wanna get better? Really? Okay, well... https://t.co/1HIV6rGJUE\n  [Quoting Tweet 1300347517675147264 (missing)]\n↓\n1300353686644772865 [2020-08-31] @visakanv 💜 37 🔁 1\nSome of my best friends, best opportunities, best experiences, best learnings etc have come from holding my ground and being earnest in the face of insults and criticism. People expect you to give up\n↓\n1300353928106713090 [2020-08-31] @visakanv 💜 20\nso earnest they can’t not stan you https://t.co/NL7uteFkJF\n  [Quoting @visakanv: visa-17: I have answers for everything!  world: u naive fool, all u have is FAILURE  visa-18: hm. true. I guess I have to make corrections to everything! Thx!  world: what?? no, ur supposed to quit,  visa-28: I still love this! I love u 😍  world: *sigh* i SUpPoSE we have to stan]\n↓\n1300355844597374977 [2020-08-31] @visakanv 💜 31 🔁 3 [(SEED) type=semantic_search]\nA mantra to consider: “I will fail, stumble and fall, many times, but I will never be the one to write me off”\n\n===\n\n1326453565871714305 [2020-11-11] @visakanv 💜 555 🔁 43 💬 2\nthe interesting part of this to me is when he says “hard to be positive when that’s reality”, when the reality right in front of him only *just* got morphed by his reality distortion field. \n\nIt’s not reality that screwed him here, but the expectations that he has about reality https://t.co/VujX8KlzNf\n  [Quoting Tweet 1325997256223428610 (missing)]\n↓\n1326454298448855041 [2020-11-11] @visakanv 💜 189 🔁 6\nreality is much more complex, crazy and wild than our tiny, limited experience of it- but we won’t see it if we stay fixated on our experience https://t.co/CXIC9qvrCA\n  [Quoting @visakanv: I never really understood the whole “empty your cup” and “unlearn what you have learned” thing until maybe a couple of years ago. Like, intellectually it sorta made sense, but... is it really that big a deal?   It actually is, IMO, and I’m wondering now how I learned to see it]\n↓\n1326456124422324225 [2020-11-11] @visakanv 💜 1129 🔁 200 💬 20 [(SEED) type=root]\nRepeat after me, if you feel like it:\n\nLife is hard, and full of rejection and failure.\n\nBut.\n\nI will never be the one to count myself out.\n\nI will never take up arms against myself.\n\nI will never be the one to sabotage me.\n\nI’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et\nImages:\n  - [Image #0] The image depicts a woman singing into a microphone on stage, with the text \"All I Do is win, win, win, no matter what\" superimposed over it in yellow. The woman is wearing a black dress and holding a microphone to her mouth with her right hand, while her left hand is holding a remote or phone.\n↓\n1326456300415324166 [2020-11-11] @visakanv 💜 62 🔁 1\n. https://t.co/jClnFmLGSe\n  [Quoting @visakanv: the most foundational elements of this can feel silly to state out loud, but some people might have to do this:  - you have to believe that winning is POSSIBLE - you have to believe that losers *can* BECOME winners, through the magic of incremental growth and change, and framing]\n↓\n1326570797670912001 [2020-11-11] @visakanv 💜 123 🔁 2\nnever downplay yourself or your work https://t.co/YkJYQV03aw\n  [Quoting @visakanv: Took me years to learn this, and you can actually decide to do it in an instant https://t.co/5D7fXwKhYE]\n├── 1326571562443665408 [2020-11-11] @cocadonv \n│   @visakanv Actually you can't decide to do it in an instant, I've tried\n│   ├── 1326571675215867905 [2020-11-11] @cocadonv \n│   │   @visakanv \"generic you\" that is. Maybe some (most?) people can\n│   └── 1326573918639980549 [2020-11-11] @visakanv \n│       @nebulousverde you mean you made the decision to stop downplaying your work, but you kept doing it anyway?\n│       ↓\n│       1326581538587365378 [2020-11-11] @cocadonv \n│       @visakanv Something like that. \"I won't downplay this thing I'm doing anymore; it's a cool and worthwhile thing actually\" but it just doesn't stick, i can't embody it. I've been getting better at it though\n│       ↓\n│       1326581741180497923 [2020-11-11] @visakanv 💜 1\n│       @nebulousverde it helps to get very specific and precise about what exactly is cool and worthwhile about the thing you're doing\n│       ↓\n│       1326582073461706752 [2020-11-11] @cocadonv 💜 1\n│       @visakanv Hmm, that sounds like it'd work. In fact every time I narrate it to someone else and explain it to beginners in the field, they look slightly confused. Then I actually show the thing (it's a program) and they're amazed\n│       ↓\n│       1326582293327179778 [2020-11-11] @cocadonv \n│       @visakanv But my \"\"\"excuse\"\"\" is that they're amazed out of ignorance of the field and how easy it actually it is to build a program like that (it actually is hard as fuck, but because *I* was able to do it, i see it as easy. See the mental trap?)\n└── 1373462608993345537 [2021-03-21] @visakanv 💜 397 🔁 49 💬 8\n    that is my friend you are talking about https://t.co/4wYtRkZgcv\n    ├── 1394978213592449025 [2021-05-19] @blisstweeting 💜 62 🔁 15 💬 1\n    │   @visakanv my number two most lovable meme after this one https://t.co/kRk8qvwYl1\n    │   Images:\n    │     - [Image #0] The image is a meme featuring two astronauts in space, with one holding flowers and the other facing a blue circle containing an orange stick figure. The text reads: \"You in your entirety, including your flaws, struggles, and insecurities Wait, it's all loveable? Always has been.\"\n    └── 1742596117689401699 [2024-01-03] @visakanv 💜 51 🔁 2\n        consider: “I will not bend social reality against myself” https://t.co/fz3O1yIG9V\n          [Quoting Tweet 1742593666592473168 (missing)]\n\n===\n\n1413343363584053253 [2021-07-09] @AskYatharth 💜 4\n🧵 Now Reading 🧵\n\n🎾👟 The Inner Game of Tennis\n↓\n1413343370118717440 [2021-07-09] @AskYatharth 💜 4\nThis made me cry.\n\nI stopped reading [this is even before the Foreword] and took the hour off to reflect on just this.\n\n“What is the real game?”\n“It is a game in which the heart is entertained, the game in which you are entertained.”\n\nDo not forget the game you are playing. https://t.co/SzXV35P39p\nImages:\n  - [Image #0] The image presents a quote from Maharaji, set against a pale yellow background. The quote is prominently displayed in black text, with key phrases highlighted in yellow.\n    \n    *   **Quote:**\n        *   The quote is written in black text and reads: \"What is the real game? It is a game in which the heart is entertained, the game in which you are entertained. It is the game you will win.\"\n        *   The quote is divided into four lines, with the first line being a question and the subsequent lines providing an answer.\n        *   The text is left-aligned, creating a clean and simple visual arrangement.\n    *   **Highlighted Phrases:**\n        *   Certain phrases within the quote are highlighted in yellow, drawing attention to their significance.\n        *   The highlighted phrases are: \"What is the real game?\", \"It is a game in which the heart is entertained, the game in which you are entertained.\", and \"It is the game you will win.\"\n    *   **Author's Name:**\n        *   Below the quote, the author's name \"Maharaji\" is displayed in black text within a yellow rectangle.\n        *   The author's name is positioned at the bottom-left corner of the image, providing attribution for the quote.\n    *   **Background:**\n        *   The background of the image is a pale yellow color, which provides a subtle and calming contrast to the black text and yellow highlights.\n    \n    In summary, the image effectively showcases a thought-provoking quote from Maharaji, with strategic highlighting to emphasize key points. The clean design and simple color scheme make the quote easy to read and understand.\n↓\n1413343374338232330 [2021-07-09] @AskYatharth 💜 2\n“It is the game you will win.”\n\nSounds straight like a Dune quote.\n↓\n1413345418155421696 [2021-07-09] @AskYatharth 💜 2\nThis sentence is remarkable.\n\n“Once you understand the principles . . . you will be able to quiet your mind, focus clearly, and /truly play the game/.”\n\nWhat it means is every other time, we are not playing the game. https://t.co/zFhap6uHr2\nImages:\n  - [Image #0] The image shows a text passage with a highlighted section.\n    \n    The passage reads: \"Whether we are preparing for an inter-squad scrimmage or the National Championship Game, these principles lie at the foundation of our program. Once you understand the principles of the Inner Game, you will be able to quiet your mind, focus clearly, and truly play the game.\"\n    \n    The highlighted section is in a yellow box and contains the text: \"to quiet your mind, focus clearly, and truly play the game.\" The background of the image is a pale yellow color.\n↓\n1413345419468296192 [2021-07-09] @AskYatharth 💜 8 🔁 1\nWhen we are demurring, or apologising, or fretting—we are not playing the game.\n\nWhen we are anything but sunk, whole-heartedly advocating for ourselves—we are not playing the game.\n\nWe are playing a different game.\n\nCalled “Look at me and don’t judge me, please.” https://t.co/9HEOb0sfH5\n  [Quoting @AskYatharth: The drama is a plea to show your authority figures you ARE doing something. Can’t they see??  Gosh, I get chills writing this, feeling into the truth of how I still do this to this day. https://t.co/DXF3Itu7tX]\n↓\n1413345420911075329 [2021-07-09] @AskYatharth 💜 7 [(SEED) type=quote_of_root]\nLife is hard, and full of rejection and failure.\n\nBut.\n\nIf you are the one doing anything but vouching for yourself.\n\nYou are not playing the game. https://t.co/7E5TeLkiGn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1413345421942943746 [2021-07-09] @AskYatharth 💜 1\nTo play the game is to submerge ourselves.\n\n===\n\n1418342369821343744 [2021-07-22] @relic_radiation 💜 29 🔁 1\nslowly learning a difference between “self-love” \n\nand \n\n“u shouldn’t need any love from anyone else bc you should be able to do it all yourself” \n\n!!! they’re not the same\n↓\n1424181698691051527 [2021-08-08] @relic_radiation 💜 39 🔁 2 [(SEED) type=quote_of_root]\nSo I’ve objected to many modern versions of self love. \n\n*This* one feels clear + I easily endorse. “No matter how hard life can get, I will always have at least one person on my team. Bc that person is meee” \n\nhttps://t.co/MXzMkBjF9E\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n├── 1424182087683252224 [2021-08-08] @visakanv 💜 2\n│   @relic_radiation ❤️💪🏾🔥\n└── 1498333328403054595 [2022-02-28] @relic_radiation 💜 11\n    \"commit to self-love bc nobody will love you till you can\" feels coercive &amp; also plain wrong. \n    \n    plus: self-love as a strategy to get other-love? what?\n    \n    meanwhile: \"commit to self-love bc everybody wants to love everybody, and pragmatically not everyone has capacity\" feels better\n    ↓\n    1498334031334699010 [2022-02-28] @VividVoid_ 💜 9\n    @relic_radiation This is more of a statement about codependence, ie, high quality love exists in interdependence, when both parties love and protect themselves but choose to be dependent on the other for synergy, not out of need\n\n===\n\n1419569508222521350 [2021-07-26] @visakanv 💜 119 🔁 1 💬 1\nI consider ngmi jokes hideous, irresponsible, dangerous. I know my position on this is a buzzkill but I stand by it\n↓\n1419570029264130052 [2021-07-26] @visakanv 💜 19\nwell in this specific instance the setup is admittedly perfect sure but I’m talking about the broader scheme of people joking about bad outcomes https://t.co/qLGawGmG99\n  [Quoting Tweet 1419569708785815559 (missing)]\n↓\n1419570239516250113 [2021-07-26] @visakanv 💜 55 🔁 1\njoke about the outcomes you want https://t.co/Yvy9jYE68d\nImages:\n  - [Image #0] The image is a screenshot of a tweet from the \"Funny Tweets\" account.\n    \n    The tweet reads: \n    \"i use to say 'ima be single forever' as a joke... but bro ion think it's a joke anymore\"\n    \n    The text is written in lowercase and has some informal abbreviations (\"ima\" instead of \"I'm going to\", \"ion\" instead of \"I don't\"). \n    \n    The tweet is dated June 8, 2021, at 6:29 AM, and was posted using Twitter for iPhone. The tweet has garnered 3,185 retweets, 307 quote tweets, and 10.7K likes.\n↓\n1419571138171052032 [2021-07-26] @visakanv 💜 72 🔁 3\nsome of yall carelessly give away your power, and then bitch and whine and mope about being powerless. I absolutely hate to see it. It’s truly pathetic. And I would be too if I linger here too long, so I won’t ❤️🙏🏾\n↓\n1419571332954558465 [2021-07-26] @visakanv 💜 30 🔁 1 [(SEED) type=quote_of_root]\nInstead, https://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1419877979694452739 [2021-07-27] @AskYatharth 💜 3 [(SEED) type=semantic_search]\nLife is hard, and full of failure.\n\nBut let me not be the one to take up arms against myself.\n\nhttps://t.co/nKFnSbsuiq\n  [Quoting @AskYatharth: Life is hard, and full of rejection and failure.  But.  If you are the one doing anything but vouching for yourself.  You are not playing the game. https://t.co/7E5TeLkiGn]\n↓\n1419877981745524744 [2021-07-27] @AskYatharth 💜 1\nThis is all self-love means.\n\nNot that you are a great person. But you are one. And you deserve to stick by your side.\n\nhttps://t.co/8j1Mrn6ohr\n  [Quoting @AskYatharth: I love myself. It doesn’t mean I’m not cringe, it doesn’t mean I’m good—it just means I’m going to stick up for myself and not think of myself as a bad person.   Just as one.]\n↓\n1419877983658127367 [2021-07-27] @AskYatharth 💜 1 [(SEED) type=semantic_search]\nOtherwise, we are not playing the game.\n\nhttps://t.co/nKFnSbsuiq\n  [Quoting @AskYatharth: Life is hard, and full of rejection and failure.  But.  If you are the one doing anything but vouching for yourself.  You are not playing the game. https://t.co/7E5TeLkiGn]\n\n===\n\n1424125175352619013 [2021-08-07] @visakanv 💜 43 🔁 1\nnot to dunk on or attack anybody else but, just reflecting on my own experience\n\nif I let my fear of being excluded or intimidated as a child keep me out, I don't think I would have made it to adulthood\n\nI was basically an alien outsider my whole life\n\nhttps://t.co/BFp6PToQuM\n  [Quoting @visakanv: let's play \"spot the visa\", it shouldn't take you more than 2-5 seconds each time. I'm like the opposite of Where's Waldo. Where's Visa? everyone knows where Visa is at all times, which also means that everyone knows if Visa is absent. I've never been able to hide, ever https://t.co/m55NbY4xf0]\n↓\n1424125550600232961 [2021-08-07] @visakanv 💜 18 🔁 2\nlike, I'm not saying, pretend you don't feel excluded, pretend you don't feel intimidated. those feelings are real. you can accept them. you can face them. you can acknowledge that you're terrified and then Do The Thing anyway\n\nhttps://t.co/nHONsUtzuG\n  [Quoting @visakanv: a wise older guy once said, \"i learned in my 20s that me putting off something scary *always* led to things getting worse. so I cultivated the habit of throwing myself immediately into whatever scary bullshit came my way. it's my day-to-day horror meditation. AHHH!!!!\"]\n↓\n1424126222284464132 [2021-08-07] @visakanv 💜 20 🔁 2\nbeing ostracized, for eg – shunned, cast out – it can feel like literal death. it's mortifying. you may even actually throw up from shock, horror, disgust.\n\nbut, amazingly, as long as you remain resolute about making it to the next day, you'll find that you're still here. alive\n↓\n1424126778239422465 [2021-08-07] @visakanv 💜 17 🔁 1\nrejection sucks. failure sucks. racism sucks. there's a lot of cruelty in the world, some of it completely innocuous, like a passing shower, and some of it directed straight at you, for reasons you might not understand in the moment, or ever.\n\nand yet. the world spins on\n↓\n1424128301132500993 [2021-08-07] @visakanv 💜 11 🔁 1\nthroughout history there have been people who were outsiders, misfits, aliens – and, often through great effort, they found ways to find family and kinship. the world is a huge place and there are all kinds of people. some are loving and kind. but you won't find them if you hide\n↓\n1424128356790902785 [2021-08-07] @visakanv 💜 4\nhere's one thread, https://t.co/2mjmDP7gl6\n  [Quoting @visakanv: Bozoma was born in Connecticut to Ghanaian parents. She grew up moving frequently, including to Ghana and Kena, before settling down in Colorado. She was obviously Not White, but she was also not quite African-American, and not quite African. A foreigner everywhere.  I feel this.]\n↓\n1424128486290059266 [2021-08-07] @visakanv 💜 4\nand here's another\n\nhttps://t.co/PEQnmKDv1b\n  [Quoting @visakanv: so you're a weirdo, huh https://t.co/XExDMfrydc]\n↓\n1424128659669938178 [2021-08-07] @visakanv 💜 10 [(SEED) type=quote_of_root]\nbut most importantly of all: https://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1427817439111360518 [2021-08-18] @AskYatharth 💜 18 🔁 1\nYou have no obligation to reject yourself before the world does. https://t.co/13oT1CrVfG\n  [Quoting Tweet 1425399411174117377 (missing)]\n↓\n1427817441040687105 [2021-08-18] @AskYatharth 💜 4\nYou have no right to reject yourself before the world does. *let people decide* https://t.co/VNhmsBNQO0\n  [Quoting @AskYatharth: I had  the obligation to let others reject me who gave me the right to reject myself anyway?  The trick is to do it in a way that’s kind.]\n↓\n1427817443221819400 [2021-08-18] @AskYatharth 🔁 1\nhave a high-stakes newsletter, sure\n\nbut also have a garage with the door open, where people can see, where you do not hide—you do not let yourself decide what is worth seeing or not https://t.co/T2QlA39usI\n  [Quoting @AskYatharth: no thread is too bad too put out there  it is not my responsibility to reject sending it out before the algo does  but i can edit as much i want to in the moment. as long as im still editing and working it out https://t.co/7E8ISbf8Su]\n↓\n1427817445675372546 [2021-08-18] @AskYatharth  [(SEED) type=quote_of_semantic_search]\nit may very well be worth rejecting, but let yourself not be the one to do it\n\nanything else is *not playing the game* https://t.co/S2mtrGsXU1\n  [Quoting @AskYatharth: Life is hard, and full of failure.  But let me not be the one to take up arms against myself.  https://t.co/nKFnSbsuiq]\n↓\n1427817450125643776 [2021-08-18] @AskYatharth 💜 13 [(SEED) type=quote_of_root]\ndeclaring this Visa’s Litany:\n\nà la Dune’s Litany Against Fear\nà la Gendlin’s Litany\n\n@visakanv https://t.co/7E5TeL2HOP\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n├── 1530993568642637824 [2022-05-29] @visakanv 💜 5\n│   @AskYatharth aw i missed this the last time, this is so nice\n└── 1532031479487664128 [2022-06-01] @AskYatharth 💜 14 🔁 1\n    i will think im hot. i will take up space. i will risk boring others. i will risk being bad\n    \n    i will let others tell me. i will let them be a part of my process \n    \n    i am not an isolated island. i deserve to exist in the world. i deserve to learn from it https://t.co/yyR8BjKsTn\n      [Quoting @ElodesNL: so what if I fear I'm not hot? let others, not me, reject me.  so what if I fear I take up too much space? let others, not me, reject me.  so what if I fear my thoughts might bore others? let others, not me, reject me.  so what if I fear I'm bad? let others, not me, reject me.]\n    ├── 1532033081892282369 [2022-06-01] @ElodesNL 💜 1\n    │   @AskYatharth yesss ❤️‍🔥\n    └── 1532035139349250053 [2022-06-01] @AskYatharth 💜 23 🔁 4\n        it’s ok to cause the world inconvenience to learn \n        \n        the world exists for you as much as anyone else. you have as much claim on it as anyone \n        \n        you are not some retreat, who can only come into the world and interact once they have perfected themselves \n        \n        this is the playtest https://t.co/tV4VsmlVPx\n          [Quoting @AskYatharth: you might waste people’s time at a salon  you might make other drivers wait at an intersection because you stalled  you are obligated to do as much as possible to avoid that  but it’s ok to cause the world inconvenience to learn]\n\n===\n\n1428116908885348357 [2021-08-18] @ElodesNL 💜 124 🔁 13 💬 1\nso what if I fear I'm not hot? let others, not me, reject me.\n\nso what if I fear I take up too much space? let others, not me, reject me.\n\nso what if I fear my thoughts might bore others? let others, not me, reject me.\n\nso what if I fear I'm bad? let others, not me, reject me.\n↓\n1428116910504398852 [2021-08-18] @ElodesNL 💜 34\nso what if I fear I don't deserve good things? let others, not me, say what is good.\n\nso what if I fear I don't deserve good people? let others, not me, say what is good.\n\nso what if I fear I don't deserve love? let others, not me, say what is good.\n↓\n1428116912077213700 [2021-08-18] @ElodesNL 💜 23\nso what if I fear people won't set their own boundaries? let others, not me, bear this guilt.\n\nhttps://t.co/d8srrkIPU5\n↓\n1428116913767522311 [2021-08-18] @ElodesNL 💜 19 🔁 1\nwhat if I am bad, and I miss it?\n\nlet others, not me, stop me.\n↓\n1428117233390194695 [2021-08-18] @ElodesNL 💜 23\n*@visakanv voice*\n\nrisk 100 friendships.\n\nhttps://t.co/Aek1tjDXtt\n↓\n1428166739032899584 [2021-08-19] @visakanv 💜 4 [(SEED) type=quote_of_root]\n@ElodesNL hell yeah ❤️💪🏾🔥 https://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1432736623913934849 [2021-08-31] @AskYatharth 💜 15 🔁 1\nbrain thoughts:\n\n“I’m experiencing a lot of internal violence.”\n\n“If there were other people around, they would see I’m super uncomfortable with myself, and unable to actually enjoy stuff.”\n\n“But as long as I’m alone, it’s actually reasonably functional and pleasant.” https://t.co/IPOp0NTcVZ\n  [Quoting @AskYatharth: My brain: “I’m judging every move I make 100% of the time.”  No wonder it can be exhausting to be around me.]\n↓\n1434267789657661441 [2021-09-04] @AskYatharth 💜 13 🔁 1\nfuck I think I had my whole life explained to me\n\nwhen I’m alone, I’m in this self-involved, kinda intense, but familiar place of navigating\n\nit’s like I’m in a super messy room, but it’s 𝘮𝘺 messy room, and I know how to elegantly move around it; it’s even kinda fun https://t.co/7P6ORRA8tl\nImages:\n  - [Image #0] The image is a black-and-white photograph of Steve Jobs in his home office, surrounded by clutter and bookshelves. The photo is taken from a slightly elevated angle, looking down on Jobs as he stands at his desk, leaning forward with his hands resting on the surface.\n    \n    *   **Steve Jobs**\n        *   Standing at his desk\n        *   Leaning forward with his hands resting on the surface\n        *   Wearing a dark shirt and light-colored pants\n    *   **Desk**\n        *   Cluttered with various items, including:\n            *   Books\n            *   Papers\n            *   Office supplies\n            *   Electronic devices\n            *   Cables\n        *   A computer monitor is visible on the right side of the desk\n    *   **Bookshelves**\n        *   Behind Jobs, filling the wall\n        *   Multiple shelves, each packed with books\n        *   Some decorative items on the shelves, such as vases or sculptures\n    *   **Window**\n        *   To the right of Jobs, allowing natural light to enter the room\n        *   White curtains or blinds partially covering the window\n    *   **Text Overlay**\n        *   In the top-left corner, \"STEVE JOBS | IN A PRIVATE LIGHT\" is written in small white text\n        *   In the bottom-left corner, a caption reads: \"The genius in his labyrinth. Jobs in his home office in December 2004, the last time Walker photographed him.\"\n↓\n1434267791830372354 [2021-09-04] @AskYatharth 💜 12 🔁 1\nbut as soon as someone else gets involved in the picture, they see my super messy room, and my actions becomes awkward and jilting, because they weren’t designed with the spaciousness to dance with someone else\n↓\n1434267792811827200 [2021-09-04] @AskYatharth 💜 3\n*insert picture of somone earnest, now crestfallen\n↓\n1434267793881395204 [2021-09-04] @AskYatharth 💜 5\nthey look at the “fun” i was having, and it kinda dissolves before their eyes\n\n“𝘳𝘦𝘢𝘭𝘭𝘺? you call this fun? 👀”\n\n“yeah-well, i guess . .”\n\ni have to think a lot of nerds relate to this\n↓\n1434267795043217409 [2021-09-04] @AskYatharth 💜 6\nit was a pleasant, alone, cope kinda fun. in an objectively messy room \n\ni just didn’t know it was possible to be a different way, i wasn’t “aware” i was unhappy, and so i wasn’t https://t.co/NXJHeUmvYJ\n  [Quoting @AskYatharth: These days, I wake up, and I feel tense. It’s a familiar kind of tension.  It’s the tension of my worrying mind having woken up before me.  I barely remember there is such a thing as enjoying the moment, or feeling freeeee, because I didn’t have those things most of my life. https://t.co/kVR2UGZpGT]\n↓\n1434267796884443137 [2021-09-04] @AskYatharth 💜 2\nlittle bit of nostalgia for that nerd life me\n\n(why nostalgia?)\n\nyou’re right, it’s totally something that hasn’t died, it’s still entirely alive\n↓\n1434874905829339138 [2021-09-06] @AskYatharth 💜 1\nMaybe one day I will relate to it as if the nerd way has died.\n\nFor now, it’s well and truly alive, and 𝘐 𝘸𝘰𝘯’𝘵 𝘮𝘪𝘯𝘪𝘮𝘪𝘴𝘦 𝘪𝘵..\n\nhttps://t.co/gojNo0Zf8a\n  [Quoting @AskYatharth: If I wake up at 8:30am:  - I already feel guilty somehow  If I wake up at 6:30am: - There’s no guilt; it’s too early for that. - I’m only driven by beauty.  I felt my worrying mind activate like 60 seconds after I woke up today. It was so obvious. https://t.co/niWjHUj53d]\n↓\n1434874907360313353 [2021-09-06] @AskYatharth 💜 1 [(SEED) type=quote_of_semantic_search]\nLet me not take up arms against myself.\n\nhttps://t.co/KpGnDHRPvk\n  [Quoting @AskYatharth: Life is hard, and full of failure.  But let me not be the one to take up arms against myself.  https://t.co/nKFnSbsuiq]\n\n===\n\n1435541889357287428 [2021-09-08] @visakanv 💜 21 🔁 1\nI selfishly want all my loved ones to suffer the consequences of success https://t.co/v9XJn6WK98\n  [Quoting Tweet 1435286661743714316 (missing)]\n↓\n1435542556675227653 [2021-09-08] @visakanv 💜 16\nwhen you thought it was just fun and games hanging out in my mentions and now all you do is win: https://t.co/JaHU78tdn7\nImages:\n  - [Image #0] The image is an album cover, featuring a man with his head in his hand and the title \"DJ KHALED SUFFERING FROM SUCCESS\" at the bottom. \n    \n    To recreate this image, you would need to create a black-and-white photograph of a man with his head in his hand, wearing a fur coat and gold jewelry, including a large ring and multiple bracelets and necklaces. The man should be positioned on the right side of the image, with his head tilted down and his hand covering his face. \n    \n    At the bottom of the image, the text \"DJ KHALED\" should be written in white, followed by \"SUFFERING FROM SUCCESS\" in yellow. In the bottom-right corner, a parental advisory logo should be visible, indicating that the album contains explicit content. The background of the image should feature a cloudy sky with mountains in the distance, adding to the overall somber tone of the image.\n↓\n1435543058800472073 [2021-09-08] @visakanv 💜 19 🔁 2\nif you do not want to carry the heavy burden of winning all the time, being hot and sexy, getting rich, being surrounded by fabulous friends who challenge and support you to live your best life, you should block me immediately\n↓\n1435543307216556036 [2021-09-08] @visakanv 💜 9 [(SEED) type=quote_of_root]\nfor the rest of you still here: https://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1442090672824078343 [2021-09-26] @visakanv 💜 33\n👑 https://t.co/d8t8YC2E0x\n  [Quoting Tweet 1441960928027701249 (missing)]\n↓\n1442091257652674565 [2021-09-26] @visakanv 💜 7 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1507509994128015364 [2022-03-26] @visakanv 💜 221 🔁 22 💬 1\nthere is a very radical, powerful state of mind, state of being, that people throughout history have recurringly tried to talk about, but it's v hard to get the point across because people who don't want to hear about it will look for problems with the imperfect utterance\n↓\n1507510331794661377 [2022-03-26] @visakanv 💜 165 🔁 6 💬 1\nits the feeling of being the author of your own fate/destiny, of being in charge, being truly self-sovereign, earning your own respect and admiration, feeling your own body and mind standing by to assist you, the captain of your soul\n↓\n1507510686318206980 [2022-03-26] @visakanv 💜 76 🔁 2\nwe can talk shit about this all day, argue about the details, blah blah, the comments section appended to this is tens of thousands of pages long full of procrastinators &amp; avoiders looking for fine print technicalities &amp;excuses to support their argument that they're not in charge\n↓\n1507510983992164354 [2022-03-26] @visakanv 💜 102 🔁 2\nn ya kno what, if you argue against it, you're right. you're not ready. it's wise of your fear to protect you from the absolutely searing light of self-responsibility. it's like a weight on your shoulders that will break your back if you don't have the right form. u have to train\n↓\n1507511679462297601 [2022-03-26] @visakanv 💜 100 🔁 7 💬 1\nthis quote is in the right spirit of it\n\nthere is no test to pass but your own\n\nyou have to seize it for yourself\n\nthere are a bunch of movies that have scenes that try to capture the emotional reality of this, I remember Into The Spider-Verse has it\n\nhttps://t.co/LJQKFKRXoP\n  [Quoting @introspectVV: adulthood isn't an award they'll give you for being a good child https://t.co/tvJehkSRZr]\n↓\n1507512889309298692 [2022-03-26] @visakanv 💜 86 🔁 1\nMoana has it (the call isn't out there at all, it's inside me), Frozen has it (you are the one you've been waiting for all of your life) \n\nit's you\n\nyou are already the monarch of your life but you have to see it and accept it https://t.co/LnyFG2vjLM\nImages:\n  - [Image #0] The image is a fan art illustration of two Disney princesses, Anna from \"Frozen\" and Elsa, standing on a mountainous landscape with a star in the middle. The image depicts Anna on the left, wearing a blue dress and purple cape, reaching out her hand towards a star that is being held by Elsa on the right, who is wearing a white dress.\n↓\n1507513767701381122 [2022-03-26] @visakanv 💜 61 🔁 2\ni don't think I could have shipped Introspect without listening to frozen, moana, spiderverse, superman, avatar, etc soundtracks etc over and over again lol\n\nit's not an intellectual thing, you need the emotional reckoning, it comes from the gut and heart https://t.co/O4NFz9C9Ff\n  [Quoting @visakanv: Everyday is a new opportunity to assign value to things, to decide what is important, what is beautiful, what is good, what is deserving. In this regard you are truly the Monarch of your life, first of your name, bla bla https://t.co/YGXHATd5Ke]\n↓\n1507513953194491906 [2022-03-26] @visakanv 💜 69 🔁 3 [(SEED) type=quote_of_root]\nyour life is your life\nit is yours\nit is *your* life\n\nit is YOURS\n\nhttps://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1507515507859402756 [2022-03-26] @visakanv 💜 53 🔁 3\nin closing:  https://t.co/IVUvys5lg9\n  [Quoting @visakanv: some sage elder wisdom from Steven Pressfield (78yo) https://t.co/w0GS40D8OJ]\n↓\n1507520138660450308 [2022-03-26] @visakanv 💜 25 🔁 2\nI wrote a whole book trying to help guide people to this realization within themselves, here's what readers have said about it: https://t.co/SM3XoZXo0a\n  [Quoting @visakanv: reviews and social proof for my book Introspect, the thread  (buy it here: https://t.co/pWry0F4w7I)]\n↓\n1507524742676426761 [2022-03-26] @leo_guinan 💜 1\n@visakanv We have the chance to write our own stories now.When I started writing mine, I realized it sucked.So I started changing it. Now I'm writing the story that I want to write.It's incredibly empowering. But hard to reach. You have to unlearn a lot of constraints.\n↓\n1507531377683877889 [2022-03-26] @visakanv 💜 1\n@leo_guinan ❤️💪🏾🔥\n\n===\n\n1519863538617315329 [2022-04-29] @visakanv 💜 54 🔁 1\nsometimes a thing that trips me up is that people are used to people making arguments that they aren't personally invested in, don't have skin-in-the-game in. i'm not sure I do this on any front, I don't think I argue or advocate for anything that I don't personally embody myself\n↓\n1519863690266550272 [2022-04-29] @visakanv 💜 29 🔁 1 💬 1\nlike, i honestly think twitter is close to the best use of my time, which is why I'm here so much. I enjoy it. if I felt twitter is bad for you, I wouldn't be on twitter advocating that we should get off twitter, I would simply not be on twitter\n↓\n1519863940440035328 [2022-04-29] @visakanv 💜 17\nyesterday i saw a bunch of people arguing about whether tesla is overvalued or undervalued. i'm not sure what the point of that argument is. if you think it's undervalued, you can buy it. if you think it's overvalued, you can... short it? i'm not sure how shorts work actually lol\n↓\n1519864246783590402 [2022-04-29] @visakanv 💜 12\nwhen I wrote Introspect, I wrote a section on coping mechanisms, and to write that section well, I decided to read about smoking, and I re-read Easyway to quit smoking, and I was persuaded that I ought to quit smoking, and so I quit smoking\n↓\n1519864486647468032 [2022-04-29] @visakanv 💜 22 🔁 1\npart of why I took so long with that book was because at some level internally I knew that if you want to be an author of a book that helps people, you ought to demonstrate by example, and that required working thru my own shit. which, I think, makes the book even more legit\n↓\n1519865022570446849 [2022-04-29] @visakanv 💜 34 🔁 1\nI like the motif, I find it meaningful, I get the tattoo. I like the meme, I find the art beautiful, I buy the painting. it's a simple way to live: literally practice what you preach, and if it's not working, adjust your practice, adjust your speech, until you're in alignment https://t.co/4dYsnaGVjF\nImages:\n  - [Image #0] The image is a photograph of a man with a tattoo on his chest. The man is shirtless, has dark hair and a beard, and is smiling at the camera. He has a black labyrinthine tattoo on his chest. The background appears to be an interior room with white walls, a window with black blinds, and a plant behind the man.\n↓\n1519865703125643264 [2022-04-29] @visakanv 💜 27 💬 1\nI think creatives should be prolific, so I am prolific\n\nit's very simple\n\nif you wanna know what i think about something you can just look at what i do\n\nthere's no tedious elaborate convolution, no second-guessing\n↓\n1519866037860470784 [2022-04-29] @visakanv 💜 18\ni was a nervous and unconfident speaker, felt that verbal speech is valuable skill to have, i committed to practicing until I got good, and I got good\n\nI don't advocate or recommend anything that I don't do myself https://t.co/OjRER5YXmd\n  [Quoting @visakanv: when I first started making videos of myself talking, I was stiff, awkward, nervous, anxious, frozen. but I kept at it, because I wanted to git gud. I believed that I could learn to become confident and charismatic on camera. here's some of that journey: https://t.co/MSllrsufdQ]\n↓\n1519866623754371072 [2022-04-29] @visakanv 💜 34 🔁 4 [(SEED) type=quote_of_root]\ncheesy but true: when your thoughts, beliefs, actions, intents, etc are in alignment, you attain a resonance, a glow, and life is wonderful. even if you're facing difficulties and challenges and things are frustrating etc, you're not fighting yourself https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1519868177307824128 [2022-04-29] @visakanv 💜 16\nso all of that said, like\n\nI mean what I say! sure sometimes I joke and fool around etc yea but it's all in harmony, it's all resonant\n\ni don't say this as some sort of vague feel-good platitude, this is my actual mission and i'm actually working on it \nhttps://t.co/QCM7vr3rzW\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\n↓\n1519868519856635905 [2022-04-29] @visakanv 💜 6\nthat's it for today's sermon, time to switch to more shitposting 😂✌🏾\n\ni've laid out all my stuff it's all there i'm not hiding anything\n\nhttps://t.co/YsF6RRULAA\n  [Quoting @visakanv: Sermonposting without shitposting gets you pedestalized, which is dehumanizing   Shitpost too much and nobody takes you seriously, which is also kind of dehumanizing  You can nerdpost forever quite happily, but it can be a lonely and frustrating experience  The flow is the point https://t.co/HYsXv2Bhpc]\n↓\n1519868658864242688 [2022-04-29] @visakanv 💜 8\n(if I do get the edit button I'm updating the above tweet to point out that loneliness is also dehumanizing. it gnaws at me)\n↓\n1519868715462193152 [2022-04-29] @visakanv 💜 10\n(but I don't think twitter should have an edit button)\n↓\n1519870933221376001 [2022-04-29] @visakanv 💜 10\nno wait i have a couple of other final parting thoughts\n\nif you're even moderately intelligent – and I think that applies to anybody reading this – you can take some time to sit down and think about what's going on. see how things are going. evaluate. ask yourself what's up\n↓\n1519871193394085891 [2022-04-29] @visakanv 💜 20 🔁 2\nwhat do you care about? what do you notice? what are patterns that repeat themselves? what are the cycles? what keeps happening, predictably, reliably? why? think about it! come to an understanding! and then ask yourself, what would you like to do about it? \"nothing\" is valid!\n↓\n1519871515801812994 [2022-04-29] @visakanv 💜 10 🔁 1\nand when you come to an understanding that makes sense to you, have a felt sense of what's important to you, what you care about, what you want to focus on, you can cultivate awareness and understanding, and intervene artfully, create better outcomes, become more powerful,\n↓\n1519871825270145025 [2022-04-29] @visakanv 💜 13 🔁 1\nand then we can find the others, support and uplift each other, do cool shit, become wealthy, healthy, wise, joyous, create space for more people to do the same (if they want), and then repeat this cyclically, creatively, iteratively, and everything just gets lovelier 💐\n\nok fin.\n\n===\n\n1538036041193402368 [2022-06-18] @visakanv 💜 86 🔁 5\nthere are certain defeatist-flavored narratives that I have always flat out refused to accept\n↓\n1538036882931519490 [2022-06-18] @visakanv 💜 60 🔁 1\nfor example, I know of people who describe this experience if it's some immutable law of the universe, that we will always feel less-than, not-enough, inadequate. I've experienced the feeling sometimes, yes, but I refuse to believe it's insurmountable  https://t.co/SPXnr6t0Sl\n  [Quoting Tweet 1537659685838278656 (missing)]\n↓\n1538037256820097024 [2022-06-18] @visakanv 💜 95 🔁 5\nif i experience feelsbad.exe I fucking hit inspect element on the motherfucker and investigate why the fuck it's happening and I go upstream and I fight the raggedy bitch. [checks notes] sometimes I have to make friends with the motherfucker and love him. so be it!! i'll do it!!!\n↓\n1538037692302172160 [2022-06-18] @visakanv 💜 52 🔁 1 [(SEED) type=quote_of_root]\ni'm not saying that I live a life of perfect bliss and infinite joy. i get annoyed, frustrated, sometimes miserable and depressed even. but I have a deep faith in a deep place that I am never going to go down without a fucking fight to the absolute death https://t.co/h2zoutAuLJ\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1538038071265857538 [2022-06-18] @visakanv 💜 61 🔁 3\n\"what if the problem is the whole world\" first of all, nobody is humanly capable of actually perceiving the whole world. so what you think is the world is actually your model of the world, which is informed by how you direct and manage your attention, so https://t.co/tFaWtEZM1p\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1538038639975878656 [2022-06-18] @visakanv 💜 54 🔁 1\nthere is always some tiny way to feelgood.exe. do a pushup. tidy a surface. compliment a friend. drink a glass of water. reflect on the miracle of existence. whatever works for you, find something you love and attend to it. people were composing music in concentration camps\n↓\n1538038791662870528 [2022-06-18] @visakanv 💜 34 🔁 1\nor you can lie down and be sad and do nothing. that is also a choice. and i dont mean to judge you for whatever choice you make, life is absurd and nothing matters. im just saying how i am\n\nhttps://t.co/cLpQFc3Jcf\n  [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n↓\n1538039228142997504 [2022-06-18] @visakanv 💜 42\nplease do not read the above as \"you should be like me\". i have no idea what you should be like, what you should do, etc. but i think some people have simply never seriously considered the range of possibility that's out there. life is fucking wild, man, more than we can imagine\n↓\n1538041308077379584 [2022-06-18] @visakanv 💜 38 🔁 3\nnot saying anybody has to be happy, or not-sad, or anything at all. IME it's the sense of obligation (\"I have to... I should... I must...\") that's soul-draining. and that sense can be questioned, interrogated, disrespected. we dont have to live under the tyranny of assumptions\n\n===\n\n1550891550657622017 [2022-07-23] @visakanv 💜 23\nok i'm going out to buy some late nite mcdonalds, ask me anon questions https://t.co/PFw3EUwhwq\n\n===\n\n1550894994403123200 [2022-07-23] @visakanv 💜 5\n👇🏾  https://t.co/1UuBVGbUxW https://t.co/Mty9SpL0Ok\n  [Quoting @visakanv: Scarcities in the world:   - Stories - Meaning  - Context - Perspective - Empathy - Sincerity - Relationships - Focus - Nuance - Curiosity]\nImages:\n  - [Image #0] The image displays a white text box with black text that reads, \"what do you think will be important 100 years from now.\" The text is centered and written in a simple, sans-serif font. The text box has rounded corners and a subtle shadow effect, giving it a slightly raised appearance. The background of the image is plain white.\n    \n    To recreate this image, one would need to:\n    \n    * Create a white text box with rounded corners\n    * Center the text within the box\n    * Use a simple, sans-serif font to write the text in black\n    * Add a subtle shadow effect to the text box to give it a raised appearance\n    * Set the background of the image to plain white\n    \n    The text within the image reads: \"what do you think will be important 100 years from now\".\n↓\n1550895904844001280 [2022-07-23] @visakanv 💜 11\nprobably The User Illusion by Tor Norretranders. Or maybe Lives of a Cell by Lewis Thomas. Or Keay Davidson’s biography of Carl Sagan https://t.co/eXZ8GWxvsV\nImages:\n  - [Image #0] The image is a simple graphic with text on a white background. The text reads, \"Book that changed your worldview the most\" in black font.\n    \n    To recreate this image, follow these steps:\n    \n    * Create a white rectangle with rounded corners.\n    * Add a subtle shadow effect to the rectangle to give it some depth.\n    * Center the text \"Book that changed your worldview the most\" within the rectangle.\n    * Use a black font for the text.\n    \n    The resulting image will be a clean and simple design that prompts the viewer to think about the book that had the most significant impact on their perspective.\n↓\n1550896138051391488 [2022-07-23] @visakanv 💜 14 🔁 1\nthat I’m not a good enough husband and won’t be a good enough dad https://t.co/DZwKkZYk4H\nImages:\n  - [Image #0] The image is a simple graphic with the text \"Biggest insecurity\" in black font on a white rectangle.\n    \n    * The white rectangle is centered in the image and has rounded corners.\n    \t+ It is positioned horizontally, spanning most of the width of the image.\n    \t+ The rectangle has a subtle shadow effect underneath it, giving it a slight 3D appearance.\n    * The text \"Biggest insecurity\" is written in a plain black font within the rectangle.\n    \t+ The text is centered both horizontally and vertically within the rectangle.\n    \t+ The font is sans-serif and appears to be a standard font, possibly Arial or Helvetica.\n    * The background of the image is a soft, gradient-like color that transitions from pink to white.\n    \t+ The pink tone is more prominent on the left side of the image, gradually fading into white towards the right.\n    \t+ The background is blurred, creating a subtle bokeh effect.\n    \n    The image presents a straightforward design with a clear message, inviting the viewer to consider their biggest insecurity.\n↓\n1550896507900940289 [2022-07-23] @visakanv 💜 100 🔁 14 💬 1\nBitch I was born here, it’s my home, I’m fucking staying lmao. Why should I be the one to leave? https://t.co/CmHHSDMmut\nImages:\n  - [Image #0] The image is a simple graphic with text on a white background. \n    \n    * The text is in black and reads: \"why stay in Singapore if it is so structurally racist?\" \n    * The text is centered within a white rounded rectangle, which has a subtle shadow effect around its edges.\n    * The background of the image is a soft pink color, gradating to white towards the center.\n    \n    The image appears to be a meme or a social media post, likely used to spark a discussion or debate about the topic of racism in Singapore.\n↓\n1550896751413891072 [2022-07-23] @visakanv 💜 17\nmost important thing is that you can communicate healthily and navigate conflict/disagreement together, everything else is downstream of that https://t.co/dCihlnmX1a\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1550897366995070976 [2022-07-23] @visakanv 💜 4\nOooh fun Q. They’re both intertwined, I think of FAN as outward directed (but not entirely) and Introspect as inward directed (but not entirely) and together they got this sorta yin-yang thing going on. I’m looking forward to updating FAN v1.1 which will make this clearer https://t.co/lRgVYMXnMl\nImages:\n  - [Image #0] The image is a white text box with rounded corners and a subtle shadow, containing the following text:\n    \n    \"is there an obvious way that FAN and Introspect fit together or is that better left to reader interpretation?\"\n    \n    To reproduce this image, you would need to create a white text box with rounded corners, add a subtle shadow effect, and type out the given text in a clear, black font.\n↓\n1550897850233413632 [2022-07-23] @visakanv 💜 6\nhonestly too many to list. If I’m following someone it typically means I think they’ve got big potential. But how these things play out can be unpredictable in the short term. Look for people who are producing public-facing output https://t.co/JiLlbS8AET\nImages:\n  - [Image #0] The image is a graphic with text on a white background.\n    \n    The text reads: \"Who do you think is going to be the next TPOT-er or FAN to break into fame or a new career from connections made here?\"\n    \n    To recreate this image, one would need to create a white rectangle with rounded corners and a subtle shadow effect, and then center the given text within it. The text should be in a bold, black font. The background of the image should be a light pink or peach color, gradating to white towards the center.\n↓\n1550898242996473857 [2022-07-23] @visakanv 💜 8\n👇🏾 https://t.co/svGsmVhzzq https://t.co/D9vRlObVSX\n  [Quoting @visakanv: @michaelcurzi Plans are worthless, planning is priceless. Spend a day making elaborate plans and then disregard them completely to make whatever you think is most compelling. Repeat monthly or quarterly]\nImages:\n  - [Image #0] The image presents a thought-provoking question about balancing long-term thinking with living in the moment, set against a clean and simple background.\n    \n    *   The main text is displayed on a white rectangle with rounded corners.\n        *   The text is written in black font.\n        *   The text reads: \"How to balance thinking long-term and living in the moment?\"\n    *   The background of the image features a subtle gradient effect.\n        *   The gradient transitions from white at the center to a soft pink hue towards the edges.\n        *   The gradient adds a touch of warmth and visual interest to the overall design.\n    \n    In summary, the image effectively conveys a relatable question about finding balance between planning for the future and appreciating the present moment, making it a thought-provoking and engaging visual.\n↓\n1550898815628038145 [2022-07-23] @visakanv 💜 7 🔁 1\nmade substantial progress on the dominos meme. let’s say millions of FANs doing their thing. It’s what I wanted when I was a kid - a rich, interesting, kind, beautiful world, and I know I’m not the only one https://t.co/QCM7vrkuBW https://t.co/kbB1MjJGyR\n  [Quoting @visakanv: if we play our cards right https://t.co/65KsVIYWuC]\nImages:\n  - [Image #0] The image is a graphic featuring a white rectangle with rounded corners, containing black text. \n    \n    * The text reads: \"what do you imagine you'll think/feel/have accomplished by age 70? and why is that in particular what you want?\"\n    * The background of the image is a gradient that transitions from light pink at the top to a slightly darker shade of pink towards the bottom.\n    * A subtle shadow effect is visible around the edges of the white rectangle, giving it a sense of depth.\n↓\n1550899468052008960 [2022-07-23] @visakanv 💜 6\nof course! It was worst when I was 13, 17, and about 25. Also felt some of it when I was quitting smoking, tho it wasn’t as bad as the earlier depressive states. Low but never hopeless. As long as there’s one other good person on earth I have hope https://t.co/BpSl3QO0fI https://t.co/6WPIfAEbCo\n  [Quoting @visakanv: I just wish that I'd get some sort of intrinsic reward for it. That I'd feel like I accomplished something. I don't feel it. I feel empty.]\nImages:\n  - [Image #0] [PIC NOT AVAILABLE]\n↓\n1550900680600145920 [2022-07-23] @visakanv 💜 5 🔁 1 [(SEED) type=quote_of_root]\nFor me, I turn to history, to music, artists, libraries. Some people have always had faith in each other &amp; kept love alive. I think to myself that those are my people, they lifted me up so I might do the same for the next kid. Maybe it won’t work out! But- https://t.co/8Lwzd2TDFX https://t.co/d9AW2Q6che\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\nImages:\n  - [Image #0] The image displays a simple, centered text on a white background with a subtle shadow effect.\n    \n    * The text is written in black and reads \"how to have faith that it'll work out\" in two lines.\n    \t+ The font used is a plain, sans-serif font.\n    \t+ The text is centered both horizontally and vertically within the white rectangle.\n    * The white rectangle has rounded corners and a subtle shadow effect around its edges.\n    \t+ The shadow is light pink and gives the impression of depth.\n    \t+ The rectangle is positioned centrally within the image, leaving some space around it.\n    * The background of the image is a soft, gradient-like color that transitions from white at the top to a light pinkish hue towards the bottom.\n    \t+ The gradient is smooth and subtle, adding a touch of warmth to the overall design.\n    \n    In summary, the image presents a straightforward yet thought-provoking message about having faith, set against a clean and visually appealing background.\n↓\n1550901095974572032 [2022-07-23] @visakanv 💜 3\nstreaming is also cool! I’d like to do it more. No particular opinion. I’d encourage more ppl to consider supporting smaller streamers I guess https://t.co/xXytVJmMC2\nImages:\n  - [Image #0] The image presents a white text box with rounded corners, containing a question about YouTube and streaming. The text is in black, and the background is a gradient of light pink to beige.\n    \n    *   The text box is centered in the image.\n        *   It has rounded corners.\n        *   The text inside is in black.\n        *   The text reads: \"You have recently expressed your opinion on Youtube. What's your opinion on streaming? What would you like to see more of in that medium?\"\n    *   The background is a gradient.\n        *   The gradient starts as light pink at the top.\n        *   It transitions to beige towards the bottom.\n    \n    The image appears to be a screenshot or a graphic element from a larger interface, possibly related to a survey or feedback mechanism.\n↓\n1550902107619745793 [2022-07-23] @visakanv 💜 7\n“I don’t have petty or bad opinions” is my petty and bad opinion 🤪\n\nI devoted a lot of time in life to get good at having well-informed, well-calibrated opinions lol maybe that too is a petty and bad opinion made manifest https://t.co/h8xXGdMheL\nImages:\n  - [Image #0] The image presents a simple, text-based graphic with a central message. The key elements of the image are:\n    \n    * A white rectangle with rounded corners, positioned centrally in the image.\n    \t+ The rectangle has a subtle shadow effect around its edges, giving it a slightly raised appearance.\n    \t+ The text \"what's a petty / bad opinion you have\" is displayed prominently within the rectangle, using a black sans-serif font.\n    \n    The background of the image features a soft, gradient-like effect, transitioning from white at the top to a light pink hue towards the bottom.\n    \n    In summary, the image is a straightforward graphic that poses a question to the viewer, inviting them to reflect on their own opinions.\n↓\n1550902332346421248 [2022-07-23] @visakanv 💜 8\nbridge nodes, aka bilingual or polyglot FANs https://t.co/1mTavY9BKG\nImages:\n  - [Image #0] The image is a white text box with rounded corners, containing a question about FANs (Facebook Affiliate Networks) outside of English-speaking communities. The text is in black and reads: \"If there are FANs outside of English-speaking communities, how do we find them? If not, do we need to build those networks from scratch?\" The background of the image is a gradient that transitions from white at the top to a light orange color at the bottom.\n    \n    To recreate this image, you would need to:\n    \n    * Create a white text box with rounded corners\n    * Add the given text in black font\n    * Place the text box on a gradient background that transitions from white at the top to light orange at the bottom\n    \n    The text in the image is: \"If there are FANs outside of English-speaking communities, how do we find them? If not, do we need to build those networks from scratch?\"\n↓\n1550902935889932288 [2022-07-23] @visakanv 💜 16 🔁 1\ndepends on the situation but: when you’re injured or tired/sore etc, you shouldn’t work out strenuously, you’ll make things worse. Similarly, periods of low motivation call for reduced workloads. Do the bare minimum. When it’s time to be miserable just be miserable it’s ok https://t.co/Ms4YgqjqBC\nImages:\n  - [Image #0] The image presents a simple, text-based graphic with a question about motivation.\n    \n    * The main text is centered in the image and reads: \"How do you work through periods of low motivation?\"\n    \t+ The text is in black font.\n    \t+ It is written in a sans-serif font, likely Arial or Helvetica.\n    \t+ The text is divided into two lines, with \"How do you work through\" on the first line and \"periods of low motivation?\" on the second line.\n    * The text is contained within a white rectangle with rounded corners.\n    \t+ The rectangle has a subtle shadow effect around its edges.\n    \t+ The background of the image is a gradient that transitions from white at the top to a light pinkish-beige color at the bottom.\n    * There are no other visual elements or graphics in the image.\n    \n    In summary, the image features a straightforward question about overcoming low motivation, presented in a clean and simple design.\n↓\n1550903795676155906 [2022-07-23] @visakanv 💜 10\nI honestly don’t think this is possible. Im too lazy for tyranny. And I find it too boring to have people do as I say. I’d rather see each person do their own thing. You can quiz anybody who’s ever met me they’ll probably laugh at the idea. I can hardly stick to a routine myself https://t.co/K43PVZnBOM\nImages:\n  - [Image #0] The image is a white rectangle with rounded corners, resembling a speech bubble, and contains the text \"oh no :( visa became a tyrant :( bad end :( how could this have happened?\" in black font.\n↓\n1550904141848858625 [2022-07-23] @visakanv 💜 7\nThailand, probably https://t.co/sI9zSpN3tr\nImages:\n  - [Image #0] The image is a simple graphic with text that reads, \"Which country you would choose after Singapore.\" The text is in black and centered on a white background within a rounded rectangle shape. \n    \n    To recreate this image, you would need to:\n    \n    * Create a white rounded rectangle with a subtle shadow effect\n    * Center the text \"Which country you would choose after Singapore\" in black within the rectangle\n    \n    The overall design is clean and minimalistic, with a focus on the text.\n↓\n1550904829844660224 [2022-07-23] @visakanv 💜 21 🔁 2\ndon’t think of it as sth to get over. your fear is a part of you, it’s job is to keep you safe. face it. embrace it. thank it for doing a gd job so far (or at least for trying, lol). next articulate your specific anxieties. Write em down! Less scary on paper. Then: baby steps! https://t.co/lbCcFUzy0Q\nImages:\n  - [Image #0] The image presents a simple, text-based graphic with a central message. The main points of the image are:\n    \n    * **Text Box**\n    \t+ Shape: Rectangular with rounded corners\n    \t+ Color: White\n    \t+ Shadow: A subtle drop shadow effect is visible around the box\n    \t+ Position: Centered in the image\n    * **Text**\n    \t+ Content: \"how do i get over my courage deficit/'anxiety procrastination?'\"\n    \t+ Font: Black, sans-serif font\n    \t+ Size: Large, but not excessively so\n    \t+ Alignment: Centered within the text box\n    * **Background**\n    \t+ Color: White\n    \t+ Gradient: A faint, light greenish-gray gradient is visible on the right side of the image\n    \n    In summary, the image features a white text box with a centered message about overcoming courage deficit and anxiety procrastination, set against a clean white background with a subtle gradient effect.\n↓\n1550906447759675394 [2022-07-23] @visakanv 💜 2\nnot that I notice 🤔 https://t.co/MIiGWLp0Ve\nImages:\n  - [Image #0] The image displays a simple text graphic with the question, \"Do you think mcd coke tastes better.\" The text is in black and centered within a white rounded rectangle. The background of the image is also white, featuring a subtle shadow effect underneath the rectangle, which adds depth to the design.\n↓\n1550907245155663872 [2022-07-23] @visakanv 💜 9\nwriting! I love writing!! joy of my life https://t.co/6TPSaZ70dL\nImages:\n  - [Image #0] The image presents a simple, yet thought-provoking question on a clean white background. The text is displayed in a rounded rectangle with a subtle shadow effect, creating a sense of depth.\n    \n    *   **Text:**\n        *   The text is centered within the rounded rectangle.\n        *   It reads, \"What's going to make you the happiest tomorrow?\" in bold, black font.\n        *   The text is divided into two lines, with \"What's going to make you\" on the first line and \"the happiest tomorrow?\" on the second line.\n    *   **Rounded Rectangle:**\n        *   The rounded rectangle has a white background.\n        *   It features a subtle shadow effect around its edges, giving it a slightly raised appearance.\n        *   The rectangle is positioned centrally within the image.\n    *   **Background:**\n        *   The background of the image is plain white.\n        *   It provides a clean and neutral backdrop for the rounded rectangle and its text.\n    \n    In summary, the image effectively conveys a reflective question through its simple yet engaging design, encouraging the viewer to consider what will bring them happiness in the future.\n↓\n1550909334175232000 [2022-07-23] @visakanv 💜 14 🔁 1\nrecurring pattern in a lot of my suggestions is “what if you leaned into the thing you’re resisting”? What if you embraced that you have “weird energy”? The worst part of “weird energy” is almost always the meta-self-consciousness about it. be weird, let them sort themselves out https://t.co/ahu3PbcCZE\nImages:\n  - [Image #0] The image shows a white text box with rounded corners and a subtle shadow, containing black text that reads: \"how to get rid of weird energy I feel talking to people I'm not familiar with - talking in a continuous stream, rising heart beat, struggle to maintain eye contain, nervous body language\".\n\n===\n\n1551895496079327233 [2022-07-26] @alcentian_one 💜 2\nreminder to myself https://t.co/xD7yb0e1I7\n  [Quoting Tweet 1551869203409506304 (missing)]\n↓\n1551896489739313154 [2022-07-26] @alcentian_one 💜 1 [(SEED) type=quote_of_root]\nmantra reminder https://t.co/lx2jUrYqx3\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1570336136085778439 [2022-09-15] @forshaper 💜 3 [(SEED) type=semantic_search]\n\"He must beat off these attacks he delivers against himself, and cast out the doubts born of failure. Forget them, and remember only the lessons to be learnt from defeat- they are more than from victory.\"\n\n===\n\n1580689538812628993 [2022-10-13] @visakanv 💜 91 🔁 3 [(SEED) type=quote_of_root]\nnever preemptively disqualify yourself https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1595381073642672131 [2022-11-23] @AskYatharth 💜 6\nthere’s a difference between being “post-” a rejection and in reaction to it\n↓\n1595381074804121600 [2022-11-23] @AskYatharth 💜 3\none is living in living denial of it. the other is truly living in the future where 𝘵𝘩𝘦 𝘳𝘦𝘫𝘦𝘤𝘵𝘪𝘰𝘯 𝘩𝘢𝘱𝘱𝘦𝘯𝘦𝘥\n↓\n1595381075991150593 [2022-11-23] @AskYatharth 💜 2\nsecurely-attached people will know answers can change. securely-attached people will also know when it doesn’t work out with one person, you can move on to another one\n\nbecause true mutuality is worth it\n\nhttps://t.co/VoMF3c9f9o\n  [Quoting @AskYatharth: “because actual compatibility is worth it” https://t.co/lU9yGQ01hX]\n↓\n1595381078860394498 [2022-11-23] @AskYatharth 💜 2\nfor someone who grew up a perfectionist, whose basis for security in the world was his competence and independence, not adults he could emotionally depend on … it’s a little different\n\nhttps://t.co/F0BqaZ5gQy\n  [Quoting @AskYatharth: one thing about growing up a certain kind of gifted children was everything had to be perfect https://t.co/QnPBR0L681]\n↓\n1595381081124982784 [2022-11-23] @AskYatharth 💜 2\n&gt; can you live with your sins? \n&gt; because otherwise you cannot live a moment beyond them\n\nhttps://t.co/q8tidEVQqP\n  [Quoting @AskYatharth: to be post-mistake, you really have to be post- the fact of having made the mistake https://t.co/H0FoL6RHiV]\n↓\n1595381322809122816 [2022-11-23] @AskYatharth \nprivate (locked alt) thread https://t.co/4dSoCAhy8u\n  [Quoting Tweet 1595377288782094336 (missing)]\n↓\n1595383265489170433 [2022-11-23] @AskYatharth 💜 2 [(SEED) type=semantic_search]\nsomething ive been trying to articulate for a while is i never really had the experience of being rejected at or failing at a thing \n\nsure, i would fail at things, but that energy would simply be subsumed into making a better plan. becoming a better person https://t.co/Ne3O871CSB\n  [Quoting @AskYatharth: ugh so not used to not getting things]\n↓\n1595383267821203456 [2022-11-23] @AskYatharth \nit is entirely different to live with the fact of having failed, accepting it like a normal human being, and moving on\n↓\n1595383269138173952 [2022-11-23] @AskYatharth 💜 1\nbut narratives of perfection don’t allow for imperfection. they are a stain https://t.co/6xOF7PbBIs\n  [Quoting @AskYatharth: &gt; he must excel brilliantly in everything he undertakes . . . (otherwise he just does not attempt it)  holy fuck. i know this isn’t explaining anything, just naming it. but even then. ive felt this so much https://t.co/y1DdkMt632]\n↓\n1595383271004991494 [2022-11-23] @AskYatharth 💜 1\nan existential stain https://t.co/OJFraPvfZc\n  [Quoting @AskYatharth: the ability to exist, without being exceptional]\n\n===\n\n1607881631616110593 [2022-12-27] @AskYatharth 💜 37 🔁 1\nim not doing too well. when i can’t cry for too long, i become… manipulative. not in the conventional sense. it’s just a meanness in interactions. a narcissism of self. an unhappiness of disconnect. feeling ignored, left behind, lost\n\n===\n\n1607881641288163329 [2022-12-27] @AskYatharth 💜 11 🔁 1\nim so afraid people won’t like me the interim. but is that really true? is it? who thinks that? why do they think that? listen to that part. what does reality sound like? what is the true sound, movement, and light of this moment of existence? what is its name? fury, grief, rage\n↓\n1607881645042065409 [2022-12-27] @AskYatharth 💜 7\nlove, timelessness, broken innocence, survived innocence, nothing wrong, the continuance of the path\n↓\n1607881648695300096 [2022-12-27] @AskYatharth 💜 9 🔁 1\nwe have different strategies available to us as kids versus as adults. as kids, we kind of have to be rescued. or skip parts of the developmental process and rescue ourselves\n\nour options are limited: fawn, withdraw (your aliveness from the room), manipulate, control\n↓\n1607881652319186945 [2022-12-27] @AskYatharth 💜 8\nbut i made it to adulthood, and im not dependent on getting the attention of an adult &amp; using these strategies. im not waiting, to be rescued. for my existence to be confirmed, for others’ power to be enlisted &amp; enrolled in any way possible for my survival\nhttps://t.co/DNrBVZXHVV\n  [Quoting @AskYatharth: the baby crying, because it needs to its back burped, or more milk, is inviting receptivity and mirroring, so it can survive  humans depend on other humans noticing them existence depended in a very fundamental way on being mirrored]\n↓\n1607881656895156224 [2022-12-27] @AskYatharth 💜 8 🔁 1\nas an adult, there’s a lot more fucking possibilities. it renews and inflates me. the adult that is here to say things are ok, the source of personal power to make my life as i want it to be, is arrived and here\n↓\n1607881659495612416 [2022-12-27] @AskYatharth 💜 5\nmy primal intelligence becomes alive again. here is an adult attuning to its needs, and listening to its basic anger, fury, grief. it renegotiates the very basic energetic templates and holding patterns i had internalised since a kid https://t.co/m6XVQFdTDZ\n  [Quoting @AskYatharth: chakra three is about burning your way into power https://t.co/dVUdvOk0Tm]\n↓\n1607881662628761600 [2022-12-27] @AskYatharth 💜 5 🔁 1\nthey don’t go away in a day, but the fire begins burning at the tips of all the ropes that bind you, and you feel their warmth, and you begin to follow the call and movement for the sake of the call and movement https://t.co/TJ9rLNbmJH\n  [Quoting @AskYatharth: when you start moving for existence’s sake,  the move becomes less about the result, and more about the urge to move. the calling becomes about the urge, not the result]\n↓\n1607881666013589504 [2022-12-27] @AskYatharth 💜 6\n&gt;i always had a feeling that it’s not enough. it’s not enough. the kind of attention i would need on my grief and rage was not enough https://t.co/UcNGKDdexG\n  [Quoting @AskYatharth: i always had a feeling that it’s not enough. it’s not enough. the kind of attention i would need on my grief and rage was not enough  and it’s true. there is literally not a human on earth since my parents whose attention would have been enough]\n↓\n1607881670631514112 [2022-12-27] @AskYatharth 💜 8 🔁 2\nthe truth is you can be 𝘬𝘪𝘭𝘭𝘪𝘯𝘨 𝘪𝘵 when it comes to being responsive to yourself\n\nthat’s what we weren’t taught\n↓\n1607881674213437440 [2022-12-27] @AskYatharth 💜 7 🔁 2\nit comes with commitment. with devotion. to yourself, to your wellbeing. that’s what shifts the landscape of this\n↓\n1607881677665370113 [2022-12-27] @AskYatharth 💜 7 [(SEED) type=quote_of_root]\nthis is the fire that burns through the binds\nhttps://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1607881681633169410 [2022-12-27] @AskYatharth 💜 8\nthis is the fire that burns through the binds\n\nbut you also need a softness. a kind of softness you might not be used to, to not burn ourselves\n\notherwise, we are fire breathers numb to the pain in our skin and unintentionally burning ourselves with the fire of our will\n↓\n1607881685324136449 [2022-12-27] @AskYatharth 💜 3 🔁 1\nwithout responsiveness, you get into a state of arrogance, where you think you can get whatever you want. no. or on the other pole, you can enter starvation\n\nthe fear of seeing people in starvation might make you want to stay in the state of arrogance forever\n↓\n1607881689308753920 [2022-12-27] @AskYatharth 💜 4\ngrandiosity keeps depression at bay, but 𝘯𝘦𝘪𝘵𝘩𝘦𝘳 𝘨𝘳𝘢𝘯𝘥𝘪𝘰𝘴𝘪𝘵𝘺 𝘰𝘳 𝘥𝘦𝘱𝘳𝘦𝘴𝘴𝘪𝘰𝘯 𝘢𝘳𝘦 𝘨𝘦𝘵𝘵𝘪𝘯𝘨 𝘸𝘩𝘢𝘵 𝘺𝘰𝘶 𝘯𝘦𝘦𝘥\nhttps://t.co/9i42zKwhgS\n  [Quoting @AskYatharth: depression was kept at bay, though, because i could keep sustaining that reality. i could keep feeding that fire  indeed, i felt incapable of depression most of my life. how could i be depressed, when i had bulletproof shell of grandiosity, i was able to sustain with achievement? https://t.co/HoWojp3qdX]\n↓\n1607881693368844295 [2022-12-27] @AskYatharth 💜 5\nthere is a singular question, and it is about aliveness\n\nthe aliveness &amp; innocence are stoked by one thing: a responsiveness to self https://t.co/RQXudnAMl9\n  [Quoting @AskYatharth: “why do i not feel alive anymore?”  this is the core question. ask 100x, repeat]\n↓\n1607881696711675904 [2022-12-27] @AskYatharth 💜 3\nyou become responsively alive in response to your own eros. you simply move in sync with it. the way you move in sync with with the needs of a partner you’ve been with for years and love https://t.co/TGXs08ZjJH\n  [Quoting @AskYatharth: responsiveness aliveness is reaching your hand out for someone who is falling because they are falling  there’s no thought i should do this]\n\n===\n\n1624186326898864128 [2023-02-10] @visakanv 💜 112 🔁 6\ni am never surprised when good things happen to my friends\n↓\n1624186978530103296 [2023-02-10] @visakanv 💜 36\n“Holy shit’s X startup just got acquired for a billion dollars”\n\n“wow Y’s book just got plugged on Oprah”\n\n“wow Z’s band is going to headline a major festival”\n\nNone of this is surprising to me. My friends are lucky, successful, blessed, and good things happen to them\n↓\n1624187162815254528 [2023-02-10] @visakanv 💜 30\nin fact, the move is to conduct ourselves as if it has already happened, because in a sense, it already has\n↓\n1624187861380784128 [2023-02-10] @visakanv 💜 25\n“wow &lt;famous celebrity&gt; listens to J’s podcast and read K’s blog”\n\nAs they should. We play with live ammo around here\n↓\n1624188407537872896 [2023-02-10] @visakanv 💜 33\nprepare and rehearse relentlessly for glorious opportunity, and position yourself to receive it \n\nwe are still in the early days\n↓\n1624189130283548672 [2023-02-10] @visakanv 💜 31 🔁 1\npossibility is everywhere\n\nanything could change everything\n\nlive like it matters\n↓\n1624189642370347010 [2023-02-10] @visakanv 💜 21 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1624190199491334147 [2023-02-10] @visakanv 💜 15\nwe are still in the early days https://t.co/GIO36T8yID\n  [Quoting @visakanv: @sonyasupposedly @SHL0MS one day people will write about how this part of twitter was legendary for all the overlapping origin stories]\n\n===\n\n1624190480886951936 [2023-02-10] @peakexperiments 💜 3 [(SEED) type=quote_of_root]\nLife is hard, and full of rejection and failure.\n\nBut.\n\nI will never be the one to count myself out.\n\nI will never take up arms against myself.\n\nI will never be the one to sabotage me.\n\nI'm on my side and I root for me to succeed. https://t.co/YlQS4GWZSp\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1624190860144574464 [2023-02-10] @visakanv 💜 1\n@peakexperiments ❤️‍🔥💪🏾⚡️!!\n↓\n1624191138977521669 [2023-02-10] @peakexperiments 💜 1\n@visakanv I actually typed it out\n↓\n1624191427029929984 [2023-02-10] @visakanv 💜 1\n@peakexperiments best way to do it! 🫡\n\n===\n\n1665764597159297024 [2023-06-05] @Malcolm_Ocean 💜 32 🔁 1 💬 1 [(SEED) type=semantic_search]\nyou don't have to beat yourself up\n\nyou don't have to beat yourself up for beating yourself up\n\nyou don't have to beat yourself up for beating yourself up for beating yourself up\n\nbut it's okay if you do\n\n(probably still doesn't help but 🤷‍♀️) https://t.co/UKza9QlbbZ\n  [Quoting @uberstuber: life is hard enough without beating yourself up, or beating yourself up for beating yourself up]\n↓\n1665776114063556610 [2023-06-05] @visakanv 💜 6\n@Malcolm_Ocean rhymes with https://t.co/B6AGdYFbRb\n  [Quoting @visakanv: 57. mindfulness for engineers, via @PearShapedComic   https://t.co/yu4zxU6cE4 https://t.co/onmSyNobks]\n↓\n1665778084350660610 [2023-06-05] @Malcolm_Ocean 💜 5\n@visakanv Ahh this is lovely. Doesn't quite capture my experience of getting lost meditating and being unable to really locate myself in the flowchart at all let alone choose to do anything about it, but hmmm... might help with that somewhat to have a visual tbh.\n↓\n1665779658124836864 [2023-06-05] @visakanv 💜 13 🔁 1\n@Malcolm_Ocean yea my ass is like inhale, exhale, kangaroo, despacito,\n↓\n1665781570291240960 [2023-06-05] @Malcolm_Ocean 💜 3\n@visakanv and then like \"wait I was meditati—sasparilla, Tarantino...\"\n\nlike I feel like if I were able to get steady again for one whole breath then maybe that'd be progress, but it has mostly felt like drowning and eventually I gave up spiritually waterboarding myself\n\n===\n\n1665767523101601792 [2023-06-05] @danallison 💜 29\nSometimes I feel like my efforts towards “self-improvement” are a lot like this. https://t.co/0T7vCjuQl3\n  [Quoting Tweet 1665765894222499842 (missing)]\n↓\n1665768321520660482 [2023-06-05] @danallison 💜 1\nI *must* get “get out of my own way” out of my own way (and that one too).\n↓\n1665768697401860096 [2023-06-05] @danallison 💜 1 [(SEED) type=quote_of_semantic_search]\nRelated https://t.co/kFm4dS7jjg\n  [Quoting @Malcolm_Ocean: you don't have to beat yourself up  you don't have to beat yourself up for beating yourself up  you don't have to beat yourself up for beating yourself up for beating yourself up  but it's okay if you do  (probably still doesn't help but 🤷‍♀️) https://t.co/UKza9QlbbZ]\n↓\n1666311950824013824 [2023-06-07] @danallison 💜 2\nOne of the best tweets of all time https://t.co/9qHB02mb0N\n  [Quoting @gnostrils: If you have a habit of being hard on yourself or are chronically unhappy, it's good to regularly strive to cultivate self-compassion, gratitude, and mindfulness. If you've tried to cultivate these things and you still feel bad, it's because you're a failure and piece of shit]\n↓\n1666992537129869312 [2023-06-09] @danallison 💜 1\nI'm pretty sure I'm the guy on the left https://t.co/Hd20vmcLPR\n  [Quoting Tweet 1666841111619416064 (missing)]\n\n===\n\n1669461381102329858 [2023-06-15] @michelleakin 💜 4\nPSA if you see a tweet that you think i should sing, put it in the replies…\n↓\n1669687981450620933 [2023-06-16] @visakanv 💜 2 [(SEED) type=quote_of_root]\n@MichelleAkin I feel like this could be fun to do https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1669688413081968642 [2023-06-16] @michelleakin 💜 4\n@visakanv ohhhhh it’s a sultry hook followed by a rap!!!!!!\n↓\n1669692132108693505 [2023-06-16] @visakanv 💜 3\n@MichelleAkin Kinda Lin-Manuel-ly\n↓\n1669692464121217027 [2023-06-16] @michelleakin 💜 3\n@visakanv mmm yep. got it.\n\n===\n\n1693325886341136654 [2023-08-20] @tasshinfogleman 💜 85 🔁 2\ndo you think it’s possible to be self-disciplined but not self-coercive? why or why not?\n↓\n1693437109804167545 [2023-08-21] @Malcolm_Ocean 💜 20 [(SEED) type=quote_of_semantic_search]\n@tasshinfogleman yeah, I've been meaning to write up a review of Jocko Willink's Discipline=Freedom which talks about this\n\nTL;DR is that he doesn't beat himself up if he fails, he just tries again, harder and/or smarter\nhttps://t.co/YdIpneFa1C\n  [Quoting @Malcolm_Ocean: you don't have to beat yourself up  you don't have to beat yourself up for beating yourself up  you don't have to beat yourself up for beating yourself up for beating yourself up  but it's okay if you do  (probably still doesn't help but 🤷‍♀️) https://t.co/UKza9QlbbZ]\n↓\n1693437504169345081 [2023-08-21] @Malcolm_Ocean 💜 16\n@tasshinfogleman this is an important distinction and he doesn't actually highlight it very clearly in his own writing/speaking, so I'm guessing a lot of people listen to his stuff, try to be disciplined, then beat themselves up when they fail\n\nwhereas he would see that as a huge distraction\n↓\n1693672877378211993 [2023-08-21] @tasshinfogleman 💜 4\n@Malcolm_Ocean love this, hope you do write it up! ❤️\n\n===\n\n1696033365139325036 [2023-08-28] @inkolore_ 💜 1 [(SEED) type=semantic_search]\nRepeat after me : I will not be cruel towards myself for fumbling around while trying something new or difficult.\n\n===\n\n1701148752759632101 [2023-09-11] @easoncxz 💜 4 [(SEED) type=semantic_search]\n\"The only way to be more confident is by getting rejected 100 times.\" 🔥 https://t.co/M93n1FEnK6\n  [Quoting Tweet 1700989644765368669 (missing)]\n↓\n1701148939519500338 [2023-09-11] @easoncxz 💜 3\nNew idea for a Visakan do-100-things project: fail 100 times.\n\n===\n\n1717726301187141646 [2023-10-27] @visakanv 💜 222 🔁 15 [(SEED) type=quote_of_root]\ncan confirm with about a dozen examples of people who’ve tried this seriously that it really leads to more winning and less losing, at whatever games you care about https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1717726808748224661 [2023-10-27] @pachabelcanon 💜 4\n@visakanv I remember when I was 15 years old, reading the Sequences, and I made a momentous decision \"I won't lie to myself\", that I would accept the truth, nor lie to myself. I've been trying to take that seriously\n\n===\n\n1717739014512574502 [2023-10-27] @AskYatharth 💜 10\ni’d like to be unrushable\n↓\n1717742337470951868 [2023-10-27] @AskYatharth 💜 3 [(SEED) type=quote_of_root]\nmaybe it’s as easy as acknowledging i don’t have to rush, because i’m already with myself.  that’s a huge person to have in my corner https://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1718064899174371488 [2023-10-28] @AskYatharth 💜 55 🔁 5\nsometimes i get in a state with people-pleasing that feels circular: i feel cramped, and not like myself. then i try to strategise, how to not be cramped. how to be me. i recognise being me is when people seem to like me. i want to hide the fact im trying so hard to not try\n↓\n1718065281623605705 [2023-10-28] @AskYatharth 💜 8 🔁 1 [(SEED) type=quote_of_root]\nfor all that strategising, none of it does as much as good as a peculiar shift in the quality of my feeling. it's something like this\nhttps://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1718066098489409861 [2023-10-28] @AskYatharth 💜 7 🔁 1\nthat's… it…\n\nthere's a quality to recognising after all is said and done, the person im going to be left with is me. not her. him. them. me. i am in my experience forever\nhttps://t.co/vGFRqolwtL\n  [Quoting @AskYatharth: our AT fields can interact, but never completely overlap]\n↓\n1718066183222731081 [2023-10-28] @AskYatharth 💜 4\nit's from that place all else connection happens. that place is inherently truthful\n↓\n1718066861919945026 [2023-10-28] @AskYatharth 💜 13 🔁 1\nall self-abandoning stems from the lack of capacity to grieve the lack of connection at the time we needed it most\n\n===\n\n1718433384991477804 [2023-10-29] @univrsw3th4rt 💜 715 🔁 55 💬 1\nbefore i started Doing Things in Public i rly had no idea how much space there is for beginners/amateurs/etc. there’s like, infinite space lmao. i just assumed that since u only see hyper-successes, that that’s all there’s opportunities for and that’s not true at all\n↓\n1718433903780811254 [2023-10-29] @univrsw3th4rt 💜 88 🔁 5\nlike me a year ago would be like wtf do u mean ur goals are paris and nyfw, only the best of the best walk in thosebut that’s not true at all, the biggest fashion gatherings in the world def have many tiers of participation, and so does any other kind of thing https://t.co/NwTSy9g4TE\n  [Quoting @univrsw3th4rt: so goals for next year and paris fashion week AND nyfw https://t.co/Y3f8MkON7e]\n↓\n1718434579432808878 [2023-10-29] @univrsw3th4rt 💜 64 🔁 3 [(SEED) type=quote_of_root]\ni just have to get over my own mental blocks and get out of my own way to be able to even see these opportunities in the first place https://t.co/3ZnLAhN9EL\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1718437964903071984 [2023-10-29] @univrsw3th4rt 💜 82 🔁 5\nlike a big part of my mental block is “why would ppl want to be subjected to anything less than perfection” lol\n├── 1718438077490688307 [2023-10-29] @univrsw3th4rt 💜 42\n│   ofc nothing’s perfect, but why would anyone want to see anything super unpolished\n│   ├── 1718538894839574898 [2023-10-29] @visakanv 💜 15\n│   │   @univrsw3th4rt straightforward answer to this is that people don’t always want to be in the company of gods and immortals, sometimes they want to be in the company of friends\n│   └── 1718837807701967064 [2023-10-30] @strangestloop 💜 3\n│       @univrsw3th4rt the unpolished is often more interesting than the polished\n└── 1718698331357212747 [2023-10-29] @AskYatharth 💜 2\n    @univrsw3th4rt 🫂 same\n    https://t.co/GmAP0jiqZd\n      [Quoting @AskYatharth: i still feel that way about dating. that i have to be perfect, and what other people are looking for is perfection]\n    ↓\n    1719013499991474320 [2023-10-30] @univrsw3th4rt 💜 2\n    @AskYatharth yup and i felt/feel this bc *i* was looking for perfection 🙃 https://t.co/YRbxJpaQGz\n      [Quoting @univrsw3th4rt: step one: become a person who doesn’t flinch at imperfection]\n\n===\n\n1719620677203026298 [2023-11-01] @AskYatharth 💜 90 🔁 5\none of the things i admire about cats and have unconsciously replicated is how they walk with their belonging\n\nthey will come nuzzle your lap and lay their head if they want, but if rejected, they will still defend their heart\n↓\n1719620979847205135 [2023-11-01] @AskYatharth 💜 8 🔁 1\nthat is what it means to carry your heart\nhttps://t.co/PssuFb5NVE\n  [Quoting @AskYatharth: link to post on forbidden website in bio  in the meantime https://t.co/a2aoTEEhrH]\n↓\n1719642081948532901 [2023-11-01] @AskYatharth 💜 7 🔁 1 [(SEED) type=quote_of_root]\nto not drop it\nhttps://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1719662052355305879 [2023-11-01] @AskYatharth 💜 6 🔁 1\n*headbutt*\nhttps://t.co/i9Wn6CmEEg\n  [Quoting @AskYatharth: @christineist walking the earth like a cat, where i was comfortable enough to put my head in someone’s lap, even someone i never met, if i sensed it was right, helped]\n\n===\n\n1733597156878258344 [2023-12-09] @AskYatharth 💜 278 🔁 14\ni want to talk about a taboo topic\n\ni had a hard time, shall we say, performing when it came to sexual intimacy. the moment before, there would just be fear\n\ni decided after a painful experience on the train home that anyone who wasn't kind to me in the moment about it happening was an asshole\n↓\n1733597159130550492 [2023-12-09] @AskYatharth 💜 105 🔁 3\nthey weren't bad necessarily. people are human after all. but if they weren't nice to me in the moment, they were an asshole 🤷‍♂️\n↓\n1733597160674042062 [2023-12-09] @AskYatharth 💜 104 🔁 2 [(SEED) type=quote_of_root]\nsomething about that made it so every time there was fear after that moment, i would remember: anyone being mean to my member would be an asshole\n\nbetween that and some anatomy learning, \n\nit was so simple. and i never quite had problems with it after that https://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1733599859247292836 [2023-12-09] @AskYatharth 💜 87 🔁 3\ni felt human again\n\ni was expecting the part where i was able to have sexual intimacy again with a cooperative spindle\n\nbut what i didn't expect is this feeling of being like... a person\n↓\n1733600644089700702 [2023-12-09] @AskYatharth 💜 95 🔁 6\nwhenever the fear came up again, i still felt like a person\n\ni had my wits. i had my opinions\n\ni still had my fears\n\nbut i was just like... a person? i could be kind to myself? i could have reasonable expectations of people? i could feel sensitivity towards them and me?\n↓\n1733600724351877260 [2023-12-09] @AskYatharth 💜 136 🔁 8\nis this what it is called when your inner kid gets scared and your inner adult doesn't disappear?\n\nbecause this is fucking awesome\n↓\n1733707520034914462 [2023-12-10] @justavagrant_ 💜 1\n@AskYatharth fuck yeah\n\n===\n\n1740456459547406767 [2023-12-28] @univrsw3th4rt 💜 27\n&gt; worry ends when the heart ignites, says I am here to fucking live gloriously in this moment come whatever❤️‍🔥 https://t.co/X3EFlfnED8\n  [Quoting @visakanv: you cannot rationalize your way out of worry. the mind is a worry machine. there's no such thing as a reason to not worry. that line of inquiry only leads to more worries. worry ends when the heart ignites, says I am here to fucking live gloriously in this moment come whatever]\n↓\n1740458920928584029 [2023-12-28] @visakanv  [(SEED) type=quote_of_root]\n@univrsw3th4rt https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1742401720771354896 [2024-01-03] @visakanv 💜 1058 🔁 31 💬 1\nwife and i were on a walk with our son and we witnessed an interesting conflict in another family unit. there was a wailing toddler asking her aunt(?) (cousin?) to carry her, and an older aunt(/grandma?) was insisting very forcefully that no!!, she must walk!!, dont be lazy!!!…\n↓\n1742401943841219023 [2024-01-03] @visakanv 💜 261 🔁 1\nit looked like a difficult/sad/uncomfortable situation, no judging, but we discussed what we thought and how we would handle it if it were us, and here are my thoughts as follows\n↓\n1742402373103034517 [2024-01-03] @visakanv 💜 353 🔁 3\n1. In the moment, it doesnt reaaaally matter whether the child walks or is carried. and thats not really what the conflict is about either. this is a proxy conflict, about connection vs independence, and kids (and adults!) need both\n↓\n1742402939564732790 [2024-01-03] @visakanv 💜 414 🔁 8\n2. i always think its important to ask what the child is really asking, what the child is really anxious about. and in this case i think the fear is the annihilating collapse of the old world. this is a destruction of comfort. kid is making bids to ask “can i still be loved”\n↓\n1742403343383945236 [2024-01-03] @visakanv 💜 328 🔁 3\n3. but the adults/caregivers are also anxious about the kid’s development. they dont want to coddle her, stifle her independence, leave her developmentally stunted.often the most cursed part is what theyre anxious sbout is the judgement of others. looking like bad/failed parents\n↓\n1742403796985323871 [2024-01-03] @visakanv 💜 504 🔁 7\n4. when this plays out with my kid, and im sure it will, i would be careful to avoid making things so dramatic/binary. can you walk a little bit and then ill carry you a little bit? soothe him and love him if he’s distressed, but then cheerfully challenge him to grow\n↓\n1742404215203578078 [2024-01-03] @visakanv 💜 394 🔁 7\n5. the tragedy here is a wretchedness spiral where the child’s anxiety about being cast out from love is spiraling together with the caregiver’s anxiety about failure to perform (their own as parent, and the child’s) into a yelling-screaming match where everything gets worse\n↓\n1742404565146997168 [2024-01-03] @visakanv 💜 300 🔁 7\n6. i half-jokingly but earnestly pointed out to wife that this has parallels with sexual intimacy/performance for a couple. imagine getting mad at each other for failing to be aroused, excited, etc. imagine being mad at each other for seeking comfort. yelling will surely help lol\n↓\n1742405343521702275 [2024-01-03] @visakanv 💜 217 🔁 5\n7. in all cases, if its not happening, its not happening, and trying to force it just makes everything worse. the problem isnt solved on the “playing field”, but off of it. in training, while socializing, away from the field. this does require spending time/effort communicating\n↓\n1742406028837445973 [2024-01-03] @visakanv 💜 321 🔁 24\n8. the safer, more secure, attached, comfortable etc someone feels, the more confident they will be about taking risks, trying new things, etc. this isnt just for kids, this is for all of us. we need encouragement more than we need threats and ultimatums.\n↓\n1742406360602742819 [2024-01-03] @visakanv 💜 237 🔁 7 [(SEED) type=quote_of_root]\ni will never be the one to count my son out. i will never take up arms against him. i will never be the one to sabotage him. im on his side and i root for him to succeed. https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1742407098129170799 [2024-01-03] @visakanv 💜 406 🔁 10\nalso im going to carry him until he’s 50 if i can. but, simultaneously, im going to earnestly-cheerfully challenge him to carry *me*. and when he manages that, maybe when he’s 13? 16? we will have a grand celebration\n\nconnection &amp; independence are not binary. we can have both ☯️ https://t.co/DqGmhxfs6M\nImages:\n  - [Image #0] The image shows a man carrying a child on his shoulders. The man, with dark hair tied up in a bun and wearing a green Hawaiian shirt, is facing away from the camera, while the child, adorned with a cartoon crown and sunglasses, sits on his shoulders, also facing away.\n├── 1742410770510426494 [2024-01-03] @goblinodds 💜 1\n│   @visakanv hell yes, you're such a great dad already :')\n├── 1742462948743037294 [2024-01-03] @SurenVynn 💜 2\n│   @visakanv I love this whole thread so much but especially those last two sentences. Thank you for stating the obvious.\n└── 1743885539047285055 [2024-01-07] @Malcolm_Ocean 💜 2\n    @visakanv book that is precisely this vibe along a particular axis\n    https://t.co/ul5ge70sna\n\n===\n\n1745395731647840349 [2024-01-11] @AskYatharth 💜 5 🔁 1\nthere's no way to pause time. only continue with the flow https://t.co/1NhOrfMPbH\n  [Quoting @AskYatharth: @relic_radiation sometimes i think about the portal to \"elsewhen\"  a place with no continuity with what happened https://t.co/8hN1L7TaBv]\n↓\n1745395837277241446 [2024-01-11] @AskYatharth 💜 1\nthere's no fucking final song. this is it\nhttps://t.co/yPvssRW1zM\n  [Quoting @AskYatharth: i wish there was a final song. a song you could listen to that would end all other songs. it would give you what you wanted and there would be no more songs needed like that again]\n↓\n1745396117905494490 [2024-01-11] @AskYatharth 💜 4\ni lived my life wishing for an elsewhen, living just outside my skin. but fuck, im here now. i get it. this is it. this body, this life, this corner\n\nthis is fucking it\nhttps://t.co/D15WD5TsET\n  [Quoting @AskYatharth: you are the only corner of the universe you will ever consciously occupy]\n↓\n1745396375217639440 [2024-01-11] @AskYatharth 💜 2 [(SEED) type=quote_of_root]\nthere's no not advocating for myself, because i don't have no one else to advocate for\n\nthis dude, is all i got\nhttps://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1745396602884554801 [2024-01-11] @AskYatharth 💜 1\nthis dude, with all that he's got, is all i got\n\nso he better be deserving of all the love in the world, because i can't swap him out with no one else\n↓\n1745398951178875152 [2024-01-11] @AskYatharth 💜 3\nlife be like: this is the way things be\n\nwhat the fuck are you going to do now\n\nwell, you don't have much choice, except\nhttps://t.co/0w1BIIDr3w\n  [Quoting @AskYatharth: there's no way to pause time. only continue with the flow https://t.co/1NhOrfMPbH]\n\n===\n\n1747403589310714129 [2024-01-16] @visakanv 💜 144 🔁 7 💬 1\ni'll say it again you just gotta have that dawg in you https://t.co/emX2pOvhRG\n  [Quoting Tweet 1747379704980439249 (missing)]\n↓\n1747404037220385113 [2024-01-16] @visakanv 💜 20\nyou could become a musician/performer and git gud, that's one way of doing it. this guy has the dawg in him https://t.co/pwaQNTaTgt\n  [Quoting @visakanv: musicians don’t need dating apps https://t.co/zLQwJiHTLk]\n↓\n1747404134796644513 [2024-01-16] @visakanv 💜 43 🔁 1\n\"that's a lot of work... most musicians don't see any kind of success...\"\n\nno dawg detected\n↓\n1747404490888954097 [2024-01-16] @visakanv 💜 33 🔁 1\nyou can see the precise moment the dawg awakens in this guy https://t.co/dOPKyFQRlu\n  [Quoting @visakanv: 🎷 https://t.co/4Gq2dYBuJy]\n↓\n1747406202592809299 [2024-01-16] @visakanv 💜 31 🔁 2\ni cant find it rn but recently there was a thing about this guy who made a video that's like \"my experience being ugly\" and a woman commented ~\"you're kinda cute actually\" and they got married. dawg detected\n↓\n1747406353436721204 [2024-01-16] @visakanv 💜 15 🔁 1\notoh, this guy fumbling the bag when the woman was already interested in him, no dawg detected https://t.co/8sa5mGhLo6\n  [Quoting @visakanv: the interesting part of this to me is when he says “hard to be positive when that’s reality”, when the reality right in front of him only *just* got morphed by his reality distortion field.   It’s not reality that screwed him here, but the expectations that he has about reality https://t.co/VujX8KlzNf]\n↓\n1747407491435233495 [2024-01-16] @visakanv 💜 27 [(SEED) type=quote_of_root]\nhow to begin cultivating that dawg within u https://t.co/8RY1prwStc\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1747408775806701707 [2024-01-17] @visakanv 💜 22\ndawg detected https://t.co/1yMlZ4uTpK\n  [Quoting @visakanv: this guy teaching himself to walk again  they said he couldn't do it  they were wrong  it was possible  never underestimate what you can do when you believe in yourself, when we believe in each other  never give up https://t.co/x95a9uCj6f]\n\n===\n\n1749182448963829844 [2024-01-21] @CountJ0ecool 💜 2 [(SEED) type=semantic_search]\nwhat do I want to fail at today?\n\nwhat do I want to be failing at for the rest of my life?\n\n===\n\n1752947981241004541 [2024-02-01] @AskYatharth 💜 80 🔁 4\nhere it is: the masturbation thread. i hope it will be useful to somebody\n\none of the few things ive felt addicted to in this life is masturbation. i wasn’t doing it that often, but it was one of those things that felt like it had high stakes https://t.co/kWgb7aP1F3\n  [Quoting @AskYatharth: Even just tolerating even the brief discomfort of getting out of my bed was enough to activate this huge mashup of grinding.  This is what I mean by everything in my life felt high-stakes. https://t.co/dzsvJWrdjv https://t.co/hScp5XRq0o]\n↓\n1752947983250030984 [2024-02-01] @AskYatharth 💜 30\nto say no to doing it felt ~really bad, and doing it ~felt really bad. and somehow, in the double bind itself, there was eroticism\n↓\n1752947984801906890 [2024-02-01] @AskYatharth 💜 26\nit was like going on a hunger strike, or cutting yourself, or having an eating disorder. it felt like a teenager messing up their grades as a fuck you to their parents \n\nthe juice of doing it partly came from how bad it felt. it felt like irreverent, punishing rebellion\n↓\n1752947986311823649 [2024-02-01] @AskYatharth 💜 49 🔁 1\nwhat do you do when it feels like someone is controlling you? ruin the only investment of theirs you control, right? you. you burn it to the ground. you say, i will defile this body. i will starve to death. i will fuck my life up. let me see you try to be invested in me then\n↓\n1752948277048426502 [2024-02-01] @AskYatharth 💜 36\nif this sounds dramatic, it’s not. im coming to observe it as the fundamental dynamic behind nearly every addiction in this society\n↓\n1752948384980459521 [2024-02-01] @AskYatharth 💜 33 🔁 1\nsure, sure, there’s the physical/chemical side of addiction. we’ll get to that. but to not address 𝘵𝘩𝘦 𝘲𝘶𝘦𝘴𝘵𝘪𝘰𝘯 𝘰𝘧 𝘤𝘰𝘯𝘵𝘳𝘰𝘭 is to 𝘮𝘪𝘴𝘴 𝘵𝘩𝘦 𝘱𝘰𝘪𝘯𝘵 https://t.co/NOJ3ZmS1Kb\n  [Quoting @visakanv: @AskYatharth ha https://t.co/xGbJGnUHmw https://t.co/FzuPaVicqD]\n↓\n1752948975483916470 [2024-02-01] @AskYatharth 💜 24\nto not address 𝘵𝘩𝘦 𝘲𝘶𝘦𝘴𝘵𝘪𝘰𝘯 𝘰𝘧 𝘤𝘰𝘯𝘵𝘳𝘰𝘭 is 𝘸𝘩𝘢𝘤𝘬 𝘵𝘩𝘦 𝘮𝘰𝘭𝘦 and be confused when it 𝘱𝘰𝘱𝘴 𝘰𝘶𝘵 𝘵𝘩𝘦 𝘰𝘵𝘩𝘦𝘳 𝘴𝘪𝘥𝘦 https://t.co/PmlNwHLfX4\n  [Quoting @AskYatharth: when the underlying feeling cannot be handled, it shows up as something we can handle, like an eating disorder, or a different emotion, or rumination (in thought land)]\n↓\n1752955210434257123 [2024-02-01] @AskYatharth 💜 32\ni could spend a lifetime denying myself masturbation and it would be a lifetime spent working, forgive the accidental metaphor, working around my holes https://t.co/B8VSD5DZkY\n  [Quoting @AskYatharth: &gt;For most therapists healing looks like avoiding falling into holes. For me, it means there are no holes https://t.co/EdUjnB8pEe https://t.co/ti5q8bXQ7a]\n↓\n1752956190777360736 [2024-02-01] @AskYatharth 💜 22\nconversely, i could try shovelling endless amounts of my valuable attention, energy, and effort into this addiction hole, and never quite feel totally content, totally in integrity, totally masculine\n↓\n1752956212768117137 [2024-02-01] @AskYatharth 💜 17 🔁 1\nbecause to use the language of my time, it is cucked to be butterin the muffin not fully out the free unbothered autonomy of your soul\n↓\n1752956425549250596 [2024-02-01] @AskYatharth 💜 37 [(SEED) type=quote_of_root]\n𝘵𝘩𝘢𝘵’𝘴 what i wanted. not \"to be masturbating\" or \"not be masturbating\". what i wanted was a kind of fluid integrity, a kind of autonomy of soul, to be doing either, but being in the team with myself https://t.co/7E5TeL3fEn\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1752958897269477800 [2024-02-01] @AskYatharth 💜 23\nthat’s something none of the discourse on masturbation or chi or self-control will talk about, but it’s the thing that mattered the most. frankly, it is the thing that matters the most\n\nthere’s a million ways to frame it. autonomy. control. shame. self-trust. doesn’t matter\n↓\n1752958918056394979 [2024-02-01] @AskYatharth 💜 36\nwhat matters to me is 𝘥𝘰 𝘺𝘰𝘶 𝘧𝘦𝘦𝘭 𝘢𝘭𝘪𝘷𝘦? and if you do, you will likely figure out your way into something decent\n\nand if you don’t, all attempts to control reality will be thwarted by that lack of feeling real\n↓\n1752958952688812254 [2024-02-01] @AskYatharth 💜 24\nand if not thwarted, then it’ll show up as a mysterious depression 10 years later, or a porsche and mid-life crisis, or a gun to your head https://t.co/K6IJWZriAE\n  [Quoting @AskYatharth: &gt;One day, years later, after washing the kitchen and the living room floors by hand, she slipped into her best silk blouse…and her big hat. She pressed her husband's shotgun to the roof of her mouth, and pulled the trigger. Every woman alive knows why she washed the floors first https://t.co/S3qhTy1HRX]\n↓\n1752960606943211667 [2024-02-01] @AskYatharth 💜 22 🔁 1\ni promise we’ll get to the part about masturbation, but the thing is \"addiction to masturbation\" is at least partly about the addiction, and addiction is always about control\n↓\n1752960905770684786 [2024-02-01] @AskYatharth 💜 28\nbrief aside: the \"sex-positive\", \"masturbation-positive\" folk are alright, but honestly, they don’t seem like the most okay folk themselves. they’re kind of just enacting the other extreme of the psychodrama, like weirdly intense leftists to society’s rightists\n↓\n1752960923239940135 [2024-02-01] @AskYatharth 💜 25\n(continued) the \"men are horny and masturbating is good actually\" people seem to be doing the best overall, because they kind of just seemed to stop overthinking it, and just started doing what they want, and adjusting as they went along\n↓\n1752961933479997461 [2024-02-01] @AskYatharth 💜 23\ni found\n\n1. if i didn’t address the issues about control, it would haunt me, regardless of which side of the spectrum i landed in\n\n2. if i did address the issues about control, i had a chance to responsively makes choices based on intuition and gut feeling\n↓\n1752964123942654107 [2024-02-01] @AskYatharth 💜 19\nonce the high stakes softened - it turned out it didn’t reeeeeeeallly matter to me that much if i masturbated or not\n\nthere were points in favour of both\n↓\n1752964166539952351 [2024-02-01] @AskYatharth 💜 22\npros to masturbation\n- literal relaxation of nervous system\n- feels awesome\n- ice cream exists, so we eat it. dick exists, so we—\n- can connect you with eros and lead to better sex and relationships\n↓\n1752964288057401800 [2024-02-01] @AskYatharth 💜 21\npros to not-masturbation:\n- also feels great\n- the buildup of eros is exquisite\n- ancient and cool energy practices 👍 \n- can connect you with eros and lead to better sex and relationships\n\n===\n\n1764338820663689375 [2024-03-03] @camino_delsol_ 💜 8 [(SEED) type=semantic_search]\nI must tell myself “I am not a failure.”Just because certain forms of digital communication are hard for me to navigate and leave me needing a deep break of de-stimulation afterwards. It’s ok, I tell myself. It’s ok. You’re still valuable in this world. 🪷\n\n===\n\n1774752831330811986 [2024-04-01] @dpinkshadow 💜 3 🔁 1\nI haven't felt like I'm included in any community until I learned to include myself\n↓\n1774766117472346535 [2024-04-01] @dpinkshadow 💜 2 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/OunG0riNl3\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1778378963716559029 [2024-04-11] @visakanv 💜 129 🔁 7 [(SEED) type=quote_of_root]\nsomeone told me this has been really helping them so here it is again https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1806325825387581654 [2024-06-27] @nobu_hibiki 💜 3\nI have like a very strong adverse reaction towards the feeling of me punishing myself, while at the same time seeing strong... positive outcomes(?) happen when a form of punishment do happen? I can hear the sound of discipline enjoyer coming toward my way but no, stop. https://t.co/1uKiy0WE9r\n  [Quoting @nobu_hibiki: The fact that I felt that the smaller bed is punishment, and that it is nice to feel like I'm being punished, kinda sucked lol. Not sure how to reconcile and work with this particular one. Seems like some super deeply rooted fear that is fundamentally important :/]\n↓\n1806326783794680255 [2024-06-27] @nobu_hibiki 💜 3 [(SEED) type=quote_of_root]\nIn my head and heart it's primarily something like this. \n\nI will never be the one to count myself out. I will never take up arms against myself. I will never be the one to sabotage me.\nhttps://t.co/GAANiZsXYh\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1806327793111970136 [2024-06-27] @nobu_hibiki 💜 1\nStill not sure what the right way to talk about this is. Feels like it's a playing with constraints thing, still something to do with the whole being free thing probably, still something to do with looking for something to focus thing, still something to do with the wife thing.\n↓\n1806328523118051668 [2024-06-27] @nobu_hibiki 💜 1\nI don't really like sandbox games. I like games with a tight gameplay loop and a system that gives me constraints to let me exercise the available resources in interesting and creative ways. Same with life. Life is like a sandbox games. I don't like that there's no gameplay loop.\n\n===\n\n1808253305480794436 [2024-07-02] @goblinodds 💜 21 [(SEED) type=quote_of_root]\ntfw i am the only one to ever do these things to me https://t.co/b8RMFWbE8U\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n\n===\n\n1808391615079502219 [2024-07-03] @visakanv 💜 608 🔁 49\ni promised a kid i that i would die trying https://t.co/GM6mfRXbJn\n  [Quoting Tweet 1808308145225134096 (missing)]\n↓\n1808391772311351352 [2024-07-03] @visakanv 💜 51 [(SEED) type=quote_of_root]\ni will not be the one to count myself out https://t.co/h2zoutSDZR\n  [Quoting @visakanv: Repeat after me, if you feel like it:  Life is hard, and full of rejection and failure.  But.  I will never be the one to count myself out.  I will never take up arms against myself.  I will never be the one to sabotage me.  I’m on my side and I root for me to succeed. https://t.co/Eo1Pk9g3et]\n↓\n1808391894730432878 [2024-07-03] @visakanv 💜 41\n'making it' is irrelevant\n↓\n1808392436458348925 [2024-07-03] @visakanv 💜 20\nhttps://t.co/EmEhGPXSck\n  [Quoting @visakanv: “...in 1901 I said to my brother Orville that man would not fly for fifty years. Two years later we ourselves made flights. This demonstration of my impotence as a prophet gave me such a shock that ever since I have distrusted myself and avoided all predictions.” — Wilbur Wright]\n↓\n1808393353828131232 [2024-07-03] @visakanv 💜 56\nfor the child within us still\nride out to meet them\nmeet your fate head on\neveryone dies\nlet death find you on the battlefield\nnot cowering in your bed\ncourage for our friends\nthis is not a practice life\nthis is it https://t.co/u6wWpB0bAn\nImages:\n  - [Image #0] The image is a black-and-white still from the Lord of the Rings film series, featuring Viggo Mortensen as Aragorn. He is depicted with long hair and a beard, wearing armor and looking directly at the camera with a serious expression, set against a blurred battlefield background.\n↓\n1808394115018555415 [2024-07-03] @visakanv 💜 61 🔁 2\n“I always remember an epitaph which is in the cemetery at Tombstone, Arizona. It says, \"Here lies Jack Williams. He done his damnedest.\" I think that is the greatest epitaph a man can have.”\n― Harry S. Truman\n\n===\n\n1854336135897788896 [2024-11-07] @RhysLindmark 💜 5 [(SEED) type=semantic_search]\nSuccess is going from failure to failure without loss of enthusiasm. ❤️ \n\n11 no's I received earlier this year when trying to pitch my book. 👇 https://t.co/KRH3aj2gpf\n\n===\n\n1936032121694392763 [2025-06-20] @GBarsawme 💜 270 🔁 44 [(SEED) type=semantic_search]\nIf self-sabotage keeps showing up,\nit’s not because you’re weak.\nIt’s because somewhere deep inside,\nyour success still feels unsafe.\nThat’s not failure.\nThat’s a brilliant system asking:\n“Will I still be loved… if I grow?”\nAnswer it gently. Then rise.\n\n===\n"
}