{
  "tweet_id": 1471180144186331136,
  "thread_text": "962087965177581568 [2018-02-09] @maimecat  [(SEED) type=semantic_search]\nRemind me to never park under THAT tree! :-) https://t.co/fwHCcVr5g0\n  [Quoting Tweet 962003923627270146 (missing)]\n\n===\n\n1213498203418636289 [2020-01-04] @Malcolm_Ocean 💜 33 🔁 7\nThe Korzybski Gap (by Romeo Stevens) https://t.co/EuaZlU62AR\nImages:\n  - [Image #0] The image is a screenshot of a Facebook post by Romeo Stevens. The text reads:\n    \n    \"Korzybski points out that much of our problem originates in the fact that natural language seems to cross from negative to positive knowledge without noticing the difference. \"I do not perceive that she has a cup\" and \"I perceive that she does not have a cup\" seem equivalent if we are not being careful.\n    \n    I've noted before that I think quite a few blindspots revolve around people in a field of science running around seeking out positive knowledge until someone comes along and knocks the field on its head by formulating things in terms of the negatives that can actually be measured. Information theory being perhaps the most profound example.\n    \n    I dub this the Korzybski Gap.\"\n    \n    The post is attributed to Romeo Stevens, with a profile picture of a man with a beard and a blue shirt, and is dated 21 hours ago.\n↓\n1471749848693022721 [2021-12-17] @visakanv  [(SEED) type=quote_of_root]\n@Malcolm_Ocean https://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1324978566455468035 [2020-11-07] @visakanv 💜 4802 🔁 1343 💬 110\nfocus your time and energy on what you want to see more of\n↓\n1501421617397657600 [2022-03-09] @nick10bk 💜 12 🔁 2\n@visakanv Cool analogy that fits almost perfectly: I remember reading about a stunt driving class where they taught you to \"look where you want to go\" if you look at the obstacle/hazard, you'll likely hit it. \n\nhttps://t.co/uFoRvv6V55\n↓\n1581232348640980993 [2022-10-15] @visakanv 💜 8 [(SEED) type=quote_of_root]\n@nick10bk fun version of this: https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1467852466704289806 [2021-12-06] @m_ashcroft 💜 91 🔁 6 💬 2\nThis also reminds me of the idea that \"you go where you're looking\"\n\nLike a child learning to ride a bike, \"don't hit the tree\" just turns into \"the tree\" and so of course they cycle straight into the tree \n\nWe need more clear visions of where we *do* want to go https://t.co/eUmU9AbhAM\n  [Quoting @QiaochuYuan: “focus your energy on what you want to see more of” has some distressing implications for the whole genre of dystopian fiction. it suggests that dystopian fiction doesn’t successfully act as a warning, and if anything makes dystopias look cooler, more familiar, more thinkable]\n↓\n1467852779939110916 [2021-12-06] @m_ashcroft 💜 11\nhttps://t.co/VtXznO9Ij2\n↓\n1498546666265198596 [2022-03-01] @Malcolm_Ocean \n@m_ashcroft I thought someone (@visakanv?) made a version of the video embedded on twitter, but some searching is failing me\n↓\n1498546929013198848 [2022-03-01] @visakanv 💜 2 [(SEED) type=quote_of_root]\n@Malcolm_Ocean @m_ashcroft https://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1471179134688661505 [2021-12-15] @visakanv 💜 309 🔁 27\n\"i'm trying to quit smoking\" is like \"i'm trying not to think of an elephant\"\n↓\n1471180144186331136 [2021-12-15] @visakanv 💜 475 🔁 87 💬 27 [(SEED) type=root]\ndad: don't crash into the tree!\n\nson: https://t.co/dsQO64SLRG\n├── 1471180940361691142 [2021-12-15] @eperea 💜 2\n│   @visakanv Perfect explanation of parenthood\n├── 1471182842700906498 [2021-12-15] @xuenay 💜 34 🔁 4\n│   @visakanv Reminds me of @RomeoStevens76 https://t.co/6fe3vJ64D1\n│   Images:\n│     - [Image #0] The image is a screenshot of a tweet from Romeo Stevens, dated January 14, 2020. The tweet discusses a concept from military/police psychology related to scenario completion and its effects on people's behavior in extreme stress situations.\n│       \n│       Here is the text in the image:\n│       \n│       \"Fascinating concept that I came across in military/police psychology dealing with the unique challenges people face in situations of extreme stress/danger: scenario completion. Take the normal pattern completion that people do and put blinders on them so they only perceive one possible outcome and they mechanically go through the motions *even when the outcome is terrible* and there were obvious alternatives. This leads to things like officers shooting *after* a suspect has already surrendered, having overly focused on the possibility of needing to shoot them. It seems similar to target fixation where people under duress will steer a vehicle directly into an obstacle that they are clearly perceiving (looking directly at) and can't seem to tear their gaze away from. Or like a self fulfilling prophecy where the details of the imagined bad scenario are so overwhelming, with so little mental space for anything else that the person behaves in accordance with that mental picture even though it is clearly the mental picture of the *un*desired outcome.\n│       \n│       I often try to share the related concept of stress induced myopia. I think that even people not in life or death situations can get shades of this sort of blindness to alternatives. It is unsurprising when people make sleep a priority and take internet/screen fasts that they suddenly see that the things they were regarding as obviously necessary are optional. In discussion of trauma with people this often seems to be an element of relationships sadly enough. They perceive no alternative and so they resign themselves to slogging it out for a lifetime with a person they are very unexcited about. This is horrific for both people involved.\"\n│   ↓\n│   1474969824518410241 [2021-12-26] @Malcolm_Ocean 💜 8\n│   @xuenay @visakanv @RomeoStevens76 dream mashups recreate themselves as people act into the dream scene using their motor cortex in actual reality\n│   \n│   I call this \"self-fulfilling projection\"\n│   eg a person’s anticipation of being rejected causing them to behave in a way that will predictably get them rejected.\n├── 1471183126449692676 [2021-12-15] @visakanv 💜 444 🔁 51\n│   \"i'm trying to be less stressed\", \"i'm trying to be less unhappy\", \"I want to feel less alone\", etc, all same issue\n│   \n│   you gotta focus on where you want to go, not where you don't want to go\n│   \n│   https://t.co/tFaWtEZM1p\n│     [Quoting @visakanv: focus your time and energy on what you want to see more of]\n│   ↓\n│   1471184620213342209 [2021-12-15] @visakanv 💜 135 🔁 11\n│   I think @m_ashcroft would be pleased to know that one of the differences between newbie racecar drivers and professionals is, the professionals expand their awareness and look very far ahead, iirc looking for the next turn instead of just the turn they're currently navigating https://t.co/ifQsEGwe6F\n│   Images:\n│     - [Image #0] The image is a screenshot of a transcript from a video about racing. The text is in black font on a white background and discusses the importance of vision when racing, specifically how professional drivers use their eyes to navigate the track.\n│       \n│       The text is divided into five paragraphs, with the second paragraph highlighted in blue. The highlighted text reads: \"In my experience as a racing coach, when new drivers come to me or even drivers who've been racing for a couple of years, their vision is often way too close to the car and way too narrow and we work really hard to open up this vision and get them looking much further ahead.\"\n│       \n│       The transcript is attributed to Scott Mansell, who welcomes viewers to the Driver 61 Channel and discusses the differences between new and experienced drivers. He explains that experienced drivers use eye-tracking technology to look further ahead, citing an example from the Abu Dhabi Grand Prix where drivers wore clear visors, allowing their eye movements to be tracked.\n│       \n│       Overall, the image appears to be a screenshot from a video tutorial or instructional content related to racing, likely from the Driver 61 Channel YouTube channel.\n│     - [Image #1] The image shows a screenshot of a text passage discussing a video about Formula One drivers. The text is transcribed as follows:\n│       \n│       \"A while back, Sky Sports did a piece where they put some eye-tracking glasses on Nico Hulkenberg. When you watch the driver's on track, the eye movement is actually very busy and this is because the human eye has a small focal point and said the eye has to move around a lot to take small pieces of information which the brain then maps together to give a good understanding of the position of the car and how quickly you're entering the corner. As you can see from this footage of when Nico looks in his mirror as he's coming out of the pit lane, the eye movement of a Formula One driver is very quick. They can look at the mirror in 0.1 of a second, a tenth of a second. During the night races of Formula One, it's always amazing to see that the drivers wear clear visors and so we can see their eyes, it's incredible to watch the super slo-mo footage of actually where the driver's eyes are looking. So here we have some of that incredible onboard footage from Abu Dhabi where the drivers are wearing clear visors and **it's amazing just to see how much they turn their head and how far across they're actually looking**.\n│       \n│       So let's head into the footage now. You can see here that we've got a close up of Sergio Perez, now, he's got his head tilted just a little bit in this angle here but what's important is you can see that he's looking all the way across down here and he's coming through the second part of the chicane, the right-hander, so he's looking directly across and he'll be looking for that apex as he's coming in and as you can see, he's fixated on that apex, gauging how much speed he can take it into the corner and when he can begin to pick up the throttle again. Look at his vision now, I mean, it's so far across, it's incredible. Most drivers, when they're new to track driving or sim driving, they're definitely not looking across as far as they can.\"\n│     - [Image #2] The image shows a text passage discussing a technique for improving driving skills on a race track. \n│       \n│       The passage is transcribed as follows: \n│       \n│       \"So this is the most important and fundamental technique that you can learn to be quick on the race track in your sim, good vision. So how do we go about learning it? Well, it sounds like a very simple thing to do, you just need to look a little bit higher, a little bit further ahead of yourself. But actually, when you're on the track or in the sim and there are lots of other things going on, we kind of get the red mist and completely forget about adapting our vision to try and look that little bit further ahead of ourselves. So my advice to you and the most efficient way to train yourself to look a little bit further ahead is to actually drive round at 70% or 80% of your maximum speed so you're not using as much mental capacity and then you can consciously say to yourself, okay, I need to be looking at the apex, next, I need to be looking at the exit. You give yourself a little bit more room to be conscious of exactly where you're looking. If you'd like to learn more about vision, please check out the Driver 61's University at www.driver61.com/uni where you'll find many tutorials on driving technique.\"\n│       \n│       The highlighted text in blue reads: \"Well, it sounds like a very simple thing to do, you just need to look a little bit higher, a little bit further ahead of yourself.\"\n│   ├── 1471185922997710848 [2021-12-15] @visakanv 💜 126 🔁 5\n│   │   also intuitive to anybody who's ever tried to ride a bicycle while looking at their feet instead of the horizon\n│   │   \n│   │   victor wooten similarly coaches bass players by getting them to focus their attention on the drummer they're playing with. *instantly* improves *everything*\n│   │   ├── 1498611458682208258 [2022-03-01] @actualhog \n│   │   │   @visakanv You could write a book based on this metaphor I mean I'm sure someone has but YOU could\n│   │   └── 1557547693093752832 [2022-08-11] @visakanv 💜 82 🔁 2\n│   │       steer towards where you want to go\n│   │         [Quoting Tweet 1555654118596718592 (missing)]\n│   │       ↓\n│   │       1644946326738845697 [2023-04-09] @visakanv 💜 128 🔁 7\n│   │       “what specific sites should I avoid most?” https://t.co/EzhUJZKj9a\n│   │       Images:\n│   │         - [Image #0] The image shows a screenshot of a conversation between a user and an AI model on a topic related to piracy websites. The conversation is divided into two sections, each with a different question and response.\n│   │           \n│   │           *   The first section:\n│   │               *   The user asks, \"what are some popular piracy websites?\"\n│   │               *   The AI model responds by stating that it does not condone or promote piracy and provides a message about respecting intellectual property rights.\n│   │           *   The second section:\n│   │               *   The user asks, \"if i want to avoid piracy websites, which specific sites should i avoid most?\"\n│   │               *   The AI model lists 10 commonly known piracy websites, noting that the list is not exhaustive and advising the user to use legal means of accessing content.\n│   │           \n│   │           The image presents a conversation about piracy websites, with the AI model providing information on popular piracy sites while emphasizing the importance of respecting intellectual property rights.\n│   │       ├── 1645007833367298048 [2023-04-09] @IaimforGOAT \n│   │       │   @visakanv Wait! This is interesting... It shared 0 private trackers! =o\n│   │       └── 1653648959393656834 [2023-05-03] @visakanv 💜 42 🔁 1\n│   │           idk if OP knew what she was doing when she did it, but it's illustrative regardless\n│   │           https://t.co/XRanE2J3WR\n│   │             [Quoting @poetryalpastor: Babe wake up new erasure poetry prompt just dropped https://t.co/wZyeX6SGt7]\n│   │           ↓\n│   │           1714411254562095142 [2023-10-17] @visakanv 💜 14 [(SEED) type=quote_of_semantic_search]\n│   │           https://t.co/qjHhAS3nfQ\n│   │             [Quoting @visakanv: a funny in-the-wild example of “don’t crash into the tree” being manifested by spam bots https://t.co/nRChCYtb01]\n│   │           ↓\n│   │           1740964947625168952 [2023-12-30] @visakanv 💜 26 🔁 1 [(SEED) type=semantic_search]\n│   │           don't crash into the tree \n│   │           https://t.co/xJv8rMk8VH\n│   │             [Quoting @alecrobbins: stop generating AI images. stop sharing them. i don’t understand why any of you are doing this. i don’t understand. don’t you not want to live in a world like that]\n│   │           ↓\n│   │           1750806152785645597 [2024-01-26] @visakanv 💜 42\n│   │           https://t.co/V20WSQ6e7x\n│   │           Images:\n│   │             - [Image #0] The image shows a tweet from \"rob\" (@rob_mcroberson) discussing the difficulty of getting GPT to draw a grandfather without a beard, accompanied by four images of older men with beards. A response from \"Dr. Dad, PhD\" (@GarrettPetersen) suggests avoiding negations in prompts, citing an example with DALL-E where the prompt \"Draw a clean-shaven grandpa\" produces images of older men without beards.\n│   │           ├── 1750813654172541221 [2024-01-26] @QiaochuYuan 💜 2\n│   │           │   @visakanv this is from freud:\n│   │           │   \n│   │           │   https://t.co/TvNv5P9g3V\n│   │           │     [Quoting @QiaochuYuan: @qorprate hey this is fantastic wow. \"in analysis we never discover a ‘no’ in the unconscious.\" so true bestie https://t.co/8WjQJRYQdi]\n│   │           └── 1847642858024738933 [2024-10-19] @visakanv 💜 45 🔁 3\n│   │               12. the ad may have made people realize that\n│   │               \n│   │               - it's possible \n│   │               - lots of people are doing it\n│   │               \n│   │               https://t.co/u3bAfOYaL0 https://t.co/Xs5QSzi5LY\n│   │               Images:\n│   │                 - [Image #0] The image is a headline that reads: \"You Wouldn't Steal A Movie\" Advert May Have Led To More People Stealing Movies. The text is in black font on a white background.\n│   │                   \n│   │                   * The main title is in large, bold font and reads: \n│   │                     \"You Wouldn't Steal A Movie\" Advert May Have Led To More People Stealing Movies\n│   │                   * Below the title, in smaller font, it says: \n│   │                     Turns out you would steal a movie.\n│   │                   \n│   │                   To recreate this image, you would need to:\n│   │                   - Use a white background\n│   │                   - Write the main title in large, bold, black font\n│   │                   - Write the subtitle in smaller, black font below the title\n│   ├── 1471471278481621000 [2021-12-16] @m_ashcroft 💜 3\n│   │   @visakanv I am, very!\n│   ├── 1471473566336139272 [2021-12-16] @blisstweeting 💜 1\n│   │   @visakanv @m_ashcroft Same for cybersport games eg LoL. Tested it several times, with and without expanded awareness, personal scores differ tremendously\n│   │   ↓\n│   │   1471473914027073541 [2021-12-16] @m_ashcroft 💜 2\n│   │   @blisstweeting @visakanv honestly i would love to teach this stuff to gamers\n│   │   ↓\n│   │   1471474488080584709 [2021-12-16] @blisstweeting 💜 2\n│   │   @m_ashcroft @visakanv I'd be happy to learn from you! (I probably have said it earlier: I'd love to learn from you in person, especially. Hopefully I can get to the UK late next year.)\n│   │   ↓\n│   │   1471476216846860292 [2021-12-16] @m_ashcroft 💜 2\n│   │   @blisstweeting @visakanv ah I am leaving the UK in February for a year of nomad travel - but I would HIGHLY encourage you to get 1:1 lessons with my teacher if you come to London\n│   │   \n│   │   otherwise, I'm curious, what's your current experience with gaming and expanded awareness?\n│   │   ↓\n│   │   1471477443928145927 [2021-12-16] @blisstweeting 💜 1\n│   │   @m_ashcroft @visakanv wow if I make it there I totally will\n│   │   \n│   │   actually, it's almost non-existent for that overlap (bar these several recent experiments with League of Legends)\n│   │   \n│   │   I've had some experience with expanded awareness in general though, which roots from my interest in occult in my early youth\n│   │   ├── 1471477925904060425 [2021-12-16] @m_ashcroft 💜 1\n│   │   │   @blisstweeting @visakanv haha I'm intrigued about the occult / expanded awareness intersection there\n│   │   │   \n│   │   │   I know nothing of League of Legends, but would definitely encourage you to experiment more! I'd love to hear about it\n│   │   │   ↓\n│   │   │   1471479223168679941 [2021-12-16] @blisstweeting 💜 1\n│   │   │   @m_ashcroft @visakanv haha it's a bit awkward story from my past 😅 though if you want to ask any questions I'm open for a chat or a call pretty much any time. I tried to reflect on it here but a proper format would be too many words. I mean, it's clumsy https://t.co/W4rd2z2StG\n│   │   │   ↓\n│   │   │   1471490678743990273 [2021-12-16] @m_ashcroft 💜 1\n│   │   │   @blisstweeting @visakanv haha love it, i had a similar phase\n│   │   └── 1471478130636382208 [2021-12-16] @blisstweeting 💜 2\n│   │       @m_ashcroft @visakanv I will soon reiterate some of the points in this framework I'm working on (it's focused on developing a variety of mental skills and faculties without addition of magick or any woo) https://t.co/PUkP4ri2Mg\n│   │         [Quoting @blisstweeting: Architect of Thought 🧵  I believe we can expand the frontiers of our minds. We can become more computationally efficient and better learners. I'm starting a community of people who dare to challenge their minds. You are welcome! https://t.co/rpt0hjKEf4]\n│   │       ↓\n│   │       1471478292024860673 [2021-12-16] @m_ashcroft 💜 1\n│   │       @blisstweeting @visakanv oofff this looks great\n│   │       ↓\n│   │       1471479402504593411 [2021-12-16] @blisstweeting 💜 1\n│   │       @m_ashcroft @visakanv *blushing* thank you very much!\n│   └── 1511127244500082690 [2022-04-04] @m_ashcroft 💜 3\n│       @visakanv reminding myself to write about this\n├── 1471202887816687624 [2021-12-15] @caitstuff \n│   @visakanv This is how we learn\n├── 1500428026525339652 [2022-03-06] @visakanv 💜 147 🔁 43\n│   lady: don’t kiss a girl and like it!\n│   \n│   girls: https://t.co/uvxuoSialM\n│   ├── 1644423627037868032 [2023-04-07] @visakanv 💜 17\n│   │   see replies\n│   │     [Quoting Tweet 1643731152761667585 (missing)]\n│   └── 1644619712653930496 [2023-04-08] @inkolore_ 💜 1\n│       @visakanv Well maybe the girls really didn't like it, how would the lady know ?\n├── 1517580530971291648 [2022-04-22] @meaningfulideas 💜 2\n│   @visakanv I feel like this kid all the time!\n├── 1519609174757634048 [2022-04-28] @pref_fractal 💜 1\n│   @visakanv haha is that a kiwi accent i hear\n│   \n│   classic\n├── 1519694661488676865 [2022-04-28] @juliangough \n│   @visakanv Ah, the poor kid... I remember reading in Anthony Fokker's memoir, Flying Dutchman, that some pilots had an almost magnetic attraction to trees. Got hypnotised. It was quite common for pilots, in flying's early days, when landing, to hit the only tree in the middle of the field.\n├── 1526604318547226625 [2022-05-17] @claudeglass 💜 3\n│   @visakanv for ur consideration:\n├── 1534367603560415232 [2022-06-08] @Charitra_Heen \n│   @visakanv @rorysutherland\n├── 1546861511439777795 [2022-07-12] @drojasug 💜 2\n│   @visakanv @m_ashcroft this is the most confusing part about inhibition in AT for me\n│   ↓\n│   1546862038567493632 [2022-07-12] @m_ashcroft 💜 5\n│   @drojasug @visakanv inhibition can be thought of as un-fixation from a single, stuck path, thus allowing for a new choice to be made \n│   \n│   in this analogy, the boy could inhibit ‘tree’ and choose to go somewhere else\n│   ↓\n│   1546862445612122112 [2022-07-12] @m_ashcroft 💜 3\n│   @drojasug @visakanv this boy’s awareness is collapsed not just onto the physical tree, but on its mental representation as well\n│   \n│   he is powerless to avoid it until he un-fixates \n│   \n│   he can’t place his attention anywhere else until his awareness includes other things \n│   \n│   all of that is inhibition\n│   ↓\n│   1665320785987207169 [2023-06-04] @RobertHaisfield 💜 2\n│   @m_ashcroft @drojasug @visakanv This is a great explanation, worthy of elaborating in a blog imo\n│   ↓\n│   1665428554136289280 [2023-06-04] @m_ashcroft 💜 1\n│   @RobertHaisfield @drojasug @visakanv thanks for pointing this out\n│   \n│   I have a bit of a technical version of it here, but it would benefit from making more accessible\n│   \n│   https://t.co/XrEFIoddjv\n├── 1633913668688814089 [2023-03-09] @bonkydog \n│   @visakanv https://t.co/3ZbJXwL1au\n│     [Quoting @bonkydog: EVERYBODY I KNOW YOU CAN BELIEVE IN YOURSELF IF YOU BELIEVE IN YOURSELF YOU WILL KNOW HOW TO RIDE A BIKE YOU JUST KEEP PRACTICING YOU GO GET THE HANG OF IT I KNOW IT  THUMBS UP EVERYBODY  FOR ROCK AND ROLL  https://t.co/aUIhaq1wyc]\n├── 1664036213244960769 [2023-05-31] @visakanv 💜 18\n│   teacher: don’t be ashamed of your thoughts!\n│   \n│   student:\n│     [Quoting @carinmariederry: @Jandrade0112 @sashachapin I actually had zero shame about my thoughts, and it didn’t occur to me that anyone would feel shame about having thoughts, until the teacher said “don’t be ashamed.” It was a super weird experience and I didn’t like it at all.]\n├── 1750939329051173041 [2024-01-26] @limegpt \n│   @visakanv bro is gonna grow up to be a ******\n├── 1881808484167205301 [2025-01-21] @x_esk_x \n│   @visakanv It’s called survival of the fittest for a reason. From boy fit, to mind and coordination or reaction time\n└── 1953913558741528895 [2025-08-08] @ciphergoth 💜 1\n    @visakanv while riding his bicycle, came to a sudden arboreal stop\n\n===\n\n1474540390170591235 [2021-12-25] @QiaochuYuan 💜 63 🔁 2\nthere is a real, genuine sense in which depiction is endorsement, actually. every war movie is pro-war propaganda\n\nrecite the ancient counterspell: \"focus your time and energy on what you want to see more of\" https://t.co/QUbL9CgLRD\n  [Quoting Tweet 1473847435311161350 (missing)]\n↓\n1474541634347945985 [2021-12-25] @QiaochuYuan 💜 30 🔁 1\nyou literally cannot warn people not to do something by depicting it. it doesn't work. you have to depict what you wish they were doing instead\n\nhttps://t.co/89HvlyYRN9\n  [Quoting @QiaochuYuan: “focus your energy on what you want to see more of” has some distressing implications for the whole genre of dystopian fiction. it suggests that dystopian fiction doesn’t successfully act as a warning, and if anything makes dystopias look cooler, more familiar, more thinkable]\n↓\n1474542007842263043 [2021-12-25] @QiaochuYuan 💜 10\nevery depiction is first and foremost an opportunity for imitation\n\nthus is it said: \"be the change you want to see in the world\"\n\nhttps://t.co/WV3gWsQAyV\n  [Quoting @QiaochuYuan: he gives a bunch of verbal instructions to his tennis students and it just tenses them up as they *try really hard* to follow all of them, vs. he demonstrates to them the desired behavior and asks them to imagine and then imitate it and it works perfectly https://t.co/iK140rVjHv]\n↓\n1474542437267738625 [2021-12-25] @QiaochuYuan 💜 15\nif you focus your attention on avoiding the tree you will hit the tree. focus your attention on the road\n\nhttps://t.co/gghyzAux59\n  [Quoting @Malcolm_Ocean: @takecarecactus I've heard stories (possibly apocryphal) of people on long deserted roads hitting a single tree or post next to the road, because \"don't hit the tree, don't hit the tree\" fixates their attention on the tree and so they steer towards it.  Contrast with \"stay on the road\".]\n↓\n1474559698305171462 [2021-12-25] @Malcolm_Ocean 💜 5\n@QiaochuYuan tweet &amp; video of a kid doing the thing:\nhttps://t.co/XFgPx4Yany\n  [Quoting @m_ashcroft: This also reminds me of the idea that \"you go where you're looking\"  Like a child learning to ride a bike, \"don't hit the tree\" just turns into \"the tree\" and so of course they cycle straight into the tree   We need more clear visions of where we *do* want to go https://t.co/eUmU9AbhAM]\n↓\n1474561412450058247 [2021-12-25] @visakanv 💜 6 [(SEED) type=quote_of_root]\n@Malcolm_Ocean @QiaochuYuan Exported to tweet to save ppl a click: https://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1474973656501661699 [2021-12-26] @Malcolm_Ocean 💜 2\n@visakanv @QiaochuYuan more people need to have this skill/affordance\nwe should have a bounty or something, $5 per good tweet-native video clip. just to get people going on it. or a video extract-a-thon? hmm 🤔\n\nthe clip in this tweet has 7.5k views—what a favor I did the world!\nhttps://t.co/q5hh4LI7Hk\n  [Quoting @Malcolm_Ocean: @visakanv Herbie Hancock describing a similar realization he had early on playing with Miles Davis, and \"right in the middle of Miles Davis' solo, I played the wrong chord. Sounded like a big mistake! ...and Miles paused for a second... then he played some notes that made my chord right.\" https://t.co/NsDiTfdH5g]\n\n===\n\n1481325439109013506 [2022-01-12] @m_ashcroft 💜 398 🔁 11 💬 1\nI have a horrible feeling that learning a whole bunch of stuff about Personal Knowledge Management and getting nerdy about tools and workflows has made me rather less effective at managing my personal knowledge\n↓\n1481325509657174017 [2022-01-12] @m_ashcroft 💜 54\nand if not less effective then certainly more anxious\n↓\n1481325750510829575 [2022-01-12] @m_ashcroft 💜 54\nmaybe I just need to embrace @visakanv junkyard approach, I might just be a junkyard person\n\nhttps://t.co/TyH0BUTFcJ\n  [Quoting @m_ashcroft: The stuff I have written/made that people have liked the most is stuff that came from my own life experience, not from anything that I remixed from content in my 'second brain'.  Make of that what you will.]\n↓\n1481326458916286466 [2022-01-12] @m_ashcroft 💜 116 🔁 1 💬 1\nlike, now there's always this meta cognition when I'm reading \n\n\"oh you should be taking notes\"\n\nyeah but I don't want to take notes\n\n\"okay better not read then or I'll waste my time\"\n↓\n1481326671676559367 [2022-01-12] @m_ashcroft 💜 60 🔁 1\nor there's another one which sounds like \n\n\"should this be in Roam or Obsidian... for that matter I should just commit to one over the other shouldn't I... but what about using both at once... oh god I should figure out ONCE AND FOR ALL what my system is... later\"\n↓\n1481327025117962243 [2022-01-12] @m_ashcroft 💜 60 🔁 1\nmaybe the only people who really need \"note taking systems\" are pro academics and for everyone else it's an info hazard\n↓\n1481332730671804417 [2022-01-12] @visakanv 💜 14 [(SEED) type=quote_of_root]\n@m_ashcroft I'd say that almost everyone benefits from taking notes, but the point is to always focus your attention on the thing that you're trying to do, not the thing that's helping you do it. look at what you're drawing, not the pencil you're holding. otherwise- https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1481333230590734337 [2022-01-12] @m_ashcroft 💜 10\n@visakanv yeah I agree that taking notes is good\n\n“worrying about your note taking system to the extent that you don’t take notes” is not good\n\nthe info hazard part is that I suspect most people get easily trapped in the latter\n↓\n1481334127081451520 [2022-01-12] @visakanv 💜 5\n@m_ashcroft yea don't try to take better notes\n\njust try to do whatever it is you love\n\nand the notes will get better in the process, since they have a job, which is to help you do what you love\n\n===\n\n1511176037228376067 [2022-04-05] @Malcolm_Ocean 💜 11\nI just found out Jason Mraz's song I Won't Give Up, a favorite of mine for a decade, was almost certainly written about Tristan Prettyman, who he suddenly broke up with while they were engaged.\n\nSounds surprising, but we might ask... why did he need to write that song? https://t.co/sFM0kEmj8u\n  [Quoting @QiaochuYuan: every statement a person makes about themselves, their lives, the nature of reality etc. has a shadow statement. in order to find it worthwhile to say a thing you must simultaneously be aware of the possibility of it being false, or else it wouldn't even occur to you to say]\n↓\n1511176039065546754 [2022-04-05] @Malcolm_Ocean 💜 5\nOne writes a song called I Won't Give Up when one is faced with the seriously possibility of, well, *giving up*. \n\nNow, all relationships have their challenging moments, but some have a lot more precariousness than others.\n↓\n1511176040512585736 [2022-04-05] @Malcolm_Ocean 💜 4\nI'm about to talk about other people's relationships, and I want to note that even though these people have wikipedia pages, I feel in some sense I'm relating to them as fellow singer-songwriters, writers about love &amp; relationship, &amp; journeyers of the human spirit. Not celebs.\n↓\n1511176044589461505 [2022-04-05] @Malcolm_Ocean 💜 5\nTurns out Tristan's album Cedar+Gold is almost entirely about the breakup with Mraz. Glass Jar in particular reflects on their engagement.\n\nI think they were both in denial about the fragility of their relationship. The wind doesn't just shift. Something must have felt off. https://t.co/xEP7iPZHCE\nImages:\n  - [Image #0] The image displays song lyrics on a white background. The text is transcribed as follows:\n    \n    \"I'm staring at this ring\n    an infinite circle\n    For nothing could break the foundation we built on\n    And just like that the wind shifts its way\n    How could something so sacred ever come to be replaced\"\n↓\n1511176047756132353 [2022-04-05] @Malcolm_Ocean 💜 4\nBut this excerpt (from the same song!) aptly calls Mraz out—his whole 2012 album doesn't acknowledge the breakup of mid-2011 whatsoever. https://t.co/uqNEqHQP7V\nImages:\n  - [Image #0] The image shows a passage of song lyrics. The text is transcribed as:\n    \n    \"And now everything's as if nothing ever happened\n    The version of your story isn't really matching up\n    You gave up on us\n    You got the whole world watching and everyone's attention.\n    Turn your head and you never even mention us\n    You gave up on love\"\n    \n    The lyrics are written in black text on a white background.\n↓\n1511176049459019776 [2022-04-05] @Malcolm_Ocean 💜 7\nThat album (Love Is A Four-Letter Word) is one of my all-time favorites, and has a lot of beautiful stuff on it.\n\nit's got I Won't Give Up\nbut no Listen To Yourself If Something Feels Off\nor If It's Almost A Fit It's Not A Fit\nor The Courage to Leave\nhttps://t.co/so55y2ROeY\n  [Quoting @Malcolm_Ocean: if something feels off, slow the fuck down if people tell you not to slow the fuck down, tell them to shut the fuck up if they won't shut the fuck up, get the fuck out]\n↓\n1511176051916898311 [2022-04-05] @Malcolm_Ocean 💜 7 [(SEED) type=quote_of_root]\nbtw, the brain famously doesn't really understand negation\n\ntrying to avoid something often results in steering straight into it\n\n\"(i won't) GIVE UP\" 😂\nhttps://t.co/WlYru1o9LO\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1511176054131466240 [2022-04-05] @Malcolm_Ocean 💜 9\nNow, even if you had a song called \"We're Gonna Make It\" or \"I'm So Committed To You\" (ie not making the \"don't hit the tree\" error)\n\nit would still have that shadow statement quality—why does it feel so important to say?\nhttps://t.co/oCqDCyMBrG\n  [Quoting @Malcolm_Ocean: As with choice, my general sense with \"commitment\" is that if you're tempted to commit to something or say \"I'm committed to X\" then what this actually means if you're reifying an identification with one part of you, in opposition to some other part of you that you don't trust.]\n↓\n1511176055989493765 [2022-04-05] @Malcolm_Ocean 💜 5\nI have heard but not verified that Mraz didn't intend to release I Won't Give Up, but did so after this video of a live performance of it went viral (this performance would have been after the breakup)\n\nhttps://t.co/Oexg4ikknq\n↓\n1511176059126894598 [2022-04-05] @Malcolm_Ocean 💜 4\nMraz, interviewed when the album came out, said this about it, which... sure. One way to tell the narrative.\n\n&gt; regardless of what happens in this relationship, I don’t have to give up on loving this person, or loving myself https://t.co/NUlITQUvHR\nImages:\n  - [Image #0] The image contains a quote from Jason Mraz about his song \"I Won't Give Up.\" The quote is presented in black text on a white background, with a highlighted section. \n    \n    Here is the full text of the quote: \n    \"'I Won't Give Up' was written selfishly. As many of my songs are, I write for the purpose of understanding what's going on in my life, my position in the world, processing that lesson and that miracle that I'm learning. Seeing it on the page, proving to myself that I understand the lesson, that I'm applying it to my life, and that I can move on. Ultimately it was about, you know, regardless of what happens in this relationship, I don't have to give up on loving this person, or loving myself, or give up on whatever my dreams are. Even though it's written through the filter of relationships, it's not necessarily specific for relationships. For me, the true meaning exists in the bridge saying 'I don't want to be someone who walks away so easily, I'm here to stay and make a difference.' That is for all of us. We all have something that we're fighting for or that we're striving for. Whether we want to coach our soccer team to victory or lose five pounds in a month, whatever it is, there's nothing too small worth fighting for and there's nothing too big worth going after.\"\n↓\n1511176062729818114 [2022-04-05] @Malcolm_Ocean 💜 5\nAlthough I guess indeed in the bridge he does say \"and in the end, you're still my friend\", which does imply... something? About a breakup? Maybe? 🧐\n\nBut idk, the message of the song still feels like one of staying together, not of recognizing the need to move on. https://t.co/8v2V24fxIe\nImages:\n  - [Image #0] The image displays a screenshot of song lyrics. The text is transcribed as follows:\n    \n    \"[Bridge]\n    I don't wanna be someone who walks away so easily\n    I'm here to stay and make the difference that I can make\n    Our differences, they do a lot to teach us how to use the tools and gifts\n    We got yeah, we got a lot at stake\n    And in the end, you're still my friend, at least we did intend\n    For us to work, we didn't break, we didn't burn\n    We had to learn, how to bend without the world caving in\n    I had to learn what I got, and what I'm not\n    And who I am\"\n    \n    The tweet accompanying the image reads: \"Although I guess indeed in the bridge he does say 'and in the end, you're still my friend', which does imply... something? About a breakup? Maybe? \n    But idk, the message of the song still feels like one of staying together, not of recognizing the need to move on. https://t.co/8v2V24fxIe\".\n↓\n1511176066253012996 [2022-04-05] @Malcolm_Ocean 💜 4\nAnyway, over the next few years Tristan got married, had a kid, then a divorce, &amp; wrote a fascinating blog post about that:\nhttps://t.co/rPOxvs7x0s https://t.co/aNpP39ofx3\nImages:\n  - [Image #0] The image contains a message about a past relationship. The text reads: \n    \n    \"That said...we will always be a family, our vows remain true now and forever. We are moving forward as best friends, co-parents, and with our hearts full of love. This relationship has allowed us both so much space to explore, learn, and grow, but most of all expand our capacity to love. I am a better human, and mother because of the last 5 years with Bill, and for that, i will always be grateful.\"\n↓\n1511176068224335875 [2022-04-05] @Malcolm_Ocean 💜 7\nShe concludes:\n&gt; maybe somewhere, someone will read this and feel a little less alone, a little less scared, or a bit more brave to speak up for what their heart is telling them.\n\nIt's easier to talk about what's working than what's not working. I'm working on this myself.\n↓\n1534637492078424064 [2022-06-08] @Malcolm_Ocean 💜 3\nUpdate: it wasn't public at the time I wrote this thread, but I was in fact grappling with my own marital separation.\n\nAnd in the spirit of sharing-what's-not-working, I went and wrote The Courage To Leave myself!\n\nhttps://t.co/Ebzy2AZZrh\n\n===\n\n1517386406653349888 [2022-04-22] @visakanv 💜 139 🔁 3 💬 1\nfinally figured out a good answer to “what’s an infohazard” and I can make it abstract enough that it doesn’t hurt– it’s 10-100x worse if you’re precise abt it: advanced bad is able to convincingly disguise itself as good, and you can’t tell the diff, and nothing u can do abt it\n↓\n1517386641442177025 [2022-04-22] @visakanv 💜 50\n“I don’t get it” that’s perfect, do not think about it a second more keep living your best life\n↓\n1517388496247296000 [2022-04-22] @visakanv 💜 60 🔁 5 [(SEED) type=quote_of_root]\nall you can do is focus on what you want and do your best. if you focus on what you don’t want, you somehow end up finding it, even if you swear to yourself you were trying not to find it. it can be a cruel joke. here’s the cutest version of this https://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n├── 1517415537755639808 [2022-04-22] @AskYatharth 💜 4\n│   @visakanv this is the best safe example of infohazard i know\n│   ↓\n│   1517459381603868672 [2022-04-22] @visakanv 💜 1\n│   @AskYatharth that’s what I was going for! harm reduction by presenting a truthful/honest case that’s well-calibrated enough you could put it in children’s media\n│   ↓\n│   1517561992914956290 [2022-04-22] @AskYatharth 💜 2\n│   @visakanv this is one of the less safe ones\n│   \n│   (not lim’s thread, but the lure of the unfinishable and takes you over w/o directing you to being nourished) \n│   \n│   https://t.co/HklWnYcRln\n│     [Quoting Tweet 1510647474364497925 (missing)]\n└── 1517459100895825926 [2022-04-22] @visakanv 💜 12\n    just realized the first tweet has confusing grammar \n    \n    I mean that “advanced bad…” is my answer to “what is an example of an infohazard”.  that is a legitimate answer that’s moderately diluted to avoid harming people who aren’t prepared for it\n    ↓\n    1517461563917017088 [2022-04-22] @visakanv 💜 27 🔁 1\n    the maximally hazardous version of this, if presented in the right context and setting etc, is psychologically destabilising \n    \n    (the wild thing is that the core thing is also straightforwardly true!! I think this is related to why philosophers are often nihilistic) https://t.co/dZkkAfianY\n    Images:\n      - [Image #0] The image is a meme featuring Donald Duck and his nephew Huey, with a philosophical and somewhat nihilistic message. \n        \n        The text in the image reads: \n        \"Everything that we know and love is reducible to the absurd acts of chemicals, and there is therefore no intrinsic value in this material universe. \n        Hypocrite that you are, for you trust the chemicals in your brain to tell you they are chemicals. \n        All knowledge is ultimately based on that which we cannot prove. Will you fight? Or will you perish like a dog?\"\n        \n        To recreate this meme, one would need to:\n        * Use a cartoon image of Donald Duck and Huey\n        * Position Donald Duck on the left side of the image, with a speech bubble containing the text\n        * Have Huey on the right side, looking up at Donald with a concerned expression\n        * Ensure the background is a bright yellow color\n        * Use a clear, readable font for the text in the speech bubble\n    ↓\n    1517462072593817600 [2022-04-22] @visakanv 💜 15\n    I’m talking in circles on purpose so I don’t do a direct hit on anyone \n    \n    point is, if you’re gonna go into the labyrinth, be prepared to go all the way\n    \n    but you never really know if you’re prepared if you’ve never done it before\n    \n    so it’s a leap of faith\n    \n    life is bonkers like this https://t.co/iCMTOwEZKF\n    Images:\n      - [Image #0] The image is a dimly lit, blurry photo of a person in a striped shirt walking down a staircase. The person is walking away from the camera, down a narrow staircase with wooden walls and steps, suggesting an ominous or eerie atmosphere.\n    ↓\n    1517463520102678529 [2022-04-22] @visakanv 💜 29 🔁 1\n    and this is also why good mentor figures are slightly crazy themselves, they’re preparing you to deal with reality which is absurd and senseless, ayy lmao https://t.co/GYqNnmatXL\n    Images:\n      - [Image #0] The image is a screenshot from Disney's \"The Lion King\" featuring a scene where a mandrill is seen hanging upside down from a stick, with Simba looking on. The caption at the bottom of the image reads, \"It means you're a baboon!...\"\n    ↓\n    1517465176471076864 [2022-04-22] @visakanv 💜 46 🔁 1\n    humor is the antidote to despair, that’s the infoblessing \n     https://t.co/cLpQFclk3N\n      [Quoting @visakanv: this is the heart of philosophy, all else is commentary 🧐 https://t.co/7uu4B9YhpH]\n\n===\n\n1519569831384608770 [2022-04-28] @visakanv 💜 58 🔁 2 [(SEED) type=quote_of_root]\ndon’t enjoy your life\n\ndon’t forgive yourself for your mistakes \n\ndon’t learn and do better\n\ndon’t be gentle and kind to yourself and others\n\ndon’t feel a cosmic sense of bliss and oneness with all things\n\ndo not be a joyful radiant sunbeam\n\nabsolutely do not do these things https://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1519570605946810368 [2022-04-28] @visakanv 💜 19\nstop it! stop being wonderful human beings!!! stop being so kind and lovely!!!! STOP IT! no more joy and peace!!! we have enough!! https://t.co/SJ9lmUDWPM\nImages:\n  - [Image #0] The image shows a man making a serious face in front of a stop sign. The man is bald, has a short beard, and is wearing glasses and a white shirt, positioned in the bottom-left corner of the image.\n↓\n1519575702521081856 [2022-04-28] @sharanvkaur 💜 5\n@visakanv i like this one more https://t.co/zid1Tz3qi8\n  [Quoting @visakanv: Me, with love, looking at u being back on ur bullshit again https://t.co/7DyppSkxVZ]\n↓\n1519575881731088385 [2022-04-28] @visakanv 💜 3\n@sharanvkaur oh dear https://t.co/A4ic9nUfCu\n  [Quoting @visakanv: wife: i think this is one of your best tweets, it's super under-appreciated  me: aw thanks bb!!  wife: every time I see it I feel inspired...  me: 😍!  wife: ...to get back on my bullshit  https://t.co/0516JQaORM]\n\n===\n\n1520452137439928320 [2022-04-30] @Malcolm_Ocean 💜 9 [(SEED) type=semantic_search]\nin which DALL-E crashes into the tree https://t.co/OuUNMs20f6\n  [Quoting Tweet 1520438789201661956 (missing)]\n\n===\n\n1533169628347777029 [2022-06-04] @the_wilderless 💜 29\nFear is good sometimes\n↓\n1533169756752183301 [2022-06-04] @the_wilderless 💜 14\nVulnerability is often misguided and bad\n↓\n1533169889602686976 [2022-06-04] @the_wilderless 💜 12\nSome things about you could, in a relative sense, benefit from fixing\n↓\n1533170088966246402 [2022-06-04] @the_wilderless 💜 12\nHappiness for happiness’ sake tends to be misguided\n↓\n1533170350921502721 [2022-06-04] @the_wilderless 💜 16 🔁 1\nIntegration and transformation of personal experience can easily be a crutch to distract you from things needing attention in your material life\n↓\n1533170766308691973 [2022-06-04] @the_wilderless 💜 16 [(SEED) type=quote_of_root]\nMost meditation instruction has a “don’t hit the tree”-type relationship to thought and monkey-mind https://t.co/7xG6LuJz9O\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n├── 1533170881849180160 [2022-06-04] @the_wilderless 💜 12\n│   Violence towards other beings is inevitable and sometimes good\n│   ↓\n│   1533171265044889601 [2022-06-04] @the_wilderless 💜 15 🔁 1\n│   100% nonconfrontational only-love-and-care towards your internal parts is largely unnecessary, sometimes stunting, and is better replaced by Respect for all parts of yourself\n│   ↓\n│   1533171476601483264 [2022-06-04] @the_wilderless 💜 8\n│   What else what else. \n│   \n│   I’m going to bed in a bit, what else 100% ensures I’ll wake up to 20-tweet replies explaining in deep detail why I am wrong and immoral?\n│   ├── 1533171810564448257 [2022-06-04] @the_wilderless 💜 9\n│   │   More talk is not the go-to solution for almost anything\n│   │   ↓\n│   │   1533173109297127425 [2022-06-04] @the_wilderless 💜 11\n│   │   Developing increasingly convincing arguments in favor of an idea is not the same as that idea being correct. \n│   │   \n│   │   There may be an inverse in there somewhere—the more time and energy you spend building a convincing argument, the less likely your point is to be right.\n│   │   ├── 1533173188808658946 [2022-06-04] @the_wilderless 💜 6\n│   │   │   Don’t hold me to that last one, but there’s something there\n│   │   │   ↓\n│   │   │   1533173700190736384 [2022-06-04] @the_wilderless 💜 16 💬 1\n│   │   │   Your core beliefs are true. \n│   │   │   \n│   │   │   Their opposites are also true. \n│   │   │   \n│   │   │   This is not a cute verbal Switcheroo, it’s a gut wrenching horror show that will break you and rebuild you. If you don’t see that, keep looking.\n│   │   │   ↓\n│   │   │   1533173918500114435 [2022-06-04] @the_wilderless 💜 15\n│   │   │   Pineapple on pizza is really good. Throw on some spicy sausage, 2 or 3 different kinds of cheese, maybe some bacon bits, that’s a top 10 pizza.\n│   │   │   ├── 1533176679278993409 [2022-06-04] @the_wilderless 💜 14\n│   │   │   │   “Gender is performative” was a self-fulfilling magic spell that made gender 50,000x more performative, and tbh I’m exhausted w all the performance\n│   │   │   │   ↓\n│   │   │   │   1533192593630167041 [2022-06-04] @profoundish 💜 1\n│   │   │   │   @the_wilderless https://t.co/dOO4R84SKF\n│   │   │   │     [Quoting @the_wilderless: 💍🪤]\n│   │   │   └── 1533180948295974913 [2022-06-04] @QiaochuYuan 💜 4\n│   │   │       @the_wilderless this is the worst one but i will grant you the sausage and bacon. the objectively best combination of pizza toppings i've ever tasted was bacon and potato, surprisingly rare considering how insanely good it is\n│   │   │       ↓\n│   │   │       1533181176810074112 [2022-06-04] @QiaochuYuan 💜 3\n│   │   │       @the_wilderless there are two places in berkeley that do bacon + potato on pizza iirc and i've never seen it anywhere else. absolute madness\n│   │   └── 1533174658169815041 [2022-06-04] @aleksil79 💜 1\n│   │       @the_wilderless I've lost almost all desire to convince others of what I know. QED.\n│   └── 1533174392137580546 [2022-06-04] @DRMacIver 💜 2\n│       @the_wilderless Tweet something about gender\n│       ↓\n│       1533174754634498053 [2022-06-04] @the_wilderless \n│       @DRMacIver I could throw down a lil Not Even Wrong, as a treat https://t.co/8oVR7ir5ZI\n│         [Quoting @the_wilderless: It’s time. I am ready.   Today, at long last, and after much public outcry (I hear you, my children, I hear you)  I will finally reveal:  My Thoughts On Gender Stuff]\n│       ↓\n│       1533175077377810433 [2022-06-04] @DRMacIver 💜 1\n│       @the_wilderless Yeah I'm familiar with your attempts to cop out on having any object level takes on the subject 😜\n│       ↓\n│       1533176778382004224 [2022-06-04] @the_wilderless 💜 2\n│       @DRMacIver Just for you, amigo https://t.co/pBTOg075cv\n│         [Quoting @the_wilderless: “Gender is performative” was a self-fulfilling magic spell that made gender 50,000x more performative, and tbh I’m exhausted w all the performance]\n├── 1533180091328434176 [2022-06-04] @QiaochuYuan 💜 6\n│   @the_wilderless there's an exercise early in the aro email meditation course that i thought was really cute, basically they were like \"try to think uninterrupted for 20 minutes, you'll eventually notice that it's impossible.\" real \"smoke the entire pack until you get sick of it\" energy\n│   ↓\n│   1533182898131681280 [2022-06-04] @the_wilderless 💜 2\n│   @QiaochuYuan Loved that one and it’s opposite https://t.co/HTXA6tCGEH\n│     [Quoting @the_wilderless: Literally 2 meditation exercises from Roaring Silence, performed over ~5 hours, gave me more useful insight than 30 days of Goenka retreats.]\n└── 1533588692975210498 [2022-06-05] @relic_radiation 💜 2\n    @the_wilderless tooooootally! u inspired me to tweet this.\n    \n    this pings me every time one of my massage teachers uses the word 'mindfulness' 😅\n    \n    https://t.co/wS8EQOVtxv\n      [Quoting @relic_radiation: whoever decided to create practices all about ‘quieting the mind’ (and moreover, call them ‘mindfulness practices’)   sure forgot to focus on what they wanted to see more of.  (( I much prefer my practices for 'dropping in' and 'depth of bodily sensing, listening, &amp; presence' ))]\n\n===\n\n1546653953948938240 [2022-07-12] @AskYatharth 💜 11 🔁 1 [(SEED) type=quote_of_root]\n.@Malcolm_Ocean used to say things like “the brain doesn’t understand ‘nots’” \n\nsaying what you don’t want almost gets interpreted as saying you do want it\n\ni never really understood it. until i saw @visakanv thread on target fixation https://t.co/9dPMQ1jWGf\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1546654447970832384 [2022-07-12] @AskYatharth 💜 6 🔁 1\nin high-dimensional spaces, simply naming the thing focuses your attention there \n\navoiding it is very hard. you jitter around in the edges of the thing\n\nversus just approaching and naming something else, the thing you want to approach, entirely https://t.co/Tft3Yy9nvp\n  [Quoting @AskYatharth: had lil🤯moment  there is fundamental asymmetry between “approach” and “avoid” in high-dimensional spaces]\n\n===\n\n1546654791677333505 [2022-07-12] @AskYatharth 💜 3 [(SEED) type=quote_of_root]\ni always wondered about intentions/manifesting out of fear. the way it almost fucks too over more\n\ni think it works a bit like this https://t.co/9dPMQ1jWGf\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1546655020094959617 [2022-07-12] @AskYatharth 💜 2\nyou’re so focused on the thing not happening that it happens \n\nin fearing the thing, it is made real https://t.co/DEmqumKCN3\n  [Quoting @AskYatharth: “This being said, if our intention comes from a source of love or positivity, we will reap the rewards. If the intention comes from fear, you will experience just that- the fear of losing what you have just created.” https://t.co/Nxew2zt7Fr]\n↓\n1546655259220537344 [2022-07-12] @AskYatharth \nit’s a bit like this thing: https://t.co/aqUb4ZW31N\n  [Quoting @AskYatharth: .@Malcolm_Ocean used to say things like “the brain doesn’t understand ‘nots’”   saying what you don’t want almost gets interpreted as saying you do want it  i never really understood it. until i saw @visakanv thread on target fixation https://t.co/9dPMQ1jWGf]\n\n===\n\n1573386338828705792 [2022-09-23] @the_wilderless 💜 102 🔁 5\nJust to put this out there:\n\nMeditation gets touted a lot as a way to end the incessant inner monologue,\n\nAnd when I started meditating, it was largely because the voice in my head wouldn’t stop,\n\nBut classic meditation made mine worse\n↓\n1573387000916443138 [2022-09-23] @the_wilderless 💜 69 🔁 4 [(SEED) type=quote_of_root]\n“Distance yourself from your thoughts”\n“Observe your thoughts from afar”\n“Notice the space between your thoughts”\n“You are the space the thoughts drift through”\n“Just note if there’s a thought and let it go”\n\n…you may notice the problem I had w this approach https://t.co/7xG6LuJz9O\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1573387277803339779 [2022-09-23] @the_wilderless 💜 61\nThe thing that ended up bypassing the issue entirely was somatic meditation.\n↓\n1573387579235487747 [2022-09-23] @the_wilderless 💜 39 🔁 1\nThis is one of those things that seems to resonate with people in the Somatic Resonance course,\n\nAnd one of those things that gets a spark of recognition way more often than I’d expect, given how little I see the issue talked about in meditative circles,\n├── 1573387882584227844 [2022-09-23] @the_wilderless 💜 37 🔁 1\n│   I think I’m gonna schedule a couple of 1-hour mini-workshop sessions to chat about this, say what worked for me, what I’ve seen work for others, what some common pitfalls are,\n│   \n│   And share some practices/frames that have become invaluable to me\n│   ↓\n│   1573388498685526016 [2022-09-23] @the_wilderless 💜 55 🔁 4\n│   If you’re curious about ditching the compulsive inner monologue, if classic meditation has left you feeling trapped in your head, if you’re generally curious about somatic approaches to meditation, let me know—I’ll set times/dates in a couple days\n│   ↓\n│   1573388501323862016 [2022-09-23] @the_wilderless 💜 23\n│   I’ll try to set up times for a couple different time zones, depending how many people register interest\n│   ↓\n│   1573546212074176512 [2022-09-24] @the_wilderless 💜 15 🔁 2\n│   I’m starting out w the following dates/times; can change them or add others later depending on people’s availability:\n│   \n│   Wednesday 28th: 12:30pm CEST (6:30am EST / 6:30pm Beijing)\n│   \n│   Thursday 29th: 3pm CEST (9am EST / 7am MT / 9pm Beijing)\n│   \n│   Friday 30th: 5pm CEST (11am EST / 8am PT)\n│   ↓\n│   1573546873335455744 [2022-09-24] @the_wilderless 💜 14 🔁 1\n│   You can get a ticket here, at the pretty pretty picture. I set the minimum donation at $25, pay whatever it feels worth to you 🙏\n│   \n│   Calendar invites and zoom link are in the product content\n│   \n│    https://t.co/WDJWUlVtRP\n│   ↓\n│   1573635328522461184 [2022-09-24] @the_wilderless 💜 5\n│   If none of those times work for you but you’d like to come, let me know—I’ll try to set up times that fit as many as I’m able to\n│   ↓\n│   1615102779768414221 [2023-01-16] @the_wilderless 💜 2\n│   Link for materials and recordings https://t.co/OzZi3nZY1V\n│     [Quoting @the_wilderless: Okay this one was huge actually, Somatic Silence  One of the best changes in my life was softening my inner monologue through somatic meditation,  and this lil workshop to share that w people feels huge.  (I put it down to $1 for the holidays btw 💝)  https://t.co/2sa4wkgxQI]\n└── 1575459391662440452 [2022-09-29] @caffeinum 💜 1\n    @the_wilderless effectively, classical Goenka vipassana is a somatic meditation in that sense. it’s all about body scan and feeling sensations on your body\n    \n    https://t.co/nwHpqcOHbj is a worldwide community, it’s completely free to join 10-day course\n    ├── 1575459598378717185 [2022-09-29] @caffeinum 💜 1\n    │   @the_wilderless also, classic Buddhist anapanasati is breath observation, which should happen on the body space versus visual or thinking space\n    └── 1575459829262458881 [2022-09-29] @the_wilderless \n        @caffeinum I am… ambivalent, to put it mildly https://t.co/RxjptV2tkR\n          [Quoting @the_wilderless: @taalumot @Witchuals1 My main example would be: one of my main complaints about the Goenka retreats was pretty much exactly this]\n        ├── 1575459972678311938 [2022-09-29] @the_wilderless 💜 1\n        │   @caffeinum Also, open offer to everyone I should probably re-surface https://t.co/fwzJovz8HO\n        │     [Quoting @the_wilderless: Open offer, if anyone is every curious about the 10-day Vipassana courses from the Goenka people over at dhamma dot com,  Maybe give me a call first. Those retreats aren’t for everyone and the organization seems to semi-intentionally cover over that fact https://t.co/CjZrU9CAw4]\n        ├── 1575460640113790977 [2022-09-29] @caffeinum \n        │   @the_wilderless my teacher has been really bad at explaining this, but it’s all about first noticing the difference between somatic and mental, and then shifting your attention from mental to somatic as much as you can\n        │   \n        │   there are no thoughts in the body space\n        │   ↓\n        │   1575460823065133056 [2022-09-29] @caffeinum \n        │   @the_wilderless can you say after your experience with somatic attention, you’re gonna do better in goenka technique?\n        │   ↓\n        │   1575461643391275010 [2022-09-29] @the_wilderless \n        │   @caffeinum I would skip the goenka technique\n        │   ↓\n        │   1575463418122887170 [2022-09-29] @caffeinum \n        │   @the_wilderless i mean i myself didn’t like body scans. i am past it.\n        │   \n        │   but for many people, it’s been very helpful, obviously it’s one of the easiest ways to get into hardcore meditation for laypeople\n        │   \n        │   i wonder what your critique boils down to\n        └── 1575461605671854080 [2022-09-29] @caffeinum \n            @the_wilderless yeah, I mean it seems really hard to “ignore” this madness that’s going inside your mind, but did you *really* try to ignore it? not battling against it, not trying to stop it, just ignore\n            ↓\n            1575461915446464514 [2022-09-29] @the_wilderless \n            @caffeinum The point of that post wasn’t that ignoring what’s happening is hard, it’s that you’re ignoring the very things that are most vital\n\n===\n\n1583508221347569665 [2022-10-21] @visakanv 💜 334 🔁 11\n“look straight”, “eyes on me”, “focus on the horizon” are all way better instructions than “don’t look down”\n↓\n1583508890359984130 [2022-10-21] @visakanv 💜 21 [(SEED) type=quote_of_root]\nhttps://t.co/ljUFdnyPnc\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1608673855601782784 [2022-12-30] @AskYatharth 💜 8 [(SEED) type=quote_of_root]\nyou don’t “break” codependence, you just leave it https://t.co/9dPMQ1C5Un\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1608673858017689600 [2022-12-30] @AskYatharth 💜 9\nyou find something else to focus your time &amp; energy on\n\nyou look for the other frame\n\notherwise you just keep having a relationship with the tree (codependence)\n↓\n1608674438568095744 [2022-12-30] @AskYatharth 💜 6\nsetting your sights on “breaking” codependence is setting your sights on the very frame you wish to leave https://t.co/BDhnq06zlV\nImages:\n  - [Image #0] The image depicts a young boy riding a small, yellow and red tricycle on a grassy field. The boy, dressed in a blue shirt and dark shorts, is captured in motion, with his hair blowing in the wind as he pedals the tricycle.\n\n===\n\n1621621724507938816 [2023-02-03] @sama 💜 2299 🔁 298 💬 14\neliezer has IMO done more to accelerate AGI than anyone else.\n\ncertainly he got many of us interested in AGI, helped deepmind get funded at a time when AGI was extremely outside the overton window, was critical in the decision to start openai, etc.\n├── 1621630819508027393 [2023-02-03] @visakanv 💜 152 🔁 1 [(SEED) type=quote_of_root]\n│   @sama https://t.co/ljUFdnQYBk\n│     [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n└── 1626234468926390274 [2023-02-16] @AskYatharth 💜 15 [(SEED) type=semantic_search]\n    @sama dad: don’t crash into the tree!\n    \n    son: https://t.co/5SwcF5V1M0\n    ↓\n    1626234531018850310 [2023-02-16] @AskYatharth 💜 1\n    @sama yud is dad in this scenario, to be clear\n    ↓\n    1626234563331780609 [2023-02-16] @AskYatharth  [(SEED) type=quote_of_root]\n    @sama (source) https://t.co/9dPMQ1C5Un\n      [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1632423107620118528 [2023-03-05] @visakanv 💜 559 🔁 25\nnamed after the guy who disapproved of it lmao https://t.co/V4rN6BXyTy\n  [Quoting Tweet 1632421499159052294 (missing)]\n↓\n1632553281234022402 [2023-03-06] @justavagrant_ 💜 1 [(SEED) type=semantic_search]\n@visakanv dont hit the tree\n\n===\n\n1633197494091018240 [2023-03-07] @AskYatharth 💜 5\nhttps://t.co/L7Ja041biQ is shut down, but its best feature have been creeping into @savvycal \n\nthis is a no-brainer over Calendly https://t.co/4WupukaC5z\n  [Quoting Tweet 1588602742431703045 (missing)]\n↓\n1633197496687284224 [2023-03-07] @AskYatharth 💜 4\nrip https://t.co/L7Ja041biQ, a product so good i cold-zoomed the CEO for no other reason than to ask them to never shut it down (they did) https://t.co/NSG9HCzZIW\n  [Quoting @AskYatharth: @meditationstuff https://t.co/L7Ja04iekQ  Instead of  1. Send them a link 2. Hope they use it 3. If they don’t, follow-up]\n↓\n1633198142622662656 [2023-03-07] @dschorno 💜 3\n@AskYatharth they shut it down after you specifically asked them not to!? rude\n↓\n1633198305885966336 [2023-03-07] @AskYatharth 💜 4\n@dschorno “can you acquire us to make sure we never shut down”\n\n“no”\n\n“ok cool”\n↓\n1633198643577602049 [2023-03-07] @visakanv 💜 7 [(SEED) type=quote_of_root]\n@AskYatharth @dschorno bro https://t.co/ljUFdnQqLM\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1633199238099402753 [2023-03-07] @AskYatharth 💜 3\n@visakanv @dschorno i honestly just wanted to be friends and maybe work for him or with him or his engineers to build things like it\n\n===\n\n1633411142004666370 [2023-03-08] @Malcolm_Ocean 💜 4 [(SEED) type=semantic_search]\nd̶o̶n̶'̶t hit the tree https://t.co/rFdj3Et8VR\n\n===\n\n1633899731385561088 [2023-03-09] @__drewface 💜 15\nman, if anticapitalists really want more cooperative, peaceful, abundant social structures for all people, they need to burn the \"degrowth\" and \"anti-liberalism\" parts of their platform\n\nmarkets can be cruel, but growth? liberalism? these are the foundations of peace. https://t.co/zBqWrDQGuC\nImages:\n  - [Image #0] The image shows a snippet of text from a webpage or document, with some words highlighted in blue. The text reads: \"policy analyst based in brooklyn, ny (lenapehoking) working to integrate anti-capitalist, anti-displacement, cooperative, and degrowth principles into their housing-based advocacy, policy\".\n    \n    The highlighted words are \"anti-capitalist\", \"anti-displacement\", and \"degrowth principles\".\n  - [Image #1] The image is a screenshot of a text that describes a policy analyst. The text is partially visible and reads: \"policy analyst based in brooklyn, ny (lenapehoking) working to integrate anti-capitalist, anti-displacement, cooperative, and degrowth principles into their housing-based advocacy, policy\".\n    \n    The text is written in a simple gray font on a white background, with three highlighted phrases: \"anti-capitalist\", \"anti-displacement\", and \"degrowth principles\", which are displayed in white text within blue highlighted boxes.\n↓\n1633902159795240961 [2023-03-09] @__drewface 💜 3\nah yes, how could I forget?\n\nin order to improve society for the oppressed we should be opposed to: \"peace\", \"dissension\", \"friendship\", \"family\"\n\ninstead, we should support: \"unity\", \"cohesion\", \"discipline\", and \"the revolution\"\n\ngreat principles for urban planning 🏙️ https://t.co/ERf3EZt2XI\nImages:\n  - [Image #0] The image shows a text passage discussing the negative effects of liberalism on a revolutionary collective. The text is transcribed as: \"Liberalism is extremely harmful in a revolutionary collective. It is a corrosive which eats away unity, undermines cohesion, causes apathy and creates dissension. It robs the revolutionary ranks of compact organization and strict discipline, prevents policies from being carried through and alienates the Party organizations from the masses which the Party leads. It is an extremely bad tendency.\"\n  - [Image #1] The image shows a passage of text that discusses the negative effects of liberalism on a revolutionary collective. The text is transcribed as: \"Liberalism is extremely harmful in a revolutionary collective. It is a corrosive which eats away unity, undermines cohesion, causes apathy and creates dissension. It robs the revolutionary ranks of compact organization and strict discipline, prevents policies from being carried through and alienates the Party organizations from the masses which the Party leads. It is an extremely bad tendency.\"\n↓\n1633903798551715841 [2023-03-09] @sensefulronin 💜 3\n@__drewface My steelman is that it is about de-centering growth, which means prioritizing other things besides growth such as wellbeing and met needs.\n↓\n1633905056947814426 [2023-03-09] @__drewface 💜 2\n@sensefulronin Yea, here's a pamphlet entitled \"demystifying degrowth\". You're right, but the steelman for \"growth\" is also about prioritizing things such as well-being and met needs!\n\nWe're all talking past each other thinking that we're not on the same page, and it's distracting. https://t.co/3v2xcWpzS9\nImages:\n  - [Image #0] The image is a colorful infographic titled \"Demystifying Degrowth\" that presents a critical perspective on the concept of economic growth and its impact on the environment. The infographic is divided into three sections, each with a distinct color scheme and illustrations.\n    \n    *   **Section 1:**\n        *   The first section features a snail on a leaf, accompanied by the text \"We are taught that buying more things - not later, but right now - is good for us and good for the economy.\"\n        *   The section highlights the consequences of excessive consumption, stating that if everyone in the world consumed as much as the average U.S. citizen, we would need five planets.\n        *   Statistics:\n            *   5 planets needed if everyone consumed like the average U.S. citizen\n    *   **Section 2:**\n        *   The second section depicts a cityscape with a person holding a laptop, surrounded by pollution and waste.\n        *   The text notes that quarterly earnings increase quicker over new luxury condos than community health clinics, and that arming millions of soldiers for war swells the economy more than conflict mitigation.\n        *   Instead of extending the life of every product to reduce waste, the market encourages us to replace our electronics each year and buy new clothes every season.\n        *   Statistics:\n            *   Quarterly earnings increase quicker over new luxury condos than community health clinics\n            *   Arming millions of soldiers for war swells the economy more than conflict mitigation\n    *   **Section 3:**\n        *   The third section features a person surrounded by thought bubbles, with the text \"Our economy is based on our right to consume, but not our natural world at all.\"\n        *   The section emphasizes the importance of a habitable planet, stating that the planet we live on must be habitable for us to find meaning in our lives, to plan for the future.\n        *   It also poses the question, \"How can the economy be reassembled to grow these things?\"\n        *   Statistics:\n            *   None\n    \n    In summary, the infographic challenges the conventional wisdom that economic growth is the primary goal, highlighting the environmental costs of excessive consumption and the need for a more sustainable approach. By presenting statistics and thought-provoking questions, the infographic encourages viewers to rethink their assumptions about the economy and its impact on the planet.\n  - [Image #1] The image is an infographic titled \"Demystifying Degrowth\" and presents a critical perspective on the concept of economic growth. The title is displayed in the top-left corner, accompanied by a cartoon snail on a leaf.\n    \n    **Main Points:**\n    \n    * **Introduction**\n    \t+ The infographic begins by stating that buying more things is not necessarily good for the economy or the environment.\n    \t+ It highlights that if everyone consumed as much as the average U.S. citizen, five planets would be needed to sustain them.\n    * **The Impact of Consumption**\n    \t+ The section emphasizes that quarterly earnings increase faster over new luxury condos than community health clinics.\n    \t+ It notes that arming millions of soldiers for war swells the economy more than conflict mitigation.\n    \t+ The section also states that the planet we live on must be habitable for us to find meaning in our lives and plan for the future.\n    * **The Economy's Focus on Consumption**\n    \t+ The infographic asserts that the economy is based on our right to consume, but not our right to live.\n    \t+ It doesn't even recognize our natural world at all, but the soil must be fertile for us to eat, and the air and water must be clean for us to sustain ourselves.\n    \t+ The section concludes by asking how the economy can be reassembled to grow these things.\n    * **The Consequences of Consumption**\n    \t+ The infographic illustrates that instead of extending the life of every product to reduce waste, the market encourages us to replace our electronics each year and buy new clothes every season.\n    \t+ It highlights that we are also taught to do things that grow the economy and maximize profits in the immediate term.\n    \n    **Summary:**\n    \n    The infographic presents a critical view of the concept of economic growth, arguing that it prioritizes consumption over sustainability and the well-being of the planet. It highlights the negative consequences of this approach, including the depletion of natural resources and the degradation of the environment. The infographic concludes by questioning how the economy can be restructured to prioritize the well-being of both humans and the planet.\n↓\n1633906019251175444 [2023-03-09] @visakanv 💜 1 [(SEED) type=quote_of_root]\n@__drewface @sensefulronin degrowthers trying to draw attention to the thing they want to de-center:\n\nhttps://t.co/ljUFdnQqLM\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1644578728092254214 [2023-04-08] @RomeoStevens76 💜 142 🔁 9\nThe somatic tension we call fear seems to be built from two components seemingly at odds. The imperative to get away from the fear object, and the intense focus on the fear object. The vivid sensory clarity feels like getting closer. \n\nDon't yet know the solution.\n↓\n1644713667387359233 [2023-04-08] @eshear 💜 1 [(SEED) type=quote_of_root]\n@RomeoStevens76 https://t.co/scnQ6o21yJ\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1644717172684656648 [2023-04-08] @visakanv 💜 3\n@eshear @RomeoStevens76 🙏🏾 solution imo is to focus on where you wanna go, not on what you wanna get away from https://t.co/tFaWtEIIZp\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n\n===\n\n1661807845204189184 [2023-05-25] @visakanv 💜 141 🔁 7\nI originally wrote this after thinking through a question someone asked me about how to deal with doomscrolling\n\nToday someone else asked me about how to deal with validation-seeking and I realize it has the same core answer https://t.co/RRtORIt1PZ\n  [Quoting @visakanv: you don’t win big from being the goodest good boy you can be (minimizing negative variance to try and please your internal taskmaster)  you win big by being a bad motherfucker who’s sensitive to feedback (maximizing positive variance in alignment with your deepest feelings)]\n↓\n1661808875111354369 [2023-05-25] @visakanv 💜 37\n“how do I doomscroll less” “how do I be less validation-seeking” are both kinda losing frames. The upstream question is: what’s the point of doing that?\n↓\n1661809231333580800 [2023-05-25] @visakanv 💜 37 🔁 2 [(SEED) type=quote_of_root]\nThe point is typically to free you up to do your best work, whatever that means to you. And it’ll be easier to work backwards from focusing on doing what you want, than by focusing on not-doing what you don’t want https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1661809472451526661 [2023-05-25] @visakanv 💜 40 🔁 2\nso ultimately always the core answer to everything is to https://t.co/tFaWtEIIZp\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1661809819899277313 [2023-05-25] @visakanv 💜 47 🔁 3\nsomewhere out there there’s a parallel version of you, who does more of the bad thing you think you should do less of, and yet is somehow happier anyway… because they also simultaneously do more of the good thing that you know in your heart you actually want to really be doing\n↓\n1661811272411906048 [2023-05-25] @visakanv 💜 35 🔁 3\nif “best work” is loaded with unpleasant connotations, feel free to swap it out with “play” or “vibing” or whatever feels right for you, whatever is creative-generative-abundant\n\n===\n\n1662334809878986753 [2023-05-27] @danallison 💜 8 🔁 1\nCan we please add “Metatron” to the lexicon as the opposite of “Moloch”? We need an affirmative counter meme. Focus on what you want to see more of! https://t.co/VK7hQVRLcD\n  [Quoting Tweet 1647949526118854661 (missing)]\n↓\n1662334812139720705 [2023-05-27] @danallison  [(SEED) type=quote_of_root]\nMoloch is the tree. Don’t crash into the tree! https://t.co/qWeQPjeB1A\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n↓\n1662334814232653826 [2023-05-27] @danallison 💜 1\nAnother candidate is “Super Cooperator Cluster”, but that one is kind of a mouthful. https://t.co/SLoIBxSUtZ\n  [Quoting @algekalipso: You may be tempted to be cynical about the motivations of everyone.   But giving up on genuine compassion as a motivation is not just a tactical error: it's a misrepresentation of reality.  Indeed, the super-cooperator cluster exists already. It's just not at a critical mass yet.]\n\n===\n\n1681711288294965257 [2023-07-19] @RichDecibels 💜 27 [(SEED) type=semantic_search]\ndon't hit the tree https://t.co/gMar44lqsI\nImages:\n  - [Image #0] The image depicts a rural road with a sign indicating a speed limit of 70 and a warning about a potential collision with a tree.\n    \n    *   The road is paved, with a white line on the left side and a grassy verge on the right.\n        *   The road curves to the left in the distance.\n        *   There are trees on the left side of the road.\n    *   A signpost is located on the right side of the road.\n        *   The top sign is circular, with a red border and a white center, displaying the number \"70\" in black text.\n        *   The bottom sign is square, with a white background and a black border, featuring a graphic of a car crashing into a tree.\n    *   In the background, there is a field of yellow crops or grass, with trees in the distance.\n        *   Power lines are visible on the right side of the image.\n        *   The sky is blue with white clouds.\n    \n    The image appears to be a warning sign for drivers to be cautious of a tree on the side of the road.\n↓\n1681711327348129793 [2023-07-19] @RichDecibels 💜 7 [(SEED) type=quote_of_root]\ndon't hit the tree\n\nhttps://t.co/AZPnRYdr2E\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1686397654886912000 [2023-08-01] @__drewface 💜 11 💬 1 [(SEED) type=quote_of_root]\n\"DRIVE SAFELY\" signs in Texas are responsible for 2600 additional crashes. https://t.co/pSFnezNnmS https://t.co/tL4QVffuat\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1700528583108862368 [2023-09-09] @visakanv 💜 86 🔁 1\ndon’t think of an elephant https://t.co/9UZBleuUTf\n  [Quoting Tweet 1699870423402574038 (missing)]\n↓\n1700528749685743890 [2023-09-09] @visakanv 💜 28 🔁 1 [(SEED) type=quote_of_root]\nfocus on what you want, not what you don’t want https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1701266720470491258 [2023-09-11] @justavagrant_ 💜 7\nAnyone got good song recommendations about self love?\n↓\n1701266722081116196 [2023-09-11] @justavagrant_  [(SEED) type=quote_of_root]\nI love “greatest love of all” by Whitney, but it has a “look how much better this is than not this” vibe. https://t.co/CewEnGD97I\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1705151573616177509 [2023-09-22] @dpinkshadow 💜 18 🔁 1\noh I feel broken so let's obsess over fixing all the broken things in me = i'm irreparably broken https://t.co/HhQCon9KYJ\n  [Quoting @visakanv: focus your time and energy on what you want to see more of]\n↓\n1705153073092665830 [2023-09-22] @visakanv 💜 5 [(SEED) type=quote_of_root]\n@dpinksh classic rookie error. focus on what is beautiful, what is good, what you love, what you admire https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n├── 1705153350466146545 [2023-09-22] @visakanv 💜 3\n│   @dpinksh https://t.co/BgpaSs490L\n│     [Quoting @visakanv: dusting off an old meme format https://t.co/rdhujzVoT2]\n└── 1705153475175166317 [2023-09-22] @dpinkshadow 💜 1\n    @visakanv yeah I see now!\n    \n    but some lessons can only be taught by failure\n    ↓\n    1705153814767259803 [2023-09-22] @visakanv 💜 1\n    @dpinksh in a sense! depends on what you mean by failure, and what failure feels like to you. if you can be cheerful about it as a learning opportunity you will become unstoppable https://t.co/C14VvYx3U8\n      [Quoting @visakanv: people who are good at dealing with failure don’t think of failure as failure]\n    ├── 1705154110536970330 [2023-09-22] @visakanv 💜 2\n    │   @dpinksh I got a lot of stuff about this, stop me when you’ve had enough lol https://t.co/Carh8BDg4i\n    │     [Quoting Tweet 1422534005921091590 (missing)]\n    │   ├── 1705154260839887275 [2023-09-22] @visakanv 💜 1\n    │   │   @dpinksh https://t.co/pkwc3blctd\n    │   │     [Quoting @visakanv: at my most depressed i had the thought \"every success is just a stepping stone to the next inevitable failure\".   what i couldn't see then: I had an internalized assumption that failure is bad, to be ashamed of.   actually, failure can be a delightful opportunity for learning]\n    │   │   ↓\n    │   │   1705154592185717100 [2023-09-22] @visakanv 💜 2\n    │   │   @dpinksh ok last one https://t.co/t7MkWbjUnD\n    │   │   Images:\n    │   │     - [Image #0] The image is a screenshot of a Twitter thread featuring a user's tweets. The tweets are from the account \"@visakanv\" and are displayed in a vertical sequence on a dark blue background.\n    │   │       \n    │   │       * The first tweet, dated 16/2/15, reads: \"'Every little success is just a stepping stone to inevitable failure' - my subconscious\" and has 43 likes.\n    │   │       \t+ The tweet is a quote attributed to the user's subconscious.\n    │   │       \t+ It has 3 retweets and 43 likes.\n    │   │       * The second tweet, dated 15/10/22, reads: \"^ fun example of a tweet from depressed visa the statement by itself is not wrong, but what is implicit that was unrecognised was 'and failure is a bad thing to be upset/ashamed about.' now I can see that failures are learning opportunities, that I can love n embrace 'failure'\" and has 49 likes.\n    │   │       \t+ The tweet is a reflection on a previous tweet and its underlying message.\n    │   │       \t+ It has 49 likes.\n    │   │       * The third tweet, undated, reads: \"'every road leads to failure 😂' visa vs 'every road leads to failure!' visa\" and has no likes or retweets visible.\n    │   │       \t+ The tweet is a comparison between two different versions of a statement.\n    │   │       \t+ It includes an emoji: 😂.\n    │   │       * The fourth tweet, dated 17/4/22, reads: \"editing video always takes longer than I think lol but like-\" and is accompanied by two images of the same man with different hairstyles.\n    │   │       \t+ The tweet is a commentary on the time it takes to edit videos.\n    │   │       \t+ The images show the man with short hair and glasses, and then with longer hair and a necklace.\n    │   │       \n    │   │       The Twitter thread showcases the user's thoughts on failure and success, as well as their personal experiences with editing videos.\n    │   └── 1705156263925924041 [2023-09-22] @dpinkshadow 💜 1\n    │       @visakanv I'm honored with your replies\n    │       ↓\n    │       1705159633751650661 [2023-09-22] @visakanv 💜 1\n    │       @dpinksh 🥰🙏🏾\n    └── 1705156115372110178 [2023-09-22] @dpinkshadow 💜 1\n        @visakanv I used failure exactly in that sense (motivator to change your ways). but also I'm not at a point in my life that I can accept failure with a cheerful optimism. it feels heavy and it's up to me to channel that in forms of passion.\n\n===\n\n1709070600474337404 [2023-10-03] @univrsw3th4rt 💜 13\nat a soccer game the other day my dad remarked on the frequency of shots-on-goal that ended up exactly in the goalie’s arms. “what’s going on there, i wonder?” took me a week to find the words but i realized it’s easier to aim *towards* sthg rather than *away* from sthg\n↓\n1709070775410479299 [2023-10-03] @univrsw3th4rt 💜 7 [(SEED) type=semantic_search]\nactually my first thought was that vid @visakanv has tweeted about where the dad is like “don’t crash into the tree!” and the som crashes into the tree lol\n↓\n1709071038867251578 [2023-10-03] @univrsw3th4rt 💜 8\nthe players are prob in their head being the dad to themselves, like “don’t kick it at the goalie!!!” and they’re body is like “got it, kick it at the goalie!!!”\n\n===\n\n1714410095784947981 [2023-10-17] @visakanv 💜 26 🔁 1 [(SEED) type=semantic_search]\na funny in-the-wild example of “don’t crash into the tree” being manifested by spam bots https://t.co/nRChCYtb01\nImages:\n  - [Image #0] The image shows a screenshot of a Twitter conversation. The top tweet is from Maia Bittner, who asks, \"I kinda want to buy a video game console what should I get?\" with 16 replies, 8 likes, and 1,592 views. \n    \n    Below Maia's tweet is a response from Controversial Gorilla, suggesting either a PS5 for \"adult\" games with good graphics or a Switch for more casual gaming. The tweet has 2 reposts and 5 likes.\n    \n    At the bottom of the image is a tweet from Andrea Koons, stating \"my dick is growing,\" accompanied by an OnlyFans link. This tweet has 2 views.\n    \n    The image highlights an example of spam bots responding to a genuine tweet, with the second response being a clear spam message.\n↓\n1714410246960210248 [2023-10-17] @visakanv 💜 10 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1778090104005046440 [2024-04-10] @visakanv 💜 120 🔁 1\ncan yall please just listen to me about ONE thing 😭 https://t.co/jbpC1CU9iB\n  [Quoting Tweet 1778088140760047788 (missing)]\n↓\n1778090325090894138 [2024-04-10] @visakanv 💜 104 🔁 9 [(SEED) type=quote_of_root]\ndefine the outcome you WANT\ndescribe the behaviour you WANT\nsay what you WILL DO https://t.co/ljUFdnQYBk\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1783939374909911413 [2024-04-26] @univrsw3th4rt 💜 32\nreply to this tweet and i’ll share which tweet of urs (if any) i had bookmarked on my lurker acct (before i started this one)\n↓\n1784065723096043826 [2024-04-27] @strangestloop 💜 1\n@univrsw3th4rt thx\n↓\n1784066033533235582 [2024-04-27] @univrsw3th4rt 💜 3\n@strangestloop 🥲 https://t.co/pEtdhtMX5N\nImages:\n  - [Image #0] The image shows a tweet from the account \"@strangestloop\" with the username \"Loopy.\" The tweet reads: \"so you're telling me you have to meet someone AND like them AND be attracted to them AND they like you AND they're attracted to you AND you keep liking each other AND you agree or compromise on every big life thing? how is this so common?\" The tweet is dated August 14, 2022, and has garnered 37 comments, 83 retweets, and 1,000 likes.\n↓\n1784066685969760616 [2024-04-27] @strangestloop  [(SEED) type=quote_of_root]\n@univrsw3th4rt mf literally staring down the tree smh\nhttps://t.co/7PIRSGEviG\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1806727909228662902 [2024-06-28] @Malcolm_Ocean 💜 19\nwait did @X just try to make its search smart, thereby making it stupid? I'm trying to find @visakanv's \"don't hit the tree\" post https://t.co/Rap2F72V76\nImages:\n  - [Image #0] The image shows a screenshot of a Twitter search result for \"from:visakanv 'hit the tree'\" with four tweets from Visakan Veerasamy (@visakanv). The tweets are sorted by \"Top\" and include the following text:\n    \n    * May 8: \"elizabeth ii's coronation did for television roughly what jennifer lopez's versace dress did for google image search\" is (a variation of) a sentence i once wrote that i'd like to write 1000x more of, about other things\n    * Jan 24: someone just quoted this and i was horrified like holy shit when was i ever this mean/dismissive to anyone and then i clicked through and lol'd\n    * Dec 15, 2023: “one of the most fascinating things” really? Of all the things in the world, human incompetence is the *most* fascinating? (with a truncated link)\n    * Dec 12, 2022: I think I've listened to the entirety of OK Computer at least 200 times, and that feels like a low estimate\n    \n    Each tweet includes the user's name, handle, and date, as well as engagement metrics (replies, retweets, likes).\n↓\n1806727911166316799 [2024-06-28] @Malcolm_Ocean 💜 16 [(SEED) type=quote_of_root]\noh wait I always get the wrong keywords for this tweet.\n\nthat doesn't change the fact that the search is showing irrelevant results (and isn't, for instance, being actually smart and fixing my hit-&gt;crash into!) https://t.co/tg0xNXILlH https://t.co/xAuEnYK4PD\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\nImages:\n  - [Image #0] The image shows a screenshot of a tweet from Visakan Veerasamy (@visakanv) on December 15, 2021, with a reply to himself. \n    \n    The tweet reads: \n    \"dad: don't **crash** into the tree!\n    son:\"\n    \n    Below the text is a video thumbnail showing a boy riding a bike towards a tree in a grassy area. The video is 11 seconds long and is attributed to \"Tube/PaulArdern.\" The tweet has received 15 replies, 68 retweets, and 350 likes.\n    \n    To recreate this image, one would need to post a tweet with the same text, include the video thumbnail, and display the same engagement metrics. The tweet is a humorous anecdote about a father warning his son not to crash into a tree, only to have the son do so anyway.\n\n===\n\n1809530954462929403 [2024-07-06] @easoncxz  [(SEED) type=semantic_search]\nSlash their tyres before they run over your kids. https://t.co/R0jOAIZriS\n  [Quoting Tweet 1808876793149206845 (missing)]\n\n===\n\n1818004536805540091 [2024-07-29] @mr_samosaman 💜 1 [(SEED) type=quote_of_root]\nthis is another instance of \"don't crash into the tree\"\nhttps://t.co/t7uQiX2wE8 https://t.co/QgRE8ePRjS\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1909824414738264395 [2025-04-09] @AskYatharth 💜 5 [(SEED) type=semantic_search]\n@visakanv: \"dad: don't crash into the tree!\"\n↓\n1909824443221762161 [2025-04-09] @AskYatharth 💜 2\n@Malcolm_Ocean: towardsness and awayness, aiming in high dimensionality\nhttps://t.co/qXonzzKS4f\n  [Quoting @AskYatharth: had lil🤯moment  there is fundamental asymmetry between “approach” and “avoid” in high-dimensional spaces]\n\n===\n\n1921313755410931725 [2025-05-10] @jessi_cata 💜 3 🔁 1\nMapping out a space of utilitarian views on the Singularity https://t.co/NRuDLSR6qx\nImages:\n  - [Image #0] The image is a flowchart that categorizes utilitarian views on the Singularity, a hypothetical future event where artificial intelligence surpasses human intelligence.\n    \n    To recreate the diagram, start with a box labeled \"Utilitarian?\" and draw two arrows, one pointing to \"Non-utilitarian ethics\" (labeled \"No\") and the other to \"Singularity outcome affecting?\" (labeled \"Yes\"). From \"Non-utilitarian ethics,\" draw an arrow to \"Assume globalized development?\" with two possible outcomes: \"Differential technology development\" (Yes) and \"Agent-preferring approaches\" (No). From \"Singularity outcome affecting?\", draw an arrow to \"Timing focused?\" with two possible outcomes: \"Prefer earlier singularity?\" (Yes) and \"Focus on biological moral patients?\" (No). The \"Prefer earlier singularity?\" branch splits into \"Accelerationism\" (Yes) and \"Decelerationism\" (No). The \"Focus on biological moral patients?\" branch splits into \"Focus on humans?\" (Yes) and \"AI sentience focus\" (No). The \"Focus on humans?\" branch leads to \"Near-term human focus\" (Yes), while the \"AI sentience focus\" and \"Near-term non-human animal focus\" (No) are endpoints.\n↓\n1921316633324208562 [2025-05-10] @lumpenspace  [(SEED) type=semantic_search]\n@jessi_cata @s0phyyyy a tree is not the way\n\n===\n\n1922717049979060637 [2025-05-14] @danallison 💜 3 [(SEED) type=quote_of_root]\nDon’t crash into the “don’t crash into the tree” tree. https://t.co/qWeQPje3c2\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1935374204196524341 [2025-06-18] @TylerAlterman 💜 26\nAFAICT the main way Christianity screws people up is by using the notion of sin (and the consequent punishment of hell, aka infinite suffering) as a fractal means of exerting control, from the level of society, down to the level of the family and self\n↓\n1935376190132408399 [2025-06-18] @TylerAlterman 💜 14 🔁 1\nNot that there isn’t something real about sin. As @feral_eyes points out, the og translation of sin is “to miss the mark.” If you keep making the same mistakes about how to live, eventually you do end up in a sort of hell. But this phenomenon is closer to saying “if you keep putting your hand in the flames, eventually your arm will catch fire.” It’s closer to physical law than moral judgment\n↓\n1935432825064370280 [2025-06-18] @made_in_cosmos 💜 1 [(SEED) type=quote_of_root]\n@TylerAlterman @feral_eyes Been enjoying your musings on religion lately, and this one especially resonates. Sin definitely points to something real, but I'd rather focus my time and attention on cultivating virtue. Otherwise it kinda feels like this\n\nhttps://t.co/hNiKu384eh\n  [Quoting @visakanv: dad: don't crash into the tree!  son: https://t.co/dsQO64SLRG]\n\n===\n\n1935968640240681243 [2025-06-20] @xlr8harder 💜 186 🔁 6\nThe \"I should really build a home AI rig\" to \"checking GPU prices and deciding to wait longer\" pipeline.\n↓\n1936101325512782132 [2025-06-20] @voooooogel 💜 6 [(SEED) type=semantic_search]\n@xlr8harder they're gonna crash any day now 🥲\n↓\n1936111444472275028 [2025-06-20] @xlr8harder \n@voooooogel Don't give up hope!  Maybe when AMD releases their next version...\n\n===\n\n1947127784528375910 [2025-07-21] @SarahAMcManus 💜 9 [(SEED) type=semantic_search]\noh no it's the @visakanv \"dad: don't crash into the tree!\" video\n\nvibecoder: don't delete the production database again!\n\n===\n"
}