{
  "tweet_id": 1546576363976593411,
  "thread_text": "1265009372780003328 [2020-05-25] @JimmyRis 💜 18 🔁 4 💬 1 [(SEED) type=semantic_search]\nNever stop gently pointing out obvious things\n↓\n1265009375153983489 [2020-05-25] @JimmyRis 💜 6\nI used to think: “this is obvious, so there’s a good chance they’ve thought it”\n\nBut often find that if an obvious thing is not addressed, chances are high it’s been missed (because otherwise it wouldn’t be an issue, cuz it’s obvious)\n\n===\n\n1266250829624782852 [2020-05-29] @visakanv 💜 129 🔁 4\noh fuck you're gonna make me t r i a n g l e https://t.co/vQpyeh6dI6\n  [Quoting Tweet 1266107891921989633 (missing)]\n↓\n1266251877336809473 [2020-05-29] @visakanv 💜 82 🔁 4\nthere are 3 cores. 1 core by itself would fail, because it would be susceptible to attack, overloading, etc. when FRIENDLY is under seige, I typically switch modes to NERD. 90% of malicious actors don’t know how to fight this. Often they literally *call* me nerd. I thank them https://t.co/9EZrEAm1Y9\nImages:\n  - [Image #0] The image shows a simple hand-drawn diagram on lined paper, featuring a triangle with three vertices labeled \"Friendly,\" \"Nerd,\" and \"Ambitious.\" The triangle is drawn in blue ink, with each vertex connected to the others by a line. The labels are written in the same blue ink as the triangle. The background of the image is a piece of lined paper, which provides a clean and simple backdrop for the diagram.\n↓\n1266252914546204673 [2020-05-29] @visakanv 💜 57 🔁 2\nI can *reposition* myself depending on my mood, the prevailing atmosphere, the landscape and so on. I can play with two “hands” tied behind my back for months on end if required. It’s dynamic, not fixed. I stay interesting because I switch modes when I get bored of myself https://t.co/gpUNiy0ujK\nImages:\n  - [Image #0] The image shows a hand-drawn triangle on lined paper, with three words written around it. The triangle is drawn in blue ink and has a grid pattern inside it, with several dots marked at various points along the lines. The word \"FRIGNDLY\" is written above the triangle, while the words \"NEED\" and \"AMBITIONS\" are written below it, one on either side. To reproduce this image, you would need to draw a triangle with a grid pattern and dots, and write the three words around it in a similar style.\n↓\n1266256430593536000 [2020-05-29] @visakanv 💜 78 🔁 8\nIf my core was 100% about seeking peers, I think it would likely trap me in some local optima- I would get caught up in other people’s drama and conflicts, get over-invested, feel overdefined and overburdened by them. It’s important that I have other things going on than friends https://t.co/ufOhIxAUkG\nImages:\n  - [Image #0] The image is a handwritten note on lined paper, featuring a blue pen drawing of a triangle with a grid pattern inside it. The triangle is surrounded by three phrases: \"WHO ARE MY PEOPLE?\" at the top, \"I WANT TO KNOW!\" on the left, and \"WHAT CAN I ACCOMPLISH?\" on the right.\n    \n    *   The top phrase is written in quotation marks and positioned above the triangle, with the word \"FRIENDLY\" below it.\n    *   The left phrase is also in quotation marks and placed to the left of the triangle, with the word \"NEED\" above it.\n    *   The right phrase is in quotation marks and situated to the right of the triangle, with the word \"AMBITIOUS\" above it.\n    *   The background of the image is white lined paper, which provides a clean and simple backdrop for the handwritten notes and drawing.\n    \n    The overall design of the image suggests that it is a personal reflection or brainstorming exercise, with the triangle representing a central idea or concept and the surrounding phrases providing context and meaning.\n↓\n1266257836863979520 [2020-05-29] @visakanv 💜 72 🔁 4\nEach core is augmented and reinforced by the other two https://t.co/zc7HaDz3Qv\n↓\n1266260280289267714 [2020-05-29] @visakanv 💜 82 🔁 3 💬 3\nThese three cores also have ”content extensions”, or “output streams”. Should I explain it? Of course I’m going to explain it, I’m a fucking nerd https://t.co/FjyPJ0WYhM\nImages:\n  - [Image #0] The image is a hand-drawn diagram on lined paper, illustrating the concept of \"shitposting\" and its relationship to various aspects of online behavior.\n    \n    *   The diagram is centered around a triangle with a geometric pattern inside, surrounded by three main categories: **Friendly**, **Ambitious**, and **Nerd**.\n        *   **Friendly** is associated with the phrase \"Who are my people?\" and the statement \"People are force multipliers.\"\n        *   **Ambitious** is linked to the question \"What can I accomplish?\" and is positioned next to the phrase \"Seemposting.\"\n        *   **Nerd** is connected to the phrase \"I want to know!\" and is placed beside the term \"Nerdposting.\"\n    *   The diagram also includes several other key points, such as:\n        *   \"Sensemaking is multiplayer\" and its connection to the **Friendly** category.\n        *   \"Knowledge is power\" and its association with the **Nerd** category.\n        *   The cyclical nature of the diagram, suggesting that these categories are interconnected and influence one another.\n    *   The overall design of the diagram is simple yet effective, using a combination of text, arrows, and geometric shapes to convey complex ideas in a visually engaging way.\n    \n    In summary, the image presents a thought-provoking diagram that explores the dynamics of online behavior, particularly in the context of \"shitposting.\" By examining the relationships between different categories and concepts, the diagram offers insights into the ways in which individuals interact and engage with one another online.\n↓\n1266263384195862529 [2020-05-29] @visakanv 💜 595 🔁 141 💬 17\nSermonposting without shitposting gets you pedestalized, which is dehumanizing \n\nShitpost too much and nobody takes you seriously, which is also kind of dehumanizing\n\nYou can nerdpost forever quite happily, but it can be a lonely and frustrating experience\n\nThe flow is the point https://t.co/HYsXv2Bhpc\nImages:\n  - [Image #0] The image is a handwritten diagram on lined paper, featuring a central triangle surrounded by various phrases and arrows. The diagram appears to be a mind map or concept map, exploring the idea of \"puncturing the tyranny of solemnity\" and the importance of balance between different aspects of online behavior.\n    \n    Here is a detailed breakdown of the diagram:\n    \n    *   **Central Triangle:**\n        *   The triangle is drawn in blue ink and has no label.\n    *   **Surrounding Phrases and Arrows:**\n        *   **\"Puncture the tyranny of solemnity - don't take yourself too seriously - have a laugh with your friends\"**\n            *   This phrase is written at the top of the page, above the central triangle.\n        *   **\"Shitposting\"**\n            *   Circled and connected to the top of the triangle with an arrow.\n            *   Associated with the phrase \"who are my people?\" and the idea of being friendly.\n        *   **\"Friendly\"**\n            *   Written next to the top-right corner of the triangle.\n            *   Connected to the phrase \"people are force multipliers.\"\n        *   **\"Nerd\"**\n            *   Written next to the bottom-left corner of the triangle.\n            *   Associated with the phrase \"I want to know!\" and the idea of nerdposting.\n        *   **\"Ambiverts\"**\n            *   Written next to the bottom-right corner of the triangle.\n            *   Associated with the phrase \"what can I accomplish?\" and the idea of sermon posting.\n        *   **\"Sensemaking is multiplayer\"**\n            *   Written in a box to the left of the triangle.\n        *   **\"People are force multipliers\"**\n            *   Written in a box to the right of the triangle.\n        *   **\"Knowledge is power\"**\n            *   Written in a box below the triangle.\n        *   **\"Nerdposting\"**\n            *   Circled and connected to the bottom-left corner of the triangle with an arrow.\n            *   Associated with the idea of going on curiosity-driven, exploratory adventures of learning and delight.\n        *   **\"Sermon posting\"**\n            *   Circled and connected to the bottom-right corner of the triangle with an arrow.\n            *   Associated with the idea of creating vectors for people to be aligned on, setting the tone, and establishing the culture.\n    \n    In summary, the diagram explores the idea that online behavior should strike a balance between being\n↓\n1580377333143257091 [2022-10-13] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\n@visakanv you need three tiny QTable tweets with each of these phrases:\n\n- sensemaking is multiplayer\n- people are force-multipliers\n- knowledge is power\n\nmaybe with the graphic in each of them too\n\nthat you don't is a sign we're still underestimating this medium\nhttps://t.co/yAnGl5AJe5 https://t.co/QD2ASaqhlN\n  [Quoting @Malcolm_Ocean: say the obvious]\nImages:\n  - [Image #0] The image is a screenshot of a Twitter search results page. To reproduce it, create a black background and add the following elements:\n    * A gray search bar at the top with the text \"from:visakanv sensemaking is multiplayer\" in it.\n    * A navigation bar below the search bar with the following tabs: \"Top\", \"Latest\", \"People\", \"Photos\", and \"Videos\". The \"Top\" tab is highlighted in blue.\n    * A large, centered image of a cartoon chicken with a red head and yellow body, falling or flying through the air, with a light purple background behind it.\n    * White text below the image that reads, \"No results for 'from:visakanv sensemaking is multiplayer'\".\n↓\n1580379327861882880 [2022-10-13] @Malcolm_Ocean \n@visakanv honestly there's another half-dozen tweets in that graphic:\n\n1. nerd: I want to know!\n2. nerdposting: go on curiosity-driven, exploratory adventures of learning &amp; delight\n3. friendly...\n4. ...\netc\n\nI might call sermonposting \"visionposting\" or \"grandposting\" or something\n↓\n1627327637717716994 [2023-02-19] @forthrighter \n@Malcolm_Ocean @visakanv I think sermonposting and earnestposting are probably the same thing as it relates to things like value alignment\n\n===\n\n1451913443766898691 [2021-10-23] @relic_radiation 💜 8\nohhh intimate relationships involve *actually feeling emotionally close* to the other person\n\nnot just publicly associating with them\n\nohhhh\n↓\n1451913708674945026 [2021-10-23] @relic_radiation 💜 4\non one hand I already knew this. on the other, I’m feeling it in an embodied way now. \n\n“lightning bolts of duh” moment\n\nhttps://t.co/xOcWBfAlAB\n  [Quoting Tweet 1417029690955554818 (missing)]\n↓\n1451914493634678793 [2021-10-23] @JimmyRis 💜 1 [(SEED) type=quote_of_semantic_search]\n@relic_radiation https://t.co/XsOhyvencw\n  [Quoting @JimmyRis: Never stop gently pointing out obvious things]\n\n===\n\n1546576363976593411 [2022-07-11] @Malcolm_Ocean 💜 212 🔁 20 💬 39 [(SEED) type=root]\nsay the obvious\n├── 1546578857129492481 [2022-07-11] @JimmyRis 💜 11 [(SEED) type=quote_of_semantic_search]\n│   @Malcolm_Ocean &lt;3 https://t.co/n6HCpfzgRf\n│     [Quoting @JimmyRis: Never stop gently pointing out obvious things]\n├── 1577714825064583169 [2022-10-05] @loopholekid 💜 45 🔁 1\n│   @Malcolm_Ocean it's important to repeat things\n│   ↓\n│   1578191175495868417 [2022-10-07] @Malcolm_Ocean 💜 36 [(SEED) type=semantic_search]\n│   @loopholekid say the obvious again\n├── 1579926699780624387 [2022-10-11] @visakanv 💜 59\n│   @Malcolm_Ocean I love this tweet because I’m now going to QT it every time I feel like saying an obvious thing, which means other people will likely also want to say obvious things too\n│   ↓\n│   1579927370542088192 [2022-10-11] @visakanv 💜 17\n│   @Malcolm_Ocean as in, I get to set off cascades of obvious-thingsaying. delightful\n│   ↓\n│   1579998318889140224 [2022-10-12] @Malcolm_Ocean 💜 10\n│   @visakanv you've got yourself to thank for this (in part)\n│   \n│   because it's by your example and explanation that I started tweeting things for the purpose of functioning as reusable pithy QTs\n│   ↓\n│   1579998837514833920 [2022-10-12] @visakanv 💜 3\n│   @Malcolm_Ocean iiiiits happenin!!\n│   \n│   https://t.co/zOu5v9O7QT\n│     [Quoting @visakanv: Now that more of us are playing the threading game:  As we compete+collaborate effectively articulate things we all care about,  And weave each other’s thoughts into our respective webs,  The desire paths will assemble a mindcity paved with the best individual thoughts]\n│   ↓\n│   1579999094126542848 [2022-10-12] @visakanv 💜 6\n│   @Malcolm_Ocean already crazy how in ~3-4 years what felt novel now feels normal\n│   \n│   twitter didn't yet natively show QTs until over a year later\n│   \n│   https://t.co/1sr9lwjcCr\n│     [Quoting @visakanv: Nice  Here’s my #1 rec for @twitter: realize that quote tweets are a killer feature of your product. Add it as a separate part of notifications besides All and Mentions. And separate it from RTs. Ie make it “likes, RTs, QTs”. Sounds radical? It’ll push this game into hyperdrive https://t.co/sVuqnoC13t]\n│   ↓\n│   1580002030873378816 [2022-10-12] @Malcolm_Ocean 💜 3\n│   @visakanv so true https://t.co/VWGxyAjIOT\n│   Images:\n│     - [Image #0] The image is a still from a movie or TV show, with the text \"IT'S HAPPENING!\" superimposed over it. The man in the center of the image is wearing a gray button-down shirt and has short brown hair, standing in front of a microphone with a headset around his neck, looking to the left with a surprised expression.\n│   ↓\n│   1580002226059509760 [2022-10-12] @Malcolm_Ocean 💜 2\n│   @visakanv https://t.co/jCv9j4PIKo\n│     [Quoting Tweet 535237650630733824 (missing)]\n├── 1600183938961780740 [2022-12-06] @uberstuber 💜 34 🔁 2\n│   @Malcolm_Ocean hacks are actively harmful without solid fundamentals\n│   ↓\n│   1600236079965085697 [2022-12-06] @Malcolm_Ocean 💜 14 🔁 1\n│   @uberstuber yup\n│   https://t.co/B0AQO3Fb1r\n│     [Quoting Tweet 1598555342262398978 (missing)]\n├── 1600717170786570240 [2022-12-08] @AskYatharth 💜 20\n│   @Malcolm_Ocean https://t.co/JvXcFgNQ5O\n│     [Quoting @AskYatharth: people’s experiences are important to them]\n│   ├── 1601407847262490624 [2022-12-10] @Malcolm_Ocean 💜 8\n│   │   @AskYatharth yo this is a good one\n│   │   \n│   │   can we make it even obviouser?\n│   │   https://t.co/Ts25aoxFHc\n│   │     [Quoting @Malcolm_Ocean: consider something you understand that others don't — maybe a recent tweet or blog post  see if you can articulate it as a tautology  share results below]\n│   │   ↓\n│   │   1601410764010827777 [2022-12-10] @AskYatharth 💜 9\n│   │   @Malcolm_Ocean ooo, directionally like this?  https://t.co/o4vkZbpuTI\n│   │     [Quoting @AskYatharth: people’s experience of an event are what was important to them about it]\n│   │   ↓\n│   │   1602039065855275008 [2022-12-11] @Malcolm_Ocean 💜 5\n│   │   @AskYatharth yeah, nice! that's fucking great. reminds me of another ~tautology of mine that I haven't tweeted, hang on...\n│   │   \n│   │   (you don't actually have to hang on since I'm gonna tweet it before I tweet this tweet)\n│   │   \n│   │   ...boom:\n│   │   https://t.co/eYDwzYi7dD\n│   │     [Quoting @Malcolm_Ocean: if I try to tell someone something, and they respond with an objection that's entirely irrelevant to what I meant  what they respond with is entirely relevant to what THEY thought I meant*, and that's what I need to dialogue with  *otherwise they would have said something else]\n│   └── 1738427457936691610 [2023-12-23] @franki3stone 💜 1\n│       @AskYatharth @Malcolm_Ocean They’re often more important than time or money:\n├── 1625549847863635968 [2023-02-14] @visakanv 💜 90 🔁 6\n│   @Malcolm_Ocean https://t.co/j2DOseiGel by @sivers https://t.co/6s8clKiutd\n│   Images:\n│     - [Image #0] The image is a text-based graphic on a black background, with white text that reads:\n│       \n│       \"Any creator of anything knows this feeling:\n│       You experience someone else's innovative work. It's beautiful, brilliant, breath-taking. You're stunned. Their ideas are unexpected and surprising, but perfect.\n│       \n│       **You think, \"I never would have thought of that. How do they even come up with that? It's genius!\"**\n│       \n│       Afterwards, you think, \"My ideas are so obvious. I'll never be as inventive as that.\"\n│       \n│       I get this feeling often. Amazing books, music, movies, or even amazing conversations. I'm in awe at how the creator thinks like that. I'm humbled.\n│       \n│       But I continue to do my work. I tell my little tales. I share my point of view. Nothing spectacular. Just my ordinary thoughts.\n│       \n│       One day someone emailed me and said, \"I never would have thought of that. How did you even come up with that? It's genius!\"\n│       \n│       Of course I disagreed and explained why it was nothing special.\n│       \n│       But afterwards, I realized something surprisingly profound:\n│       \n│       **Everybody's ideas seem obvious to them.**\n│       \n│       I'll bet even John Coltrane or Richard Feynman felt that everything they were playing or saying was pretty obvious.\n│       \n│       **So maybe what's obvious to me is amazing to someone else?**\n│       \n│       Hit songwriters often admit that their most successful hit song was one they thought was just stupid, even not worth recording.\n│       \n│       We're clearly bad judges of our own creations. We should just put them out there and let the world decide.\n│       \n│       **Are you holding back something that seems too obvious to share?**\"\n├── 1713173334463324327 [2023-10-14] @JustAnkurBagchi 💜 1\n│   @Malcolm_Ocean Be kinder.\n├── 1762934901341569343 [2024-02-28] @Malcolm_Ocean 💜 4\n│   https://t.co/MWPToExn4f\n│     [Quoting Tweet 1762593034984734828 (missing)]\n└── 1763045869916688677 [2024-02-29] @RomeoStevens76 💜 14 🔁 2\n    @Malcolm_Ocean Most of the alternative lives people like to read about vicariously come with tradeoffs that most people would find totally untenable.\n\n===\n\n1546576429705461764 [2022-07-11] @Malcolm_Ocean 💜 5 [(SEED) type=quote_of_root]\nmy friends in the other room: what time is it?\nother friends: various improv yes-and'y riffs on time\nfirst friends: WHAT TIME IS IT?!?\nme: 9:20\nfirst friends: THANK YOU!\nother friends: oh that was an actual question\nme:\nhttps://t.co/yAnGl5j8mx\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1578021523704598528 [2022-10-06] @Prigoose 💜 1\n@Malcolm_Ocean it's time to give cryptic answers\n\n===\n\n1559412309600387072 [2022-08-16] @Malcolm_Ocean 💜 9 🔁 1 [(SEED) type=quote_of_root]\ndo unusual things until new things are unusually obvious to you\n\nthen\nhttps://t.co/yAnGl5jGc5\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1559423865327067138 [2022-08-16] @aleksil79  [(SEED) type=quote_of_root]\nRT @Malcolm_Ocean: do unusual things until new things are unusually obvious to you\n\nthen\nhttps://t.co/yAnGl5jGc5\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1560097444326961152 [2022-08-18] @SurenVynn 💜 7 [(SEED) type=semantic_search]\nsay the obvious\n↓\n1560121866634665985 [2022-08-18] @m_ashcroft 💜 6\n@SurenVynn THE OBVIOUS\n↓\n1560121952563789825 [2022-08-18] @SurenVynn 💜 2\n@m_ashcroft THE OBVIOUS\n↓\n1560131811534987267 [2022-08-18] @VividVoid_ 💜 1\n@SurenVynn @m_ashcroft THE OBVIOUS\n\n===\n\n1560189320308596741 [2022-08-18] @Malcolm_Ocean 💜 4\nstriking how writing longer stuff vs shorter stuff has such nonlinear scaling effects\n\nI'm working on a 4k word (&amp; far from finished) piece I started last week and it's taken me an hour to get to writing full new coherent paragraphs, because I had to re-read / edit / get oriented\n↓\n1560189322082779136 [2022-08-18] @Malcolm_Ocean 💜 2 [(SEED) type=quote_of_root]\nI am uhh definitely not the first person to observe this, but I figured I would share with the world that I am observing it also. Now you know.\n\nThis is what the world looks like from my vantage point right now.\nhttps://t.co/yAnGl5jGc5\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1562420557458464768 [2022-08-24] @m_ashcroft 💜 31 🔁 1 💬 1\npretty sure my core talking point is \"you can only respond to what you notice\"\n\neverything else is elaboration that flows from there\n\nincidentally (i think) this is an incredibly important and under-appreciated point and i will continue to beat the drum \n\nhttps://t.co/2IgZsarztt\n  [Quoting @m_ashcroft: I have a talking point that I want to bang on about more in different ways  that is \"you can only respond to what you notice\"  not being able to notice something (if it lies outside your awareness) renders you choiceless  expanding your capacity to notice things gives you agency]\n↓\n1614562551341383680 [2023-01-15] @visakanv 💜 4 💬 1\n@m_ashcroft do a standalone tweet of this for future QTs and to thread other stuff under it pls\n↓\n1614563178460979202 [2023-01-15] @m_ashcroft 💜 2\n@visakanv you mean tweet just this phrase on its own?\n↓\n1614563833758248964 [2023-01-15] @visakanv 💜 3 [(SEED) type=quote_of_root]\n@m_ashcroft yea, like https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1614565664240320512 [2023-01-15] @m_ashcroft 💜 7\n@visakanv I did the thing, I am excited to find out why https://t.co/nSAQWQGhM2\n  [Quoting @m_ashcroft: you can only respond to what you notice]\n\n===\n\n1565824335075475457 [2022-09-02] @relic_radiation 💜 3\n✧·ﾟ: * notes from our second session of somatic emotional group coaching with @JamesMayfield_ *:·ﾟ✧ https://t.co/A3tVbI4NHr\n  [Quoting @relic_radiation: community emotional healing event! @JamesMayfield_ is the best trauma healer / somatic coach I've personally met, &amp; now he's affordable &amp; accessible on the internet.  2hr of drop-in online group coaching for a month. he'll run it with his decade of xp, I'm there to learn &amp; promo https://t.co/NrTmjW4PTP]\n↓\n1565824749242138629 [2022-09-02] @relic_radiation 💜 3\n@JamesMayfield_ \"Grief is not bad. Anger is not bad. Grief is wisdom. Anger is wisdom.\"\n\n- ah it's one thing to tweet this. another to witness it said, in the moment, to someone else's long-forsaken grief and anger found in their body 🥲\n↓\n1565824932273164289 [2022-09-02] @relic_radiation 💜 2 [(SEED) type=quote_of_semantic_search]\n\"Grief is not bad. Anger is not bad. Grief is wisdom. Anger is wisdom.\"\n\nhttps://t.co/jwpmUZXH4U\n  [Quoting @JimmyRis: Never stop gently pointing out obvious things]\n↓\n1565825713722335234 [2022-09-02] @relic_radiation 💜 3\n\"Usually when we feel tension, we pull away from it. That's not what we're doing here. This tension is wisdom.\"\n\n- @JamesMayfield_\n↓\n1565826426594549760 [2022-09-02] @relic_radiation 💜 5\nmy main takeaway: wow, what RELIEF to watch someone else skillfully work w intense emotions. I'm so stoked about my role 'hosting' this and logisticating, without facilitating the emotional work myself. \n\nwhat balm for the overwhelmed, emotionally-parentified younger part of me💜\n↓\n1565826707424219136 [2022-09-02] @relic_radiation 💜 2\nnotes from part 1 here: https://t.co/WPaHGvbnaZ\n  [Quoting @relic_radiation: notes from our first somatic group coaching session, with @JamesMayfield_ yesterday! 🌿]\n↓\n1565827996962893824 [2022-09-02] @relic_radiation 💜 3\n\"A lot of my work is about balancing connection and power. A lot of people early on choose one or the other -\n\n&amp; then they think it's part of their personality, when it's really a coping mechanism from a young part.\"\n\n( theory is nice, *finding* it in-session is a trip &amp; a half )\n↓\n1565828879494815745 [2022-09-02] @relic_radiation 💜 3\nI feel like I'm becoming more human from watching (well, \"entering a space of sacred witness\") as other people have emotions. &amp; moreover, move through them!\n\n🥲 I'm honored to share energetic space with all y'all who attended. learning and growing so much\n\n===\n\n1577712873916071936 [2022-10-05] @visakanv 💜 101 🔁 3 [(SEED) type=quote_of_root]\na thing that i've spent a lot of time and energy practicing over the years, such that i take it for granted, is that i've learned to calibrate my replies for ~maximal interestingness. might be worth talking out loud about it for a bit https://t.co/gB9wqJHWQj\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1577715641783418880 [2022-10-05] @visakanv 💜 37 🔁 1\n│   I mean at the most basic level like, simply taking a moment to think \"hm, what would be interesting?\" I think instantly puts you above like 98% of people who respond thoughtlessly (which is &gt;~50% of replies? depending). \n│   \n│   yes this takes effort but the reward is disproportionate\n│   ↓\n│   1577715845299478530 [2022-10-05] @visakanv 💜 28\n│   once you've decided that ok i'm willing to put in some effort into doing good replies, then it becomes a question of, alright what would be compelling? what would be constructive? what makes OP look good? what adds interesting texture and dimension to the discussion?\n│   ↓\n│   1577716365221191680 [2022-10-05] @visakanv 💜 22\n│   not every single thing can be responded to in an interesting and constructive way. cool thing about a place like twitter – though this is true of everywhere – is that you can skip past things that are \"poor setups\" (subjective!) and look for setups where you can hit out the park\n│   ↓\n│   1577718246257483776 [2022-10-05] @visakanv 💜 18 🔁 1\n│   I think the overall posture/premise/orientation is the most critical thing. every day i scroll thru the timeline and i'm really struck by how most people just... don't see the big picture, long game, etc. and of course, i wanna be careful to say, you shouldn't feel *obligated* to\n│   ↓\n│   1577718497345384448 [2022-10-05] @visakanv 💜 36 🔁 1\n│   I just come from a place, personal history, worldview, etc where it's v obvious to me that good replies done consistently over an extended period of time is a powerful creator of wealth, meaning, relationships, ie it's \"free real estate\". but ok maybe it's too much work for ppl\n│   ↓\n│   1577718848228274176 [2022-10-05] @visakanv 💜 25 🔁 1\n│   i imagine lots of people feel similar things in their respective domains. like a meditation teacher might be amused to witness how stressed people are, a fitness teacher might be amused to witness how unfit we are. everyone is struggling, overwhelmed and unrealized on many fronts\n│   ↓\n│   1577720328167469057 [2022-10-05] @visakanv 💜 33 🔁 1 💬 1\n│   good reply game is, in a sense, the unit of currency of socializing. all socializing is collaboration, all collaboration is humanizing. when you get good at collaborating, you get good at getting people to help you, including meditation &amp; fitness teachers etc. I find that so fun\n│   ↓\n│   1577722259782836224 [2022-10-05] @visakanv 💜 18\n│   if you get good at replies, it becomes ~easy to accumulate status. tho u do have some choice about whether or not you want to hold on to that. personally, i'm curious to see what interesting, valuable, prosocial things can be done with status (scenebuilding etc). there are costs\n│   ↓\n│   1577723218047049729 [2022-10-05] @visakanv 💜 21 🔁 2\n│   it's sensible to avoid accumulating more status than you want, than you find useful. and if you're not sure of yourself, it's sensible to take it slow. too much too fast with no clear idea of what you want and you'll get swept up in forces beyond your perception and/or control\n│   ↓\n│   1577724038708797440 [2022-10-05] @visakanv 💜 46 🔁 4\n│   music is always an excellent entrypoint for thinking about this stuff. \"my job is not to just play with him, my job is to make him sound better.\"\n│   \n│   https://t.co/yShIMh5pGa\n│     [Quoting @visakanv: I truly can't with this man. Galaxy brain shit. Musical magician 🤯 https://t.co/Mtufs9qcKc]\n├── 1577717408663572493 [2022-10-05] @abhayance 💜 1\n│   @visakanv @Malcolm_Ocean 2x2 obvious vs interesting\n│   ↓\n│   1578192660795314177 [2022-10-07] @Malcolm_Ocean 💜 1\n│   @abhayance @visakanv first thought is the actual Q is just whether it's interesting to you\n│   \n│   if something is obvious to you &amp; also interesting to you, probably good\n│   \n│   but sometimes I see a tweet &amp; I have an obvious reply &amp; I'm like \"fuck but then if someone replies to *me* then I'll have to talk abou—\n└── 1578192199354761217 [2022-10-07] @Malcolm_Ocean 💜 3\n    @visakanv my gloss of how to do this in a way that feels like fun rather than drudgery is \"find the places where there's an obvious interesting reply you can make that feels exciting to make\" (even if it involves stretching to explain something anew)\n    \n    https://t.co/5rm1jjGhSj\n      [Quoting @Malcolm_Ocean: I want to find the things that are worth doing &amp; where it'd be harder   for me NOT to do them than to do them.]\n\n===\n\n1577786458491916288 [2022-10-05] @__drewface 💜 306 🔁 20 [(SEED) type=quote_of_root]\nmany lovely people feel depressed, lonely, and uninspired because they are in a depressing, lonely, and uninspired environment, and it has nothing to do with them.\n\nThere are actually pretty easy fixes (like moving and quitting your job), but it's upsetting and hard to admit that https://t.co/Asmucl3RMs\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1577788758400851971 [2022-10-05] @nosilverv 💜 14\n│   @__drewface woah, buddy, that implies hyper-individualism isn't true you sure you wanna head out that road\n│   ├── 1577798118690721792 [2022-10-05] @__drewface 💜 2\n│   │   @nosilverv I think oddly enough that both are true\n│   └── 1577805370030018560 [2022-10-05] @TylerAlterman 💜 8\n│       @nosilverv @__drewface Had to admit this to myself for the 1000th time today\n├── 1577789274979704832 [2022-10-05] @ElodesNL 💜 11\n│   @__drewface I am 100% in this tweet. fuck\n│   ↓\n│   1577798762155630594 [2022-10-05] @__drewface 💜 11\n│   @ElodesNL My rec would be to join a residency with inspiring people asap. I'd recommend @medleyberlin, their initial cohort seems pretty stacked. @_ArnaudS_ is up to something here.\n│   \n│   Or build your own with the homies. You're welcome on our couch if you want to couchsurf NY.\n│   ↓\n│   1579569700677509120 [2022-10-10] @ElodesNL 💜 2\n│   @__drewface @medleyberlin @_ArnaudS_ I've been to Medley, it's a wonderful team and their cohort has amazing people. Can't do remote work at my current coding job tho so visiting for a longer period would be tough. as soon as I've got a remote job I will be visiting a whole bunch of places though ❤️‍🔥\n└── 1577792852318425089 [2022-10-05] @IaimforGOAT 💜 15\n    @__drewface If I were rich I would create something like this at scale. 3m to a year, all expenses paid.\n    \n    Step away Thiel Fellowship, Heal Fellowship is coming. \n    \n    https://t.co/BZMlxqheX4\n      [Quoting @IaimforGOAT: AirBnB but you don't pay for an empty house. You pay for a full house in a family which is both happy and welcoming.  You experience what it is like to stay some time in a random city AND you get to experience what it feels like to be in a family with (hopefully better) dynamics]\n    ↓\n    1577797887462891521 [2022-10-05] @__drewface 💜 12\n    @IaimforGOAT Why not create something like this now? I'm already doing this. Sure, it's not at scale, but if 10 of us do it and blog about it, then we become 100. Do things that don't scale.\n    ↓\n    1577800708073693189 [2022-10-05] @IaimforGOAT 💜 4\n    @__drewface Being rich would be a proxy to having most of my own things sorted out tho, which sadly I am not there yet.\n    \n    Rn I'm closer 2 the side of the spectrum that needs to have something like this than the side that can build it. 😅\n    \n    But I'm glad you and others are exploring this idea!\n    ↓\n    1577844793715167232 [2022-10-06] @__drewface 💜 6\n    @IaimforGOAT I was earning $24k per year for quite some time while doing organizing. It's not really finance constrained.\n    \n    I was in a privileged and wealthy position in a lot of ways, but finances weren't one of them.\n    \n    The first time i organized coliving, we found roommates on Craigslist!\n\n===\n\n1579926088846671872 [2022-10-11] @visakanv 💜 87 🔁 6 [(SEED) type=quote_of_root]\nagreeable people and disagreeable people each get screwed in different ways that are very predictable once you take a moment step back to think about it https://t.co/3WyYhoJgRF\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1579926324860182530 [2022-10-11] @visakanv 💜 15\nhttps://t.co/XUW46CG6mb\n  [Quoting @visakanv: each has a weak spot, right? if you're too agreeable, people get to exploit you, take advantage of you, walk over you. you need some hard boundary somewhere. if you're too disagreeable, you win lots of skirmishes, but people can resent you. and you're vulnerable to slights]\n\n===\n\n1580585051104096257 [2022-10-13] @Malcolm_Ocean 💜 8\nI'm having a really satisfying experience of writing a summary of my worldview where each paragraph begins with \"It seems to me that:\"\n\nIt makes space for the rest of the paragraph to be clear &amp; bold &amp; non-hedging &amp; brief, without coming across as dogmatic or \"you should agree\"\n↓\n1580585052454649856 [2022-10-13] @Malcolm_Ocean 💜 1 [(SEED) type=quote_of_root]\nin other words, it makes it a lot more straightforward for me to say what's obvious to me that may not be obvious whatsoever to others, without any sense of argument\n\nhttps://t.co/yAnGl5jGc5\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1580585054233034752 [2022-10-13] @Malcolm_Ocean 💜 1\nlyrics from a song I started playing around with last year:\nhttps://t.co/CUnf6dCYEb\n  [Quoting @Malcolm_Ocean: 🎶 from this point of view 🎵 it's kinda obvious... that this point of view 🎶 isn't obvious from other points of view]\n↓\n1580585055734595585 [2022-10-13] @Malcolm_Ocean 💜 5\nsomething obvious to me about why this works that may not be obvious to *you*: \"it seems to me\" is much closer to the heart than \"I think\"\n\n\"I think\" feels like a flimsy opinion someone can just dismiss as wrong\n\"it seems to me\" is describing reality—from your perspective\n\n===\n\n1581299541638516736 [2022-10-15] @__drewface 💜 30 🔁 4 [(SEED) type=quote_of_root]\nthe best education money can buy is still not very good https://t.co/AsmuckMOKs\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1581300071391297537 [2022-10-15] @__drewface 💜 7\nEspecially for adolescents.\n\n===\n\n1600058981447344128 [2022-12-06] @visakanv 💜 270 🔁 23 [(SEED) type=quote_of_root]\nit's good for a person to experience multiple social contexts\n\nit's not healthy to have most of your life overly constrained within a single social context https://t.co/gB9wqJqlYL\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1600062886600380418 [2022-12-06] @visakanv 💜 82 🔁 3\n│   it's good for children to spend time away from family\n│   \n│   once you have a friend group it's good to spend time away from that friend group\n│   \n│   once you have a job it's good to spend time talking with people who aren't your colleagues, and people who aren't in your industry\n│   \n│   and so on\n│   ↓\n│   1600063199482884097 [2022-12-06] @visakanv 💜 66 🔁 2\n│   it's good to spend time talking with people significantly older and younger than you\n│   \n│   it's good to travel beyond your hometown, and beyond your home country if you can manage it\n│   \n│   it's good to witness a scene that \"isn't yours\", music or art or food, whatever\n│   ↓\n│   1600064005569417226 [2022-12-06] @visakanv 💜 45\n│   whenever I'm invited to speak at some community event – and I'm sort of like a beloved travelling cousin to a bunch of communities – I tend to say something like, \"what you guys have here is amazing, I love it, and I wish you all a very merry Fuck Off From Here From Time To Time\"\n└── 1600307761866326016 [2022-12-07] @yashkaf 💜 15\n    @visakanv if you're a rationalist who's lived in Berkeley/SF since you got out of college, this tweet is for you\n\n===\n\n1600065781890441216 [2022-12-06] @RichDecibels 💜 270 🔁 16 [(SEED) type=quote_of_root]\nsubcultures that don't actively support babymaking don't last long https://t.co/45jadcqybP\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1600113050555543552 [2022-12-06] @blisstweeting 💜 24\n@RichDecibels monks lol\n\n===\n\n1600071406812684294 [2022-12-06] @tasshinfogleman 💜 48 🔁 1 [(SEED) type=quote_of_root]\nif you are not kind to others you will be very lonely, but if you are kind to others you will have many friends who love you dearly https://t.co/mCE9fwkerB\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1600169714449121280 [2022-12-06] @eshear 💜 20 🔁 2 [(SEED) type=quote_of_root]\nthe culture you live in is just how people behave, day to day. and those behaviors are shaped primarily by what actions are perceived to be rewarded and what actions are perceived to be punished. https://t.co/9e78QqiSnx\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1600236503258476545 [2022-12-06] @Malcolm_Ocean 💜 1\n@eshear even more simply: shaped by what works and what doesn't work\n\nwhether that's interpreted in terms of reward &amp; punishment is an additional layer added on top\n\n===\n\n1600352591426113536 [2022-12-07] @AskYatharth 💜 4 [(SEED) type=quote_of_root]\ndo what you want https://t.co/uAICGFJuws\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1600352595071348737 [2022-12-07] @AskYatharth 💜 2\nbut gotta 1. figure out what you want 2. create the life situations to be able to follow those wants. both are non-trivial\n↓\n1600352596656812033 [2022-12-07] @AskYatharth 💜 2\nthe great part is you don’t have to have figured out what you want. you start learning to do what you want by trying to do what you want, even if you’re bad at it\n\n===\n\n1600404616721551360 [2022-12-07] @Malcolm_Ocean 💜 11 🔁 1 💬 1 [(SEED) type=quote_of_root]\nsay the obvious even if you've said it before https://t.co/yAnGl5AJe5\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1600404618910920704 [2022-12-07] @Malcolm_Ocean 💜 7 🔁 2\n│   your worldview has evolved since the last time you said the obvious\n│   https://t.co/0u7rjUtNZ9\n│     [Quoting @eshear: I used to struggle w needing to be “creative” or “original” in my work. At some point I had a breakthrough that really helped me: I cannot repeat an idea, no matter how basic or common, without imparting some of my worldview into it.]\n└── 1600585848642277385 [2022-12-07] @sensefulronin 💜 3\n    @Malcolm_Ocean Check to see if it has been done before in order to relieve some of that \"I have to take action!\" stress.\n\n===\n\n1600406293117739009 [2022-12-07] @the_wilderless 💜 15 🔁 1 [(SEED) type=quote_of_root]\nMythopoetic cognition is the engine of mind https://t.co/8PLZMoeuxZ\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1600456789975216128 [2022-12-07] @the_wilderless 💜 5\nhttps://t.co/yVozIkPCB0\n  [Quoting @the_wilderless: Mythopoetic cognition is the engine of mind https://t.co/8C3TWBDwF1]\n\n===\n\n1600426157165379584 [2022-12-07] @DRMacIver 💜 28 🔁 3 [(SEED) type=quote_of_root]\nThe thing you used to think was good and now think is bad is probably still good, you just fucked it up and then overcorrected. https://t.co/jSRslZ1F8K\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1600595108830642176 [2022-12-07] @bierlingm 💜 3 🔁 1 [(SEED) type=quote_of_root]\nthis message draws out personal convictions https://t.co/deKVTiWFQ6\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1601409794153205760 [2022-12-10] @Malcolm_Ocean 💜 2\n@bierlingm and yet\nhttps://t.co/sFM0kEmj8u\n  [Quoting @QiaochuYuan: every statement a person makes about themselves, their lives, the nature of reality etc. has a shadow statement. in order to find it worthwhile to say a thing you must simultaneously be aware of the possibility of it being false, or else it wouldn't even occur to you to say]\n\n===\n\n1609586085470040064 [2023-01-01] @visakanv 💜 39 🔁 1 [(SEED) type=quote_of_root]\naction and reflection should happen in cycles, like inhale-exhale, day-night, yin-yang. if you get stuck on one or the other you're going to have a bad time\n\nhttps://t.co/gB9wqJqTOj https://t.co/aE8bKxlSeO\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1609991013099241472 [2023-01-02] @visakanv 💜 96 🔁 9 💬 1 [(SEED) type=quote_of_root]\nyou can scroll past a thing and not talk about it https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1609996338414112768 [2023-01-02] @visakanv 💜 42 🔁 1\nit's worth doing an inventory of all of your utterances and asking yourself how they are serving you, what outcomes they are leading to, and whether those are outcomes you like\n\nit's worth being deliberate about this because it can reshape your reality\n\nhttps://t.co/Zn2QbrEFrr\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1609996690844700673 [2023-01-02] @visakanv 💜 41 🔁 5\nyour attention is currency. what are you choosing to spend it on? why? what are you sharing with your peers? why? how do you see it playing out over the next year, 5 years, 10 years? what sort of life do you want for yourself?\n\n===\n\n1610154782685286400 [2023-01-03] @visakanv 💜 62 🔁 3 [(SEED) type=quote_of_root]\ndifferent spaces have different norms https://t.co/3WyYhosdPF\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1610155856523591681 [2023-01-03] @visakanv 💜 41 🔁 1\n│   the norms you are accustomed to are not all the norms there are\n│   ↓\n│   1610155956914249728 [2023-01-03] @visakanv 💜 37 🔁 1\n│   you can experience a different set of norms by seeking out different spaces\n│   ├── 1610211880122945536 [2023-01-03] @RichDecibels \n│   │   @visakanv careful policing of norms is one of the most generative things you can do\n│   └── 1610243029197283330 [2023-01-03] @Malcolm_Ocean 💜 2\n│       @visakanv also we are constantly co-creating our norms, and some norms are loose and can be changed by someone proposing something different even once\n│       \n│       eg I recently set off an abundance vibes chain of 4 \"I'll pay for dinner today\"s (vs settling up via venmo)\n│       \n│       https://t.co/CSQuGmjfP0\n│         [Quoting Tweet 1404558294673367040 (missing)]\n└── 1610242371484291074 [2023-01-03] @Malcolm_Ocean 💜 2\n    @visakanv also, different spaces have different meta-norms, ie ways of relating to norms and the maintenance of norms\n    \n    broadly these include\n    https://t.co/jQOwgbuhRZ\n      [Quoting @Malcolm_Ocean: @anielsen108 @justchap Pre-modern norms: \"that's just the way things are done\"  Modern norms: \"this way is correct because...\"  Postmodern norms: 　҉҉҉͌͌͌҉͎ͦ͞͝҉͟҈ͦ͞͡҉̅҈͠҉͞҈̲ͬ͟҈  Metamodern norms: \"we have common knowledge that X→Y, &amp; we all don't like Y, so we don't do X\" ⬅️not actually normative!]\n\n===\n\n1615200447505272832 [2023-01-17] @visakanv 💜 41 🔁 4 💬 1 [(SEED) type=quote_of_root]\nwrite your first chapter last https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1615233794184998912 [2023-01-17] @the_wilderless 💜 7\n@visakanv Literally only realized this last week, you could have saved me so much time on this goddamn thing\n\n===\n\n1631246275743043587 [2023-03-02] @alex_with_ease 💜 9\nThis will be a thread of me restating common tpot sayings.\n↓\n1631246858084286464 [2023-03-02] @alex_with_ease 💜 4\nCourageously attend to what you want to flourish\n\nhttps://t.co/9Cxc0UgX0a\n  [Quoting @visakanv: focus on what you want to see more of]\n↓\n1631382191992102912 [2023-03-02] @alex_with_ease 💜 8 🔁 1\nwhen you feel tempted to substitute someone else's wisdom for your own, ponder \"how did I recognize this wisdom?\" and follow the source of that\nhttps://t.co/FE3Q4bD7yI\n  [Quoting Tweet 1608061231918878721 (missing)]\n↓\n1636726080995196933 [2023-03-17] @alex_with_ease 💜 2\nYour worth does not depend on others' opinions or your comparison to them.\nJust keep going and being kind to yourself.\n\nhttps://t.co/kGs5rCpiVL\n  [Quoting @VividVoid_: You are not inferior to anyone. Good night. I love you. See you in the morning. https://t.co/EeDR1fsZkZ]\n↓\n1650061515272212482 [2023-04-23] @alex_with_ease 💜 2\nIf you want to get better at something, don't do a thing once, don't even do it a few times, do a thing many times.\n\nYou need enough to be able to look back and find patterns, to develop taste.\n\nhttps://t.co/gkuY84OAEK\n  [Quoting @visakanv: you don't need to do 100 things before you start examining the things you've made. about every 5-7 things usually reveals something you can learn from, if you pay a little attention and be a little curious]\n↓\n1695829528558321990 [2023-08-27] @alex_with_ease 💜 1\nLive from desire, seek out resonance\n\nhttps://t.co/S8pKVX6bFe\n  [Quoting @the_wilderless: live urgently, seek resonance]\n↓\n1759291710213849486 [2024-02-18] @alex_with_ease 💜 2 [(SEED) type=quote_of_root]\nWhat is obvious to you is not obvious to everyone\nhttps://t.co/HxirxqCPfg\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1819819081442209976 [2024-08-03] @alex_with_ease \nThe era of the Internet has just begun\n\nhttps://t.co/lgLWIJIAPC\n  [Quoting @visakanv: when I meditate deeply and become absolutely still, it becomes clear to me that society has still not even really begun to understand the power and potential of social media]\n\n===\n\n1635531680869142528 [2023-03-14] @Malcolm_Ocean 💜 9\nanybody out there have a malcolm totem? what's it do? https://t.co/AfpZ8CYnPX\n  [Quoting @_brentbaum: creating these days: let's tap into tasshin courage and inhabit mage presence to write a nibras prayer of a river manifesto with anansi aliveness guided by silvia spirit and ivan bravery  totems totems totems each and every one of you]\n↓\n1635660656597712896 [2023-03-14] @strangestloop 💜 2 [(SEED) type=semantic_search]\n@Malcolm_Ocean it says the obvious\n\n===\n\n1642362984717484033 [2023-04-02] @strangestloop 💜 7 [(SEED) type=semantic_search]\nmay you say the obvious ❤️\n\n===\n\n1663283409966501889 [2023-05-29] @visakanv 💜 72 🔁 6 [(SEED) type=quote_of_root]\ni should talk with my friends more https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1663297712798806022 [2023-05-29] @m_ashcroft 💜 5\n@visakanv 👋\n\n===\n\n1663291587093495808 [2023-05-29] @Malcolm_Ocean 💜 60 🔁 4\nI'm realizing that when I try to aim to MAKE MORE MONEY, I feel selfish &amp; grabby\n\nbut I feel more sane &amp; Whole-some when I aim to HELP MORE PEOPLE, in sustainable ways\n\nwhen I aim to CREATE MORE WEALTH, while capturing a similar fraction of the wealth I create as I do now\n↓\n1663291588066566144 [2023-05-29] @Malcolm_Ocean 💜 17\nlike yes, I need more money in order to have the life I want to have. but I'm seeing if I can reorient towards the idea that if I'm not making enough money that that means either:\n- I'm not helping the world enough\n- I don't have my wealth-creation hooked up to my own engine\n↓\n1663291588968333312 [2023-05-29] @Malcolm_Ocean 💜 26\nthis makes me realize that in some ways, by keeping my business super small, that I've been being... not exactly \"selfish\", but... not as *kind* as I could be being!\n\nwhich transforms my ambition into \"how can I become more kind? how can I serve the world better?\"\n↓\n1663291589991747584 [2023-05-29] @Malcolm_Ocean 💜 12\nimportantly, I'm not considering myself to have obligations here to be kind or serve the world\n\nI only need to help the world enough that it helps ME enough for me to have the life I want.\n\n(more than that, I can do if I want to! which I often do)\nhttps://t.co/2hbhhnyELk\n  [Quoting @Malcolm_Ocean: &gt; the moral value of an individual's actions depends solely on the impact on other individuals, regardless of the consequences on the individual themself  this is quite precisely cucked https://t.co/tzU7H9Da4o]\n↓\n1663291591145185280 [2023-05-29] @Malcolm_Ocean 💜 9\nI'm not saying this can't also goodhart\n\nlots of grifters convince themselves that they're helping people and that the people who don't finish the their expensive courses they pressured them into buying are just lazy or whatever\n↓\n1663291591992414208 [2023-05-29] @Malcolm_Ocean 💜 11\nbut it seems to at least start from a better place\n\nI guess in some ways this whole thing is the same idea as this quote from one of the main inspirations for my business:\nhttps://t.co/8aNHuk7I0o\n  [Quoting Tweet 1663291147727548416 (missing)]\n↓\n1663291593120677888 [2023-05-29] @Malcolm_Ocean 💜 10\nanyway, the proof is in the pudding &amp; so far I've neither helped more people nor made more money, so don't take this thread as having much credibility\n\nwe'll see if this reframe/re-aim helps me over the coming months &amp; years. it feels right.\n\nhow do you think about it?\n↓\n1663434670141505536 [2023-05-30] @AskYatharth 💜 1 [(SEED) type=quote_of_root]\n@Malcolm_Ocean sounds like you got some blocks about this others don't\nhttps://t.co/DuOm7dEOI7\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1663435383278030849 [2023-05-30] @AskYatharth \n│   @Malcolm_Ocean happy to expand in dm or reply\n│   ↓\n│   1664498699786137600 [2023-06-02] @Malcolm_Ocean 💜 1\n│   @AskYatharth I mean yeah if you have anything that feels at least a little less obvious to say 😛\n│   \n│   I'm aware I've got particular hangups here... though maybe not more than most people, just more visible, idk\n└── 1664498450820653058 [2023-06-02] @Malcolm_Ocean 💜 1\n    @AskYatharth haha I mean definitely. I've been working through them for a couple years, as I think you know. and making headway!\n\n===\n\n1664078321569742848 [2023-06-01] @imperialauditor 💜 5 🔁 2 [(SEED) type=quote_of_root]\nsomething I find fun and useful: \n\nwhen reading something I really want to focus on and understand, I read it aloud https://t.co/05bIDnhXIx\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1668094164062425093 [2023-06-12] @__drewface 💜 98 🔁 5 💬 1 [(SEED) type=quote_of_root]\nyoung men in my social circles feel pressure to be \"larger than life\"\n\nHOWEVER, we would all be more confident, powerful, and effective if we admitted our shortcomings and asked for help taking the next step (rather than asking for help accomplishing the grand vision) https://t.co/AsmuckMgUU\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1668095688155054081 [2023-06-12] @__drewface 💜 16\n│   admitting \"shortcomings\" isn't the point, actually. fuck that. You ARE NOT inadequate.\n│   \n│   Anyone who is doing the work is adequate enough to do it, so you should be confident asking for help with the next step, even if it SEEMS embarrassing. It is, in fact, very cool. https://t.co/DEBJK8Ehz6\n│   Images:\n│     - [Image #0] The image is a screenshot of a text box with a sentence about the etymology of the word \"shortcoming.\" The text reads: \"The root of shortcoming is the phrase 'to come short,' which was used starting in the 1600's to mean 'to be inadequate.'\"\n│     - [Image #1] The image is a text box with a sentence about the etymology of the word \"shortcoming.\" The text reads: \"The root of shortcoming is the phrase 'to come short,' which was used starting in the 1600's to mean 'to be inadequate.'\"\n└── 1668339591362011137 [2023-06-12] @sensefulronin 💜 1\n    @__drewface Events like the one you hosted this past weekend were excellent in helping people see and take a next step. Very pragmatic.\n\n===\n\n1675485978708914177 [2023-07-02] @mimi10v3 💜 2 [(SEED) type=semantic_search]\nis it not obvious? 🫶\n\n===\n\n1713168132104462611 [2023-10-14] @tasshinfogleman 💜 36 🔁 1 [(SEED) type=quote_of_root]\nmeet your friends in person https://t.co/mCE9fwCnFJ\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1718766234265919705 [2023-10-29] @Malcolm_Ocean 💜 17 🔁 3\none of many reasons why saying the obvious is wise\n\nhttps://t.co/zXJP6EQVCa\n  [Quoting Tweet 1717936346629853500 (missing)]\n↓\n1718864718021194200 [2023-10-30] @Malcolm_Ocean  [(SEED) type=quote_of_root]\nhttps://t.co/yAnGl5jGc5\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1723250684869632505 [2023-11-11] @visakanv 💜 769 🔁 98 [(SEED) type=quote_of_root]\nthe way to stay interesting as a creator, is to continue to focus on gratifying your ever-evolving taste, rather than on trying to please the largest segment of your audience. this protects you from becoming a caricature of yourself https://t.co/3WyYhosdPF\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1723368412515053587 [2023-11-11] @Rusty_Swarf 💜 1 [(SEED) type=quote_of_root]\nsaying the obvious thing is no substitute for doing the obvious thing https://t.co/IUHbmW5Nyj\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1723401468256956664 [2023-11-11] @alex_with_ease  [(SEED) type=quote_of_root]\nLearning to rest well is one of the most important and difficult skills, at least in the modern world. https://t.co/5MiBtmZrFT\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1724953487551901927 [2023-11-16] @visakanv 💜 1753 🔁 256 [(SEED) type=quote_of_root]\nthe way to get good at something is practice and study. ~95% of the time when someone asks “how did that person get so good at that thing”, the answer is “lots of practice and study”. music? writing? fitness? socializing? chess? basketball? whatever it is: practice and study https://t.co/3WyYhosdPF\n  [Quoting @Malcolm_Ocean: say the obvious]\n↓\n1724955321159033117 [2023-11-16] @visakanv 💜 101 🔁 2\nsometimes there are variables like “he’s a genetic freak” (phelps) or “dad personally tutored him in physics” (feynman, wozniak) or “he inherited 12,000 books as a kid” (popper), or “had access to computer before anyone else” (gates), “grew up courtside” (curry)… still: practice and study\n↓\n1724960252108603767 [2023-11-16] @visakanv 💜 194 🔁 15\npractice-and-study-maxxing over the long haul requires managing your psychology. that means enjoying the process, understanding your motivations, visualizing the goal, tending to the ecology of yr moods &amp; environments &amp; peers, etc to keep you in the game. show up, dont die, quit\n↓\n1724963053635293415 [2023-11-16] @visakanv 💜 82 🔁 6\nthere are some interesting corollaries to this. when i encounter anyone who’s good at anything, i rarely ask them “how are you so good”. i ask something closer to “how do you practice and/or study”. and because that feels like a question based on understanding (especially when i get specific), we tend to end up bonding quicker. \n\n(This itself is something that i have practised and studied a lot, lol.)\n↓\n1724963825651474515 [2023-11-16] @visakanv 💜 77 🔁 4\nsince it takes practice and study to get good at anything, its also quite reasonable to assume the inverse: anything that you’re bad at is something you have simply not practiced-and-studied enough, or well enough. \n\nbad practice can sour one’s interest, lead to “i cant do math”\n↓\n1724965730012234227 [2023-11-16] @visakanv 💜 64 🔁 7\n“i cant sing, i can’t dance, i cant tell jokes”, all of these are revisable for the majority of people, though if the limiting belief is stuck you’ll likely need exposure to a great teacher. good news is there are many: Gallwey, Werner, Wooten… https://t.co/NI92cHopnW\n  [Quoting @visakanv: marvelling at how precisely Timothy Gallwey's Inner Game of Tennis (🎾) and Kenny Werner's Effortless Mastery (🎹) say *exactly* the same things about judgement, ego, self-talk, instruction, etc and their impact on performance]\n↓\n1724967916263923824 [2023-11-16] @visakanv 💜 83 🔁 7\nthe best teachers are often cheeky. they know that your dismissal of your own potential ability is rooted in your limited experience rather than deep knowledge of what is possible. and so they dont take your ignorant self-criticism too seriously. and from them u learn not to, too\n\n===\n\n1725613882352316466 [2023-11-17] @mimi10v3 💜 14 💬 1 [(SEED) type=semantic_search]\nsay the simple obvious things more often\n↓\n1725652695783010508 [2023-11-17] @SelonNerias 💜 1\n@mimi10v3 @mimi10v3 is awesome\n↓\n1725653660535837010 [2023-11-17] @mimi10v3 💜 1\n@SelonNerias awwwww 🫠\n↓\n1725654338066911441 [2023-11-17] @SelonNerias 💜 1\n@mimi10v3 we 10v3 you\n\n===\n\n1725614754410995749 [2023-11-17] @peakexperiments 💜 1 [(SEED) type=quote_of_semantic_search]\nPeople need to hear the obvious, it's easy to think nobody does because it's obvious but you'd be surprised https://t.co/jJDmQbqUL4\n  [Quoting @mimi10v3: say the simple obvious things more often]\n\n===\n\n1728193029247492484 [2023-11-24] @RomeoStevens76 💜 160 🔁 10\nHow do ultra successful manipulators succeed when it is obvious what they are doing? One reason is that almost no one updates on whether their behavior correlates with others' behavior. \n/\n↓\n1728193030933668071 [2023-11-24] @RomeoStevens76 💜 81 🔁 5\nThe individual says to themselves: it's obvious to *me* that this person is deceitful, but they're succeeding bc lots are dumb. For my benefit and for the sake of others, I won't burn bridges with the manipulator but instead curry favor with them, even though I know what's up.\n/\n↓\n1728193032292646974 [2023-11-24] @RomeoStevens76 💜 72 🔁 2\nAnd everyone thinks this and the manipulator succeeds.\n↓\n1728194754960400603 [2023-11-24] @RomeoStevens76 💜 63 🔁 2\nAnd by the manipulator I mean Sam Altman. Stop being cooperate bots or pretending to be cooperate bots bc you think you're being clever. You're defecting by helping a defector, full stop.\n↓\n1728198928833872081 [2023-11-24] @hrosspet 💜 2 [(SEED) type=semantic_search]\n@RomeoStevens76 the beauty of stating the obvious\n\n===\n\n1737846074591821958 [2023-12-21] @xsphi 💜 84\nwait men don't do this? why not??? https://t.co/nYEkU0BBGy\n  [Quoting @mechanical_monk: btw has anyone investigated the phenomenon where you lie down in bed with a woman and as you're looking into each other's eyes, about to kiss, she says \"hi :-)\"  this has happened multiple times]\n↓\n1737846522421854674 [2023-12-21] @xsphi 💜 30 [(SEED) type=semantic_search]\nit's the obvious thing to say\n\n===\n\n1738268735901962698 [2023-12-22] @visakanv 💜 252 🔁 13 [(SEED) type=quote_of_root]\nit’s worth making a list of all the things that you regularly share with people, and have *that* be shareable, be it a blogpost or a twitter thread https://t.co/3WyYhosdPF\n  [Quoting @Malcolm_Ocean: say the obvious]\n├── 1738270498113405414 [2023-12-22] @mechanical_monk 💜 10\n│   @visakanv i never get to share stuff with ppl these days\n│   \n│   i need to find friends who are far enough from my memeplex that they haven't read all the same blogposts but close enough that they would consider reading some\n│   ↓\n│   1738309601253355885 [2023-12-22] @Malcolm_Ocean 💜 3\n│   @mechanical_monk @visakanv wdym everyone has read all the same blog posts?\n│   \n│   I feel like there's just way too much for that to be remotely possible\n│   \n│   eg here's the coolest thing I've read this year, and if you've already read it I bet I have another one you haven't\n│   https://t.co/P4UIPPm8C7\n│   ↓\n│   1738311214814425530 [2023-12-22] @mechanical_monk 💜 2\n│   @Malcolm_Ocean @visakanv ah i don't read much these days, so when i share something it's like, \"here's a foundational piece of my worldview\", some classic old SSC post or something. in the context of getting to know someone\n│   \n│   i will read this, with this strong an endorsement i'm curious. thx!\n│   ↓\n│   1738676797519405385 [2023-12-23] @Malcolm_Ocean 💜 1\n│   @mechanical_monk @visakanv gotcha. maybe you need new foundational worldview pieces :P\n│   \n│   I'll be curious to see what you make of the Snake Cult piece\n│   ↓\n│   1738722935165059433 [2023-12-24] @mechanical_monk \n│   @Malcolm_Ocean @visakanv it was somewhat interesting, although paleontology is not really an interest of mine so i don't know what to make of it\n│   ↓\n│   1738751209270567137 [2023-12-24] @Malcolm_Ocean 💜 3\n│   @mechanical_monk @visakanv huh, I don't think of it as primarily about paleontology... more like psychohistory or something.\n│   \n│   for me it connected with this other epic piece I read this year in a way that was quite insightful\n│   https://t.co/19pq0hucNq\n└── 1738420316462842314 [2023-12-23] @wayfaring_tim 💜 1\n    @visakanv I'm not sure what I'll share ahead of time so I just preempt it by manually listing things I like as I go on:\n    https://t.co/tbrSNXo1Zk\n    ↓\n    1738838774363066497 [2023-12-24] @wayfaring_tim \n    @visakanv @dghaehre DO NOT CLICK ON THIS LINK https://t.co/oBmNw4WcC5\n    Images:\n      - [Image #0] The image shows a screenshot of a list of links and text. The text is as follows:\n        \n        - Youtube\n          - LITERATURE - Gustave Flaubert, The School of Life\n          - NVIDIA Keynote at SIGGRAPH 2023\n          - NVIDIA Keynote at COMPUTEX 2023\n          - Competition is for Losers with Peter Thiel\n          - EVE Online l Down the Rabbit Hole\n        - Songs\n          - Close to Me, The Cure\n        - Poems\n\n===\n\n1744846509567316217 [2024-01-09] @strangestloop 💜 5 [(SEED) type=semantic_search]\ndo the obvious\n\n===\n\n1744877357507231913 [2024-01-10] @strangestloop 💜 8 [(SEED) type=quote_of_semantic_search]\ngirl named the obvious: 😳 https://t.co/RVpxdNEShB\n  [Quoting @strangestloop: do the obvious]\n↓\n1744907425264656728 [2024-01-10] @univrsw3th4rt \n@strangestloop changing my name rn\n↓\n1744908750975074735 [2024-01-10] @strangestloop 💜 2\n@univrsw3th4rt why the shitpost gotta get more likes than the wisdompost 😩\n↓\n1744908844457681030 [2024-01-10] @univrsw3th4rt 💜 1\n@strangestloop ppl b horny\n↓\n1744909416292335704 [2024-01-10] @strangestloop 💜 2\n@univrsw3th4rt https://t.co/uMUIStaTur\nImages:\n  - [Image #0] The image is a simple black and white line drawing of a smiling character with the word \"yea\" written above its head. The character is drawn with a rounded head, large circular glasses, and a wide smile, and has simple, rounded limbs.\n\n===\n\n1753134258091348274 [2024-02-01] @eshear 💜 1456 🔁 76\nOne clear mark of intelligence is when someone is often surprised, but usually by particularly interesting bits of detail or nuance\n↓\n1753138072219484295 [2024-02-01] @eshear 💜 35 [(SEED) type=quote_of_root]\nhttps://t.co/aAD6GAwsdd\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1753156661265719613 [2024-02-01] @eshear 💜 179 🔁 6\nThe point of disappearing content (fleets, stories) is to allow people to say stuff without it having to follow them around forever. Someone else might remember it or record it (screenshot it), but it doesn’t attach itself as an official part of your public identity forever.\n↓\n1753156901310017656 [2024-02-01] @eshear 💜 24 [(SEED) type=quote_of_root]\nhttps://t.co/9e78Qq1Plx\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1755721323840704831 [2024-02-08] @s0ulDirect0r 💜 38 🔁 1\nyou will feel feelings until the day you die\n↓\n1755721325438791857 [2024-02-08] @s0ulDirect0r 💜 8 [(SEED) type=semantic_search]\ntoday’s “say the obvious thing”\n↓\n1755721804897980456 [2024-02-08] @s0ulDirect0r 💜 6\nshoutouts to lord River @the_wilderless https://t.co/nth3fk4Z4b\nImages:\n  - [Image #0] The image shows a screenshot of a Discord message from a user named Anansi, with a profile picture and a post that reads: \"privately journaled about what the greatest sources of suffering are in my life there was really just one answer these feelings Anansi Today at 2:26 PM named that 'i shouldn't feel like this' and felt a big sigh run through me taking a page from the Book of River 'what's obvious to me about feelings?' they are never going to stop that's all they are going to keep churning and flowing until i die\".\n    \n    To recreate this image, follow these steps:\n    \n    * Set the background to dark gray.\n    * Add white text to the image, with the following content:\n      * \"privately journaled about what the greatest sources of suffering are in my life there was really just one answer these feelings\"\n      * A profile picture of a person with long dark hair and a white shirt, accompanied by the username \"Anansi\" and a sun emoji, with the timestamp \"Today at 2:26 PM\"\n      * \"named that 'i shouldn't feel like this' and felt a big sigh run through me taking a page from the Book of River 'what's obvious to me about feelings?' they are never going to stop that's all they are going to keep churning and flowing until i die\"\n    * Ensure the text is arranged in the same format as the original image, with the profile picture and username on the left side of the message.\n    \n    The text is a personal reflection on the nature of feelings and suffering, referencing a \"Book of River\" and the idea that feelings are ongoing and uncontrollable.\n\n===\n\n1758543863629885691 [2024-02-16] @visakanv 💜 353 🔁 20 💬 1 [(SEED) type=quote_of_root]\none of the reasons you can’t “simply” recreate an old thing is that the new version of the old thing exists in a world where the old thing already exists. this was not true in the case of the old thing https://t.co/3WyYhosdPF\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1759799970469957789 [2024-02-20] @eshear 💜 217 🔁 7 [(SEED) type=quote_of_root]\nThe Bay Area would be vastly better off with 3-5 larger metropolitan governments rather than the 101 cities and 9 counties it has today. https://t.co/h0Po6UPIAu\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1763065884770209802 [2024-02-29] @kindgracekind 💜 28\nI swear to god if something sneaks up on us from behind the sun I’m gonna be so annoyed\n↓\n1763065917850681475 [2024-02-29] @kindgracekind 💜 3 [(SEED) type=semantic_search]\nIt’s so obvious\n\n===\n\n1783558461256790485 [2024-04-25] @visakanv 💜 301 🔁 12 [(SEED) type=quote_of_root]\nour children will have technology that we don't currently have, that enables them to do things that we can't currently do https://t.co/gB9wqJqTOj\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1804273422618480800 [2024-06-21] @Malcolm_Ocean 💜 3 [(SEED) type=quote_of_root]\nnot all things money can't buy are better than things money can buy\n\nhttps://t.co/5fcXcz2VOW\n  [Quoting @Malcolm_Ocean: say the obvious]\n\n===\n\n1938740111958520185 [2025-06-27] @amguzzi  [(SEED) type=semantic_search]\ngotta love when you need to state the obvious https://t.co/Cycsu8gUx2\n\n===\n\n1940367671998218246 [2025-07-02] @HSVSphere 💜 190 [(SEED) type=semantic_search]\nstraight to the point &amp; obvious. what else do you want?\n\n===\n"
}