{
  "tweet_id": 712913395645685760,
  "thread_text": "683435611081064448 [2016-01-02] @mykola 💜 1\nIt's so weird, Paul Graham is like some patron saint of concern trolling. Reading that piece he sounds so _earnest_, but it's 100% straw.\n↓\n683435983686234112 [2016-01-02] @mykola 💜 1 [(SEED) type=semantic_search]\n\"People who think I'm a troll often say X, of which I will now demonstrate a complete and facile misunderstanding. Then I will refute that.\"\n\n===\n\n712913395645685760 [2016-03-24] @literalbanana 💜 1076 🔁 406 💬 46 [(SEED) type=root]\nsorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic\n├── 773199080281534465 [2016-09-06] @ultimape 💜 12 🔁 3\n│   @literalbanana story about a guy being harassed that escalated to reverse trolling to defend his beliefs: https://t.co/NtmYXiAEuC\n├── 784603214775746561 [2016-10-08] @ultimape 💜 6\n│   @literalbanana Operation Mindfuck - Robert Anton Wilson https://t.co/u3SXeLY0sQ\n├── 800808817286004736 [2016-11-21] @ultimape 💜 6\n│   @literalbanana when this plan backfires? (Or is this fake too...)https://t.co/AY6oxjUbQ5 https://t.co/jwPmkHDg0t\n│   Images:\n│     - [Image #0] The image is a screenshot of a text passage. The passage is written in black text on a white background and reads: \n│       \n│       \"I thought they'd fact-check it, and it'd make them look worse. I mean that's how this always works: Someone posts something I write, then they find out it's false, then they look like idiots. But Trump supporters — they just keep running with it! They never fact-check anything. Now he's in the White House. Looking back, instead of hurting the campaign, I think I helped it. And that feels [bad]. \n│       You think you personally helped elect Trump?\"\n│       \n│       This passage is a quote from an interview or article, likely discussing the spread of misinformation and its impact on the 2016 US presidential election.\n└── 816614069264334848 [2017-01-04] @ultimape 💜 8 🔁 1\n    @literalbanana Feynman was also suspicious of ritual to point suggesting not brushing our teeth? (epic trolling) https://t.co/xbKtpBa1dM\n\n===\n\n725927741955014659 [2016-04-29] @ultimape 💜 38 🔁 6\nI am a Strange Loop named Ouroboros. https://t.co/gpfUnBJMCi\n  [Quoting @ultimape: if we can answer that, it becomes a Curry–Howard correspondence from math-&gt;logic-&gt;computation-&gt;biology-&gt;brainshttps://t.co/8Z0aAjDJTC]\n\n===\n\n799361377831792640 [2016-11-17] @ultimape 💜 3 🔁 1\nA curious ant, foraging for metaphor. Sniffing out analogies of the lost. Stumbling upon ideas that smell of our own. What are you growing?\n↓\n801684968623718404 [2016-11-24] @ultimape \nNo, you're a malformed idiom!Wait, which meme was this again?\n↓\n803098237934665728 [2016-11-28] @ultimape \nRap god?\"Possessed, shot thru with some magic spirit. Singing gorgeously beautiful epics in a stream of allusions…\" https://t.co/XPsZc0ibsF\n↓\n803099625112698880 [2016-11-28] @ultimape \n\"…when they get jealous, they confuse itIt's not hip hop, it's pop, cause I found a hella way to fuse it\"https://t.co/vWOnr966ZS\n↓\n803102293403045888 [2016-11-28] @ultimape \n\"You are God […]You have the fire […]Alias's all of us, soul of us, the fall of usTo surely come when we deny it\"https://t.co/p5PqfiFEuD\n↓\n803602739523620864 [2016-11-29] @ultimape 💜 1\nI am jaglavak: an ant called crab. A fire type pokemon living in water. Drowning everytime the tides raise.https://t.co/kfNbulHjD6\n  [Quoting @ultimape: \"These googly eyes and pipe cleaners may say I'm a lobster, but in my heart I am a caged bird in the midst of song.\"https://t.co/IzNvEVuuw1 https://t.co/JRZJxIUUgm]\n↓\n803605481260363776 [2016-11-29] @ultimape 💜 3 🔁 1\nI also want pet underwater spiders?!\"a lovely reminder that where life finds a niche, it fills it\"https://t.co/EJVJLZKfeF https://t.co/F93GCG2Et3\nImages:\n  - [Image #0] The image shows a text passage about a spider that lives underwater. The text is written in black font on a white background and reads:\n    \n    \"Just like humans and their submersibles, to become a master diver this spider must first become a master engineer. It begins by spinning a web among the underwater vegetation, according to biologist Roger Seymour of Australia's University of Adelaide, who has established populations in the lab to study the dynamics of their novel way of getting air.\"\n    \n    To reproduce this image, one would need to create a white background with the given text in black font, ensuring that the text is formatted correctly and the font is consistent throughout.\n↓\n804110866127978496 [2016-11-30] @ultimape \nAbstract, but relatable?\n↓\n804899139943301120 [2016-12-03] @ultimape \nIf the lord wanted to encourage carcinisation, He'd call them unclean.Oh wait, Leviticus 11:9-10 + Romans 14:14 https://t.co/DWVUNWiaHs\n  [Quoting @ultimape: Biblical Carcinisation: https://t.co/Ae9OzMG4n0 - God doesn't hate shrimp. She is one. We are not (yet) in her image. Summon the #GodLobster]\n↓\n804901017779339264 [2016-12-03] @ultimape 💜 1\nIf the lord wanted us to eat bananas, he would have given them legs.Genesis 1:11-12 + Genesis 1:29-30 + Genesis 9:3https://t.co/8mSloGKNkl\n↓\n804918426049323008 [2016-12-03] @ultimape 💜 6 🔁 2 [(SEED) type=quote_of_root]\nbasic, but if clearly defending your trolling is sincerely &amp; easily distinguishable from beliefs then you're sorry. https://t.co/nLDqh2a6s5\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n805723869101359104 [2016-12-05] @ultimape 💜 2\n（ＸＥＮＯＣＥＮＴＲＩＣ ＆ ＥＴＨＮＯＲＥＬＡＴＩＶＩＳＭ ）－（ＩＤＥＯＬＯＧＹ ＆ ＥＮＴＩＴＡＴＩＶＩＴＹ）＝（ＩＣＯＮＯＣＬＡＳＴＩＣ ＆ Ｉ＇Ｍ ＳＯＲＲＹ）https://t.co/y2LHCTw3Lk\n  [Quoting @ultimape: Accidental Meme-Bombing 💣: appropriating 💃cultural narratives w/ love ❤.Don't mean to tread 🐍 on you.I'm confused 😕, playing with ideas 💡]\n↓\n805725283831652352 [2016-12-05] @ultimape 💜 2\nI am Jaglavak, the meme trader. Breaking cultural boundaries in search of powerful metaphor. An Informavore farming rhizomatic zygophores.\n↓\n805737467584376832 [2016-12-05] @ultimape 💜 1\nWords echo in my head like orphaned thoughts; space dust &amp; comets.Echolalia &amp; hypnagogic imagery form new planets, indwelling the chaos.\n↓\n805738942939201536 [2016-12-05] @ultimape \nIdeas fight for survival in an agar, growing &amp; feeding off of the weaker signals, occasionally coalescing into temporary brilliance of suns. https://t.co/7plPXyZyss\nImages:\n  - [Image #0] The image depicts a digital representation of ideas competing for survival in a virtual environment, as hinted at by the tweet \"Ideas fight for survival in an agar, growing & feeding off of the weaker signals, occasionally coalescing into temporary brilliance of suns.\"\n    \n    **Visual Representation:**\n    \n    * The image features a collection of circles in various colors, including yellow, green, blue, and red, scattered across the screen.\n    * The circles are of different sizes, with some being larger than others.\n    * Some circles contain text, such as \"Agarum,\" \"F.Hollande,\" \"FGP,\" and \"KURWA_PL,\" while others are blank.\n    \n    **Leaderboard:**\n    \n    * A gray box in the top-right corner displays a leaderboard with the following information:\n    \t+ Leaderboard\n    \t+ 1. purviak.com\n    \t+ 2. 252-8\n    \t+ 3. Mariusz\n    \t+ 4. TAPPAJA\n    \t+ 5. Bernd\n    \n    **Background:**\n    \n    * The background of the image is a light gray color, providing a neutral backdrop for the colorful circles.\n    \n    **Overall Impression:**\n    \n    * The image appears to be a screenshot from a digital platform or game, possibly related to idea generation or innovation.\n    * The use of different colors and sizes for the circles may represent the relative strength or popularity of the ideas being represented.\n↓\n805740231844577280 [2016-12-05] @ultimape \nMining suns of their brilliance...https://t.co/kAt6cuNd9b\n  [Quoting @ultimape: I found my new hobby: weaving meaningful stories using the poetry of twitter suns.I refuse to call them weird.]\n↓\n805741288477904896 [2016-12-05] @ultimape 💜 4 🔁 1 💬 1\nIf you play a game enough, your mind adapts. It's called a tetris effect, long term leads to playing in your sleep.https://t.co/YLJ4V25YFh\n↓\n805741984614875137 [2016-12-05] @ultimape \nDo you practice weirding? https://t.co/mI28L6kg6Y\n  [Quoting @ultimape: Red Queen of weirding: I do it for half an hour a day. Why, sometimes I've believed as many as six impossible [worlds] before breakfast.]\n↓\n805743524696231936 [2016-12-05] @ultimape 💜 1\nHave you ever tried to outdream the outdreamer?https://t.co/PEykXY82eD\n  [Quoting Tweet 647380929237925888 (missing)]\n↓\n807896611896623105 [2016-12-11] @ultimape 🔁 1\n\"Is the Pope a Catholic?\"\n+ \"Does a bear shit in the woods\"\n= \"Does the pope shit in his hat?\"\nhttps://t.co/Fu5HLjWtMC\n↓\n807941709053173760 [2016-12-11] @ultimape \nknow+ see= understand?\"those who work within [x] don’t always know see it that way\"\n\n===\n\n866405413612400641 [2017-05-21] @ultimape 💜 2 🔁 1\nI've learned to signalling insincerity b/c I've bad experiences w/ others judging me for how serious I take things.https://t.co/4OlSqfqz5G\n  [Quoting @ultimape: This is why it's so hard to communicate across groups.I'm being so philosophical right now. https://t.co/7LPgFdrViK]\n\n===\n\n866425558330167297 [2017-05-21] @ultimape \nBubble forming?This line of reasoning conflates sock puppet influence tactics w/ genuine negative signals of swarm.https://t.co/GwNsWniMcD https://t.co/KlPsFdIqla\nImages:\n  - [Image #0] The image is a screenshot of a news article discussing the practice of \"trolling\" websites, with a large gray box overlaying most of the text. The visible text discusses how websites with important or unconventional content are often targeted by trolls, and how this can be a sign that the website is having an impact.\n↓\n866426179724738560 [2017-05-21] @ultimape \nFar too easy to frame parasitical advertising norms as conspiracy theoryish attacks against one's ingroup. Sad!https://t.co/yiRRSAeBml\n  [Quoting @ultimape: When Brands manipulate hive against best interests, they're no longer information mutualists, but parasite jerks.https://t.co/m3orQbgfa2]\n↓\n866427384366542848 [2017-05-21] @ultimape \nI take conspiracy seriously... I think they're seeing something. But also see they've have fallen in a mental trap.https://t.co/NAeCF01TpD\n  [Quoting @ultimape: A conversation? Just Apes comparing maps.https://t.co/SzJWXmhoOm https://t.co/mnUbdPQIut]\n↓\n866427996814675968 [2017-05-21] @ultimape \n\"The outgroup are out to get us!\" &lt;- Ascribing agency where none exists is a common failure in human rationality.https://t.co/QOa5jhgq3v\n  [Quoting @ultimape: Could the social contagion of emotion be another form of bayesian learning influencing attention at the swarm level?https://t.co/EFCH1KZzT4 https://t.co/5tgGE4CCdW]\n↓\n866429404196556805 [2017-05-21] @ultimape \nBut another common failure is NOT ascribing agency where it does.I guess that's cognitive dissonance. Cosmic jokes?https://t.co/Gb3NTbdYH9\n  [Quoting @ultimape: You can't be manipulated if you are unpredictable.https://t.co/gN4upqLnxq]\n↓\n868273019214606336 [2017-05-27] @ultimape 💜 1\nSpontaneously exercising models of the world by seeking out @literalbanana-memes and figuring out the troll angle.https://t.co/QvNilrKtfo\n↓\n868273770284318720 [2017-05-27] @ultimape 💜 2\n@literalbanana This new trend among autodidacts and post-rationalists.It attracts polymaths like ants to smushed bananas.https://t.co/ipIiCiYxMj\n  [Quoting @ultimape: You can learn more about truth faster not by 'correct' beliefs, but by having others explain why your trollish misappropriations are bad.]\n↓\n868275895617945600 [2017-05-27] @ultimape 💜 2\n\"Every company attempting to innovate needs some version of a Banana as a Service!\" 🍌https://t.co/ENiVILcXGT https://t.co/wqVj1GWGMY\nImages:\n  - [Image #0] The image is a screenshot of a tweet discussing the importance of a \"Devil's Advocate process\" in organizations. The text is transcribed below:\n    \n    \"Any organization that aspires to innovate but has not embraced an explicit Devil's Advocate process should consider trolling. Consider recent Opening Remarks column at BusinessWeek on Why Negativity is Really Awesome.\n    \n    'Banana as a Service' spokesperson, Nicholas Perry (@ultimape on Twitter ($TWTR)), tells about a series of high profile disasters where reputations, jobs and even lives were needlessly lost. These include recent state and Federal health insurance exchange failures, several 60 Minutes stories that went awry and the NASA Challenger explosion. In every case, internal voices had raised red flags that, if addressed, might have averted the disaster in question. But management ignored or shot the messenger rather than heed the message.'\"\n↓\n868279459929100288 [2017-05-27] @ultimape \nSincerity trolling is still trolling?\"made some very tart remarks about philosophers.  All of them were true.\"https://t.co/4d7tu1VjCs\n↓\n899900452149571584 [2017-08-22] @ultimape \nWhat if that's bad?https://t.co/Oj3aWheo4Q\n  [Quoting Tweet 899344436106117120 (missing)]\n↓\n899901739545092096 [2017-08-22] @ultimape 💜 1 [(SEED) type=quote_of_root]\nI wish I had basic beliefs. I don't even know what I believe have the time.https://t.co/nLDqh2a6s5\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n899902092843921408 [2017-08-22] @ultimape \nHow can I tell when I'm joking? I often struggle to recognize my own sarcasm.https://t.co/khN7IAaal7\n  [Quoting @ultimape: Best jokes change minds by minding change. Mine jokes that mind jokes. I am a joke mining jokes who don't mind jokes.Hope you don't mind.]\n↓\n899902347530391552 [2017-08-22] @ultimape 💜 1\nI'm making fun of myself, but I'm not joking? https://t.co/8NTAsOKiF8\n  [Quoting @ultimape: Holy shit, I watched Charlie &amp; The Chocolate Factory for years without realizing what sarcasm is. This explains everything. https://t.co/DvdglkALCs]\n↓\n899902819960053761 [2017-08-22] @ultimape 💜 3\nJust thinking about this makes me uneasy. I am often stricken w/ dread that everything I know is just a cruel joke.https://t.co/UaHffcjoAB\n  [Quoting @ultimape: Sarcasm is like Schrodinger's cat. I'm never quite sure if I'm using the analogy correctly.]\n↓\n899904276142710784 [2017-08-22] @ultimape 💜 1\nOr maybe the world *IS* a cruel joke, and everybody else is just laughing at me because the world goes over my head.\n\n===\n\n888940516485636096 [2017-07-23] @visakanv 💜 1 [(SEED) type=quote_of_root]\n🤔 https://t.co/IfHCC3CkvI\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1021913489625870337 [2018-07-25] @eigenrobot 💜 30 🔁 5\nleft-wing: \"nudge\" eugenics\nright-wing: corporate extraterritoriality\nlibertarian: legalized dueling between consenting parties\nauthoritarian: merovingian restoration but theyre robots https://t.co/hUAfCIX6im\n  [Quoting Tweet 1021541247389814784 (missing)]\n↓\n1021914045148876800 [2018-07-25] @eigenrobot 💜 13 [(SEED) type=quote_of_root]\nhttps://t.co/684ONuaiDK\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1056048644971843584 [2018-10-27] @eigenrobot 💜 21 🔁 2\nif its more than one get a better ideology https://t.co/KugXVnhLTn\n  [Quoting Tweet 1056048311612985344 (missing)]\n↓\n1056051111214206976 [2018-10-27] @eigenrobot 💜 9 [(SEED) type=quote_of_root]\nrelated https://t.co/684ONuaiDK\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1058367905090494465 [2018-11-02] @eigenrobot 💜 492 🔁 70\ncolonialism was just OG open borders and if you support one you have to support the other send tweet\n↓\n1058572071054311424 [2018-11-03] @eigenrobot 💜 90 🔁 2 [(SEED) type=quote_of_root]\nhttps://t.co/684ONtSHMc\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1065605478133260288 [2018-11-22] @eigenrobot 💜 85 🔁 3\nmay start referring to white Native American/First Peoples activists as \"nativists\" just to see if they object\n↓\n1065634232998002690 [2018-11-22] @eigenrobot 💜 39 🔁 1\nJEET swooping in to support my model! Glad to have you sort of https://t.co/L1hO4Z8UNW\n  [Quoting Tweet 1065253531253391360 (missing)]\n↓\n1144481428203167744 [2019-06-28] @eigenrobot 💜 27\nYES https://t.co/KYSCzfu0z6\n  [Quoting Tweet 1144295376041566208 (missing)]\n\n===\n\n1236218464794292225 [2020-03-07] @nosilverv 💜 25\nthe best accounts are the ones that are so over the top you can't tell if trolling or deranged\n↓\n1236403869397049344 [2020-03-07] @eigenrobot 💜 6 [(SEED) type=quote_of_root]\n@nosilverv https://t.co/3euVmucKqg\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1236476437999366145 [2020-03-08] @nosilverv 💜 3\n@eigenrobot me: 25 likes\nbanana that says exactly the same: 700 likes\n↓\n1236476720061898752 [2020-03-08] @eigenrobot \n@nosilverv four years ahead too\n↓\n1236477848728322048 [2020-03-08] @nosilverv 💜 2\n@eigenrobot right? its like shes' doign it on purpose\n↓\n1236477979158405120 [2020-03-08] @eigenrobot 💜 1\n@nosilverv iktf buddy\n\n===\n\n1403262108960059398 [2021-06-11] @eigenrobot 💜 95 [(SEED) type=quote_of_root]\ni think my views have become too reasonable\n\ntime to find some new weird belief's https://t.co/684ONuaiDK\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1403262298752307203 [2021-06-11] @eigenrobot 💜 41\nactually nevermind ive still got it\nhttps://t.co/y2J9IVbbbJ\n  [Quoting @eigenrobot: this is actually a cool idea and could work in the US to a certain extent  secession at the state level is dumb but at the county level? hell yes.   make more states noncontiguous. why should states be defined at the geographic level? https://t.co/PDYC72ITpK]\n↓\n1403262530999312385 [2021-06-11] @eigenrobot 💜 28\ngenuinely mad we dont do this. it wouldnt even take a constitutional amendment and we could reset it every decennial census. piece of cake\n↓\n1403268724421914624 [2021-06-11] @eigenrobot 💜 53 🔁 2\nwe were never asked https://t.co/boJ0SfO8uh\nImages:\n  - [Image #0] The image is a map of the Holy Roman Empire around 1400, titled \"Das Heilige Römische Reich um 1400.\" The map is in German and features a color-coded key to distinguish between different regions. The map includes various territories, cities, and geographical features, such as rivers and mountains.\n    \n    **Key Features:**\n    \n    *   Color-coded key to differentiate between regions\n    *   Territories, cities, and geographical features labeled in German\n    *   Map title: \"Das Heilige Römische Reich um 1400\"\n    \n    **Map Content:**\n    \n    *   The map displays the Holy Roman Empire's territorial divisions, including duchies, bishoprics, and free cities.\n    *   The color-coded key helps identify the different types of territories, such as:\n        *   Geistiche Gebiete (ecclesiastical territories)\n        *   Reichsstadt (imperial cities)\n        *   Nicht darstellbare Kleinstiterritorien (small territories not represented)\n        *   Gemen des Heiligen Römischen Reiches (borders of the Holy Roman Empire)\n        *   Kondominate sind als schwarze dargestellt (condominates represented in black)\n    \n    **Geographical Features:**\n    \n    *   The map includes major rivers, such as the Rhine, Danube, and Elbe.\n    *   Mountain ranges, like the Alps and the Carpathians, are also depicted.\n    \n    **Historical Context:**\n    \n    *   The map provides a snapshot of the Holy Roman Empire's political landscape around 1400.\n    *   The empire's complex territorial structure and the relationships between different regions are illustrated.\n    \n    Overall, the map offers a detailed representation of the Holy Roman Empire's geography and political organization during the late Middle Ages.\n\n===\n\n1536551084314927104 [2022-06-14] @dschorno 💜 10 🔁 1 [(SEED) type=semantic_search]\npeople hate when you confidently assert things that you only vaguely believe in, but thats simply how its done friends\n\n===\n\n1574947356923265026 [2022-09-28] @eigenrobot 💜 788 🔁 46 💬 4\nim pleased to announce that ive finally become insane\nhttps://t.co/So5HCo8Iii\n↓\n1574947734234484737 [2022-09-28] @eigenrobot 💜 115 🔁 1 [(SEED) type=quote_of_root]\nhttps://t.co/684ONtTfBK\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1574950812031123457 [2022-09-28] @eigenrobot 💜 67 🔁 1\nwoh\n\nthis guy is intense\nhttps://t.co/s9wFwC9BdP\n  [Quoting Tweet 1574950128565485571 (missing)]\n↓\n1574957043307679745 [2022-09-28] @eigenrobot 💜 87\nhttps://t.co/ZdqpG8ecUo\n  [Quoting Tweet 1257865273043939328 (missing)]\n↓\n1575103294497701888 [2022-09-28] @forthrighter \n@eigenrobot relax about these kinds of feedback, everything's a remix and the work you did to arrive at these conclusions has value separate from the work itself\n\nit's also way more fucking fun to build dart boards than to throw darts, imo\n\n===\n\n1668604408903397380 [2023-06-13] @eigenrobot 💜 399 🔁 11\nso we just kicked intersex out of the pride flag this year huh\n\nonly RTing sesame street because theyre an available example\n\nwhat happened to the intersex representation\n\ntoo medical? not gay enough?\n\nwhyd you throw them under the bus radicals. answer for this https://t.co/RHhYep0yx4 https://t.co/GeczdR5d9t\n  [Quoting Tweet 1668256850712891392 (missing)]\nImages:\n  - [Image #0] The image depicts a vibrant city street, likely in London, adorned with numerous rainbow flags featuring an intersex symbol. \n    \n    * The street is flanked by tall buildings on either side, with a row of trees lining the center.\n    \t+ The buildings are constructed from light-colored stone and feature ornate details.\n    \t+ The trees are lush and green, adding to the festive atmosphere.\n    * A multitude of rainbow flags hang above the street, each bearing a yellow triangle with a black circle at its center.\n    \t+ The flags are arranged in a grid pattern, stretching down the length of the street.\n    \t+ The rainbow colors transition smoothly from one to another, creating a sense of continuity.\n    * In the foreground, several red double-decker buses are visible, along with a few cars and pedestrians.\n    \t+ The buses are parked along the side of the road, while the cars are driving down the street.\n    \t+ Pedestrians can be seen walking along the sidewalk, adding to the lively atmosphere.\n    * The sky above is a brilliant blue, with no clouds in sight.\n    \t+ The overall effect is one of joy and celebration, suggesting that the image was taken during a Pride parade or similar event.\n    \n    In summary, the image captures a lively and festive scene, with a city street transformed into a vibrant display of rainbow flags and colorful decorations.\n\n===\n\n1668605212393713668 [2023-06-13] @eigenrobot 💜 135\nseriously who decided this. im actually demanding answers as this is a fascinating matter\n↓\n1668606326144892931 [2023-06-13] @eigenrobot 💜 154 🔁 3\nterrible news for asexuals who will no longer be able to exploit their radical cachet to get laid\nhttps://t.co/GYcoqbqBVy\n  [Quoting Tweet 1668605948774998018 (missing)]\n↓\n1668607043345719297 [2023-06-13] @eigenrobot 💜 68 🔁 1\nmeanwhile ABDL cut out of pride entirely. fucked up. david vitter must be fuming i bet he was planning a comeback\n↓\n1668607266679914498 [2023-06-13] @eigenrobot 💜 97\nyou know honestly. if you dont know what that is dont google it. this is my gift to you. happy pride month\n↓\n1668609290079289346 [2023-06-13] @eigenrobot 💜 49\nTHAT SAID\n\nit is interesting that this hasnt been considered alongside gender as part of a broader agequeering discourse\n↓\n1668609524968595456 [2023-06-13] @eigenrobot 💜 83 🔁 4\n\"queering\" things is about finding exceptions and blurring lines and complexifying ontologies and age as we understand it is as rigid and modernist a construct as gender.\n\nits ripe for postmodernist deconstruction\n↓\n1668610518083416064 [2023-06-13] @eigenrobot 💜 73\nwhat does it really mean to be an adult? is age just a number? does that number mean anything? well i find that transchronophobic to be quite honest\n↓\n1668610613373808642 [2023-06-13] @eigenrobot 💜 79\nits not like we dont already have the agequeer among us\n\nfor example, plenty of \"old\" people dye their hair and take viagra and have facial reconstructive surgery and botox injections to better project the age with which they prefer to identify\n↓\n1668611026500083712 [2023-06-13] @eigenrobot 💜 93 🔁 3\nmeanwhile, twelve year old coal miners love smoking cirgarettes, african preteens fight in wars, teenages pretend to be authorities on sex, and even american college students have \"fake\" IDs that reflect the age that they prefer to identify with for purely expressive reasons\n↓\n1668612366131396609 [2023-06-13] @eigenrobot 💜 79 🔁 1\nfrom child brides to saudi royalty who somehow have kids in their eighties with those child brides, people the world over are transgressing their societies expectations given their age assigned at birth\n\ni think they deserve recognition as a genuine queer vanguard during pride\n↓\n1668612958052663297 [2023-06-13] @eigenrobot 💜 91 🔁 2 [(SEED) type=quote_of_root]\nhttps://t.co/684ONtSHMc\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1668633368479805447 [2023-06-13] @eigenrobot 💜 81\nfor people bemoaning the additions because the original pride flag already represented everyone? \n\nsorry dudes we had that before the rainbow flag https://t.co/CfRnVCrf7L\nImages:\n  - [Image #0] The image depicts a stylized representation of the American flag, with a blue rectangle in the upper left corner featuring white stars and a spiral pattern. The remaining space is filled with red and white stripes that radiate outward from the center, creating a sense of movement and energy.\n    \n    To recreate this image, follow these steps:\n    \n    * Start with a blue rectangle in the upper left corner, occupying approximately one-quarter of the total area.\n    * Within the blue rectangle, arrange 18 white stars in a seemingly random pattern, with some stars positioned near the edges and others clustered together.\n    * Create a spiral pattern within the blue rectangle by drawing a series of concentric circles that decrease in size as they approach the center. The circles should be composed of small white dots.\n    * Fill the remaining space with red and white stripes that radiate outward from the center of the image. The stripes should be thin and evenly spaced, with the red stripes slightly wider than the white ones.\n    * Ensure that the stripes are curved, following the shape of the spiral pattern created by the concentric circles.\n    * Pay attention to the proportions of the image, with the blue rectangle occupying the upper left quadrant and the stripes filling the remaining three-quarters of the space.\n    \n    By following these steps, you should be able to recreate the stylized American flag depicted in the image.\n↓\n1668781570033868800 [2023-06-14] @eigenrobot 💜 11\nan only slightly amusing explanation sadly\n\noh well perhaps we'll always have LGBTQIA just like well always have the NAACP and no one will talk it\nhttps://t.co/8BtpU88nZP\n  [Quoting Tweet 1668697365614673922 (missing)]\n\n===\n\n1668654086181335047 [2023-06-13] @goblinodds  [(SEED) type=quote_of_root]\nRT @eigenrobot: https://t.co/684ONtSHMc\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1693634263546007585 [2023-08-21] @eigenrobot 💜 119 🔁 3 💬 1 [(SEED) type=quote_of_root]\nlemma: if your trolling is clearly and easily distinguishable from defending your beliefs than your trolling is basic https://t.co/684ONtSHMc\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n↓\n1693641246948933645 [2023-08-21] @Paul_Melman 💜 1\n@eigenrobot What if your trolling is indistinguishable from genuinely getting mad on the internet?\n\n===\n\n1734027715693474062 [2023-12-11] @strangestloop 💜 7 🔁 1 [(SEED) type=semantic_search]\nif you can't explain your beliefs in plain language then your beliefs are suspect\n\n===\n\n1739363399706857650 [2023-12-25] @the_wilderless 💜 83 🔁 6\nthe main problem with me always saying \"live urgently, seek resonance\" was that I didn't put a \"motherfucker\" at the end\n↓\n1739363628917129366 [2023-12-25] @tasshinfogleman 💜 15 🔁 1\n@the_wilderless we're here to renew the sacred, ya little shits\n↓\n1739363993439904211 [2023-12-25] @tasshinfogleman 💜 5\n@the_wilderless how many times do i have to fuckin' explain it to you, mythopoetic cognition is the engine of mind\n↓\n1739364606601257187 [2023-12-25] @strangestloop 💜 7 [(SEED) type=quote_of_semantic_search]\n@tasshinfogleman @the_wilderless dumb it down for the benefit of all beings? :^)\nhttps://t.co/c0sjtO8HF2\n  [Quoting @strangestloop: if you can't explain your beliefs in plain language then your beliefs are suspect]\n↓\n1739365797330329895 [2023-12-25] @michelleakin 💜 3\n@strangestloop @tasshinfogleman @the_wilderless this whole thread https://t.co/UhxXy4TUk0\nImages:\n  - [Image #0] The image is a screenshot of Snoop Dogg, an American rapper, in a television show or commercial. He is wearing a grey newsboy cap and a black shirt with an orange collar and has a goatee and a ponytail. \n    The text \"DELIOUSNESS\" is superimposed over the image in white letters.\n\n===\n\n1798422482845901020 [2024-06-05] @VividVoid_ 💜 312 🔁 2\nWhat are the great load-bearing TPOT posts? Like the early ideas that defined the scene and its norms?\n↓\n1798422858387071112 [2024-06-05] @imhinesmi 💜 17\n@VividVoid_ https://t.co/2m3pHnQRYZ\n  [Quoting @visakanv: twitter_rpg_strategy_guide.txt]\n↓\n1798422955921428890 [2024-06-05] @imhinesmi 💜 3 [(SEED) type=quote_of_root]\n@VividVoid_ https://t.co/NtrrD4lr75\n  [Quoting @literalbanana: sorry but if sincerely defending your beliefs is clearly and easily distinguishable from trolling then your beliefs are basic]\n\n===\n\n1799610284966907965 [2024-06-09] @eigenrobot 💜 513 🔁 3\nof course both leftists and far right ppl under the age of 25 hate my guts because my beliefs inasmuch as they exist are anathema to both groups\n\nthey fuck up by not understanding why they hate me, nor having words for it, so each ascribes to me the beliefs of the other extreme\n↓\n1799610386259247354 [2024-06-09] @eigenrobot 💜 147 🔁 2 [(SEED) type=semantic_search]\n\"what are your beliefs\" please be reasonable\n↓\n1799611832681816427 [2024-06-09] @eigenrobot 💜 166 🔁 3\none issue is that these people, who are so young, seem to exist in a state of deep anomie\n\ni don't see any pretense at an ethics among the far right which is at least a kind of honesty\n\namong the far left it's intensely pretended but utterly incoherent under any investigation\n↓\n1799612264657326490 [2024-06-09] @eigenrobot 💜 88\nof course im not gonna let centrists off the hook here\nhttps://t.co/ngYJGSql8H\n  [Quoting @eigenrobot: undergirding this trend, which i see as broader than these examples, is a contemporary lack of moral grounding  one must have _some_ ethical frame of reference in which to make a judgment if they are to be at all confident in their decision; one must have a sense of how to judge]\n↓\n1799612903768702989 [2024-06-09] @eigenrobot 💜 143 🔁 6\ni rib rationalists a lot but you know what.\n\nsay what you will about the tenets of effective altruism, at least its an ethos\n↓\n1799621976719560878 [2024-06-09] @eigenrobot 💜 58\ni suspect this misunderstands nietzsche fwiw (non-hostile chatgpt response generation, i just havent read bertram yet and assume gpt will do better here)\n\nthis feels like the problem that nietzsche was trying to _solve_\nhttps://t.co/jytd3k078M https://t.co/3Px7vFmTpu\n  [Quoting Tweet 1799620180701495803 (missing)]\nImages:\n  - [Image #0] The image shows a screenshot of a conversation between Eigen Robot and ChatGPT. The text is as follows:\n    \n    Eigen Robot: can you summarize the project of Nietzsche as understood by ernst bertam\n    \n    ChatGPT: ernst bertram, in his work \"nietzsche: attempt at a mythology,\" interprets nietzsche as a mythic figure striving to transcend traditional morality and cultural norms. he frames nietzsche's project as an effort to overcome the nihilism of his time by revaluating all values and embracing a life-affirming philosophy. bertram emphasizes the poetic and prophetic aspects of nietzsche's thought, viewing him as a cultural hero who seeks to reshape society's spiritual and intellectual landscape through the creation of new myths and ideals.\n    \n    To reproduce this image, you would need to create a screenshot of a conversation between two entities, Eigen Robot and ChatGPT, with the above text. The conversation should be formatted with the Eigen Robot's question at the top, followed by ChatGPT's response below, on a white background.\n\n===\n\n1799674146697138488 [2024-06-09] @eigenrobot 💜 163 🔁 3 [(SEED) type=quote_of_semantic_search]\nnot a belief but a history:\n\nthere is a large tribe of people over thirty who are disappointed liberals\n\nmy hunch is that people too young to remember the bush years and the recession never became liberals at all https://t.co/zSuWMQdbrW\n  [Quoting @eigenrobot: \"what are your beliefs\" please be reasonable]\n↓\n1799675141795832110 [2024-06-09] @eigenrobot 💜 96 🔁 2\niraq and afghanistan were particularly brutal for liberals because their failures were dispositive and unavoidable evidence that in fact the world was not entirely interested in or capable of simply becoming americans\n↓\n1799675705867087934 [2024-06-09] @eigenrobot 💜 55\ni don't know what will become of the first postliberal generation but i hope they can get their shit together\n\n===\n\n1837964686186123297 [2024-09-22] @DefenderOfBasic 💜 24 🔁 1 [(SEED) type=semantic_search]\nproof that most people who you think are trolling are just confused and you can just kindly explain things and they'll go \"woah, I didn't realize that, thanks!\" https://t.co/nI38QsxqHJ\n  [Quoting Tweet 1837962187777687823 (missing)]\n↓\n1837964688635973712 [2024-09-22] @DefenderOfBasic 💜 7 🔁 1\nmy only notes here are that people should ask him more questions. It's hard to explain anything to anyone unless you understand what's in this head first. Figure out their mental model, repeat back their position in your words, when they say \"exactly\", you got it, reel em in\n↓\n1837964936028262645 [2024-09-22] @DefenderOfBasic 💜 5\nI made this visual for a different purpose but it fits here very well\n\nhttps://t.co/wWmLxAbvxR\n  [Quoting @DefenderOfBasic: This is exactly what it's like trying to teach someone anything without feedback (without asking them questions at every step of the way)  You think you're making great points but nothing sticks, you're just blindly tossing things into their brain (physics is off until the end) https://t.co/Xvts4Ta8eH]\n↓\n1837965246205399160 [2024-09-22] @DefenderOfBasic 💜 5\nAll the arguments being made are perfect arguments...for the mental model that *you* have of them. You have no idea if that is actually what they think \n\nif you get feedback at every step of the way you're way more likely to succeed, if it's possible to. It's not always possible\n\n===\n\n1857253364485988458 [2024-11-15] @DefenderOfBasic 💜 28 🔁 1\nthere are no trolls on the internet anymore, right? every human on the internet wants something, is trying to do something\n↓\n1857257377185321076 [2024-11-15] @taijitu_sees 💜 5\n@DefenderOfBasic Some people are chaotic for amusement and just enjoy seeing people confused. They might change, but will probably take awhile for them to work out their knots.\n↓\n1857397744681226429 [2024-11-15] @DefenderOfBasic 💜 3 [(SEED) type=semantic_search]\n@taijitu_sees I feel like we can identify this very easily (and thus their trolling fails). My theory is sincerity beats trolling, 100% of the time\n↓\n1857428259874750497 [2024-11-15] @taijitu_sees \nI think it does with enough therapeutic time investment and patience. I remember being a massive troll. Getting the most even keeled person to crack was a game I'd play. Wish I hadn't trained my brain on using dark empathy tilting people further into insecurities. Still learning how to flip it and bolster insecurities after finding them.\n\n===\n\n1876039020523954311 [2025-01-05] @DefenderOfBasic 💜 14 🔁 1 [(SEED) type=semantic_search]\nsay what you believe is true with the greatest conviction (you might completely wrong &amp; holding onto dangerous beliefs...better get it out sooner than later!)\n\n===\n\n1900869011069386955 [2025-03-15] @DefenderOfBasic 💜 127 🔁 4 [(SEED) type=semantic_search]\nnormalize responding in earnest even if you are 100% sure the other person is trolling. It's not for them, it's for the thousands of confused bystanders who will learn a lot &amp; update their beliefs thanks to your explanation 🙏\n\n===\n"
}